{
  "info": {
    "author": "Pragnesh Patel",
    "author_email": "patelpragnesh386@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "Environment :: Web Environment",
      "Framework :: Django",
      "Intended Audience :: Developers",
      "License :: OSI Approved :: BSD License",
      "Operating System :: OS Independent",
      "Programming Language :: Python",
      "Topic :: Internet :: WWW/HTTP",
      "Topic :: Internet :: WWW/HTTP :: Dynamic Content"
    ],
    "description": "# DRF API LENS\nDRF API Lens is a comprehensive Python package designed to help developers capture errors in their Django REST framework (DRF) APIs.The package offers a range of reusable tools to simplify the process of error handling in DRF.At the core of the package is the ErrorCapturingMiddleware, which intercepts any error that occurs during the execution of an API request. The middleware logs the error to the console and optionally stores it in a database when configured to do so via the STORE_CAPTURE_ERROR_TO_DATABASE setting.In addition, the package provides the capture_error decorator to handle exceptions that occur during view function execution. This powerful decorator takes care of catching any errors that arise during the execution of an API request, saving developers time and effort.The validate_api_parameters parameter is another valuable feature of DRF API Lens. This parameter checks if the required parameters are present in the API request data, and returns an error response if any of the parameters are missing. This functionality is highly customizable, as developers can specify the parameters they want to validate using a list of strings.Overall, DRF API Lens is an end-to-end solution that makes error handling in DRF APIs a breeze. It provides developers with a range of reusable tools that are easy to implement and highly customizable, saving them time and effort while ensuring their APIs are robust and reliable.\n\n## Installation\nTo install drf_api_lens, run the following command:\n```\npip install drf_api_lens\n```\n\n## Setup Configuration\n1. Add 'drf_api_lens' to your INSTALLED_APPS in your settings.py file.\n```\nINSTALLED_APPS = [\n    'django.contrib.admin',\n    'django.contrib.auth',\n    'django.contrib.contenttypes',\n    'django.contrib.sessions',\n    'django.contrib.messages',\n    'django.contrib.staticfiles',\n    ...\n    'drf_api_lens',\n]\n```\n\n2. Add the following lines to your MIDDLEWARE setting:\n```\nMIDDLEWARE = [\n    'django.middleware.security.SecurityMiddleware',\n    'django.contrib.sessions.middleware.SessionMiddleware',\n    'django.middleware.common.CommonMiddleware',\n    'django.middleware.csrf.CsrfViewMiddleware',\n    'django.contrib.auth.middleware.AuthenticationMiddleware',\n    'django.contrib.messages.middleware.MessageMiddleware',\n    'django.middleware.clickjacking.XFrameOptionsMiddleware',\n    ...\n    'drf_api_lens.middleware.ErrorCapturingMiddleware',\n]\n```\nThis will enable the ErrorCapturingMiddleware to capture errors that occur during API request execution.\n\n3. Run following command ```python manage.py migrate```\n\n4. Add setting.py ```STORE_CAPTURE_ERROR_TO_DATABASE: If set to True, captured errors will be stored in the database. The default value is False.```\n\n\n\n## Usage\n\n#### ErrorCapture model is used to capture and store error-related information for analysis and debugging purposes.\n> **user**: CharField with a maximum length of 256 characters. This field is optional and may be left blank. It is used to store the username or email or identifier of the user who triggered the error.\n\n> **url_requested**: CharField with a maximum length of 1024 characters. This field is optional and may be left blank. It is used to store the URL that was requested when the error occurred.\n\n> **request_headers**: TextField. This field is optional and may be left blank. It is used to store the HTTP headers that were sent with the request.\n\n> **request_body**: TextField. This field is optional and may be left blank. It is used to store the request body that was sent with the request.\n\n> **query_params**: TextField. This field is optional and may be left blank. It is used to store the query parameters that were sent with the request.\n\n> **request_method**: CharField with a maximum length of 8 characters. This field is optional and may be left blank. It is used to store the HTTP method that was used for the request (e.g. GET, POST, etc.).\n\n> **ip_address**: CharField with a maximum length of 50 characters. This field is optional and may be left blank. It is used to store the IP address of the client that made the request.\n\n> **response_body**: TextField. This field is optional and may be left blank. It is used to store the response body that was sent back by the server.\n\n> **response_status_code**: PositiveSmallIntegerField. This field is optional and may be left blank. It is used to store the HTTP status code that was returned by the server.\n\n> **execution_time**: DecimalField with 5 decimal places and a maximum of 8 digits. This field is optional and may be left blank. It is used to store the time (in seconds) that it took for the server to process the request and generate a response.\n\nAdditionally, you can mention any other relevant details about the model, such as the fact that it inherits from TimeStampModel and includes the **created_at** and **updated_at** fields. You could also provide information about the Meta class and the db_table attribute, which specifies the name of the database table that will be used to store instances of the model.\n\n**NOTE**: The ErrorCapture model only stores information for requests that return HTTP status codes other than HTTP_200_OK, HTTP_201_CREATED, HTTP_202_ACCEPTED, HTTP_203_NON_AUTHORITATIVE_INFORMATION, HTTP_204_NO_CONTENT, HTTP_205_RESET_CONTENT, HTTP_206_PARTIAL_CONTENT, HTTP_207_MULTI_STATUS, HTTP_208_ALREADY_REPORTED, or HTTP_226_IM_USED. Requests that return any of these status codes are considered successful and are not captured by this model.\n\n\n## ErrorCapturingMiddleware\nThe ErrorCapturingMiddleware is a middleware that captures any error that occurs during API request execution. If an error occurs, it will be logged to the console and optionally saved to the database if the STORE_CAPTURE_ERROR_TO_DATABASE setting is True.\n\n\n## @capture_error decorator\nThe drf_api_lens package provides the capture_error decorator to handle exceptions that occur during view function execution.\n\n\nHere is an example usage of the capture_error decorator in a class-based view:\n```\nfrom drf_api_lens.decorators import capture_error\n\nclass MyAPIView(APIView):\n    @capture_error()\n    def post(self, request, *args, **kwargs):\n        # Your code here\n```\n\nThe decorator is a tool that helps handle errors that occur during the post method's execution. If an error occurs, it will provide a response that includes a message with the name of the file and line number where the error occurred. The message will also include the name of the function in which the error occurred, along with the error message itself.\n\nHere is an example of what the response might look like:\n```\n{\n    \"error\": true,\n    \"data\": [],\n    \"message\": \"An error occurred in file '/home/../../../api_v1/views.py' at line 47: 'name 'test' is not defined' in function 'testing'\"\n}\n```\n\n## validate_api_parameters parameter\nThe validate_api_parameters parameter is an optional parameter for the capture_error decorator that checks if the required parameters are present in the API request data. If the parameters are not present, the package returns an error response.\n\nHere's an example of how to use the validate_api_parameters parameter:\n```\nfrom drf_api_lens.decorators import capture_error\n\nclass MyAPIView(APIView):\n    @capture_error(validate_api_parameters=['name', 'email'])\n    def post(self, request, *args, **kwargs):\n        # Your code here\n```\n\nIf the name and email parameters are not present in the API request data, the capture_error decorator will return an error response with the message \"Missing parameters: name, email\".\nlike this:\nIf the required parameters are not present in the API request data, the package will return an error response:\n```\n{\n    \"error\": True,\n    \"data\": [],\n    \"message\": \"Missing parameters: name, email\"\n}\n```\n\n## Conclusion\nThe drf_api_lens package provides a middleware, decorator, and optional settings to capture errors in Django REST framework (DRF) APIs. The package provides the ErrorCapturingMiddleware to catch any error that occurs during the execution of an API request, and the capture_error decorator to handle exceptions that occur during view function execution. The package also provides a validate_api_parameters parameter that checks if the required parameters are present in the API request data. If the parameters are not present, the package returns an error response.\n\n\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/pragnesh123-cmd/drf_api_lens",
    "keywords": "",
    "license": "BSD-3-Clause",
    "maintainer": "",
    "maintainer_email": "",
    "name": "drf-api-lens",
    "package_url": "https://pypi.org/project/drf-api-lens/",
    "platform": null,
    "project_url": "https://pypi.org/project/drf-api-lens/",
    "project_urls": {
      "Homepage": "https://github.com/pragnesh123-cmd/drf_api_lens"
    },
    "release_url": "https://pypi.org/project/drf-api-lens/1.0/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "DRF API Lens is a comprehensive Python package designed to help developers capture errors in their Django REST framework (DRF) APIs.",
    "version": "1.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17254872,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "847c73fa82e8569d96d242d00384aa261250600be7f455a17c496ed2ae9bfe51",
        "md5": "7c2de2e895ef43b7cc17eaadba6fec8c",
        "sha256": "62c6a5f93db6d13539f2e937cc42e24eddb683e82b9781c6c0de3a59a6060528"
      },
      "downloads": -1,
      "filename": "drf_api_lens-1.0.tar.gz",
      "has_sig": false,
      "md5_digest": "7c2de2e895ef43b7cc17eaadba6fec8c",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 12382,
      "upload_time": "2023-03-11T18:12:52",
      "upload_time_iso_8601": "2023-03-11T18:12:52.610617Z",
      "url": "https://files.pythonhosted.org/packages/84/7c/73fa82e8569d96d242d00384aa261250600be7f455a17c496ed2ae9bfe51/drf_api_lens-1.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}