{
  "info": {
    "author": "Seva Alekseyev",
    "author_email": "sevaa@sprynet.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "Environment :: MacOS X :: Cocoa",
      "Environment :: Win32 (MS Windows)",
      "Environment :: X11 Applications :: Qt",
      "Intended Audience :: Developers",
      "License :: OSI Approved :: BSD License",
      "Operating System :: OS Independent",
      "Programming Language :: Python",
      "Programming Language :: Python :: 3.5",
      "Programming Language :: Python :: 3.6",
      "Programming Language :: Python :: 3.7",
      "Programming Language :: Python :: 3.8",
      "Programming Language :: Python :: 3.9",
      "Programming Language :: Python :: Implementation :: CPython",
      "Topic :: Software Development :: Debuggers"
    ],
    "description": "DWARF Explorer\n==============\n\nA cross-platform GUI utility for visualizing the DWARF\ndebugging information in executable files, built on top of [pyelftools](https://github.com/eliben/pyelftools) and [filebytes](https://github.com/sashs/filebytes). Runs on Windows, MacOS X, and Linux. Supports parsing the following file types for DWARF data:\n - ELF (Linux, Android)\n - Mach-O (MacOS X, iOS)\n - PE (Windows, Cygwin)\n\nThis project came from my desire to see and navigate the DWARF tree of compiled Android and iOS binaries. Seeing the DIEs is easy enough with utilities like `readelf` or `dwarfdump`. However, chasing inter-DIE references back and forth is not straightforward with those.\n\nThe utility might be of use for anyone who is building DWARF parsers for one or another reason, especially if their preferred parsing library is `pyelftools`.\n\nNote that regular Windows executables (EXE/DLL files) are PE files but don't, as a rule, contain DWARF information. The Microsoft toolchains (Visual Studio and the like) produce debugging information in Microsoft's own format, Program Database (PDB). There are, though, a couple of toolchains that produce PE files with DWARF debug info in them - notably GCC under Cygwin. DWARF Explorer is compatible with those.\n\nThe pyelftools library that dwex is based on supports DWARF versions 2-4, and so does dwex. DWARF v5 exists, and will be eventually supported, but it's not mainstream yet. DWARF v1 is supported experimentally, in ELF files only.\n\nRequirements and Dependencies\n------------\n - Python 3.5+\n - PyQt5\n - filebytes 0.10.1+\n - pyelftools 0.27+\n\nInstalllation\n-------------\n\nIf necessary, install [the latest Python](https://www.python.org/downloads/) in the way that's appropriate for your OS. Run `pip install dwex` from the command line, under `sudo` or elevated command line if necessary.\n\nOn Windows, if `pip` and/or Python is not in PATH, use `c:\\Python39\\python -m pip install dwex`, substituting your own path to Python 3.\n\nAlternatively, get the dwex source tree from Github, and run `python setup.py install` in the root folder of the package. In this scenario, you'd have to install the dependencies separately - with `pip install pyqt5 filebytes pyelftools`.\n\nOn Linux, sometimes the `python` command defaults to Python 2 while Python 3 is installed side by side. In this case, use `python3` and `pip3`, respectively. Use `python -V` to check.\n\nOnce you install it, there will be a `dwex` command. On Windows, there will be a `dwex.exe` in the `Scripts` folder under the Python folder, and also a start menu item \"DWARF Explorer\".\n\nUsage\n-----\n\nClick Open in the File menu, choose your executable, and eyeball the DWARF tree. Alternatively, drag and drop an executable onto the main window. You can open by dropping a dSYM bundle folder, too.\n\nOn the most basic level, the debug information in a compiled file is an array of *compilation units* (CUs). Each CU contains a tree of data items called *Debugging Information Entries* (DIEs). Each DIE has a title called *tag*, and contains a name-value dictionary called *attributes*. Each CU has exactly one root DIE, and the rest of the DIEs are in its subtree.\n\nThe UI of DWARF Explorer was meant for eyeballing that data structure:\n\n![dwex](https://user-images.githubusercontent.com/5807738/77756810-510ad300-7006-11ea-8d97-b7c109d050b1.png)\n\nThe left hand tree displays the DIEs, with CU root DIEs on the top level. Expand the tree and click on DIEs to see their attributes. DIE attributes that have a substructure or point at larger data structures are clickable.\n\nDIEs generally correspond to source level entities in the program - variables, functions, classes, members, methods, etc. The DIE tag tells you which one is it. The exact way the compiler builds a DIE tree to describe the program varies between source languages, compiler versions, target platforms and architectures. The official home of the DWARF spec is at [dwarfstd.org](http://dwarfstd.org/), but there's considerable leeway for implementations to improvise upon. On top of that, the DWARF spec contains explicit extension points for compiler vendors to tap into.\n\nDIE attribute values are relatively small scalars - integers, strings, sometimes short byte arrays. However, they sometimes refer at larger data structures. Physically, it's an integer, but logically, it's a pointer to some data elsewhere. Also, DIE attribute values may contain references to other DIEs - for example, a DIE for a variable would contain a reference to a DIE that describes its datatype. DIE attributes that contain references to other DIEs are rendered in blue; the link can be followed by a double-click or a Ctrl+Enter. To come back to the original DIE, use Navigate/Back, the Back mouse button, or an appropriate keyboard shortcut (Alt-Left on Windows and Linux, Ctrl-[ on Mac).\n\nIn DWARF, tag and attribute names are prefixed with `DW_TAG_` and `DW_AT_`, respectively. DWARF Explorer elides those by default to reduce visual clutter. Use `View/DWARF prefix` in the menu to bring them back.\n\nDisclaimer\n----------\n\nThis project is unrelated to [ragundo/DwarfExplorer](https://github.com/ragundo/DwarfExplorer). That one deals with a different kind of dwarves. Although, interestingly enough, they also use the Qt library for their GUI.",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/sevaa/dwex/",
    "keywords": "dwarf,debug,debugging,symbols,viewer,view,browser,browse,tree",
    "license": "BSD",
    "maintainer": "",
    "maintainer_email": "",
    "name": "dwex",
    "package_url": "https://pypi.org/project/dwex/",
    "platform": "any",
    "project_url": "https://pypi.org/project/dwex/",
    "project_urls": {
      "Homepage": "https://github.com/sevaa/dwex/"
    },
    "release_url": "https://pypi.org/project/dwex/1.0/",
    "requires_dist": null,
    "requires_python": ">=3.5",
    "summary": "GUI viewer for DWARF debug information",
    "version": "1.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17193001,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "5ceaa4038aa3b47eaf7e3675e875e836311007498a026401250cb7cd8c6675df",
        "md5": "cb0d8482188cc1304d361ae5eed2ea6a",
        "sha256": "8a6ca0f0de6fa49a3c3598a0d983c3679030c428758b19fa6851ecc01bbb9391"
      },
      "downloads": -1,
      "filename": "dwex-1.0.tar.gz",
      "has_sig": false,
      "md5_digest": "cb0d8482188cc1304d361ae5eed2ea6a",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.5",
      "size": 30774,
      "upload_time": "2020-12-03T03:54:50",
      "upload_time_iso_8601": "2020-12-03T03:54:50.302889Z",
      "url": "https://files.pythonhosted.org/packages/5c/ea/a4038aa3b47eaf7e3675e875e836311007498a026401250cb7cd8c6675df/dwex-1.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}