{
  "info": {
    "author": "Jan Kosinski",
    "author_email": "jankos@amu.edu.pl",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: GNU General Public License (GPL)",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.7"
    ],
    "description": "# AGouTI - Annotation of Genomic and Transcriptomic Intervals\n\n## Introduction\nHigh-throughput sequencing techniques have become very popular in molecular biology research. In many cases, obtained results are described by positions corresponding to the transcript, gene, or genome. Usually, to infer the biological function of such regions, it is necessary to annotate these regions with overlapping known genomic features, such as genes, transcripts, exons, UTRs, CDSs, etc. AGouTI is a tool designed to annotate any genomic or transcriptomic coordinates using known genome annotation data in GTF or GFF files. \n\n#### Main features\n1. AGouTI works with coordinates describing positions within the genome and within the transcripts,\n2. Ability to assign intragenic regions from provided GTF/GFF annotation (UTRs, CDS, etc.) or de novo (5’ part, middle, 3’ part, whole), \n3. Annotation of intervals in standard BED or custom column-based text files (TSV, CSV, etc.) in any non-standard format,  \n4. Flexible handling of multiple annotations for a single region, \n5. Flexible selection of GTF/GFF attributes to include in the annotation. \n\n<hr>\n<br>\n<br>\n<br>\n\n## Installation\n\nPython >= 3.7 is required to run this software.\n\nYou can install AGouTI using `pip` as follows (recommended)\n\n`pip install AGouTI`\n\nor by \n\n`python setup.py install`\n\n<br>\n\n#### Having troubles with an older Python version?\n\nYou can easily manage python versions using `conda` and the concept of virtual environments.\n\n`Anaconda` can be downloaded from https://www.anaconda.com/distribution/#download-section (Python 3.x version)\n\nTo create a virtual environment with a specified Python version, you can type\n\n`\nconda create --name your_virtualenv_name python=3.8\n`\n\nAfterward, you need to activate your virtual environment.\n\n`\nconda activate your_virtualenv_name\n`\n\nNow you can install AGouTI using `pip` or `conda` and perform your analysis.\n\nAfter your job is finished, you can leave your virtual environment.\n\n`\nconda deactivate\n`\n\nAs an alternative to conda you can use Python's `venv`\n\n<hr>\n<br>\n<br>\n<br>\n\n## Run AGouTI\n\nYou can now access <b>AGouTI</b> as follows:\n\n`\nagouti --help\n`\n<br/>\n\nRunning AGouTI is a two-step process. First, you need to create a dedicated database based on your annotation file (GTF/GFF3) using the `create_db` module and then annotate your intervals with the features of interest using `annotate`.\n\n`\nagouti create_db --help\n`\n\n<br/>\n\n`\nagouti annotate --help\n`\n\n<br>\n<br>\n\n### Step 1. Create the database\n\nWe have decided to rely on the SQLite database to efficiently store and access annotation data. Thus, the first step of our annotation pipeline is to create such a database using information included in GTF or GFF3 files. All feature names and attributes from the GTF/GFF3 file are automatically converted to lowercase to uniform the feature selection during the annotation step. By default, the initial database is created in RAM. Then it is inspected to provide the user with a list of features and attributes available in the GTF/GFF file and visualize the hierarchy of those features in a graph-based manner. The inspection process is efficient while the initial database is stored in memory (by default), but for low-memory machines, it can also be stored on the hard drive (an SSD drive would be recommended for speed). Memory consumption depends on the number of features and attributes that must be stored. For example, estimated memory use for Gencode annotation files of the human genome is up to 5GB. Finally, the database is written on a hard drive and can be used for annotation. All those steps are done automatically using create_db mode. Example invocations: \n\n`\nagouti create_db -f GTF -a gtf_of_your_choice.gtf -d database_name\n`\n\nor \n\n`\nagouti create_db -f GFF3 -a gff3_of_your_choice.gff3 -d database_name\n`\n\n##### Required options\n\n<b>-a</b>, <b>--annotation</b> : Input file containing gene annotations in GTF or GFF3 format.\n\n<b>-f</b>, <b>--format</b> : Input file format (GTF or GFF3), can be gzip-compressed.\n\n<b>-d</b>, <b>--db</b> : Name for the output database.\n\n##### Additional options \n\n<b>-l</b>, <b>--low-ram</b> : Creates the database as a sqlite3 file directly on your disk. By default, the initial database is created in RAM to quickly inspect contents and relations between features and afterward saved on a local drive. Using this option may significantly slow down database creation. Use only when your RAM size is limited in comparison to the expected size of your database.\n\n<b>-i</b>, <b>--infer_genes</b> : Infer genes. Use only with GTF files that do not contain separate lines describing genes. This step might be very time-consuming.\n\n<b>-j</b>, <b>--infer_transcripts</b> :  Infer transcripts. Use only with GTF files that do not contain separate lines describing transcripts. This step might be very time-consuming. \n\n##### Output\nThe output files include: \n\n1. <b>database_name</b> - the SQLite database file\n2. <b>database_name.relations</b> -  text file storing relations between feature types. This file is required for annotation with AGouTI. Therefore it must be stored in the same directory as the database file.\n3. <b>database_name.attributes_and_features.pickle</b> - python dictionary stored as a pickle file. This file is required for annotation with AGouTI. Therefore it must be stored in the same directory as the database file. \n4. <b>database_name.database.structure.txt</b> - additional text file listing all the features and attributes present in the GTF/GFF3 file and showing relations between them in a tree-like structure\n\n\nThe output consists of a tree-based structure representing the hierarchy of the features in the GTF or GFF3 file and a list of available attributes for each feature type. That information is by default displayed on stdout. \nHaving insights into the database contents, users can choose only a subset of features and attributes to annotate the dataset of interest. \n\n<br>\n<br>\n\n### Step 2. Annotate your file\nAfter creating the database, you can run annotation with AGouTI using the `agouti` annotate command. For example, AGouTI can annotate intervals stored in standard BED or any column-based text file containing information about genomic or transcriptomic coordinates (see the `--custom` option). \n\nThe transcriptomic mode enables the annotation of intervals encoded as positions within the transcripts instead of chromosomes. However, it is instrumental in annotating results from transcript-focused analyses (e.g., RBPs binding sites, identification of RNA structural motifs, etc.), it is essential to use the same source and version of annotation files as during the generation of the intervals submitted for annotation. The transcript IDs often change between the annotation releases as the transcript layout is improved (e.g., ENST00000613119.1 -> ENST00000613119.2 -> ENST00000613119.3, etc.). Since the transcript IDs are part of the coordinate system in transcriptomic mode, any difference will result in an annotation error. \n\nBasic command:\n\n`agouti annotate -i input.bed -d database_name`\n\n##### Required Options\n\n<b>-i</b>, <b>--input</b> : Input file in BED or another column-based format (see --custom). \n\n<b>-d</b>, <b>--database</b> : Database created by agouti create_db.\n\n##### Additional options\n\n<b>-m</b>, <b>--custom</b> : Specify that the input text file is in custom format, besides BED. It should contain columns with information about feature id (id), chromosome (chr), start (s), and end (e) coordinates. Users can optionally specify a column with strand information (strand); otherwise, AGouTI will set it to '.'. Format should be specified as column indexes (starting from 1), in the following order: \"id,chr,s,e,strand\" or \"id,chr,s,e\", e.g. --custom 1,2,4,5,6. The field separator used in your file can be provided using the --separator option.\n\n<b>-p</b>, <b>--separator</b> : Field separator for the --custom option. Default is tabulator.\n\n<b>-b</b>, <b>--first_base_num</b>' : The first base number in the input file (BED/CUSTOM). Either 0 (0-based coordinates) or 1 (1-based coordinates). Default is 0 (standard for genomic BED files).\n\n<b>-n</b>, <b>--header_lines</b> : The number of header lines. 0 by default. If a single header line is present, set this parameter to 1, etc. \n\n<b>-t</b>, <b>--transcriptomic</b> : Transcriptomic annotation mode. In this mode, transcript IDs from the GTF/GFF3 are expected to be placed in the first column of provided BED file instead of chromosome names. Coordinates in this mode are assumed to reflect positions within the transcript. Optional.\n\n<b>-f</b>, <b>--select_features</b> : Comma-separated list of feature names to be reported, e.g., \"mRNA,CDS\". Refer to [db_name].database.structure.txt file written during the database creation for a list of valid features. By default, all features are reported. \n\n<b>-a</b>, <b>--select_attributes</b> : Comma-separated list of attribute names to be reported, e.g., \"ID,description\". Refer to [db_name].database.structure.txt file written during the database creation for a list of valid attributes. By default, all attributes are reported.\n\n<b>-c</b>, <b>--combine</b> : List of specific feature-attribute combinations to be reported. Desired combination should be specified in the format: 'feature1-attribute1:attribute2,feature2-attribute1', e.g., \"mRNA:description,biotype\"  for each mRNA, will provide annotation of mRNA description and mRNA biotype.\n\n<b>-s</b>, <b>--strand_specific</b> : Strand-specific search. \n\n<b>-w</b>, <b>--completly_within</b> : The feature must lie entirely within the GTF/GFF3 feature to be reported. \n\n<b>-l</b>, <b>--level</b> : Group results on a specific level (e.g., 1 for gene level, 2 for mRNA, tRNA). Must be one of [1,2]. An annotation may be done on gene or transcript levels (level 1 or 2) so that each output line will correspond to the gene or transcript. Please note that --level 1 cannot be combined with --transcriptomic. Default is 2.\n\n<b>-r</b>, <b>--annotate_feature_region</b> : Report region within the GTF or GFF3 feature, which overlaps with an entry from the input file. Designed to work with `--transcriptomic`. Possible values: \n\n1. `5 prime` -  when the annotated feature starts within the first quarter of gene or transcript and ends in the first half\n2. `middle` -  starts and ends within the second and third quarter\n3. `3 prime` - starts within the third quarter and ends in the last one\n4. `whole` - starts within the first quarter and ends within the last one. The length of the annotated feature does <b>not</b> exceed 90% of transcript or gene length.\n5. `full` - starts within the first quarter and ends within the last one. The length of the annotated feature does exceed 90% of transcript or gene length.\n\n<b>--statistics</b>: Calculate additional statistics. Those will be displayed at the end of the software\\'s output (starting with #).\n\n<b>--stats_only</b>: Display statistics only.\n\n##### Output\nOutput is by default displayed on stdout in the form of a self-explanatory `.tsv` table.\n<hr>\n<br>\n<br>\n<br>\n\n## Test case 1\n\nAll files used in this case are available at https://github.com/zywicki-lab/agouti (`agouti/agouti_pkg/sample_data.tar.gz`).\n\n### Annotate human single nucleotide polymorphisms (SNPs) stored in the BED file (`common_snp.bed`). \n\nWe've downloaded BED file from the UCSC Table Browser (<i>https://genome.ucsc.edu/cgi-bin/hgTables</i>) using the following filters:\n\n<b>Clade:</b> Mammal\n<b>Genome:</b> Human\n<b>Assembly:</b> Dec. 2013 (GRCh38/hg38)\n<b>Group:</b> Variation\n<b>Track:</b> Common SNPs(151)\n<b>Table:</b> snp151Common\n<b>Position:</b> chrX\n<b>Output format:</b> BED - browser extensible data\n\nand saved only the first 1000 SNPs in `common_snp.bed`.\n\nFurthermore, we've downloaded gene annotations (only the X chromosome, genome version <i>GRCh38.p13</i>) in the GFF3 file format from the Ensembl database (<i>https://www.ensembl.org</i>) and subtracted to contain only the first 18178 lines.\n\nTo run AGouTI, the User needs to create the database based on the contents of the GFF3 file. It can be done using the command\n\n`agouti create_db -f GFF3 -a Homo_sapiens.GRCh38.105.chromosome.X.gff3.gz -d Homo_sapiens.GRCh38.105.chromosome.X.db`\n\nAfter the job completes, the User can explore the structure and contents of the database and GFF3 file by examining the `Homo_sapiens.GRCh38.105.chromosome.X.db.database.structure.txt`.\n\nLet’s say that we are not interested in pseudogenes, unconfirmed_transcripts, and non-coding RNAs. To annotate SNPs using our database and calculate additional statistics (`--statistics`), we can type\n\n`agouti annotate -d Homo_sapiens.GRCh38.105.chromosome.X.db -i common_snp.bed -f gene,lnc_rna,exon,mrna,five_prime_utr,three_prime_utr,cds --statistics > annotated_snp.tsv`\n\nYou can examine the results stored in the `annotated_snp.tsv`\n\nPlease note! Some SNPs lie in the intergenic regions, and the closest gene upstream/downstream is marked as `None`, because we operate near the chromosome border, and no gene is annotated upstream or downstream from such SNPs.\n\nTo discard SNPs located in the intergenic regions, we can use `grep`, `awk`, or similar tools, e.g.\n\n`grep -v intergenic annotated_snp.tsv > annotated_snp_intergenic_discarded.tsv`\n\nYou can also make annotations on gene instead of transcript level (option `-l`)\n\n`agouti annotate -d Homo_sapiens.GRCh38.105.chromosome.X.db -i common_snp.bed -f gene,lnc_rna,exon,mrna,five_prime_utr,three_prime_utr,cds -l 1 --statistics | grep -v intergenic > annotated_snp_l1.tsv`\n\nYou can explore the differences by examining the `annotated_snp_l1.tsv` file.\n\n<hr>\n<br>\n<br>\n\n## Test case 2\n\nAll files used in this case are available at https://github.com/zywicki-lab/agouti (`agouti/agouti_pkg/sample_data.tar.gz`).\n\n### Annotate sample results obtained with the missRNA software (`missRNA.tsv`). Records represent coordinates of the small RNA molecules excised from the longer RNA molecules.\n\nWe've downloaded human gene annotations (only the 1st chromosome, genome version <i>GRCh38.p13</i>) in the GFF3 file format from the Ensembl database (<i>https://www.ensembl.org</i>) and subtracted to contain only the first 68571 lines.\n\nTo create the databasae, run:\n\n`agouti create_db -f GFF3 -a Homo_sapiens.GRCh38.105.chromosome.1.gff3.gz -d Homo_sapiens.GRCh38.105.chr1.db`\n\nTo annotate the file in format other than standard BED using transcriptomic mode, use:\n\n`agouti annotate -i missRNA.tsv -d Homo_sapiens.GRCh38.105.chr1.db -t -r -m 2,1,4,5,6 > missRNA-results.tsv`\n\nThe self-explanatory output file is stored as `missRNA-results.tsv` in the same directory as sample datasets.\n\n<hr>\n<br>\n<br>\n<br>\n\n\n### Contribute\n\nIf you notice any errors and mistakes or would like to suggest some new features, please use Github's issue tracking system to report them. You are also welcome to send a pull request with your corrections and suggestions.\n\n### License\n\nThis project is licensed under the GNU General Public License v3.0 license terms.\n\nAnytree (Copyright (c) 2016 c0fec0de) and gffutils (Copyright (c) 2013 Ryan Dale) packages are distributed with this software to ensure full compatibility. Documentation, authors, license and additional information can be found at https://anytree.readthedocs.io/en/latest/ and https://github.com/daler/gffutils.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/zywicki-lab/agouti",
    "keywords": "",
    "license": "GNU General Public License",
    "maintainer": "",
    "maintainer_email": "",
    "name": "AGouTI",
    "package_url": "https://pypi.org/project/AGouTI/",
    "platform": null,
    "project_url": "https://pypi.org/project/AGouTI/",
    "project_urls": {
      "Homepage": "https://github.com/zywicki-lab/agouti"
    },
    "release_url": "https://pypi.org/project/AGouTI/1.0.3/",
    "requires_dist": [
      "numpy",
      "pandas"
    ],
    "requires_python": ">=3.7.0",
    "summary": "Annotation of Genomic and Transcriptomic Intervals using GTF/GFF files.",
    "version": "1.0.3",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16057152,
  "releases": {
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0feb0172e8bb3a4a9f7e00a253819dbc51ecaad5b473beaec9f59e52fc5e1594",
          "md5": "a51c84802783246f8379f85220adcc4a",
          "sha256": "7ccb99ea67cc05f008c956a190a9a2c3b79d0cee51506697718616ba15858ba1"
        },
        "downloads": -1,
        "filename": "AGouTI-1.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "a51c84802783246f8379f85220adcc4a",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7.0",
        "size": 1378633,
        "upload_time": "2022-06-28T11:41:27",
        "upload_time_iso_8601": "2022-06-28T11:41:27.120920Z",
        "url": "https://files.pythonhosted.org/packages/0f/eb/0172e8bb3a4a9f7e00a253819dbc51ecaad5b473beaec9f59e52fc5e1594/AGouTI-1.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "132fbd471d0ff1ca4633f488e918fb552a495d7d18be4c2ad9a2c6b51fe8b2f5",
          "md5": "9e41b1b3a5aeca4bf97d14d9e20d540e",
          "sha256": "570b6ecb31e0de76de3df4d118e9fb295dc66025b3a3489676c3c725ff41eca7"
        },
        "downloads": -1,
        "filename": "AGouTI-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "9e41b1b3a5aeca4bf97d14d9e20d540e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7.0",
        "size": 1335357,
        "upload_time": "2022-06-28T11:41:29",
        "upload_time_iso_8601": "2022-06-28T11:41:29.031946Z",
        "url": "https://files.pythonhosted.org/packages/13/2f/bd471d0ff1ca4633f488e918fb552a495d7d18be4c2ad9a2c6b51fe8b2f5/AGouTI-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b2a949001b0fa6aaa4a7cc53cb12102f634b31e4c98148721ea5e1eb68fe963c",
          "md5": "787dbded878a978e91e26e8eba7c1d2e",
          "sha256": "8951e8cb3a44f570056c4dbf3292cf32b2650db2b6f61e9a18666d1f2082443c"
        },
        "downloads": -1,
        "filename": "AGouTI-1.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "787dbded878a978e91e26e8eba7c1d2e",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7.0",
        "size": 1383124,
        "upload_time": "2022-07-05T20:53:28",
        "upload_time_iso_8601": "2022-07-05T20:53:28.329448Z",
        "url": "https://files.pythonhosted.org/packages/b2/a9/49001b0fa6aaa4a7cc53cb12102f634b31e4c98148721ea5e1eb68fe963c/AGouTI-1.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a1db1a3bb382562bde4bb42b65f4fd48be075ba506b2ceb5d79e1c9fe956fcf6",
          "md5": "07270afb4bd44af881eb3a993bac7e40",
          "sha256": "0fec027ea076ca2bf7d6a1e888d20bd5733983ff93b431daa94b6af36e5b0f80"
        },
        "downloads": -1,
        "filename": "AGouTI-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "07270afb4bd44af881eb3a993bac7e40",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7.0",
        "size": 1347633,
        "upload_time": "2022-07-05T20:53:30",
        "upload_time_iso_8601": "2022-07-05T20:53:30.869959Z",
        "url": "https://files.pythonhosted.org/packages/a1/db/1a3bb382562bde4bb42b65f4fd48be075ba506b2ceb5d79e1c9fe956fcf6/AGouTI-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "48f4b6db5a496f1974b0a65273ad8e7581fea7d9bbbe228b3b6793c91f5f9779",
          "md5": "08e50a661a2c1d9aa8d0597e41102eb1",
          "sha256": "5d57c092e485ea8304f709f743abcd574370ecdd0d44217ceb8ccb741459027d"
        },
        "downloads": -1,
        "filename": "AGouTI-1.0.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "08e50a661a2c1d9aa8d0597e41102eb1",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7.0",
        "size": 1383220,
        "upload_time": "2022-12-10T11:08:28",
        "upload_time_iso_8601": "2022-12-10T11:08:28.765409Z",
        "url": "https://files.pythonhosted.org/packages/48/f4/b6db5a496f1974b0a65273ad8e7581fea7d9bbbe228b3b6793c91f5f9779/AGouTI-1.0.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8dec19f53d67f2512695d24a7d9a5768ff46eff65ab808af34201cb8563481dc",
          "md5": "f9d5c7debf95adbec11a576b9c5b6be9",
          "sha256": "633409c591c4e0cd48aa394eeb1668b6c655d75c7dba7d8b4197cab976f4d29e"
        },
        "downloads": -1,
        "filename": "AGouTI-1.0.3.tar.gz",
        "has_sig": false,
        "md5_digest": "f9d5c7debf95adbec11a576b9c5b6be9",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7.0",
        "size": 1347658,
        "upload_time": "2022-12-10T11:08:31",
        "upload_time_iso_8601": "2022-12-10T11:08:31.105561Z",
        "url": "https://files.pythonhosted.org/packages/8d/ec/19f53d67f2512695d24a7d9a5768ff46eff65ab808af34201cb8563481dc/AGouTI-1.0.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "48f4b6db5a496f1974b0a65273ad8e7581fea7d9bbbe228b3b6793c91f5f9779",
        "md5": "08e50a661a2c1d9aa8d0597e41102eb1",
        "sha256": "5d57c092e485ea8304f709f743abcd574370ecdd0d44217ceb8ccb741459027d"
      },
      "downloads": -1,
      "filename": "AGouTI-1.0.3-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "08e50a661a2c1d9aa8d0597e41102eb1",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.7.0",
      "size": 1383220,
      "upload_time": "2022-12-10T11:08:28",
      "upload_time_iso_8601": "2022-12-10T11:08:28.765409Z",
      "url": "https://files.pythonhosted.org/packages/48/f4/b6db5a496f1974b0a65273ad8e7581fea7d9bbbe228b3b6793c91f5f9779/AGouTI-1.0.3-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "8dec19f53d67f2512695d24a7d9a5768ff46eff65ab808af34201cb8563481dc",
        "md5": "f9d5c7debf95adbec11a576b9c5b6be9",
        "sha256": "633409c591c4e0cd48aa394eeb1668b6c655d75c7dba7d8b4197cab976f4d29e"
      },
      "downloads": -1,
      "filename": "AGouTI-1.0.3.tar.gz",
      "has_sig": false,
      "md5_digest": "f9d5c7debf95adbec11a576b9c5b6be9",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7.0",
      "size": 1347658,
      "upload_time": "2022-12-10T11:08:31",
      "upload_time_iso_8601": "2022-12-10T11:08:31.105561Z",
      "url": "https://files.pythonhosted.org/packages/8d/ec/19f53d67f2512695d24a7d9a5768ff46eff65ab808af34201cb8563481dc/AGouTI-1.0.3.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}