{
  "info": {
    "author": "",
    "author_email": "Gordon Kamer <gordon@agrippa.build>",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "# Agrippa\n\nThis python package is meant to assist in building/understanding/analyzing machine learning models. The core of the system is a markup language that can be used to specify a model architecture. This package contains utilities to convert that language into the ONNX format, which is compatible with a variety of deployment options and ML frameworks.\n\n# Installation\n\nAgrippa can be installed with `pip install agrippa`. The `requirements.txt` file contains dependencies to run both the package and the tests found in the `tests` folder.\n\n# Usage\n\nThe principal function is export, which takes a project folder and compiles the contents into a .onnx file.\n\n```\nimport agrippa\n\nmodel_dir = '../path/to/dir'\nagrippa.export(model_dir, 'outfile_name.onnx')\n```\n\nThe function header for export is:\n\n```\ndef export(\n        infile,  # the markup file\n        outfile=None,  # the .onnx file name\n        producer=\"Unknown\",  # your name\n        graph_name=\"Unknown\",  # the name of the model\n        write_weights=True,  # should this create a weights file, should none exist\n        suppress=False,  # suppresses certain print statements\n        reinit=False,  # reinitializes all weights from the weights file\n        bindings=None  # a dictionary to bind variables present in the markup\n    ):\n```\n\n# Markup Language Spec\n\nA project should be bundled into its own directory, which should have three files:\n1. One file with the extension `.agr` or `.xml` specifying the model architecture\n2. A `weights.pkl` file to specify the parameter values in the model (optional)\n3. A `meta.json` file to define certain metadata, like the producer name (optional)\n\nThe architecture file is parsed like XML, so it should be well-formed XML. Recall that tags with no respective end-tag should end with ` \\>`, and all attributes should be formatted like strings with quotes around them.\n\n## Markup Syntax\n\nEvery architecture file should be encased in a `<model>` tag, ideally with an attribute `script-version=\"0.0.0\"` (the current version).\n\nAn example script that does only one matrix multiply might look like this:\n\n```\n<model script-version=\"0.0.1\">\n    <import dim=\"[5, 1]\" from=\"input\" type=\"float32\" />\n    <block title=\"Projection\">\n        <import from=\"input\" />\n        <node title=\"Linear\" op=\"MatMul\">\n            <params dim=\"[5, 5]\" name=\"W\" type=\"float32\" />\n            <input dim=\"[var(features), 1]\" src=\"input\" />\n            <output dim=\"[5, 1]\" name=\"y\" />\n        </node>\n        <export from=\"y\" />\n    </block>\n    <export dim=\"[5, 1]\" from=\"y\" type=\"float32\" />\n</model>\n```\n\nThere are only three types of root-level tags that are allowed: `<import>`, `<export>`, and `<block>`. The import and export tags specify the inputs and outputs of the entire model, respectively. There may be multiple of each type, but each type must appear at least once. Each import and export tag must have three attributes: `dim`, `from`, and `type`. They are used like so:\n\n```\n<import dim=\"[3, 1]\" from=\"input\" type=\"float32\" />\n<export dim=\"[3, 1]\" from=\"y\" type=\"float32\" />\n```\n\nThe `from` name for the export matches the name you should expect from ONNX runtime. It should also match the output of the last node from which you are piping output.\n\nMost of the architechture should be contained inside `<block>` tags. These tags take a title attribute, which does not need to be unique. Importantly, `<node>` tags must be inside blocks. Block tags should contain `<import>` and `<export>` tags (with the attributes mentioned above) specifying all of the inputs/outputs the underlying nodes inside the block use.\n\nNodes define operations. Their `op` attribute defines the ONNX op type they will be converted to. They must also have a `title` attribute, which is unique. Nodes must also contain appropriate `<input>`, `<output>`, and `<params>` tags. The `<input>` and `<params>` tags need to be in the order specified in the ONNX documentation for a particular node type. See an example node:\n\n```\n<node title=\"Linear\" op=\"MatMul\">\n    <params dim=\"[3, 3]\" name=\"W\" type=\"float32\" shared=\"no\" />\n    <input dim=\"[3, 1]\" src=\"input\" />\n    <output dim=\"[3, 1]\" name=\"linear\" />\n</node>\n```\n\nParameters, which are specified using the `<params>` tag, take a `name` attribute (unique only for non-shared parameters), a `dim` attribute, a `type` attribute, and an optional `shared` attribute. The `shared` attribute should equal \"yes\" or \"no\". It specifies whether a parameter name is meant to be unique; by default, parameters which share the same name (such as in a repitition) become independent values upon compilation.\n\n## Repetitions\n\nBlocks may take a `rep` attribute, which defines how many times a block should be stacked on top of itself. Its outputs are passed to its inputs and so on. The number of inputs and the number of outputs need not match (they are matched based on order; note that if you want to use intermediate outputs, you must account for name mangling in repeated blocks). Even though the names of the outputs are mangled during repetitions, you may use the outputs in your markup with consideration to that fact: simply refer back to the name you specified, which is automatically mapped to the last name in the repetition.\n\n## Variable Bindings\n\nThe `agrippa.export` function takes an optional argument, `bindings`. The `bindings` parameter is meant to be a dictionary of variables, set by the user, to replace areas in the markup file where the `var` function is used. For example, if an input tag has a `dim` attribute set to `\"[var(image_width), var(image_height)]\"`, a binding of `{'image_width': 512, 'image_height': '256'}` would set all occurances of `var(image_height)` to `512` and all occurances of `var(image_height)` to `256`. Note that in all cases, strings are used, since xml attributes require strings; the values are type-casted upon compilation.\n\n## Expressions\n\nAttributes also support expressions using `expr()`. For example, in order to specify that a parameter should be initialized to the square of a variable (supplied in bindings), you could use:\n`<params name=\"squared\" dim=\"[2, 2]\" init=\"constant\" init_args=\"[expr(my_var^2)]\">`.\n\nNote that the expression goes inside the list (expressions do not support lists). They support to following binary operators: `^`, `*`, `/`, `%`, `-`, `+`.\n\nAlso note that `expr(my_var)` and `var(my_var)` are equivalent.\n\n## Weight Initialization\n\nBy default, weights are initialized with a standard normal distribution. There are ways to specify other initializations for each parameter, however. The `params` tag takes an optional `init` attribute along with an optional `init_args` attribute. The `init_args` attribute must always be some value (non-string), such as a list (e.g., `init_args=\"[2, 3]\"`). Recall that all attributes are specified with double quotation marks) The options for initialization are:\n\n| Value    | Description    | Arguments |\n|----------|----------------|-----------|\n| normal   | Normally distributed | A list of two numbers, the first defining the mean and the second defining the standard deviation. |\n| uni_random  | Uniformly random in [a, b) | A list of two numbers, the first defining the a and the second defining b.|\n| zeros | All zeros | None |\n| ones  | All ones  | None |\n| constant | Initializes tensor to specified value | The first argument in the list is the value\n\n## Frozen Parameters\n\nIn order to freeze a parameter, you can set the `frozen` attribute equal to `yes`. Internally, this option adds `$constant` to the ONNX initialization names. When importing the parameter into PyTorch using the conversion tool, the `$constant` indicates that the initializer should be added as a buffer (constant) rather than a parameter.\n\n## Importing From Other Files\n\nAnother file can be used in your model by using a `block` tag with a `src` attribute. Like so:\n\n```<block src=\"path/to/file.agr\" name=\"imported_file\" />```\n\nThe `name` attribute defines how you refer to imports/exports of the imported model. For example, if the linked model has a root level import with name `inputs`, an output (or import) (in the original file) with name `imported_file$inputs` will be automatically passed to the imported model. Likewise, an export can be referred to in the original file by specifying an input with name `imported_file$out_name_from_imp_file`.\n\n## Other Rules\n\n### Names\n\nNode titles are optional (a default, unique game is given to them upon compilation). Parameter names should be unique only when they are not shared parameters; parameters inside repeated blocks will have their names mangled so that they are unique. Name mangling affects parameters, node titles, and output/input names separately.\n\n### Types\n\nTypes by default are set to float32.\n\n### Dimensions\n\nSpecifying the dimensions of inputs and outputs are optional. Specifying the dimensions of imports and exports are only required at the root level, though it is recommended that you specify them for clarity.\n\n\nAny behavior not mentioned here is undefined.\n\n## Supported Types\n\nThe only currently supported type is `float32`.\n\n## Supported ONNX OpTypes\n\nThe currently supported op types are:\n\n\n| ONNX OpType | Tested ONNX Compile Support        | Tested Training Support           |\n| ----------- | ---------------------------------- |-----------------------------------|\n| Add         | <span style=color:green>Yes</span> | <span style=color:green>Yes</span>|\n| Concat      | <span style=color:green>Yes</span> | <span style=color:green>Yes</span>|\n| Identity    | <span style=color:green>Yes</span> | <span style=color:green>Yes</span>|\n| LeakyRelu   | <span style=color:green>Yes</span> | <span style=color:green>Yes</span>|\n| LpNormalization | <span style=color:green>Yes</span> | <span style=color:green>Yes</span>|\n| MatMul      | <span style=color:green>Yes</span> | <span style=color:green>Yes</span>|\n| Mul         | <span style=color:green>Yes</span> |<span style=color:green>Yes</span>|\n| Relu        | <span style=color:green>Yes</span> |<span style=color:green>Yes</span>|\n| ReduceMean  | <span style=color:green>Yes</span> |<span style=color:green>Yes</span>|\n| Softmax     | <span style=color:green>Yes</span> |<span style=color:green>Yes</span>|\n| Sqrt        | <span style=color:green>Yes</span> |<span style=color:green>Yes</span>|\n| Sub         | <span style=color:green>Yes</span> |<span style=color:green>Yes</span>|\n| Transpose   | <span style=color:green>Yes</span> |<span style=color:green>Yes</span>|\n\nAdditional notes on functionality that might differ from ONNX. For most details, see [the Onnx documentation](https://github.com/onnx/onnx/blob/main/docs/Operators.md).\n\n| ONNX OpType | Notes                                |\n| ----------- | -------------------------------------|\n| Transpose   | Important difference with the Onnx documentation: by default, when imported into PyTorch, the transpose operator will keep the first dimension the same so as to support batching. The Onnx default behavior is to reverse all the dimensions. |\n\n## Syntax Highlighting in VSCode\n\nIf you'd like to use the extension `.agr` for clarity, you can enable syntax highlighting in vscode by placing the following in a settings.json file:\n```\n\"files.associations\": {\n    \"*.agr\": \"xml\"\n}\n```\nTo create that settings file, use the command pallet (CTRL-SHIFT-P), type `settings.json`, and choose the appropriate option.\n\n# Training\n\nONNX is built for inference. However, various supporters of ONNX, including Microsoft (via the onnxruntime), have tried to implement training support. As far as I can tell, Microsoft gave up on trying to support training ONNX files directly. Many of the training tools in onnxruntime are either experimental or scheduled to be depricated. What they did end up implementing was a tool to train PyTorch models (i.e. objects of classes that inherit from torch.nn.Module). Their tool is more narrowly for speeding up training that you could already do natively in PyTorch, and it is not used in this project.\n\nAnother option, besides trying to rely on existing ONNX training projects, would have been to make our own. It is actually relatively straightforward: the ONNX file itself is a highly expressive computational graph. We could build a separate graph for training, which has gradient nodes added. It could even take parameters as input and output new parameters while keeping all the data on a GPU. The key is having access to (or building from scratch) nodes that can compute the gradient of each operation (there are many, but they are relatively simple). I ultimately decided (like Microsoft) that this was not worth the pain.\n\nInstead, we opt for converting onnx files to PyTorch. We provide utilities to do that and to use the training features of PyTorch.\n\nUnfortunately, PyTorch does not natively support importing ONNX files. But there is a work-around: building on top of some community tools, we can make our own ONNX to PyTorch converter that is suitable for training. There is more information in the README.md under src/agrippa/onnx2torch for details on exactly how a particular community project was modified. It does not support all ONNX operations, but neither does our markup language.\n\n## Usage\n\nThe following code snippet takes a project directory, converts it to an onnx file, then uses the build-in ONNX-to-PyTorch converter to create a PyTorch model, which can be trained in the usual way.\n\n```\nimport agrippa\n\nproj_name = 'simple-project'\nonnx_out = 'simple_testing.onnx'\n\nagrippa.export(proj_name, onnx_out)\n\ntorch_model = agrippa.onnx_to_torch(onnx_out)\n```\n\n# Utilities\n\nSome utilities are available in agrippa.utils. This includes `find_params`, which returns weight (parameter) names and values as a dictionary. It also includes `save_torch_model`, which takes trained weights from a PyTorch model and saves them into a fresh `weights.pkl` file.\n\n## Finding Parameters\n\nThe returned dictionary includes parameters whose names contain the `name` argument (first argument) as a substring. Searching for weights in this way is recommended, since the names of parameters might be changed when the markup is compiled (for example, the names of weights that appear in repeated blocks). The `find_params` function takes two mandatory parameters and one optional: the substring that will be matched (mandatory), the directory of the project (mandatory), and the path to the weights file name within that directory (optional).\n\n### Example\n\n```\nmatches = agrippa.utils.find_params('bias', 'FNN')\nprint(matches)\n```\nThe above code might print:\n```\n{'biases$1': array([[-0.77192398],\n       [-0.02351803],\n       [-0.00533084],\n       [ 0.13640493],\n       [-0.12087004]]), 'biases$2': array([[-0.18979854],\n       [-0.15769928],\n       [ 0.46656397],\n       [-0.10602235]])}\n```\n\n## Saving Model from PyTorch\n\nAfter importing your model to PyTorch using `agrippa.onnx_to_torch`, you probably would like to save the trained weights. When imported into PyTorch, the names of the weights change slightly, so it is recommended that you save your models using `agrippa.utils.save_torch_model`, which takes as parameters the PyTorch model, the project directory, and (optionally) the weights filename inside that directory. Under the hood, this function loops over the `state_dict` of the PyTorch model, removes `initializer.` from the parameter's name, and saves it inside a dictionary to `weights.pkl`.\n\n### Example\n\n```\n# ... training loop\nagrippa.utils.save_torch_model(torch_model, \"my-project\", \"weights.pkl\")\n```\n\n# Examples\n\nThe following architecture is a simple feed forward network with five layers followed by a normalization. The architecture is organized into two blocks, the FFN and the norm layer. Inside the FFN is a FFN Layer block, which is repeated five times.\n\n```\n<model script-version=\"0.0.1\">\n\n    <import dim=\"[3, 1]\" from=\"input\" type=\"float32\" />\n\n    <block title=\"FFN\">\n        <import from=\"input\" />\n        <block title=\"FFN Layer\" rep=\"5\">\n            <import from=\"input\" />\n            <node title=\"Linear\" op=\"MatMul\">\n                <params dim=\"[3, 3]\" name=\"W\" type=\"float32\" />\n                <input dim=\"[3, 1]\" src=\"input\" />\n                <output dim=\"[3, 1]\" name=\"linear\" />\n            </node>\n            <node title=\"Bias\" op=\"Add\">\n                <params dim=\"[3, 1]\" name=\"B\" type=\"float32\" />\n                <input dim=\"[3, 1]\" src=\"linear\" />\n                <output dim=\"[3, 1]\" name=\"biased\" />\n            </node>\n            <node title=\"ReLu\" op=\"Relu\">\n                <input dim=\"[3, 1]\" src=\"biased\" />\n                <output dim=\"[3, 1]\" name=\"relu\" />\n            </node>\n            <export from=\"relu\" />\n        </block>\n    </block>\n    <block title=\"Norm\">\n        <import from=\"relu\" />\n        <node title=\"ReLu\" op=\"LpNormalization\" axis=\"0\" p=\"1\">\n            <input dim=\"[3, 1]\" src=\"relu\" />\n            <output dim=\"[3, 1]\" name=\"y\" />\n        </node>\n        <export from=\"y\" />\n    </block>\n \n    <export dim=\"[3, 1]\" from=\"y\" type=\"float32\" />\n\n</model>\n```\n\nYou can find more example projects inside the `tests` folder.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "ml,ai,artificial intelligence,neural networks",
    "license": "The MIT License (MIT) Copyright © 2022 Gordon Kamer  Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the “Software”), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:  The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.  THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.",
    "maintainer": "",
    "maintainer_email": "",
    "name": "agrippa",
    "package_url": "https://pypi.org/project/agrippa/",
    "platform": null,
    "project_url": "https://pypi.org/project/agrippa/",
    "project_urls": null,
    "release_url": "https://pypi.org/project/agrippa/1.0.1/",
    "requires_dist": [
      "numpy (<=1.23.4)",
      "onnx (>=1.12.0)",
      "torch (>=1.13.1)",
      "torchvision (>=0.14.1)"
    ],
    "requires_python": ">=3.8",
    "summary": "Making AI easier",
    "version": "1.0.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16851662,
  "releases": {
    "0.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1c134ad48b0881c9df8ce6f349713dc8f577d6cfafb1e3d76695e0256b9bf972",
          "md5": "3cbcac4dcad6f724a6b31e627eb70b3a",
          "sha256": "cb139e0752b315b6e8c909600bc6756a33e447b46245e2a8168c6bb59919b9ce"
        },
        "downloads": -1,
        "filename": "agrippa-0.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "3cbcac4dcad6f724a6b31e627eb70b3a",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 5661,
        "upload_time": "2022-11-02T04:03:38",
        "upload_time_iso_8601": "2022-11-02T04:03:38.965287Z",
        "url": "https://files.pythonhosted.org/packages/1c/13/4ad48b0881c9df8ce6f349713dc8f577d6cfafb1e3d76695e0256b9bf972/agrippa-0.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e92992ae2fb6451881090cd26dc3e5c80a18259208d9f58d5fe7f9ff662d93d6",
          "md5": "da6903a3fe7581c7eb6ea18324b86f38",
          "sha256": "63d68465dab9acaa3d54878e50495dd3fc6046b879ff8f3ad2851770a352bfaa"
        },
        "downloads": -1,
        "filename": "agrippa-0.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "da6903a3fe7581c7eb6ea18324b86f38",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 4607,
        "upload_time": "2022-11-02T04:03:40",
        "upload_time_iso_8601": "2022-11-02T04:03:40.648309Z",
        "url": "https://files.pythonhosted.org/packages/e9/29/92ae2fb6451881090cd26dc3e5c80a18259208d9f58d5fe7f9ff662d93d6/agrippa-0.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b1c433d885b07bf750543979643fd6e28e7a37385de9d0c27b8ea9722704e438",
          "md5": "a371a3f648fca6c8e80752e26d8bc91d",
          "sha256": "78ef5dd1504fb4aff0fcba77f3e89eef6dc8e3354fe4fe87ac1420cc92e1f173"
        },
        "downloads": -1,
        "filename": "agrippa-0.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "a371a3f648fca6c8e80752e26d8bc91d",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 5755,
        "upload_time": "2022-11-02T04:25:06",
        "upload_time_iso_8601": "2022-11-02T04:25:06.186711Z",
        "url": "https://files.pythonhosted.org/packages/b1/c4/33d885b07bf750543979643fd6e28e7a37385de9d0c27b8ea9722704e438/agrippa-0.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5b129fe2e00551fdc0274c285f37810874489551beb1e74cd8243cef09d7f5ce",
          "md5": "81bc9171f9483d31f9503d37160713a5",
          "sha256": "b137c394a73c5bbf23c0a222c5bfb6275dd565e967ed5d41b1b2512a82ef9f8f"
        },
        "downloads": -1,
        "filename": "agrippa-0.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "81bc9171f9483d31f9503d37160713a5",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 4660,
        "upload_time": "2022-11-02T04:25:07",
        "upload_time_iso_8601": "2022-11-02T04:25:07.920186Z",
        "url": "https://files.pythonhosted.org/packages/5b/12/9fe2e00551fdc0274c285f37810874489551beb1e74cd8243cef09d7f5ce/agrippa-0.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5f33c228a15721cfed1f6a42e9748f6104b28835354d727a2d472bf5d8129478",
          "md5": "e02dca163fcf5cc51196362dce81a898",
          "sha256": "2855be77332085036295b08f19ff30220dddd5468212eeed998d48c1b308b610"
        },
        "downloads": -1,
        "filename": "agrippa-0.0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "e02dca163fcf5cc51196362dce81a898",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 5759,
        "upload_time": "2022-11-02T04:29:11",
        "upload_time_iso_8601": "2022-11-02T04:29:11.835555Z",
        "url": "https://files.pythonhosted.org/packages/5f/33/c228a15721cfed1f6a42e9748f6104b28835354d727a2d472bf5d8129478/agrippa-0.0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "489fa6d5a166731678948b3c70b11418c4db42eef1f981601884703d3a9f270b",
          "md5": "b687e9425eaf7dc53b0bc748d230fceb",
          "sha256": "9090d48a6fb4ec06a52cdd3a946657f1ade873383334cd6a1db2321339437aa6"
        },
        "downloads": -1,
        "filename": "agrippa-0.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "b687e9425eaf7dc53b0bc748d230fceb",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 4659,
        "upload_time": "2022-11-02T04:29:13",
        "upload_time_iso_8601": "2022-11-02T04:29:13.506034Z",
        "url": "https://files.pythonhosted.org/packages/48/9f/a6d5a166731678948b3c70b11418c4db42eef1f981601884703d3a9f270b/agrippa-0.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d1545e55edc2d0a666901e0c9e3dcf182105c829205d02a7ad6923649a92d53a",
          "md5": "6b60fd558240fade755973c0a936072b",
          "sha256": "509e0310e928c6a02d3bbfed8b59e765df5a65ff650a1de629e2a8f201c7b1f0"
        },
        "downloads": -1,
        "filename": "agrippa-0.0.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "6b60fd558240fade755973c0a936072b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 5802,
        "upload_time": "2022-11-02T04:50:00",
        "upload_time_iso_8601": "2022-11-02T04:50:00.649556Z",
        "url": "https://files.pythonhosted.org/packages/d1/54/5e55edc2d0a666901e0c9e3dcf182105c829205d02a7ad6923649a92d53a/agrippa-0.0.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0ce5586a0275bb8443e1e196480d477bbd8742f988b56836f23948d8fa7af1a3",
          "md5": "0f5f310b682ac9ad08b916c26a22a556",
          "sha256": "27c07275052d3a466fc1c0ba4e3cc59da945eb33d7a702aeb739f09108cfeff0"
        },
        "downloads": -1,
        "filename": "agrippa-0.0.3.tar.gz",
        "has_sig": false,
        "md5_digest": "0f5f310b682ac9ad08b916c26a22a556",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 4706,
        "upload_time": "2022-11-02T04:50:02",
        "upload_time_iso_8601": "2022-11-02T04:50:02.401730Z",
        "url": "https://files.pythonhosted.org/packages/0c/e5/586a0275bb8443e1e196480d477bbd8742f988b56836f23948d8fa7af1a3/agrippa-0.0.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f99c506a7030f73d8e2e5b6d72dcb574dc501febd7459f524de290836acdfd41",
          "md5": "9dfaaa231481c36e7d6e6f9fb9e3cda0",
          "sha256": "7ea14539e76678087cc6bc26f8422091f3032fb05c4e9127ed85ebee41cf5a6b"
        },
        "downloads": -1,
        "filename": "agrippa-0.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "9dfaaa231481c36e7d6e6f9fb9e3cda0",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 9080,
        "upload_time": "2022-11-03T04:55:15",
        "upload_time_iso_8601": "2022-11-03T04:55:15.185613Z",
        "url": "https://files.pythonhosted.org/packages/f9/9c/506a7030f73d8e2e5b6d72dcb574dc501febd7459f524de290836acdfd41/agrippa-0.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "abc4605b3793de62bc7e05ce03d5a6444519efca844412f1fa01535565dff0cf",
          "md5": "a027277b18b6825a052d6fb9ee88af1c",
          "sha256": "53c2d2d52e52f8f678435abb3d501bf54539dbd811d328eaac422e68f6769674"
        },
        "downloads": -1,
        "filename": "agrippa-0.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "a027277b18b6825a052d6fb9ee88af1c",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 10619,
        "upload_time": "2022-11-03T04:55:17",
        "upload_time_iso_8601": "2022-11-03T04:55:17.249794Z",
        "url": "https://files.pythonhosted.org/packages/ab/c4/605b3793de62bc7e05ce03d5a6444519efca844412f1fa01535565dff0cf/agrippa-0.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0049db305256d01c3d92d1f3550cb65447e1432a62269ab40ded3a6440655c87",
          "md5": "68113e63686f522164c938b0cff95b88",
          "sha256": "cff3dbcd726561410ac9f6bedd02331b811b6615020ebe0413b194f08714040f"
        },
        "downloads": -1,
        "filename": "agrippa-1.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "68113e63686f522164c938b0cff95b88",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 79342,
        "upload_time": "2023-02-14T05:18:40",
        "upload_time_iso_8601": "2023-02-14T05:18:40.166927Z",
        "url": "https://files.pythonhosted.org/packages/00/49/db305256d01c3d92d1f3550cb65447e1432a62269ab40ded3a6440655c87/agrippa-1.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "fa60fc411de27611fc6f04e90376394f1147c47a0c2465e140e3f37b4c72adee",
          "md5": "d148661d789c72883ce0869883f596bb",
          "sha256": "763c45a006046498ac6f038330a88f278f63008d473a74395ba9490a115b7a56"
        },
        "downloads": -1,
        "filename": "agrippa-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "d148661d789c72883ce0869883f596bb",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 50668,
        "upload_time": "2023-02-14T05:18:41",
        "upload_time_iso_8601": "2023-02-14T05:18:41.730712Z",
        "url": "https://files.pythonhosted.org/packages/fa/60/fc411de27611fc6f04e90376394f1147c47a0c2465e140e3f37b4c72adee/agrippa-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7753e82cc796435ebc519f429b6a4f6b52d4f914844b46e9aa985776e96a39f0",
          "md5": "a5d06ef5fc68622765732062a337a142",
          "sha256": "0582458f562b9dd3685eded05112ba06939d7cf99603754ccc3ebfa6b8d343be"
        },
        "downloads": -1,
        "filename": "agrippa-1.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "a5d06ef5fc68622765732062a337a142",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 79363,
        "upload_time": "2023-02-14T05:26:26",
        "upload_time_iso_8601": "2023-02-14T05:26:26.736871Z",
        "url": "https://files.pythonhosted.org/packages/77/53/e82cc796435ebc519f429b6a4f6b52d4f914844b46e9aa985776e96a39f0/agrippa-1.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "16d156c257d7bffec8119d7eb7d5e23e219709ed17cf8afd4d99aa6ff01a1a42",
          "md5": "462acbff830ddf7bc8e0c460a8643fec",
          "sha256": "d45d70517b8c277635a8e7b04dc797e43a9714fce928d4eaf021f0cf5120d300"
        },
        "downloads": -1,
        "filename": "agrippa-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "462acbff830ddf7bc8e0c460a8643fec",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 50710,
        "upload_time": "2023-02-14T05:26:28",
        "upload_time_iso_8601": "2023-02-14T05:26:28.768021Z",
        "url": "https://files.pythonhosted.org/packages/16/d1/56c257d7bffec8119d7eb7d5e23e219709ed17cf8afd4d99aa6ff01a1a42/agrippa-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "7753e82cc796435ebc519f429b6a4f6b52d4f914844b46e9aa985776e96a39f0",
        "md5": "a5d06ef5fc68622765732062a337a142",
        "sha256": "0582458f562b9dd3685eded05112ba06939d7cf99603754ccc3ebfa6b8d343be"
      },
      "downloads": -1,
      "filename": "agrippa-1.0.1-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "a5d06ef5fc68622765732062a337a142",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.8",
      "size": 79363,
      "upload_time": "2023-02-14T05:26:26",
      "upload_time_iso_8601": "2023-02-14T05:26:26.736871Z",
      "url": "https://files.pythonhosted.org/packages/77/53/e82cc796435ebc519f429b6a4f6b52d4f914844b46e9aa985776e96a39f0/agrippa-1.0.1-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "16d156c257d7bffec8119d7eb7d5e23e219709ed17cf8afd4d99aa6ff01a1a42",
        "md5": "462acbff830ddf7bc8e0c460a8643fec",
        "sha256": "d45d70517b8c277635a8e7b04dc797e43a9714fce928d4eaf021f0cf5120d300"
      },
      "downloads": -1,
      "filename": "agrippa-1.0.1.tar.gz",
      "has_sig": false,
      "md5_digest": "462acbff830ddf7bc8e0c460a8643fec",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.8",
      "size": 50710,
      "upload_time": "2023-02-14T05:26:28",
      "upload_time_iso_8601": "2023-02-14T05:26:28.768021Z",
      "url": "https://files.pythonhosted.org/packages/16/d1/56c257d7bffec8119d7eb7d5e23e219709ed17cf8afd4d99aa6ff01a1a42/agrippa-1.0.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}