{
  "info": {
    "author": "Jules Scholler",
    "author_email": "jules.scholler@wysscenter.ch",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 1 - Planning",
      "Intended Audience :: Developers",
      "Programming Language :: Python :: 3"
    ],
    "description": "MOTA\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/WyssCenter/MOTA",
    "keywords": "cell mapping,atlas",
    "license": "LIMITED LICENSE AGREEMENT   IMPORTANT-READ CAREFULLY: This Limited License Agreement ('LLA) is made between you on behalf of yourself or on behalf of any entity by which you are employed or engaged (collectively referred to in this LLA as 'You' or 'Licensee') and the Wyss Center for Bio and Neuro Engineering, a non-profit entity incorporated under the laws of Switzerland having its place of business at Chemin des Mines 9, CH-1202 Genève, Switzerland (the 'Wyss Center').  The Wyss Center materials licensed under this LLA shall mean the software including any associated media, documentation and any software update, upgrade or change make available by the Wyss Center (collectively the 'Licensed Materials').  THE LICENSED MATERIALS ARE LICENSED TO YOU ON THE CONDITION THAT YOU ACCEPT ALL THE TERMS AND CONDITIONS OF THIS LLA. BY CLICKING ON THE 'I ACCEPT' BUTTON OR BY INSTALLING, ACCESSING OR OTHERWISE USING THE LICENSED MATERIALS, YOU AGREE TO BE BOUND BY THE TERMS OF THIS LLA. IF YOU DO NOT AGREE WITH ANY CONDITION OF THIS LLA, DO NOT INSTALL, ACCESS OR USE THE LICENSED MATERIALS.  1. LIMITED LICENSE  Subject to the terms and conditions of this LLA and applicable Open Source Terms (as defined hereafter) and during the term of this LLA, the Wyss Center hereby grants You under intellectual property rights owned by the Wyss Center or under which the Wyss Center has the right to grant a license, a worldwide, non-exclusive, non-transferable, royalty-free, license, without the right to sub-license, to use internally the Licensed Materials and to modify the source code form of the Licensed Materials for the sole purpose of performing evaluation, simulation, testing and developing derivatives of the Licensed Materials ('Limited License Purpose'). You acknowledge you are receiving the Licensed Materials under a limited license and not as a purchaser of the Licensed Materials.  2. RESTRICTIONS  You shall not, and shall not permit any third party to: (i) rent, disclose, publish, sell, assign, lease, lend, sublicense, market, transfer, distribute or otherwise provide third parties access to (any portion of) the Licensed Materials; (ii) use the Licensed Materials to create any product that competes with the Licensed Materials; (iii) disclose the results of the Licensed Materials’ performance to any third party; or (vii) otherwise use any portion of the Licensed Materials in any manner not expressly authorized by this LLA.  Other than the limited expressed license granted to You under Article 1 herein, no other rights or licenses are granted, or implied by estoppel or otherwise, under any intellectual property rights of the Wyss Center or a third-party residing in the Licensed Materials and any trademark, trade or brand name, domain name, corporate name of the Wyss Center. You may not use the Licensed Materials for any commercial purpose which includes the use of the Licensed Materials as a standalone product or in a product, to be distributed, marketed or otherwise offered for sale or for rent ultimately.  3. OWNERSHIP, COPYRIGHTS AND TRADEMARKS  The Licensed Materials are and will remain the exclusive property of the Wyss Center. Any and all feedback, changes, reconfigurations, alterations, improvements, translations, transformations, derivative works, and/or enhancements of the Licensed Materials made by You ('Modifications') shall be owned by the Wyss Center with and all documentation available related to such Modification. You shall not remove, modify or alter any Wyss Center copyright or trademark notice from any part of the Licensed Materials.  4. CONFIDENTIALITY  Confidential information shall include all information provided with the Licensed Materials which (a) is designated as 'confidential', 'proprietary' or with a similar legend, (b) is by its own nature of a type which would reasonably be considered confidential and/or (c) is source code ('Confidential Information') (d) any modification to the source code or any feedback on the Licensed Materials from You. You may only use the Confidential Information for the Limited License Purpose and shall protect the confidentiality of the Confidential Information by using the same degree of care, but not less than a reasonable degree of care, to prevent its unauthorized use, dissemination, or publication as You use to protect your own confidential information of like nature.  The confidentiality obligations shall not apply to Confidential Information, which can be shown by documentary evidence: (i) entered the public domain through no fault of the Licensee; or, (ii) was known to the Licensee prior to receipt from the Wyss Center; or, (iii) was disclosed to the Licensee by a third party having the right to disclose; or, (iv) was independently developed by the Licensee without use of the Licensed Materials or Confidential Information, the onus of proof of independence being on the Licensee.  You shall immediately notify the Wyss Center of any unauthorised use or disclosure of, or of any unauthorised access to, or of any theft or loss of the Licensed Materials or Confidential Information or part thereof, which comes to your notice. These confidentiality obligations shall survive any termination or expiration of the LLA for whatever cause.  5. DISCLAIMER OF WARRANTY  THE LICENSED MATERIALS AND ANY AND ALL PARTS THEREOF ARE PROVIDED 'AS IS'. THE WYSS CENTER MAKE NO REPRESENTATIONS OR WARRANTIES WITH RESPECT TO THE LICENSED MATERIALS AND OR PARTS THEREOF WHETHER EXPRESS, IMPLIED, OR STATUTORY, INCLUDING BUT NOT LIMITED TO, WARRANTY OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. WITHOUT LIMITING THE GENERALITY OF THE FOREGOING, THE WYSS CENTER MAKE NO REPRESENTATION OR WARRANTY THAT (I) THE USE OF THE LICENSED MATERIALS AND OR PARTS THEREOF WILL BE UNINTERRUPTED OR ERROR FREE, AND OR (II) ANY USE OF THE LICENSED MATERIALS AND OR PARTS THEREOF ARE FREE FROM INFRINGEMENT OF ANY THIRD-PARTY INTELLECTUAL PROPERTY RIGHTS.  6. OPEN SOURCE  Some portion of the Licensed Materials might contain Open Source Software subject to Open Source Terms (as defined below) applicable for each such portion, as further specified in the Licensed Materials. Such Open Source Software is supplied to You under the applicable Open Source Terms and is not subject to the terms of this LLA to the extent the terms of this LLA are in conflict with such applicable Open Source Terms.  Except for Open Source Software, You have no rights under this LLA to, and may not under any circumstances use the Licensed Materials or any parts thereof such that they become subject to any Open Source Terms. These actions include but are not limited to combining the Licensed Materials by means of incorporation or linking or otherwise.  For the purpose of this LLA, 'Open Source Terms' shall mean any open source license which requires as part of distribution of software that the source code of such software is distributed therewith, or any other open source license that complies with the Open Source Definition specified at www.opensource.org and any other comparable open source license such as for example GNU General Public License (GPL), Eclipse Public License (EPL), Apache Software License, BSD license and MIT license. 'Open Source Software' shall mean any software that is licensed or distributed under Open Source Terms as specified in the Licensed Materials.  7. DISCLAIMER OF DAMAGES  IN NO EVENT SHALL THE WYSS CENTER BE LIABLE FOR ANY INDIRECT, INCIDENTAL, PUNITIVE, SPECIAL OR CONSEQUENTIAL DAMAGES, LOST PROFITS, REVENUES OR SAVINGS, LOSS OF OPPORTUNITY, BUSINESS INTERRUPTION, DAMAGE TO PRODUCT OR EQUIPMENT, LOSS OF DATA OR FOR ANY DAMAGE ASSOCIATED WITH INTELLECTUAL PROPERTY INFRINGEMENT CLAIMS, WHETHER FORESEEABLE OR UNFORESEEABLE AND WHETHER OR NOT SUCH DAMAGES ARE BASED ON WARRANTY, CONTRACT OR ANY OTHER LEGAL THEORY, ARISING OUT OF OR IN CONNECTION WITH THIS LLA – EVEN IF LICENSEE IS AWARE, OF THE POSSIBILITY OF SUCH DAMAGES. THE WYSS CENTER AGGREGATE AND CUMULATIVE LIABILITY TOWARDS LICENSEE UNDER THIS LLA SHALL NOT EXCEED CHF 100 USD (ONE HUNDRED CHF). THE LIMITATIONS SET FORTH ABOVE IN THIS ARTICLE 7 SHALL ONLY APPLY TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW.  8. TERM AND TERMINATION  This LLA shall be valid for an initial period of one year from acceptance by You of this LLA, Thereafter, it shall automatically renew for an unlimited period of time until terminated by either the Wyss Center or Licensee upon one (1) month prior written notice to the other. Notwithstanding the foregoing, Licensee may terminate this LLA at any time by destroying all Licensed Materials, and other Confidential Information or by returning those to the Wyss Center. The Wyss Center may terminate this LLA at any time if (i) You fail to comply with the terms and conditions of this LLA, or (ii) the Wyss Center receives notice of any claim that alleges that the Licensed Materials or Your use of the Licensed Materials infringes any third-party intellectual property rights. Upon termination, You shall delete, destroy, or return to the Wyss Center all Licensed Materials in your possession and You shall stop using the Licensed Materials for any purpose whatsoever. The rights and obligations under Articles from 2 to 9 will survive the termination or expiration of this LLA.  9. MISCELLANEOUS  If a court or agency of competent jurisdiction holds any term of this LLA invalid, illegal, or unenforceable for any reason, the remainder of this LLA shall be valid and enforceable and You and the Wyss Center shall discuss in good faith a substitute, valid, enforceable provision which most nearly effects the parties intent in entering into this LLA.  The failure by the Wyss Center to enforce any provisions of this LLA or to exercise any right in respect thereto shall not be construed as constituting a waiver of its rights thereof.  No agency, partnership or other business organization shall be created or be construed as being created by reason of this LLA. You will not have the right or authority to create any obligation of any nature whatsoever on behalf of the Wyss Center or bind the Wyss Center in any respect. You and the Wyss Center are independent parties. Nothing in this LLA shall be construed as making You an employee, agent or legal representative of the Wyss Center.  Any amendment to this LLA shall be agreed in writing and be duly signed by You and the Wyss Center with reference to this LLA.  This LLA is governed by the laws of Switzerland, without regard to its conflict of law rules. All disputes arising out of or in connection with this LLA shall be finally settled by the competent courts of Geneva, Switzerland. Notwithstanding the aforesaid, nothing in this LLA shall prevent the Wyss Center from seeking any interim or final injunctive or equitable relief by a court of competent jurisdiction. ",
    "maintainer": "",
    "maintainer_email": "",
    "name": "alicetools",
    "package_url": "https://pypi.org/project/alicetools/",
    "platform": "",
    "project_url": "https://pypi.org/project/alicetools/",
    "project_urls": {
      "Homepage": "https://github.com/WyssCenter/MOTA"
    },
    "release_url": "https://pypi.org/project/alicetools/0.0.3/",
    "requires_dist": [
      "numpy",
      "tqdm",
      "pandas",
      "scikit-image",
      "allensdk"
    ],
    "requires_python": "",
    "summary": "Tools developped for ALICe platform.",
    "version": "0.0.3",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 12995330,
  "releases": {
    "0.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "613511127c520fd5a187420228adac96dd0ccdf4c74877768d90cf40e018b789",
          "md5": "fc1acee08c1ffed936705cab6eff34e5",
          "sha256": "76ca1fa183ee6037d4405f28dad5d6c3ab46dd22099dd7956276c6818b5ef5e7"
        },
        "downloads": -1,
        "filename": "alicetools-0.0.1-py3.8.egg",
        "has_sig": false,
        "md5_digest": "fc1acee08c1ffed936705cab6eff34e5",
        "packagetype": "bdist_egg",
        "python_version": "0.0.1",
        "requires_python": null,
        "size": 13251,
        "upload_time": "2022-02-04T14:51:01",
        "upload_time_iso_8601": "2022-02-04T14:51:01.064950Z",
        "url": "https://files.pythonhosted.org/packages/61/35/11127c520fd5a187420228adac96dd0ccdf4c74877768d90cf40e018b789/alicetools-0.0.1-py3.8.egg",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5e1d553c2e78da13abd9afe2f857ac5c1bea6ac93565d450f9d43a9eaa2eac8c",
          "md5": "7e9ca62d8864afe1b24d19288d9c0479",
          "sha256": "415faecbc236a96aaf9d7cff5eb31acf55685c7b81d389ba793265eb469f9ef3"
        },
        "downloads": -1,
        "filename": "alicetools-0.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "7e9ca62d8864afe1b24d19288d9c0479",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 14868,
        "upload_time": "2022-02-04T14:50:59",
        "upload_time_iso_8601": "2022-02-04T14:50:59.447405Z",
        "url": "https://files.pythonhosted.org/packages/5e/1d/553c2e78da13abd9afe2f857ac5c1bea6ac93565d450f9d43a9eaa2eac8c/alicetools-0.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "953b7f5fd4e8d59f39f1f7ed5cb505b42a6c54558dd0da63233707cdf6cdf73e",
          "md5": "0e375cb94f9b647c1f127b127c515dd0",
          "sha256": "46bcc12f732d4cb2da787ff86d126b05c35df88debfdd7f7c259a215d85f42e6"
        },
        "downloads": -1,
        "filename": "alicetools-0.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "0e375cb94f9b647c1f127b127c515dd0",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 8408,
        "upload_time": "2022-02-04T14:51:02",
        "upload_time_iso_8601": "2022-02-04T14:51:02.714075Z",
        "url": "https://files.pythonhosted.org/packages/95/3b/7f5fd4e8d59f39f1f7ed5cb505b42a6c54558dd0da63233707cdf6cdf73e/alicetools-0.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "94d4037da8c822d37464f732d858c222bf57364cc1ca516d91e065bca3a87353",
          "md5": "495d3fa795bad4d5beb9cb264c90d585",
          "sha256": "c7f2e72f50c26d2bb770314059474c1d514690f59ad873edbf76e2e21ae593da"
        },
        "downloads": -1,
        "filename": "alicetools-0.0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "495d3fa795bad4d5beb9cb264c90d585",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 14792,
        "upload_time": "2022-02-24T08:42:43",
        "upload_time_iso_8601": "2022-02-24T08:42:43.397153Z",
        "url": "https://files.pythonhosted.org/packages/94/d4/037da8c822d37464f732d858c222bf57364cc1ca516d91e065bca3a87353/alicetools-0.0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0471d3e1db49cdfa4c62f90861a574676ca3abd428803ac7d97940c04b3f9200",
          "md5": "4220dcf34eb3a92f334dbb0bbdfd8545",
          "sha256": "d3290eb31014d888e7d3375291829132235ad70f065a94c9e765e042e4853417"
        },
        "downloads": -1,
        "filename": "alicetools-0.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "4220dcf34eb3a92f334dbb0bbdfd8545",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 8375,
        "upload_time": "2022-02-24T08:42:45",
        "upload_time_iso_8601": "2022-02-24T08:42:45.298154Z",
        "url": "https://files.pythonhosted.org/packages/04/71/d3e1db49cdfa4c62f90861a574676ca3abd428803ac7d97940c04b3f9200/alicetools-0.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a1c2410500a648124018a9a493fd8e0fba9b7a0187c4b35b238cf0cce03db0ec",
          "md5": "ad6727af055e99f4974cdb22f0777bf3",
          "sha256": "8f7f54b0ecc9f4de61be2b007c250384701c9ce0e304c15f3a685e6ceee486b2"
        },
        "downloads": -1,
        "filename": "alicetools-0.0.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "ad6727af055e99f4974cdb22f0777bf3",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 15041,
        "upload_time": "2022-02-24T11:48:35",
        "upload_time_iso_8601": "2022-02-24T11:48:35.309334Z",
        "url": "https://files.pythonhosted.org/packages/a1/c2/410500a648124018a9a493fd8e0fba9b7a0187c4b35b238cf0cce03db0ec/alicetools-0.0.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ec60f57c1289294f01fdeccb9174de8ba400a4790d687035442af44fde73622a",
          "md5": "e987d1fb86ae874d01a46c4fd2ab6f9a",
          "sha256": "908c5583ab1d987ff4ab6a5b70464b867e15e4689b15153a9fba2af38062b04d"
        },
        "downloads": -1,
        "filename": "alicetools-0.0.3.tar.gz",
        "has_sig": false,
        "md5_digest": "e987d1fb86ae874d01a46c4fd2ab6f9a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 8502,
        "upload_time": "2022-02-24T11:48:37",
        "upload_time_iso_8601": "2022-02-24T11:48:37.220002Z",
        "url": "https://files.pythonhosted.org/packages/ec/60/f57c1289294f01fdeccb9174de8ba400a4790d687035442af44fde73622a/alicetools-0.0.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "a1c2410500a648124018a9a493fd8e0fba9b7a0187c4b35b238cf0cce03db0ec",
        "md5": "ad6727af055e99f4974cdb22f0777bf3",
        "sha256": "8f7f54b0ecc9f4de61be2b007c250384701c9ce0e304c15f3a685e6ceee486b2"
      },
      "downloads": -1,
      "filename": "alicetools-0.0.3-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "ad6727af055e99f4974cdb22f0777bf3",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 15041,
      "upload_time": "2022-02-24T11:48:35",
      "upload_time_iso_8601": "2022-02-24T11:48:35.309334Z",
      "url": "https://files.pythonhosted.org/packages/a1/c2/410500a648124018a9a493fd8e0fba9b7a0187c4b35b238cf0cce03db0ec/alicetools-0.0.3-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "ec60f57c1289294f01fdeccb9174de8ba400a4790d687035442af44fde73622a",
        "md5": "e987d1fb86ae874d01a46c4fd2ab6f9a",
        "sha256": "908c5583ab1d987ff4ab6a5b70464b867e15e4689b15153a9fba2af38062b04d"
      },
      "downloads": -1,
      "filename": "alicetools-0.0.3.tar.gz",
      "has_sig": false,
      "md5_digest": "e987d1fb86ae874d01a46c4fd2ab6f9a",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 8502,
      "upload_time": "2022-02-24T11:48:37",
      "upload_time_iso_8601": "2022-02-24T11:48:37.220002Z",
      "url": "https://files.pythonhosted.org/packages/ec/60/f57c1289294f01fdeccb9174de8ba400a4790d687035442af44fde73622a/alicetools-0.0.3.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}