{
  "info": {
    "author": "Lushios",
    "author_email": "author@example.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# Справочник для антивоенных споров в семье и на работе\n\n## 17 ответов на самые частые доводы, оправдывающие войну\n\n> Текст: Руслан Ленин,\n> А. П. Фогт, Саша Б., И. С., слива\n> Публикация: 27 февраля 2022\n\nВ эти дни наша главная задача — создать атмосферу полного неприятия российской военной агрессии в Украине. Но в разговорах с коллегами, друзьями, знакомыми и родными нас часто переполняют эмоции, которые не дают спокойно выстроить аргументацию. Мы приходим в отчаяние от вопросов и тезисов: неужели они это всерьез? В лучшем случае разговор заканчивается, хотя мог бы и предотвратить раскол в отношениях, и помочь консенсусу против войны.\n\nМы собрали самые частые заявления тех, кто не готов однозначно осудить российскую военную агрессию, и ответили на них. Мы опрашивали знакомых, строили и тестировали друг на друге аргументы, переписывали их снова и снова до последнего момента. Поэтому призываем вас делиться и новыми вопросами, и своими аргументами.\n\n## 1. «Разве российская армия не наносит удары только по военным объектам?»\n\nК сожалению, нет. Несмотря на постоянные заверения представителей власти и министерства обороны в обратном, российские снаряды все эти дни постоянно попадают в жилые кварталы, и уже попадали в больницы и детские сады. 25 февраля баллистическая ракета [разорвалась](https://www.amnesty.org/en/latest/news/2022/02/russian-military-commits-indiscriminate-attacks-during-the-invasion-of-ukraine/) у больницы в городе Угледар Донецкой области. В тот же день в городе Ахтырка Сумской области баллистическая ракета [попала](https://twitter.com/bellingcat/status/1497205591814684678) в детский сад. Неудивительно, что новорожденных в госпитале в Днепре медсестры вынуждены [укрывать](https://www.instagram.com/reel/CaYo9Zbgh61/?utm_medium=copy_link) от ракетных обстрелов в подвалах. За день до этого в городе [Чугуев](https://twitter.com/amnesty/status/1496906725282222083) Харьковской области российские снаряды разнесли жилой квартал. 26 февраля, обстреляны жилые дома в [Чернигове](https://twitter.com/the_ins_ru/status/1497543791959580672). Это происходит не только в приграничных районах или на юго-востоке, но и в [столице](https://twitter.com/CITeam_ru/status/1497481206451130369?s=20&t=peSgJd6gyT4nXgfIi4wRRA). Мы знаем это как от множества [очевидцев](https://www.instagram.com/realpotap/) и [фотографов](https://www.instagram.com/support.photojournalism/guide/ukraine-photographers/17938205305901344/), снимающих происходящее (так и от независимых правозащитных и расследовательских [организаций](https://www.amnesty.org/en/latest/news/2022/02/russian-military-commits-indiscriminate-attacks-during-the-invasion-of-ukraine/). Также мы знаем это от наших друзей и родственников, находящихся сейчас в Украине. Многим из них страшно, они рассказывают, что проводят часть дня в бомбоубежищах и слышат выстрелы. Мы верим этим людям, и призываем тоже говорить с близкими по ту сторону границы, если они там есть. **Это не просто часть обычных военных действий, а нарушение законов военного времени, то есть это то, что называется военными преступлениями.**\n\n## 2. «Как можно чему-то верить? Ведь идет информационная война»\n\nНаходить достоверную информацию действительно сложно. Здесь можно пойти от противного и отметить то, что вызывает наименьшее доверие. Представитель Минобороны РФ в брифинге после первого дня войны [объявил](https://twitter.com/mod_russia/status/1497205057993031689), что российская армия не понесла никаких потерь. Подобные сообщения от Минобороны появляются и в последующие дни. В это сложно поверить, ведь ни одна военная операция не обходится без потерь. Доверия не повышает и тот факт, что Роскомнадзор фактически ввел цензуру в российских СМИ, запретив упоминание информации о «спецоперации», исходящей не от Министерства обороны. С учетом того, что Минобороны выдает информацию очень скудно, это стоит расценивать как попытку создать пузырь непонимания происходящего в Украине. Напротив, независимые российские СМИ (под [угрозой](https://meduza.io/news/2022/02/26/roskomnadzor-potreboval-ot-10-smi-udalit-nedostovernuyu-informatsiyu-o-voyne-s-ukrainoy-on-zapretil-nazyvat-voynu-voynoy) блокировки) ведут непрерывный онлайн с максимально проверенной информацией — такие сводки есть, например, у [«Медузы»](https://meduza.io/live/2022/02/26/voyna) и [«Медиазоны»](https://zona.media/online/2022/02/25/third). Минобороны Украины также [делает](https://www.facebook.com/MinistryofDefence.UA) регулярные обновления ситуации, в том числе неприятные для своей стороны, что вызывает куда больше доверия чем сообщения российской стороны.\n\nМы считаем, что в такой ситуации есть смысл доверять вышеперечисленному, при этом не забывая всегда проверять полученную информацию в нескольких источниках.\n\n## 3. «А Донбассу не было страшно 8 лет? О них остальные украинцы думали все эти годы?»\n\nПрежде всего нам нужно отказаться от того, чтобы говорить про всех жителей Украины как про единого агента, который либо что-то делал, либо не делал. Все эти годы люди в Украине занимали разные позиции по отношению к войне на Донбассе. Одни голосовали за более бескомпромиссно настроенных кандидатов и партии, другие — за дипломатию. Программа нынешнего президента, за которого проголосовало большинство на выборах в 2019, году была направлена на мирное урегулирование, обмен пленными и отведение вооружений.\n\nКто-то годами принимал беженцев с Донбасса в других областях Украины и помогал им. Согласно [отчетам](https://www.unhcr.org/news/latest/2015/2/54d4a2889/ukraine-internal-displacement-nears-1-million-fighting-escalates-donetsk.html) ООН, более миллиона человек из Донецкой и Луганской областей Украины в 2014–16 годах вынужденно переселились в другие регионы Украины. В 2016 году было создано Министерство по вопросам реинтеграции временно оккупированных территорий Украины – с целью координировать поселение, помощь и трудоустройство пострадавшим от военных действий на Донбассе. Были и те, кто создавали проекты помощи тем, кто *остался* на Донбассе: [Донбасс SOS](https://www.donbasssos.org/ru/), [Восток СОС](https://vostok-sos.org/ru/), [Країна вільних людей](https://kvl.org.ua/ru/), [Пролиска](https://proliska.org/).\n\nПри этом у процесса мирного разрешения противоречий есть главное препятствие — линия фронта. Когда над Донбассом летают снаряды, неудивительно, что многие из местных жителей хотят, чтобы кто угодно пришел и остановил происходящее войсками. Когда в конституции Украины Донбасс закреплен как часть ее территории, хотя на самом деле контролируется войсками «ЛДНР» и России, логично ожидать, что внутренний диалог в украинском обществе будет включать в себя тех, кто будет считать, что у правительства есть мандат на возвращение Донбасса военным путем.\n\n**Страшно ли было Донбассу 8 лет? Сейчас мы как граждане России должны спросить у себя самих о роли *нашей* страны в этих событиях.**\n\nРоссийская Федерация много лет помогает «ЛДНР» как ресурсами, так и войскам, а значит, уже является участницей конфликта и занимает конкретную сторону. Значит, мы должны спросить себя, как *наша* страна могла бы помочь прекратить огонь на Донбассе как можно скорее? Россия — сторона конфликта на Донбассе, но это никак не делает ее полноправной участницей внутреннего политического процесса в Украине. Как она могла бы решать *этот* конфликт, а не менять политический режим всей Украины военным вторжением?\n\nИ если бы власть в России была демократической и мы могли бы через настоящих представителей влиять и на дипломатический процесс, и на действия войск, и на расходование ресурсов, какие действия мы бы проводили? Напротив, пока Россией правит президент, которого сейчас интересует реализация своих геополитических амбиций (на что он прямо указывает заявлениями о «рисках для России» и о том, что суверенитет Украины — историческая ошибка Ленина), он будет приоритизировать эти задачи над всеми прочими, включая мир на Донбассе. Настоящий вопрос: что будет, если прекратить решать задачи Путина вместо проблем Донбасса?\n\n## 4. «А кто защитит Донбасс от обстрелов?»\n\nСейчас российская армия не помогает мирным жителям Донбасса, а атакует Украину с трех фронтов и ставит целью ее полный захват. Как [заявляют](https://t.me/matveevkomment/1991) уже и депутаты Госдумы от КПРФ, «Голосуя за признание ДНР/ЛНР я голосовал за мир, а не за войну. За то, чтобы Россия стала щитом, чтобы не бомбили Донбасс, а не за то, чтобы бомбили Киев». В то же время Путин и другие представители власти излагают самые разные обоснования интервенции: то восстановление «исторического единства» народов, то восстановлении исторических границ, то — будто Украина и НАТО «создали риски» для «существования» самой России, то о защите всей Украины от неонацистов. **Помощь мирным жителям Донбасса в них почти не фигурирует.**\n\nПри этом союзничество с «ЛДНР» — далеко не самый очевидный способ такой помощи. Если бы во главу угла было поставлено разрешение ситуации, а не захватнические планы и собственное влияние на Украину, то российское правительство могло бы потратить силы на сотрудничество с гражданским обществом внутри и вне Донбасса. В этой связи напомним и о расследовании [Baza](https://donbass.baza.io/), которое называет одним из главных выгодополучателей войны в Донбассе беглого украинского олигарха Сергея Курченко — сотрудничающего с высокопоставленными чиновниками и силовиками из спецслужб РФ. В ходе конфликта на Донбассе под его контроль перешла большая часть угольных и металлургических предприятий на территории «ЛДНР». В то время как Курченко обогащается, рабочим предприятий в 2021 году месяцами [не платили](https://t.me/rwp_rwp/3749) зарплаты, и так держащиеся на уровне 10-20 тысяч рублей. Стоит поставить вопрос о том, зачем на самом деле нужна российская армия на Донбассе и ее поддержка вооруженных сил «ЛДНР».\n\n## 5. «А где же вы (российские граждане, осуждающие войну) были все эти 8 лет?»\n\nКто-то из нас был подростком, кто-то не имел позиции или не интересовался политикой, а кто-то сопротивлялся войне с Украиной. Важнее всего не это, а то, как мы будем действовать сейчас.\n\nВ России на антивоенные протесты после присоединения Крыма в 2014 вышло до [20 000](https://www.dw.com/en/anti-war-protesters-march-through-moscow/a-17938261) человек, от либералов до анархистов. Именно с Крыма, а не Донбасса, начался отсчет — это важно помнить, чтобы не путать нападение и самооборону.\n\nАнтивоенные лозунги звучали на многих других акциях: например, на траурных шествиях, посвященных Борису Немцову — до пандемии они набирали в среднем по 60 000 тысяч человек. Отказ от претензий на Крым и на Донбасс, резкое улучшение отношений с Украиной — позиция, которая никогда не уходила полностью из протестной и оппозиционной повестки. Хотя главный фокус и сместился на масштабные внутренние проблемы России — такие как фальсификация выборов, преследование политзаключенных, экологические катастрофы, пенсионная реформа.\n\nТем не менее, борясь против авторитаризма в РФ, мы боролись и за возможность менять власть и отказаться от агрессивной внешней политики. Возможность прекратить стычки с украинскими войсками и спонсирование отрядов, ведущих бои с украинской армией. Именно это, а также наше полное доверие к украинскому гражданскому обществу в деле решения их *внутренних* проблем, могло бы принести мир на Донбасс.\n\n## 6. «Путин хочет закончить эту войну, которая длится 8 лет»\n\nПутин и другие представители российской власти постоянно заявляли, что Россия — не участница военных действий на Донбассе. Значит, с его собственной точки зрения, он объявил войну, а не заканчивает ее.\n\nНа самом деле российская армия уже в 2014 году сражалась с украинской на украинской территории — например, под Иловайском. Война идет 8 лет.\n\nЗакончить войну — отличная цель. Однако она не объясняет, зачем оккупировать другую страну и стремиться взять под контроль ее политические институты. А Путин уже не раз поставил вопрос именно так — например, [25 февраля](https://t.me/novaya_pishet/36383), когда попытался убедить украинских военных совершить военный переворот: «Берите власть в свои руки, похоже нам с вами будет легче договориться, чем с этой шайкой наркоманов и неонацистов, которая засела в Киеве и взяла в заложники весь украинский народ».\n\nНаконец, вместо идеи окончания войны, за последние дни мы получаем от российской власти только новые для нее оправдания — см. п.4.\n\n## 7. «Разве мы не спасаем Украину и Россию от неонацистов?»\n\nКто мониторит фашистскую активность в обществе, причем скрупулезнее всех? Антифашисты. Именно антифашистские объединения систематически сопротивляются фашистским и неонацистским организациям. Украинские антифашисты [регулярно](https://www.youtube.com/watch?v=m5ZLpFIsMH8) [заявляют](https://ru.crimethinc.com/2022/02/15/voina-i-anarkhisty-pierspiektivy-libiertariiev-v-ukrainie), что путинская пропаганда крайне преувеличивает влияние ультраправых на украинское общество и государство. Антифашисты не стали бы *преуменьшать* степень «нацификации». **Если российская власть и государственные медиа оценивают ее выше, чем это делают антифашисты — которые находятся в стране и контексте — это ясный знак, что врут именно первые.** Также антифашисты [заявляли](https://ru.crimethinc.com/2022/02/15/voina-i-anarkhisty-pierspiektivy-libiertariiev-v-ukrainie), что будут сражаться против российского вторжения на стороне армии Украины — очевидно, они не считают ее фашистской.\n\nСуществуют неонацистские боевые группы, которые [действуют](https://www.thedailybeast.com/wagners-rusich-neo-nazi-attack-unit-hints-its-going-back-into-ukraine-undercover) **против** украинских сил и на стороне «ЛДНР» и армии России, а их представители в течение последних лет встречались с Путиным. Примеры таких образований — отряды «Русич» и «Ратибор». Историк и политолог Вячеслав Лихачев, исследуя (и признавая) роль неонацистов с **обеих** сторон конфликта [писал](https://www.ifri.org/sites/default/files/atoms/files/rnv95_uk_likhachev_far-right_radicals_final.pdf): «члены ультраправых групп сыграли гораздо большую роль с российской стороны конфликта чем с украинской».\n\nИзвестная своими националистическими взглядами **партия «Правый Сектор» не получила ни одного места в действующей Верховной Раде.** В предвыборной [программе](https://program.ze2019.com/) Зеленского, за которого проголосовали 73% избирателей при явке 61,37%, почти 13,5 млн человек, не было ни единого националистического лозунга. Зато был такой: «Надо объединяться всем, кто независимо от пола, языка, веры, национальности просто ЛЮБИТ УКРАИНУ!»\n\nНаконец, агрессию России осуждают Талибан, европейские государства, Израиль — очень пестрая палитра политических сил. В России на антивоенном митинге была задержана ленинградская [блокадница](https://www.instagram.com/p/CaZkUkMMWCl/). Люди и нации, действительно пострадавшие от нацизма, не на стороне Путина.\n\n## 8. «Украинцы сами просят Путина вмешаться, чтобы он всех спас»\n\nВ первую очередь, нужно спросить, от кого мог бы спасать гражданок и граждан Украины Путин. Выше мы упоминали о том, что угрозы со стороны неонацистских сил цинично раздуваются российскими властями, которые не говорят о том, что стоит, в первую очередь, доверить антифашизм самому украинскому обществу.\n\nДаже если сколько-то писем от озабоченных украинцев лежит на столе у Путина, можно предположить, что таких просителей не больше, чем украинцев, [доверяющих](https://www.kiis.com.ua/?lang=ukr&cat=reports&id=1093&page=1) российским СМИ — около 3%. В то же время [доверие](https://www.kiis.com.ua/?lang=ukr&cat=reports&id=1093&page=1) украинцев к собственной армии – 70%. И прямо сейчас на улицах украинских городов — [очереди](https://www.instagram.com/p/CacaomvgY--/) на запись в добровольческие части.\n\nУкраинок и украинцев представляют действующие президент и парламент. Действующий президент получил значительную долю голосов даже в Донецкой и Луганской области. В первом туре выборов в 2019 году Зеленский получил больше 20% голосов в этих областях, слегка уступив Порошенко. Во втором туре он обошел Порошенко и победил. Сейчас эти органы украинской власти призывают к миру и переговорам. Источники же призывов о спасении извне неизвестны. Заметим, сам Кремль не приводит никаких доводов в пользу нелегитимности действующей власти: ни свидетельств об уничтожении политической конкуренции, ни данных о фальсификации выборов. Вместо этого Путин просто **сам** [считает](https://t.me/novaya_pishet/36383), что они нелегитимны, так как являются «шайкой наркоманов и неонацистов». **Кому мы должны доверять суждения о легитимности украинской власти — Путину или гражданкам и гражданам Украины?**\n\nИ даже если мы представим, что существует меньшинство, нуждающееся в срочной и *внешней* помощи, то логичнее их вывезти, а не развязать войну на всей территории страны.\n\n## 9. «Путин просто защищает Россию от НАТО»\n\nЭто подмена понятий. Почему тогда Путин нападает на Украину, а не на сами страны НАТО? Украина не входит в их число. Идея, что ради «защиты от НАТО» можно нападать на Украину, опирается на представление, будто Украина — продолжение России, лишь разменная территория в противостоянии империй. Эта позиция бесчеловечна по отношению к жителям Украины.\n\nЛидер, который бы хотел двигать планету к миру и демилитаризации, в первую очередь отказался бы от утверждений, будто суверенитет соседних стран — историческая ошибка. Но Путин — например, в телеобращении 21.02.22 — делал ровно противоположное. Как империалистической риторикой, так и нападением на Украину Путин только укрепляет военные лобби в других странах. Это лишь способствует повышению военных расходов других стран и отдаляет весь мир от всесторонней демилитаризации.\n\nНаконец, даже некоторые российские генералы, как [пишет](https://www.opendemocracy.net/ru/voyna-rossii-protiv-nezavisimosti-ukrainy-lyuboy-tsenoy/) Григорий Юдин, говорили о том, что сейчас перед Россией не стоит риск военной угрозы со стороны НАТО.\n\n## 10. «Путин защищает Россию от ядерной угрозы со стороны Украины»\n\n[Будапештский меморандум](https://ru.wikisource.org/wiki/%D0%9C%D0%B5%D0%BC%D0%BE%D1%80%D0%B0%D0%BD%D0%B4%D1%83%D0%BC_%D0%BE_%D0%B3%D0%B0%D1%80%D0%B0%D0%BD%D1%82%D0%B8%D1%8F%D1%85_%D0%B1%D0%B5%D0%B7%D0%BE%D0%BF%D0%B0%D1%81%D0%BD%D0%BE%D1%81%D1%82%D0%B8_%D0%B2_%D1%81%D0%B2%D1%8F%D0%B7%D0%B8_%D1%81_%D0%BF%D1%80%D0%B8%D1%81%D0%BE%D0%B5%D0%B4%D0%B8%D0%BD%D0%B5%D0%BD%D0%B8%D0%B5%D0%BC_%D0%A3%D0%BA%D1%80%D0%B0%D0%B8%D0%BD%D1%8B_%D0%BA_%D0%94%D0%BE%D0%B3%D0%BE%D0%B2%D0%BE%D1%80%D1%83_%D0%BE_%D0%BD%D0%B5%D1%80%D0%B0%D1%81%D0%BF%D1%80%D0%BE%D1%81%D1%82%D1%80%D0%B0%D0%BD%D0%B5%D0%BD%D0%B8%D0%B8_%D1%8F%D0%B4%D0%B5%D1%80%D0%BD%D0%BE%D0%B3%D0%BE_%D0%BE%D1%80%D1%83%D0%B6%D0%B8%D1%8F) от 1994 года обязывает подписавшиеся страны (включая Россию) «уважать независимость, суверенитет и существующие границы Украины в обмен на ядерное разоружение страны». На сегодняшний день в Украине нет ядерного вооружения. Владимир Зеленский лишь заявил о [возможности](https://www.bbc.com/russian/features-60483270) его появления в феврале этого года. Почему же? Россия **уже** нарушила обещание уважать «существующие границы» Украины, причем еще в 2014, присоединив Крым. (Даже если 2014 год в России не все рассматривают, как такое нарушение, Украина оценивает это именно так 8 лет). И в 2022, признав независимость самопровозглашенных республик. И ведя военные действия на территории Украины — начиная с 2014 года и сейчас. Это значит, что очевидно, невозможно оправдать российское полномасштабное вторжение, происходящее сейчас, нарушением **Украиной** Будапештского меморандума. И лишь сейчас — и лишь в качестве возможности — она заявила, что у нее может появиться ядерное оружие. Винить в этом заявлении мы, граждане России, должны в первую очередь агрессивные действия нашей власти. Напротив, именно нападение на целую страну, как это уже было в истории мировых войн, толкает мировое сообщество к тому, чтобы вступить в конфликт на одной из сторон, и тем самым **увеличивает** риск применения ядерного оружия.\n\n## 11. «Надо было ввести войска еще во время Майдана, тогда бы не было настоящей войны»\n\nВойска как раз и были введены. Российские военные [поднимались по тревоге](https://www.rbc.ru/politics/02/10/2014/542c0dcfcbb20f5d06c1d87a) на учения, и оказывались в Крыму и «ЛДНР». Российские военные в «ЛДНР» [снимали](https://ru.crimethinc.com/2022/02/15/voina-i-anarkhisty-pierspiektivy-libiertariiev-v-ukrainie) символику российской армии, как и военные в Крыму. В Псковской области в России [находится](https://www.currenttime.tv/a/29335545.html) кладбище солдат. Все они погибли в 2014 году, с большой вероятностью — на юго-востоке Украины. Уже тогда следовало понять: Украина — это не абстрактная территория, на которой только российская армия может навести порядок, а страна, которая при всех, нормальных для любого общества противоречий, будет защищаться и видеть в российской армии не порядок, а инструмент подчинения Российской власти.\n\nНо главное — война не происходит сама собой. Решение о текущем нападении принял конкретный человек — который мог этого не делать, если бы захотел.\n\n## 12. «Может Путин и не прав, но нельзя желать своей армии поражения»\n\nКак наследники страны, победившей фашизм, мы видим патриотизм в защите достоинства нашей родины, а не в формальном следовании правилам офицерской чести. Чтобы сохранить наше человеческое достоинство, мы должны **не допустить военных преступлений и убийств как солдат, так и мирного населения страны, которая нам не угрожает.** Не тратить силы на солидарность с армией, наступающей на защищающих свою страну людей, а немедленно работать над созданием антивоенного движения для отвода войск из Украины — вот самый прямой путь избежать поражения. Участие в таких решениях определяет гражданскую свободу и смысл жизни человека.\n\n## 13. «Украина запрещает русским говорить по-русски»\n\nВ первую очередь стоит сказать, что невозможно оправдать захват страны несогласием с ее внутренней языковой политикой.\n\nСогласно последним опросам, русский язык использует заметная часть населения: например, в [2020](https://hromadske.ua/posts/ridnoyu-ukrayinsku-movu-vvazhayut-73-ukrayinciv-odnak-spilkuyutsya-neyu-lishe-53-doslidzhennya) году в Киеве русский язык использовали в интернете чаще украинского. Две трети украинцев говорят о необходимости продолжать текущую языковую политику (см. [закон](https://www.dw.com/ru/%D1%80%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9-%D1%8F%D0%B7%D1%8B%D0%BA-%D0%B2-%D1%83%D0%BA%D1%80%D0%B0%D0%B8%D0%BD%D0%B5-%D1%87%D1%82%D0%BE-%D0%BC%D0%B5%D0%BD%D1%8F%D0%B5%D1%82%D1%81%D1%8F-%D0%BF%D0%BE%D1%81%D0%BB%D0%B5-%D0%B2%D1%81%D1%82%D1%83%D0%BF%D0%BB%D0%B5%D0%BD%D0%B8%D1%8F-%D0%B2-%D1%81%D0%B8%D0%BB%D1%83-%D0%B7%D0%B0%D0%BA%D0%BE%D0%BD%D0%B0-%D0%BE-%D0%B3%D0%BE%D1%81%D1%8F%D0%B7%D1%8B%D0%BA%D0%B5/a-48484766) о государственном языке), 20% — не соглашаются с ними. Мы — не полицейские и не менторы для украинского гражданского общества. **Мы должны априори доверять самим жительницам и жителям Украины трансформацию своей судьбы демократическим путем**, включая дальнейшую языковую политику. Доверять им такой ее выбор, который сможет устраивать разные регионы и группы.\n\nЗато **мы точно можем помешать спокойному демократическому выбору, если сделаем так, чтобы русский язык *автоматически* ассоциировался с языком агрессоров и оккупантов.**\n\n## 14. «А как же сожженный Дом Профсоюзов в Одессе — они же так со всеми русскими будут поступать?»\n\nМиссия Управления ООН по правам человека — ее представители непосредственно наблюдали за событиями — [сообщает](https://ukraine.un.org/en/126054-7-years-no-answers-what-lacking-investigations-events-odesa-2-may-2014), что детальное расследование инцидента продолжается. Известно, что обе стороны были вооружены и проявляли жестокость, первыми бросать коктейли Молотова начали противники Майдана — те, кто [посчитал](https://ru.wikipedia.org/wiki/%D0%9F%D1%80%D0%BE%D1%82%D0%B5%D1%81%D1%82%D1%8B_%D0%BD%D0%B0_%D0%AE%D0%B3%D0%BE-%D0%92%D0%BE%D1%81%D1%82%D0%BE%D0%BA%D0%B5_%D0%A3%D0%BA%D1%80%D0%B0%D0%B8%D0%BD%D1%8B_(2014)), что события на Майдане приведут к ущемлению интересов жительниц и жителей Юго-Востока Украины.\n\nПротивостоящая им группа дала ожесточенный отпор, вынудила укрыться в Доме Профсоюзов. Коктейли Молотова и стрельба продолжали применяться обеими сторонами, здание загорелось, в ходе пожара забаррикадировавшиеся люди погибли.\n\nЗдесь мы можем лишь повторить нашу общую позицию. **Мы, жители России, не полицейские и не менторы для украинского гражданского общества.** Мы должны априори доверять самим жительницам и жителям Украины трансформацию своей судьбы, включая разрешение внутренних конфликтов, которые возможны в любой стране и фактически могут носить самый разный характер. Не до конца расследованный частный случай противостояния вооруженных групп, ни одна из которых не являлась избранными представителями всего народа Украины, не может быть серьезным аргументом для обсуждения тотальной угрозы.\n\nПервая помощь в таком трансформационном процессе — это не мешать. Мы как граждане России должны задать себе вопрос: мы хотим создавать новые поводы для ненависти как к себе (чем очевидно сейчас занимается Путин, напав на Украину) или нет? Хотим ли мы провоцировать своими действиями недоверие и вражду между жителями разных частей Украины или нет? То, что **мы можем сделать прямо сейчас для внутреннего мира — это показать всеми силами, что граждане России не желают использования внутренних противоречий для захвата власти над какой-либо частью страны.**\n\nНапротив, российская власть просто цинично использует упоминания о трагедии в Доме Профсоюзов, чтобы привлечь на свою сторону людей, которые знают и помнят о ней, в то время как в числе настоящих и главных причин войны раз за разом упоминает «риски для существования России», которые создала Украина.\n\n## 15. «Меня это не касается — и своих проблем достаточно»\n\nМинобороны РФ по-прежнему не рассказывает о потерях, но Минобороны Украины заявляет о тысячах убитых военнослужащих из РФ. Минобороны Украины делится информацией об убитых, пленных и раненых (с фото и паспортными данными) для того, чтобы о них могли узнать родственники, не понимающие, где их сыновья, мужья и братья. Очень многие на этой войне — не профессиональные солдаты, а срочники. Еще несколько дней назад они могли не подозревать, что окажутся на войне. Российское командование несколько дней подряд пытается взять Киев почти любой ценой, а Путин хочет вести переговоры с сильной позиции. Если это не остановить сейчас, заплатить за такую решимость придется переброской новых солдат. Наших знакомых и родственников, непосредственно оказавшихся на войне, будет становиться все больше и больше.\n\nРоссия — часть мировой экономики. Чем глубже наш режим затягивает Россию в войну, тем серьезнее будут становится санкции, ведь иностранные государства готовы использовать только такие (т.е. невоенные) методы для того, чтобы вынудить Путина прекратить войну. Обвал рубля резко поднимет цены на все товары в стране, и так растущие последние месяцы. Перестройка экономики на ведение войны будет означать конец всем надеждам обычных людей на построение своей собственной мирной жизни — в науке, индустрии, сельском хозяйстве, искусстве.\n\nИ именно как обычные люди мы будем десятилетиями встречаться с простыми украинцами — в России, в Украине, в интернете, по всему миру. И чувствовать их недоверие и вражду к нам просто потому, что мы из России. Выражая нашу позицию сегодня, мы и поддерживаем украинцев, и спасаем наши отношения с ними на годы вперед. **Украинки и украинцы будут знать не просто, что войну развязал Путин, а не обычные россияне, но и то, что когда это случилось, нам было не все равно.** Только тогда у нас будет шанс уважать себя.\n\n## 16. «Разве наше мнение на что-то может повлиять?»\n\nИменно простые граждане — инструмент, используемый для оправдания войны. Путин говорит, что рассчитывает на [«консолидированную патриотическую позицию»](https://zona.media/online/2022/02/24/war#43504), а Песков — что правительство должно [«лучше объяснять свою позицию»](https://www.interfax.ru/russia/824508), когда кто-то не согласен. Молчание создает видимость поддержки, которой правительство легитимизирует войну. Только активный протест может это изменить. На утро второго дня войны Владимир Зеленский [обратился](https://fb.watch/bpWC2rDLNy/) к российским гражданам, вышедшим вечером 24 февраля на протесты: **«Мы вас видим. Это значит, что вы нас услышали. Это значит, вы нам начинаете верить. Боритесь за нас, боритесь против войны».** Таким образом, выходя на протесты мы показываем свою поддержку украинцам и украинкам, и тем самым укрепляем их силы.\n\n(Не)молчание влияет и на армию. Путин и руководство страны не могут изложить одной, четкой и *краткой* причины, по которой начата война. Когда тебе отчаянно сопротивляется противник, когда ты наступаешь на чужой территории, и вдобавок не знаешь, за что воюешь, то долго воевать гораздо сложнее. Если добавить к этому осуждение войны в родных городах, то солдаты и офицеры могут все больше начать сомневаться, а их рвение может начать ослабевать.\n\n## 17. «Выходить на улицы бесполезно. Всех разгонят и пересажают. У беларусов не получилось.\n\nПри несомненной угрозе со стороны силовиков, регулярные и массовые мирные уличные демонстрации являются необходимым рычагом давления на систему. Относительно безопасной формой протеста, также способствующей гласности, является [акция](https://www.instagram.com/p/CaRmKvuM57L/) #тихийпикет. Участницы и участники делают повседневные дела в городе с видимыми антивоенными нашивками на сумках или одежде. Это привлекает к войне внимание окружающих, которые могут присоединиться к протесту.\n\nОднако уличные протесты — не единственная возможная тактика. Символическое попадание в машину репрессий — не всегда лучшее политическое действие. Как напоминают активисты, масштабнейшие акции протеста не остановили войну в Ираке. Есть и [другие](https://www.instagram.com/p/Cab0D_OsrtI/) тактики сопротивления войне: как открытые забастовки (право на забастовку защищено ст. 37 Конституции), так и просто взятие больничного, что ещё легче делать сейчас, во время пандемии (сейчас достаточно заявить о симптомах ОРВИ и уйти на больничный на 7 дней). Даже распространяя критические вопросы можно создать напряжение — и повысить цену военной агрессии. Стоит присоединиться к почти 1 000 000 подписавших [петицию](https://www.change.org/NetVoyne) — это поможет в распространении информации.\n\nУ беларусов мирный протест столкнулся с жестокой силовой реакцией и был задавлен. Однако не стоит забывать, что это произошло при активной поддержке Путина. В России же при массовых протестах по всей стране ресурсы на поддержку силовиков быстро закончатся. У Лукашенко был Путин, своего собственного Путина у Путина нет. Часть сил ОМОНа и Росгвардии переброшены на войну. У режима нет бесконечных ресурсов для подавления по-настоящему массового антивоенного движения.\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/lushios/anti-war-handbook",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "anti-war-handbook-package",
    "package_url": "https://pypi.org/project/anti-war-handbook-package/",
    "platform": "",
    "project_url": "https://pypi.org/project/anti-war-handbook-package/",
    "project_urls": {
      "Bug Tracker": "https://github.com/lushios/anti-war-handbook/issues",
      "Homepage": "https://github.com/lushios/anti-war-handbook"
    },
    "release_url": "https://pypi.org/project/anti-war-handbook-package/0.0.1/",
    "requires_dist": null,
    "requires_python": ">=3.6",
    "summary": "anti war handbook",
    "version": "0.0.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 13047600,
  "releases": {
    "0.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8e9a685944b2e03aced7ea8d221db119af2fb81b4a8ac5ca4babf7e611b205d1",
          "md5": "68b983a06179161f9053053e2ca68c88",
          "sha256": "12b9d2eff28fcde2bae5c29824019b23c8809c6ad7b381fa854e3830ce90575e"
        },
        "downloads": -1,
        "filename": "anti_war_handbook_package-0.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "68b983a06179161f9053053e2ca68c88",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 19145,
        "upload_time": "2022-03-01T16:58:16",
        "upload_time_iso_8601": "2022-03-01T16:58:16.314477Z",
        "url": "https://files.pythonhosted.org/packages/8e/9a/685944b2e03aced7ea8d221db119af2fb81b4a8ac5ca4babf7e611b205d1/anti_war_handbook_package-0.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "19f1756a26fd64da7fd34c7d0d64024809bddbf433bb21ac23260921e97a6964",
          "md5": "2b8c37357888105bd0a2802c8e5a5105",
          "sha256": "2519f69f4daac6d29b306c4899204776177d6a575cc5c0e7395310f09401be71"
        },
        "downloads": -1,
        "filename": "anti-war-handbook-package-0.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "2b8c37357888105bd0a2802c8e5a5105",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 49612,
        "upload_time": "2022-03-01T16:58:18",
        "upload_time_iso_8601": "2022-03-01T16:58:18.790172Z",
        "url": "https://files.pythonhosted.org/packages/19/f1/756a26fd64da7fd34c7d0d64024809bddbf433bb21ac23260921e97a6964/anti-war-handbook-package-0.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "8e9a685944b2e03aced7ea8d221db119af2fb81b4a8ac5ca4babf7e611b205d1",
        "md5": "68b983a06179161f9053053e2ca68c88",
        "sha256": "12b9d2eff28fcde2bae5c29824019b23c8809c6ad7b381fa854e3830ce90575e"
      },
      "downloads": -1,
      "filename": "anti_war_handbook_package-0.0.1-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "68b983a06179161f9053053e2ca68c88",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6",
      "size": 19145,
      "upload_time": "2022-03-01T16:58:16",
      "upload_time_iso_8601": "2022-03-01T16:58:16.314477Z",
      "url": "https://files.pythonhosted.org/packages/8e/9a/685944b2e03aced7ea8d221db119af2fb81b4a8ac5ca4babf7e611b205d1/anti_war_handbook_package-0.0.1-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "19f1756a26fd64da7fd34c7d0d64024809bddbf433bb21ac23260921e97a6964",
        "md5": "2b8c37357888105bd0a2802c8e5a5105",
        "sha256": "2519f69f4daac6d29b306c4899204776177d6a575cc5c0e7395310f09401be71"
      },
      "downloads": -1,
      "filename": "anti-war-handbook-package-0.0.1.tar.gz",
      "has_sig": false,
      "md5_digest": "2b8c37357888105bd0a2802c8e5a5105",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 49612,
      "upload_time": "2022-03-01T16:58:18",
      "upload_time_iso_8601": "2022-03-01T16:58:18.790172Z",
      "url": "https://files.pythonhosted.org/packages/19/f1/756a26fd64da7fd34c7d0d64024809bddbf433bb21ac23260921e97a6964/anti-war-handbook-package-0.0.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}