{
  "info": {
    "author": "Thomas Amore Jr.",
    "author_email": "",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 4 - Beta",
      "Intended Audience :: Developers",
      "Intended Audience :: Education",
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.10",
      "Programming Language :: Python :: 3.6",
      "Programming Language :: Python :: 3.7",
      "Programming Language :: Python :: 3.8",
      "Programming Language :: Python :: 3.9",
      "Topic :: Games/Entertainment",
      "Topic :: Games/Entertainment :: Board Games",
      "Topic :: Games/Entertainment :: Simulation"
    ],
    "description": "# AnyDeck Python Library\n___\n#### Author: Thomas Amore Jr\n#### License: MIT\n___\n## Purpose:\nGenerates a deck of virtually any type of cards from which drawing, adding, removing, and \nshuffling is handled by the deck object. Useful for the creation of a game or application \nthat uses any deck of cards which must be created and tracked through the game play.\n___\n## Installation:\n\t    pip install AnyDeck\n___\n## Usage:\n### Definitions:\n\n* **Special Cards**: One off cards that are added to the parent deck\n* **Wild Cards**: Added to the end of each child deck\n* **Child Deck**: An individual deck of regular and wild cards\n* **Parent Deck**: The all encompassing deck that you will ultimately interact with. Includes all child decks and special cards\n\t\t\t\t   \n### Order of Card Insertion at Deck Creation:\n1. Retained, unused, cards\n2. Special Cards\n3. Regular Cards\n4. Wild Cards\n\n### Deck Creation:\nThe simplest implementation is to simply call the library. With this call you will have a standard deck of 52 cards in a list of 'Card' objects referred to as the 'deck'.\n\n``` python\n    cards = AnyDeck()\n```\nNow let's take a look at the deck...\n``` python\n    for card in cards.deck:\n        print(f'{card.face} of {card.suit}')\n```\n\t\t\nNotice that the cards are not shuffled. Shuffling can be handled in two ways.\n\n* During initiation of the deck\n\n``` python\n    cards = AnyDeck(shuffled=True)\n```\n* At any time\n``` python\n    cards.shuffle()\n```\n\nInstead of using the default cards you can get a _custom deck_ of regular cards by passing arguments.\n\nFor example:\n\n1. Create a deck of cards for the faces listed in 'cards'. A card will be created for each card in each suit provided. \nIn this case a deck will be created with 8 cards, all with the suit of 'Tarot'\n\n``` python\n    cards = AnyDeck(suits='Tarot',\n                    cards=('Strength', 'The Moon', 'Justice', 'The Hermit', 'The Fool', \n                    'The Sun', 'The Tower', 'Temperance'))\n```\n\n2. Create a set of multiple decks of regular cards added into one parent deck. The following will yield a deck of 96 \ncards numbered 1 to 12 for each suit provided for the number of decks provided.\n``` python\n    cards.new_deck(decks=2,\n                   suits=('Red', 'Blue', 'Yellow', 'Green'),\n                   cards=('1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12'))\n```\n3. Let's do that again but with some wild cards. This time each child deck contains a 'wild' card with a face of 'Skip'.\n       This results in a deck of 98 cards. The same as before but with two skips cards (one for each child deck).\n``` python\n    cards.new_deck(decks=2,\n                   suits=('Red', 'Blue', 'Yellow', 'Green'),\n                   cards=('1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12'),\n                   wilds='Skip')\n```\n4. Let's add a total of 4 'Skip' cards and 8 'Joker' cards to the original deck. In this case we will utilize the \n'retain' argument of the new_deck method.\n\n   * First, we create the base deck of 96 cards:\n        ``` python\n            cards.new_deck(decks=2,\n                           suits=('Red', 'Blue', 'Yellow', 'Green'),\n                           cards=('1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12')) \n        ```\n\n   * Now we can add the 'Skip' cards by retaining the original deck and adding the new deck into it by creating\n   four child decks with a face of 'Skip' and a suit of 'Wild'. Since we passed the suits and cards arguments the \n   default cards will not be generated. When the new_deck is generated it will retain the cards created from the \n   first deck due to the retain flag being True.\n        ``` python\n            cards.new_deck(decks=4,\n                           retain_unused = True,\n                           suits='Wild',\n                           cards='Skip')  \n        ```\n   \n   * Finally, to add the eight jokers we do the same thing again. This time though we will simply override the \n   adding of the default cards so that we can make a deck of eight children decks (each consisting of a single card) \n   and again using the retained deck to keep all the already generated cards.\n        ``` python\n            cards.new_deck(decks=8\n                           retain_unused = True,\n                           wilds='Joker',\n                           override_defaults=True)\n        ```\n   * Notice that what we did was first create a deck of 96 standard cards, and then a deck of 4 'Skip' cards, \n   and finally a deck of 8 'Joker' cards. Using retain we kept the cards from each deck as a new deck was added,\n   so we end up with a deck of 108 cards. This is the same as....\n        ``` python\n               cards.new_deck(decks=2,\n                              suits=['Red', 'Blue', 'Yellow', 'Green'],\n                              cards=['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12'],\n                              wilds=['Skip', 'Skip', 'Joker', 'Joker', 'Joker, 'Joker'])\n        ```\n\n      ....since each child deck gets one of each wild card provided to the argument. Thus, each child deck \n   would have 2 Skip and 4 Joker cards. With that we would end up with the same 108 cards only in a slightly \n   different order (see 'Order of card insertion at deck creation')\n\n\n5. \"Special Cards\" are passed as Card objects and are added to the top of the deck regardless of the amount of \nchild decks added. In this example a special card with just the face value of \"Old Maid\" is created and then \npassed to the new_deck method. This example will create the special card and then two decks of regular cards that \nwere added by face.\n``` pythonls\n    old_maid_card = Card(face=\"Old Maid\")\n\n    cards.new_deck(decks=2,\n                   cards=('Alto Annie', 'Slap on Sam', 'Billy Blaze', 'Heap Big Talk', 'Clancy Clown', 'Crazy Cop',\n                          'Loggin Larry', 'Greenthumb Gert', 'Diver Dan', 'Freddie Falloff', 'Baker Benny',\n                          'Tumbledown Tess', 'Hayseed Hank', 'Postman Pete', 'Fifi Fluff', 'Bagpipe Barney',\n                          'Milkman Mo', 'Careless Carrie'),\n                   special_cards=old_maid_card)\n```\n### Drawing Cards:\nThere are two main ways to draw cards.\n\n1. A single card draw is done simply with:\n```python\n   card = cards.draw()\n```\n* This will return a single card object from the top of the deck. See the method arguments for more information of \nwhere in the deck the card should come from.\n\n\n2. Multiple complete hands can be drawn at once with a single statement. The amount of cards in the hand is required. In\nthis case the hand size is 5 cards.\n```python\n   card = cards.draw_hand(5)\n```\n* A call to this method will return a list containing lists of cards. Further arguments can produce more than one \nhand, choose to alternate the dealing of the cards, and handle situations where the deck has run out. Refer to the\nClasses and Methods section.\n\n### Replacing Used Cards:\nAt any time, the cards which have already been drawn can be returned to the bottom of the deck with:\n```python\n   cards.replace_used_cards()\n```\n\nThe default behavior is not to shuffle the cards but to simply place them back into the deck. An argument can be\npassed to shuffle the used pile before putting the cards on the bottom as well as shuffling the entire deck after\nreplacing the used cards. Refer to the Classes and Methods section.\n\n### Replacing card values from a dictionary:\nCard values can be set by referring  to a dictionary passed to the dict_to_value method. A dictionary with keys equal \nto the face of the cards and values equal to the int value of the card is required.\n```python\n   community_chest_cards = AnyDeck()\n\n   community_chest_dict = {'You Inherit $100': 100,\n                           'Doctor\\'s Fee Pay $50': -50,\n                           'Get Out of Jail Free': 0}\n\n   community_chest_cards.new_deck(suits='Community Chest',\n                                  cards=[card for card in community_chest_dict])\n\n   community_chest_cards.dict_to_value(community_chest_dict)\n```\nThe above uses a comprehension to create the list of cards to be created in the new deck. Next the dict_to_value\nmethod is called with the dictionary which will set the cards to the values listed in the dictionary.\n\n\n## Class - Card:\n### Attributes:\n\n* **face:** (str) The human readable text of a card (ie: \"2\" or \"Ace\") (Default - None)\n* **suit:** (str) The human readable text of a card suit (ie: \"Spades\" or \"Red\") (Default - None)\n* **value:** (int) Value assigned to card (Default - 0)\n* **suit_id:** (int) Key sequentially assigned to suits as they are added to a deck (Default - 0)\n* **suit_order_num:** (int) The order of the card in the suit it belongs to (Default - 0)\n* **child_order_num:** (int) The order of the card in the child deck (Default - None)\n* **unique_card_num:** (int) Unique number assigned to each card as they are added to the deck (Default - None)\n* **child_deck_num:** (int) The sequence number of the child deck (Default - None)\n\n## Class - AnyDeck:\n### **Attributes:**\n\n* **total_cards:** (int) Returns the amount of cards which encompass the entire deck at creation\n* **remaining_cards:** (int) Returns the amount of cards remaining in the deck\n* **deck_info:** (dict) Returns a dictionary with information about the total deck\n\n### Methods:\n### AnyDeck():\nDuring the initialization of the library the arguments are passed to the new_deck function. If the library is \ncalled without cards and suits then a default deck will be generated which includes a standard deck of US playing cards.\n    \n**Arguments:**\n\n                    decks:  (int) The number of duplicate decks to compile into the parent deck (Default - 1)\n                 shuffled: (bool) Should the deck be shuffled (Default - False)\n                    wilds: (list) Strings in the list will be added as 'face' to wild cards (Default - None)\n                            (str) String will be added as 'face' to the wild card (Default - None)\n                            (int) Will create int number of wild cards with the 'face' of 'Wild' (Default - None)\n                    suits: (list) Strings in the list will be added as suits in the regular deck (Default - None)\n                            (str) String will be added as the only suit in the regular deck (Default - None)\n                    cards: (list) Strings in the list will be added as cards in the regular deck (Default - None)\n                            (str) String will be added as the only card in the regular deck (Default - None)\n            special_cards: (Card) One off special cards to be added to the parent deck\n        override_defaults: (bool) Allows you to override adding the default cards and suits so that only\n                                  special or wild cards are added to the deck without any regular cards. (Default - False)\n\n### new_deck():\nCreates a new deck of cards from the provided arguments. If no cards and no suits are provided then a default deck\nof 2 through 10, Jack, Queen, King and Ave is generated. Wild and special cards can be added to a default deck. If\nyou instead need a deck with no regular cards you can call 'override_defaults'. The retain arguments will allow for\nkeeping cards between cards to new_deck. Used cards are cards which have already been drawn from the deck. Retaining\nused cards will simply maintain the used pile. Unused cards are cards which are still in the deck when new_deck is\ncalled. Retaining unused cards are kept at the top of the deck and any new cards are added to the bottom of the unused\ncards. Note that wild cards are added with a default suit of 'Wild' and a value of 0.\n\n**Arguments:**\n\n                decks:  (int) The number of duplicate decks to compile into the parent deck (DEFAULT = 1)\n             shuffled: (bool) Should the deck be shuffled (DEFAULT = False)\n                wilds: (list) Strings in the list will be added as 'face' to wild cards (DEFAULT = None)\n                        (str) String will be added as 'face' to the wild card (DEFAULT = None)\n                        (int) Will create int number os wild cards with the 'face' of 'Wild' (DEFAULT = None)\n                suits: (list) Strings in the list will be added as suits in the regular deck (DEFAULT = None)\n                        (str) String will be added as the only suit in the regular deck (DEFAULT = None)\n                cards: (list) Strings in the list will be added as cards in the regular deck (DEFAULT = None)\n                        (str) String will be added as the only card in the regular deck (DEFAULT = None)\n        special_cards: (Card) One off special cards to be added to the parent deck\n    override_defaults: (bool) Allows you to override adding the default cards and suits so that only\n                              special or wild cards are added to the deck without any regular cards. (DEFAULT = False)\n        retain_unused:\n          retain_used:\n**Returns:**\n\n\t\tNothing\n---\n### draw():\nReturns a Card object from the deck from the argument provided position. When a card is drawn it is added to the internal\n'used_cards' list. At the application level the card does not have to be returned to be considered 'used'.\n\n**Arguments:**\n\n\t\tposition: (int) Returns card from the index position of the currently unused deck\n                      (str) Returns card from named position (DEFAULT = 'top')\n                            ('random') Returns card from a random position of the currently unused deck\n                            ('top') Returns card from the top of the unused deck\n                            ('bottom') Returns card from the bottom of the unused deck\n                            ('middle) Returns card from the middle of the unused deck\n\n**Returns**:\t\n\t\t\n\t\tNothing\n---\n### draw_hand():\nDraws multiple cards into individual hands based on the arguments provided. Arguments will allow an alternating\ndrawn where each hand is given a card in turn as opposed to each hand being given all cards before moving on\nto the next hand. Should the unused deck run out of cards the refill argument can be set to add the used cards back into\nthe active deck to continue dealing the required number of cards upon unused completion. Further, with refill set,\na new deck will be created that was identical to the original deck and dealing will continue should all cards be\ndrawn. Should refill be set to false then the cards will be drawn until the used cards are depleted and the returned\nlist will have only the cards left in order of the other arguments.\n\n**Arguments**:\n\n             cards:   (int)  REQUIRED: number of cards requested for each hand\n             hands:   (int)  Number of hands requested (DEFAULT = 1)\n       alternating:  (bool)  (DEFAULT = True)\n                     (True)  Draws cards through alternating hands before beginning  the first deck again\n                    (False)  Draws all cards to a hand before moving on to subsequent hands\n            refill:  (bool)  (DEFAULT = True)\n                             (True) Refill the deck if there are not enough cards to complete the draw\n                             (False) Returns the list up until that last available card\n\n**Returns:**\t\n\t\t\n\t\tList of Lists of Cards\n---\n### add_card():\nAdd a Card object to the deck from the argument provided position.\n\n**Arguments:**\n\n            card: (Card) REQUIRED: Card object to be added\n        position:  (int) Add card to the index position of the currently unused deck\n                   (str) (DEFAULT = 'bottom')\n                         ('random') Add card to a random position of the currently unused deck\n                         ('top') Add card to the top of the unused deck\n                         ('bottom') Add card to the bottom of the unused deck\n                         ('middle) Add card to the middle of the unused deck\n\n**Returns:**\n\t\t\n\t\tNothing\n---\n### shuffle():\nShuffles the unused cards in the deck\n\n**Arguments:**\n\t\t\n\t\tNone\n\n**Returns:**\t\n\n\t\tNothing\n---\n### replace_used_cards():\nPuts the used cards back into the bottom of the active deck.\n\n**Arguments:**\n\n        shuffle_used: (bool) Shuffles the used cards before putting the back into the deck. Calling this\n                             will also clear the list of used cards. (DEFAULT = False)\n\t\t shuffle: (bool) Shuffles the new deck which now includes the used and unused cards. (DEFAULT = False)\n\n**Returns:**\t\n\n\t\tNothing\n---\n### dict_to_value():\nTake a dictionary of face:int value. The unused deck is looped through and if the face key is found to\nmatch the face of a card the value is updated for that card.\n\n**Arguments:** \n\n        value_dict: (dict) Dictionary of key/values to update the int value of a card\n\n**Returns:**\n\n\t \tNothing\n---\n### get_deck_info():\nReturns a dictionary containing the 'child_decks', 'suits', 'cards', 'wilds', 'special_cards' and\n'total_cards' of the current deck.\n\n**Arguments:**\n\t\t\n\t\tNone\n\n**Returns:**\t\n\n\t\tdict\n---\n### clear_values():\nSets the integer value of all unused cards to 'None'\n\n**Arguments:**\n\t\t\n\t\tNone\n\n**Returns:**\t\n\n\t\tNothing\n---\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/tomamore/anydeck",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "AnyDeck",
    "package_url": "https://pypi.org/project/AnyDeck/",
    "platform": null,
    "project_url": "https://pypi.org/project/AnyDeck/",
    "project_urls": {
      "Bug Tracker": "https://github.com/tomamore/anydeck/issues",
      "Homepage": "https://github.com/tomamore/anydeck"
    },
    "release_url": "https://pypi.org/project/AnyDeck/0.1.8/",
    "requires_dist": null,
    "requires_python": ">=3.6",
    "summary": "Generates a deck of virtually any type of cards from which drawing, adding, removing, and shuffling is handled by the module.",
    "version": "0.1.8",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 13158847,
  "releases": {
    "0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e846f6947207d7c8f0a48fb1adce5c495c4d46d45c7e8ad24c1a511c1244d08b",
          "md5": "af6a530d3f0a879922ca548add6c9f45",
          "sha256": "ab75d417af7030b9c86ad4a9f6cd201a61fe49acf5c58e80bee7d9d2ba607476"
        },
        "downloads": -1,
        "filename": "anydeck-0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "af6a530d3f0a879922ca548add6c9f45",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 10123,
        "upload_time": "2022-03-12T18:20:29",
        "upload_time_iso_8601": "2022-03-12T18:20:29.993212Z",
        "url": "https://files.pythonhosted.org/packages/e8/46/f6947207d7c8f0a48fb1adce5c495c4d46d45c7e8ad24c1a511c1244d08b/anydeck-0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c0e115b706f306575a859a23f29acf382334eeb037a34642ec85774dbd30b695",
          "md5": "a29833ba7d7679e2043ae8c65fca8522",
          "sha256": "eb730db284ec578c1e6bbc9a610900d335064a6cd9308323faaee007c66736d7"
        },
        "downloads": -1,
        "filename": "anydeck-0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "a29833ba7d7679e2043ae8c65fca8522",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 14923,
        "upload_time": "2022-03-12T18:20:31",
        "upload_time_iso_8601": "2022-03-12T18:20:31.825642Z",
        "url": "https://files.pythonhosted.org/packages/c0/e1/15b706f306575a859a23f29acf382334eeb037a34642ec85774dbd30b695/anydeck-0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a5b6175c900d419575029abe51b06644fa5e53b2690d72629fcba4d43085193d",
          "md5": "ada78b88475b5d0e2cdb9d1e6b004609",
          "sha256": "9a5ce5e6ac36806b1176fc3068a219db4d5f1df1fd3f56ca6aae5d41cc141ea0"
        },
        "downloads": -1,
        "filename": "anydeck-0.1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "ada78b88475b5d0e2cdb9d1e6b004609",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 7464,
        "upload_time": "2022-03-12T18:31:56",
        "upload_time_iso_8601": "2022-03-12T18:31:56.759642Z",
        "url": "https://files.pythonhosted.org/packages/a5/b6/175c900d419575029abe51b06644fa5e53b2690d72629fcba4d43085193d/anydeck-0.1.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f8aa1d0cc26d1acc050453d5bcd981ac10168ad83f19d36b5db0f946851cc9f9",
          "md5": "5f95abe30fc74cf72d97b02350e8384c",
          "sha256": "48588f613264230a3aba7d315d9553d3ae8c474bce8c5a0de9cff8c2db7294de"
        },
        "downloads": -1,
        "filename": "anydeck-0.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "5f95abe30fc74cf72d97b02350e8384c",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 8103,
        "upload_time": "2022-03-12T18:31:58",
        "upload_time_iso_8601": "2022-03-12T18:31:58.141790Z",
        "url": "https://files.pythonhosted.org/packages/f8/aa/1d0cc26d1acc050453d5bcd981ac10168ad83f19d36b5db0f946851cc9f9/anydeck-0.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ba1bee7d17b46aecddeb5ca77b8f4cffbb93d8f790badcaee1a06760487f91e4",
          "md5": "ec4b214cc4ec1619a89602516746aa08",
          "sha256": "8aeefbd61795aed4be6d46a6651912386e7a5cf1fa835aa389b4d888352ba71a"
        },
        "downloads": -1,
        "filename": "anydeck-0.1.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "ec4b214cc4ec1619a89602516746aa08",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 10144,
        "upload_time": "2022-03-12T18:37:59",
        "upload_time_iso_8601": "2022-03-12T18:37:59.369098Z",
        "url": "https://files.pythonhosted.org/packages/ba/1b/ee7d17b46aecddeb5ca77b8f4cffbb93d8f790badcaee1a06760487f91e4/anydeck-0.1.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f94fb2475a482a0b6ba80ea014771458754cef9b5dc6e4bbcd2bc385c436ee43",
          "md5": "48380d6d0ebae35aab7c16e335da03f4",
          "sha256": "445feb76b7e33f4f10a8ca85cc858ea27e3e6abf8460b93a873940a4926a66f8"
        },
        "downloads": -1,
        "filename": "anydeck-0.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "48380d6d0ebae35aab7c16e335da03f4",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 14927,
        "upload_time": "2022-03-12T18:38:01",
        "upload_time_iso_8601": "2022-03-12T18:38:01.614576Z",
        "url": "https://files.pythonhosted.org/packages/f9/4f/b2475a482a0b6ba80ea014771458754cef9b5dc6e4bbcd2bc385c436ee43/anydeck-0.1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9914c998e7c26e4cd721f205b79ab1e45d95bc84b920798b0c7281425dfbcfef",
          "md5": "30532ecbd27facbd29a62e227a10c138",
          "sha256": "27ac9c0321d2df6963c58134ccecfda31855408ef6196b8e5054e8313a27d960"
        },
        "downloads": -1,
        "filename": "anydeck-0.1.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "30532ecbd27facbd29a62e227a10c138",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 10142,
        "upload_time": "2022-03-12T18:55:53",
        "upload_time_iso_8601": "2022-03-12T18:55:53.688626Z",
        "url": "https://files.pythonhosted.org/packages/99/14/c998e7c26e4cd721f205b79ab1e45d95bc84b920798b0c7281425dfbcfef/anydeck-0.1.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8d058fe13a6309d5a77d198ebcdf058e0d81db635fe66c138b819866afd45512",
          "md5": "2a15b506637580ca9cbfefe419345e40",
          "sha256": "14527d03ac47d688374e921042388db900ad4aca8eda7b4f4ab6892bbab1276f"
        },
        "downloads": -1,
        "filename": "AnyDeck-0.1.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "2a15b506637580ca9cbfefe419345e40",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 10150,
        "upload_time": "2022-03-12T18:59:02",
        "upload_time_iso_8601": "2022-03-12T18:59:02.206597Z",
        "url": "https://files.pythonhosted.org/packages/8d/05/8fe13a6309d5a77d198ebcdf058e0d81db635fe66c138b819866afd45512/AnyDeck-0.1.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8d3fc48fe295c47b87826c20d8a37f36e2236e1e9600f9384154c90b14cf2e51",
          "md5": "d51772476fd3e72e28e56fff9398313b",
          "sha256": "c0c5275b7330589826cbb0ff8eb3a323dccf87f57c0eeb77bbb132f8f9852116"
        },
        "downloads": -1,
        "filename": "anydeck-0.1.3.tar.gz",
        "has_sig": false,
        "md5_digest": "d51772476fd3e72e28e56fff9398313b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 14919,
        "upload_time": "2022-03-12T18:55:56",
        "upload_time_iso_8601": "2022-03-12T18:55:56.811217Z",
        "url": "https://files.pythonhosted.org/packages/8d/3f/c48fe295c47b87826c20d8a37f36e2236e1e9600f9384154c90b14cf2e51/anydeck-0.1.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ec489490c9ad6a400710ae33833e9c79f988cdc98eb078a35b197942356eaab8",
          "md5": "575b77491f56ca84b34001c26b866e37",
          "sha256": "982781a1a9b9c927035199f7ed77a4c67b69be353341f83e0bad11a69b8443ff"
        },
        "downloads": -1,
        "filename": "AnyDeck-0.1.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "575b77491f56ca84b34001c26b866e37",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 10150,
        "upload_time": "2022-03-12T19:00:11",
        "upload_time_iso_8601": "2022-03-12T19:00:11.519645Z",
        "url": "https://files.pythonhosted.org/packages/ec/48/9490c9ad6a400710ae33833e9c79f988cdc98eb078a35b197942356eaab8/AnyDeck-0.1.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "fcbc7326a0149d3bd564212acb00a4c505f9fc36a9dfc4c884cc37c16079edc3",
          "md5": "9eada35299053eac2727b2af274c661f",
          "sha256": "9b0d80a63fc1ea1f6e516dd2ed4bbaa5b71a199fa67d0cce8cfcf4d9ec5744bd"
        },
        "downloads": -1,
        "filename": "AnyDeck-0.1.5-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "9eada35299053eac2727b2af274c661f",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 10190,
        "upload_time": "2022-03-12T19:10:42",
        "upload_time_iso_8601": "2022-03-12T19:10:42.065328Z",
        "url": "https://files.pythonhosted.org/packages/fc/bc/7326a0149d3bd564212acb00a4c505f9fc36a9dfc4c884cc37c16079edc3/AnyDeck-0.1.5-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7b9dd2e9ece26aeb85bd9069184f4024f395ec48cdeb47191c8f79c9c7e28d13",
          "md5": "ed4eade569e830bfc4a7bcf1356baeb0",
          "sha256": "e8d22a157d98e3539cafcb0ed4fd81fc7e14daa29d70a2785e39b16ea8c21c4d"
        },
        "downloads": -1,
        "filename": "AnyDeck-0.1.5.tar.gz",
        "has_sig": false,
        "md5_digest": "ed4eade569e830bfc4a7bcf1356baeb0",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 10421,
        "upload_time": "2022-03-12T19:10:43",
        "upload_time_iso_8601": "2022-03-12T19:10:43.745356Z",
        "url": "https://files.pythonhosted.org/packages/7b/9d/d2e9ece26aeb85bd9069184f4024f395ec48cdeb47191c8f79c9c7e28d13/AnyDeck-0.1.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9233047e31360f7c70944d208b0f2358ed99cc226147fffb8d63535c484096f1",
          "md5": "28385ed89c76f8c15dfc2838fe4e401a",
          "sha256": "b9993ff320ff30c3f684bdd4cc5530c4946a9d810f8318393b1cca2d32e218ba"
        },
        "downloads": -1,
        "filename": "AnyDeck-0.1.6-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "28385ed89c76f8c15dfc2838fe4e401a",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 10188,
        "upload_time": "2022-03-12T19:44:49",
        "upload_time_iso_8601": "2022-03-12T19:44:49.310051Z",
        "url": "https://files.pythonhosted.org/packages/92/33/047e31360f7c70944d208b0f2358ed99cc226147fffb8d63535c484096f1/AnyDeck-0.1.6-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1e11b5f64568194adee16c6c8be34221c00f26ad9fd1fc8faba17fb39337a23c",
          "md5": "13b528801df7d68d5967b51e7b595eff",
          "sha256": "90e700b83f2138854238c48c0614a2689867177de75f0f17e26c8c7f4b1de868"
        },
        "downloads": -1,
        "filename": "AnyDeck-0.1.6.tar.gz",
        "has_sig": false,
        "md5_digest": "13b528801df7d68d5967b51e7b595eff",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 10403,
        "upload_time": "2022-03-12T19:44:50",
        "upload_time_iso_8601": "2022-03-12T19:44:50.954402Z",
        "url": "https://files.pythonhosted.org/packages/1e/11/b5f64568194adee16c6c8be34221c00f26ad9fd1fc8faba17fb39337a23c/AnyDeck-0.1.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.7": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5446eddcdcfb7b3fd784875c9983441677f72e7c3f5e3adce64a112dd0103b54",
          "md5": "4b9323dd5ef085b502f7dde7e554b467",
          "sha256": "6ab7aa17e474a94b674978513dcb981f6b02bf45b8bac5e417199b2bd43e48fc"
        },
        "downloads": -1,
        "filename": "AnyDeck-0.1.7-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "4b9323dd5ef085b502f7dde7e554b467",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 10198,
        "upload_time": "2022-03-12T21:11:01",
        "upload_time_iso_8601": "2022-03-12T21:11:01.179964Z",
        "url": "https://files.pythonhosted.org/packages/54/46/eddcdcfb7b3fd784875c9983441677f72e7c3f5e3adce64a112dd0103b54/AnyDeck-0.1.7-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "608604d49cde020f9598cf640b3199c087a5e678fe05c91d26d7665a803b801d",
          "md5": "5f68114a81791006b4de40127da84385",
          "sha256": "6c54656b2c5e3768b92ede9efbf3afc24c3d875d1b9fe32943998af74194c875"
        },
        "downloads": -1,
        "filename": "AnyDeck-0.1.7.tar.gz",
        "has_sig": false,
        "md5_digest": "5f68114a81791006b4de40127da84385",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 10409,
        "upload_time": "2022-03-12T21:11:03",
        "upload_time_iso_8601": "2022-03-12T21:11:03.139231Z",
        "url": "https://files.pythonhosted.org/packages/60/86/04d49cde020f9598cf640b3199c087a5e678fe05c91d26d7665a803b801d/AnyDeck-0.1.7.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.8": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "cfb40e42e0ccc28d893dabdcf69b0e2290e57de7f2f78e7f8dfb1350765506dd",
          "md5": "3769f1d533ad9b64f2d7b9bc5e9af48b",
          "sha256": "36584962a2638352c419a73c463bdefdb7d6a27c38b2cf2386643316924fc8c7"
        },
        "downloads": -1,
        "filename": "AnyDeck-0.1.8-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "3769f1d533ad9b64f2d7b9bc5e9af48b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 10288,
        "upload_time": "2022-03-12T21:22:05",
        "upload_time_iso_8601": "2022-03-12T21:22:05.478210Z",
        "url": "https://files.pythonhosted.org/packages/cf/b4/0e42e0ccc28d893dabdcf69b0e2290e57de7f2f78e7f8dfb1350765506dd/AnyDeck-0.1.8-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c03b5d71b535de0f4f6f32f4535599fbf2de05e2ee9665c09c7049a8fe60ff5b",
          "md5": "4fba6ee78dc4996e22254081e2f227ec",
          "sha256": "f0994102ae81d1a88006eacae445bd3bd6fd4fff722c565f1ced92fc5a5d77d2"
        },
        "downloads": -1,
        "filename": "AnyDeck-0.1.8.tar.gz",
        "has_sig": false,
        "md5_digest": "4fba6ee78dc4996e22254081e2f227ec",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 10606,
        "upload_time": "2022-03-12T21:22:07",
        "upload_time_iso_8601": "2022-03-12T21:22:07.120187Z",
        "url": "https://files.pythonhosted.org/packages/c0/3b/5d71b535de0f4f6f32f4535599fbf2de05e2ee9665c09c7049a8fe60ff5b/AnyDeck-0.1.8.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "cfb40e42e0ccc28d893dabdcf69b0e2290e57de7f2f78e7f8dfb1350765506dd",
        "md5": "3769f1d533ad9b64f2d7b9bc5e9af48b",
        "sha256": "36584962a2638352c419a73c463bdefdb7d6a27c38b2cf2386643316924fc8c7"
      },
      "downloads": -1,
      "filename": "AnyDeck-0.1.8-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "3769f1d533ad9b64f2d7b9bc5e9af48b",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6",
      "size": 10288,
      "upload_time": "2022-03-12T21:22:05",
      "upload_time_iso_8601": "2022-03-12T21:22:05.478210Z",
      "url": "https://files.pythonhosted.org/packages/cf/b4/0e42e0ccc28d893dabdcf69b0e2290e57de7f2f78e7f8dfb1350765506dd/AnyDeck-0.1.8-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "c03b5d71b535de0f4f6f32f4535599fbf2de05e2ee9665c09c7049a8fe60ff5b",
        "md5": "4fba6ee78dc4996e22254081e2f227ec",
        "sha256": "f0994102ae81d1a88006eacae445bd3bd6fd4fff722c565f1ced92fc5a5d77d2"
      },
      "downloads": -1,
      "filename": "AnyDeck-0.1.8.tar.gz",
      "has_sig": false,
      "md5_digest": "4fba6ee78dc4996e22254081e2f227ec",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 10606,
      "upload_time": "2022-03-12T21:22:07",
      "upload_time_iso_8601": "2022-03-12T21:22:07.120187Z",
      "url": "https://files.pythonhosted.org/packages/c0/3b/5d71b535de0f4f6f32f4535599fbf2de05e2ee9665c09c7049a8fe60ff5b/AnyDeck-0.1.8.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}