{
  "info": {
    "author": "Martin Erzberger",
    "author_email": "martin@erzberger.ch",
    "bugtrack_url": null,
    "classifiers": [
      "Intended Audience :: Education",
      "License :: OSI Approved :: GNU General Public License v2 (GPLv2)",
      "Operating System :: POSIX :: Linux",
      "Programming Language :: Python :: 3",
      "Topic :: Education",
      "Topic :: Software Development :: Libraries :: Python Modules",
      "Topic :: System :: Hardware :: Hardware Drivers"
    ],
    "description": "# apa102-pi\n\n## Introduction\nApa102-pi is a pure Python library to drive APA102 and SK9822 type LED strands. It is supposed to work on a Raspberry\nPi, and is not tested on any other platform.\n\nBe advised that I consider this library to be \"done\", and don't plan to develop more functionality.\nI still monitor the Github page for issues or pull requests, and will release minor updates\nfrom time to time.\n\nAPA102 LEDs are typically 5050 type LEDs with an additional driver chip per LED.\nThe driver chip takes care of receiving the desired colour via its input lines, and then holding\nthis colour until a new command arrives.\n\nDepending on the LEDs vendor, they might be called \"APA102\", \"SK9822\", \"Superled\", or \"DotStar\".\nThey must not be confused with the three-wire WS2812 LEDs, also known as \"NeoPixel\".\n\nThe really nice part about the driver chip is this: Once it has received its own colour command,\nit forwards any further colour commands from its input to its output lines.\nThis allows to easily chain multiple LEDs together. Colour command #1 lights the first LED,\ncommand #2 the next LED, and so forth. Sending for example 300 colour commands does light\nan entire 5 Meter, 60 LEDs per Meter strip.\n\nSome APA102 pictures are available [here](https://tinue.github.io/apa102-pi/)\n\n## Purpose\nThe library takes care of the details on sending colour commands.\nIt is supposed to be educational, and is therefore written in Python.\nThe library is fast enough to produce nice colour effects on a 300 LED strand, even though it is running\nvia the Python interpreter. However, if you need something really fast, e.g. to drive a\nsmall \"display\" based on APA102 LEDs with 15 frames per second, then you have to look elsewhere.\n\n## Prerequisites\n* A Raspberry Pi, running an up-to-date version of Raspbian / Raspberry Pi OS. To date, Raspberry Pi OS September 22nd 2022 (Debian bullseye)\nis out, and the library works fine with this release. It should run on all Raspberry Pi models, from Zero\nto 4.\n* If hardware SPI is used: SPI enabled and active (`raspi-config`, Interface Options, SPI, \\<Yes\\>);\nThe SPI must be free and unused.\n* For software SPI (bit bang mode): Two free GPIO pins\n* Three libraries from Adafruit: [Adafruit-Blinka](https://github.com/adafruit/Adafruit_Blinka), \n[adafruit-circuitpython-bitbangio](https://github.com/adafruit/Adafruit_CircuitPython_BitbangIO),\nand [adafruit-circuitpython-busdevice](https://github.com/adafruit/Adafruit_CircuitPython_BusDevice).\nThese libraries will be installed automatically if you follow the steps in\n[Use the APA102 project as a library](#use-the-apa102-project-as-a-library).\n\nFor a permanent installation, a 10$ Raspberry Pi Zero W can be dedicated to the task of driving the LEDs.\nThe connector to the LED stripe would be soldered directly to the correct ports on the board.\nFor development purposes, a Raspberry Pi 4 Model B is a better choice due to its greater speed.\nEven the 1GB model is more than enough for this purpose.\n\n## Wiring\nThe Raspberry Pi is a 3.3 volt device, and the APA102 LEDs are 5 volt devices. \nTherefore, it is possible that the first LED driver chip does not properly detect the 3.3 volt SPI signal from\nthe Raspberry Pi.  \nThe first chip will amplify the signal to 5 volts before passing it on, so it is really only the first chip\nthat must detect the 3.3 volt signal.  \nTo avoid this risk, use a 74AHCT125 or 74AHC125 level shifter for both the clock and the MOSI signal.\nIn my limited testing with four different stripes from various Chinese sources I had no issues without\na level shifter, but your experience might be different.\n\nWithout a level shifter, the wiring is very simple:\n\n- LED ground to one of the Raspberry ground pins  \n- LED Data to Raspberry SPI MOSI  \n- LED Clock to Raspberry SPI SCLK\n\nA note about \"chip select\": The Raspberry Pi's SPI0 bus has two hardware Chip Select pins: CE0 and CE1. They correspond\nto the devices `/dev/spidev0.0` and `/dev/spidev0.1`. A typical SPI device has one Chip Select input line. So, on\na stock Raspberry Pi one can connect two SPI devices: Both share SCLK, MOSI and MISO, and each one uses its own Chip\nSelect. You might be wondering where the Chip Select input line is on an LED strip. Answer: There is none. You \ntherefore can't disable the Strip from reading data on SCLK/MOSI, at least not without additional hardware. For\nexample, you can wire the chip select GPIO of the Raspberry Pi to the level shifter \"output-enable\" pin.\n\nThe Adafruit library does not use or support the hardware chip select pins of the Raspberry Pi. Instead, any\nfree GPIO pin can be used. Because this is multiplexed in software, it is very slow. The feature supports\ne.g. sensors, where you have a lot of them (more than two), and each sensor only sends or\nreceives a limited amount of data.  \nThe apa102-pi library attempts to use this software multiplexing if a CE value is passed on driver initialization.\nThe strip will update a lot slower if this is used. It is still a bit faster than bitbang, though.\nPlease note that I have not tested this feature, because I never assembled the hardware required for this.\n\nThe LED strip uses a lot of power (roughly 20mA per LED, i.e. 60mA for one bright white dot).\nIf you try to power the LEDs from the Raspberry Pi 5V output, you will most likely immediately\nkill the Raspberry! Therefore, I recommend not to connect the power line of the LED with the Raspberry. \nTo be on the safe side, use a separate USB power supply for the Raspberry, and a strong 5V supply \nfor the LEDs. If you use a level shifter, power it from the 5V power supply as well.\n\nHaving said this, you *can* power the Raspberry from the same power supply as the LED stripes\n(instead of using an extra USB power supply). If you decide to do this, make sure to never plug\na USB power supply to the Raspberry Pi, or you risk that the LEDs try to take power through the Raspberry.\n\nAll combined, this is my extremely low-tech wiring diagram:\n\n![Wiring Diagram](Wiring.jpg)\n\nAnd here it is, the finished contraption running a \"rainbow\" program:\n\n![Raspberry Pi Zero driving APA102 LEDs](Finished.jpg)\n\nThis is a Raspberry Pi Zero W with a Phat Beat amplifier on top. The amplifier's \"VU meter\" is simply\na bunch of APA 102 LEDs; They show the \"Rainbow\" color scheme:\n\n![Raspberry Pi Zero W with Phat Beat](PhatBeat.jpg)\n\nPlugged into the USB port is a WLAN stick (nowadays I use a Raspberry Pi Zero W, of course).\nThis way I can reprogram the light show from my desk, even if the strips sit outside \nas a Christmas light. Compare this to an Arduino/WS2812 based installation: To reprogram one has\nto take the Arduino inside, or a laptop outside.\n\n\nThis is a Raspberry Pi 4 with a 3D RGB Xmas Tree from Pi Hut:\n\n![Raspberry Pi 4 with Xmas tree](xmastree.jpg)\n\n## Quick Raspberry Pi setup\nBecause the Raspberry Pi Zero runs headless, I recommend using the Raspberry Pi OS *Lite* image.\nThis image only contains the bare minimum of packages, and some packages have be added manually.\n\nI suggest to use the [Raspberry Pi Imager](https://www.raspberrypi.com/software/) for installation.\nThis software allows to setup hostname, WiFi and enable SSH without further work. The\nRaspberry Pi will run headless from the start, and there is no need to ever connect a display or\na keyboard.\n\nAfter installation, ssh into the freshly setup Raspberry Pi and install additional packages.\nAlso, enable SPI:\n\n- Update your installation (`sudo apt update && sudo apt -y upgrade`).\n- Install packages: `sudo apt install -y python3-pip python3-venv python3-rpi.gpio`\n- Activate SPI: `sudo raspi-config`; Go to \"Interface Options\"; Go to \"SPI\"; Enable SPI;\nWhile you are at it: Do change the default password! Exit the tool and reboot.  \n\n## Use the APA102 project as a library\nThe library was originally built as an educational piece of software. It shows how the protocol\nfor APA102 LEDs works. Most of this is explained in the form of comments in the source code.\nIf you are interested in this, then follow up with the chapter after this one.\nIf all you need is the library itself for your own projects, then this chapter is enough to get you started.\n\nInstall the library like this: `sudo pip3 install apa102-pi`. \nThis will install the library, and its dependencies for all users. \n\nNote: If you want to install the library into a virtual env, you must create the venv with the option `--system-site-packages`. This is necessary to get access to the shared RPi.GPIO library.\n\nTo verify the installation, download the test script from Github:\n`curl https://raw.githubusercontent.com/tinue/apa102-pi/main/runcolorcycle.py -o runcolorcycle.py`.\nTo run, type `python3 ./runcolorcycle.py`.\n \n## Full installation into a Python virtual environment\nTo retrieve the full library including source code, and use a virtual env in the process, this is what you need to do:\n- Install the git client: `sudo apt install -y git`  \n- Prepare GIT: `git config --global user.name \"John Doe\" && git config --global user.email johndoe@example.com`  \n- Create a development directory and change into it: `mkdir ~/Development && cd ~/Development`  \n- Get the APA102 Library and sample light programs: `git clone https://github.com/tinue/apa102-pi.git && cd apa102-pi`  \n- Create the virtual environment: `python3 -m venv --system-site-packages ./.venv`\n- Activate the virtual env: `source .venv/bin/activate`\n- Install the library: `pip3 install apa102-pi` (without `sudo`!)\n- Uninstall the library again (and keep the dependencies): `pip3 uninstall apa102-pi -y`\n- You might want to set the number of LEDs to match your strip: `nano runcolorcycle.py`; Update the number, Ctrl-X and \"Yes\" to save.  \n- Run the sample lightshow: `./runcolorcycle.py`.\n\n## Troubleshooting\n### Strip remains dark\nThe number one reason for this problem is that MOSI and SCLK are swapped. You can't rely on the colors of the wires,\nthey seem to change with every batch of APA102 strips that are produced. To resolve, swap the two data\nwires and try again.  \nIf it still does not work, then you might need a level shifter. Before you do this, you can try to lower the\nsupply voltage for the strip. According to the APA102 data sheets, a \"one\" signal is detected as a percentage of\nthe supply voltage: The lower the supply voltage, the higher the chance that 3.3 Volts is still detected\nas a \"one\".\n\n### Flicker\nSometimes the end of large stripes flickers. It seems that there is a correlation amongst three variables:\n* SPI bus speed\n* Overall brightness of the strip\n* Length of the strip\n\nIt turns out that you can only have two out of three: On a long, bright strip you will have to lower the bus speed \nsignificantly.  \nCheck the apa102.py driver: Default is 8MHz (`BUS_SPEED_HZ = 8000000`). You may have to go as low as 1.5MHz, \ni.e. `BUS_SPEED_HZ = 1500000`. This means that all light programs with lots of updates and zero wait\n(e.g. rainbow) will run much slower.\n\n### Brightness\nThere is a default global brightness value in the driver itself (apa102.py, line 90). Of this parameter, the LED\ncontroller chip interprets only the first 5 bits, snd ignores the rest. Therefore, everything >= 31 is 100% brightness.\nThe value is set to 1/8th of the maximum (i.e. 8), and can be changed either by patching apa102.py, or by setting\nthe value from your application. Check `sample.py` to see how this is done.\n\n## Release history\n- 1.0.0 (2015-04-13): Initial version\n- 1.1.0 (2015-12-04): Add documentation\n- 1.1.1 (2015-12-11): Rewrote the examples, driver itself is unchanged\n- 1.2.0 (2015-12-17): Fixes for reported problems; Update all of the color samples; Decouple number of steps from number of LEDs\n- 1.3.0 (2016-03-25): Merged changes from @kapacuk: Allow stripes with different color coding than RGB\n- 1.3.1 (2016-03-27): Merged 'rotate' method from @kapacuk; Fixed errors from previous merge\n- 1.3.2 (2016-12-25): Fixed error related to 'rotate'; Removed annoying messages on console; Added a debug method\n- 1.3.3 (2017-04-14): Merged pull request #19 from @DurandA; Cleanup; Update README.MD, No functional changes\n- 1.4.0 (2017-04-16): Update code to better comply with the Python style guide (PEP 8); Merged pull request from @jmb\n- 1.4.1 (2017-08-26): Tested with Raspbian Stretch; Update Readme.\n- 2.0.0 (2017-11-05): Exchanged the SPI library to Adafruit_Python_GPIO. This allows to support devices that do not use hardware SPI, for example the Pimoroni Blinkt! or the Phat Beat.\n- 2.0.1 (2018-01-19): Tiny release: Added a sample\n- 2.0.2 (2018-05-25): No change in the driver; Slight restructuring of the templates and schemes to allow easier change of the SPI pins; Additional sample specific to the the Pimoroni Blinkt!\n- 2.1.0 (2018-06-08): Make the library installable\n- 2.1.1 (2019-03-15): Enable Chip Select (thanks @grandinquisitor); Simplify installation (thanks @nielstron)\n- 2.2.0 (2019-03-16): First version that is available on PyPi (pip 3 install); Renamed package for compliancy with PEP 8.\n- 2.2.1 (2019-09-20): Nothing new, just a re-test of the library with Raspbian Buster\n- 2.3.0 (2019-11-24): Untested fix for SK9822 type LEDs; Fix name space; Update readme. Note: The namespace fix breaks compatibility with the previous version, hence the minor upgrade in the version number.\n- 2.4.0 (2020-05-28): SPI: Switch from the deprecated Adafruit_GPIO to the Adafruit CircuitPython libraries; Re-test with Raspberry Pi OS 2020-05-27.\n- 2.4.1 (2020-12-04): Remove global brightness parameter from the constructor; Re-test with Raspberry Pi OS 2020-12-02 (kernel 5.4) and latest Adafruit libraries. Fix default global brightness: The \"conservative\" value of 31 was actually 100%, because this is a 5 bit value. Also changing the branch names in Github to reflect current standards.\n- 2.5.0 (2021-12-27): Add methods get_pixel and get_pixel_rgb, support to use all hardware SPI buses on RPI 4 (by explicit choice between hardware spi and bitbanging), thanks @KAN-PC046!  Test with Raspberry Pi OS bullseye and Python 3.9. Add instructions on using a virtual env. Note: The interface changes, so the minor version is getting increased.\n- 2.5.1 (2023-01-14): Really tiny release: One bugfix (thanks @leewillis77); Use logging instead of writing to console to reduce output.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/tinue/apa102-pi",
    "keywords": "",
    "license": "GPLv2",
    "maintainer": "",
    "maintainer_email": "",
    "name": "apa102-pi",
    "package_url": "https://pypi.org/project/apa102-pi/",
    "platform": "Raspbian Buster",
    "project_url": "https://pypi.org/project/apa102-pi/",
    "project_urls": {
      "Homepage": "https://github.com/tinue/apa102-pi"
    },
    "release_url": "https://pypi.org/project/apa102-pi/2.5.1/",
    "requires_dist": [
      "adafruit-circuitpython-bitbangio",
      "adafruit-circuitpython-busdevice"
    ],
    "requires_python": ">3",
    "summary": "Driver for APA102 LEDs on a Raspberry Pi",
    "version": "2.5.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16429248,
  "releases": {
    "2.2.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "17ddf5f2f124fa802fa314cedf898c9e04a02e4a6b42410d68c741bb1a1e4cd5",
          "md5": "e8327ff3e1bffb381cbdfb77c2cca03f",
          "sha256": "8099ade5259d0cc70b657023fbec3157e5dd8250e57a30ecc7620530440f0e2e"
        },
        "downloads": -1,
        "filename": "apa102_pi-2.2.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "e8327ff3e1bffb381cbdfb77c2cca03f",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">3",
        "size": 19620,
        "upload_time": "2019-03-16T17:32:56",
        "upload_time_iso_8601": "2019-03-16T17:32:56.756663Z",
        "url": "https://files.pythonhosted.org/packages/17/dd/f5f2f124fa802fa314cedf898c9e04a02e4a6b42410d68c741bb1a1e4cd5/apa102_pi-2.2.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8dd78797789f364e3a2694b5331f7cb4cd6a7587c74a0bdb38ac9eac76118ccd",
          "md5": "6b146044eade563848d10a10bc0c0143",
          "sha256": "4e21a58d09a0b6b90e002af3fdb0d4594c79ba5d231df0d9f3de7eab50803d03"
        },
        "downloads": -1,
        "filename": "apa102-pi-2.2.0.tar.gz",
        "has_sig": false,
        "md5_digest": "6b146044eade563848d10a10bc0c0143",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">3",
        "size": 11625,
        "upload_time": "2019-03-16T17:32:59",
        "upload_time_iso_8601": "2019-03-16T17:32:59.616052Z",
        "url": "https://files.pythonhosted.org/packages/8d/d7/8797789f364e3a2694b5331f7cb4cd6a7587c74a0bdb38ac9eac76118ccd/apa102-pi-2.2.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.3.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8a2275f6a30293df031d9fd3d94641312c6c8cafa1667647376784dc3f65c0ef",
          "md5": "244d4f5dcf261909d600b2b45696cc07",
          "sha256": "57d2c119d978d18789a4346fa29d09d45fd5184abe05a83fc2d5aa4f629c9f49"
        },
        "downloads": -1,
        "filename": "apa102_pi-2.3.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "244d4f5dcf261909d600b2b45696cc07",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">3",
        "size": 20730,
        "upload_time": "2019-11-24T19:59:25",
        "upload_time_iso_8601": "2019-11-24T19:59:25.885987Z",
        "url": "https://files.pythonhosted.org/packages/8a/22/75f6a30293df031d9fd3d94641312c6c8cafa1667647376784dc3f65c0ef/apa102_pi-2.3.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f9799aa48184e2135157fa19ea029103ac0803ac49c9b3ec930b8a5e98d3dfee",
          "md5": "c045be8df116415440bcd6904bdaa2dc",
          "sha256": "6dbbfa5b772a77a718692cbdddf40dcad30245d53400e451de37de77e8eee38c"
        },
        "downloads": -1,
        "filename": "apa102-pi-2.3.0.tar.gz",
        "has_sig": false,
        "md5_digest": "c045be8df116415440bcd6904bdaa2dc",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">3",
        "size": 17814,
        "upload_time": "2019-11-24T19:59:26",
        "upload_time_iso_8601": "2019-11-24T19:59:26.968700Z",
        "url": "https://files.pythonhosted.org/packages/f9/79/9aa48184e2135157fa19ea029103ac0803ac49c9b3ec930b8a5e98d3dfee/apa102-pi-2.3.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.4.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e08556fa4dff6e9295c355a3f05a08f5537d38c9868edce185293668683585cb",
          "md5": "f00dabcc98ecc4e00d290e32bec4e8b9",
          "sha256": "5fe54af3bdd995f78679a5586596f58bcd830e1d11437d5c88dd5f5a0022b298"
        },
        "downloads": -1,
        "filename": "apa102_pi-2.4.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "f00dabcc98ecc4e00d290e32bec4e8b9",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">3",
        "size": 22047,
        "upload_time": "2020-05-28T15:33:18",
        "upload_time_iso_8601": "2020-05-28T15:33:18.299484Z",
        "url": "https://files.pythonhosted.org/packages/e0/85/56fa4dff6e9295c355a3f05a08f5537d38c9868edce185293668683585cb/apa102_pi-2.4.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1d662743d87aaf990737388729fcd9acd867b3808c92bf518348a64b9ba4c4bd",
          "md5": "894140c6b4cde7551bb736a39648667a",
          "sha256": "3290e79188463d1bb89862b06ee16f2a0fa9f6f85e27e3f9905c32ec2173437b"
        },
        "downloads": -1,
        "filename": "apa102-pi-2.4.0.tar.gz",
        "has_sig": false,
        "md5_digest": "894140c6b4cde7551bb736a39648667a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">3",
        "size": 19597,
        "upload_time": "2020-05-28T15:33:19",
        "upload_time_iso_8601": "2020-05-28T15:33:19.398384Z",
        "url": "https://files.pythonhosted.org/packages/1d/66/2743d87aaf990737388729fcd9acd867b3808c92bf518348a64b9ba4c4bd/apa102-pi-2.4.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.4.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "97eeb72bdb62af50d235aa63a6e4d9759eacf420cbc70f54800359179102f943",
          "md5": "8089e7bb8e2199bb41eb4e852f3510b6",
          "sha256": "05339371b33b38f26c4df67f790b46a8976950d375a38e14daadd690172713e4"
        },
        "downloads": -1,
        "filename": "apa102_pi-2.4.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "8089e7bb8e2199bb41eb4e852f3510b6",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">3",
        "size": 22389,
        "upload_time": "2020-12-04T19:00:42",
        "upload_time_iso_8601": "2020-12-04T19:00:42.961287Z",
        "url": "https://files.pythonhosted.org/packages/97/ee/b72bdb62af50d235aa63a6e4d9759eacf420cbc70f54800359179102f943/apa102_pi-2.4.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8f5d6f5319d6feeddb017714ab799c394e09c230de92fc22d36f20f0fdb88e31",
          "md5": "f69aac99449ae91ce2fc4b3e74b37fd4",
          "sha256": "b0a4037e410519b0a2ae48326716d95314ce803543880eb167e549be14714b9e"
        },
        "downloads": -1,
        "filename": "apa102-pi-2.4.1.tar.gz",
        "has_sig": false,
        "md5_digest": "f69aac99449ae91ce2fc4b3e74b37fd4",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">3",
        "size": 20320,
        "upload_time": "2020-12-04T19:00:44",
        "upload_time_iso_8601": "2020-12-04T19:00:44.159962Z",
        "url": "https://files.pythonhosted.org/packages/8f/5d/6f5319d6feeddb017714ab799c394e09c230de92fc22d36f20f0fdb88e31/apa102-pi-2.4.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.5.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "fdd483e3b7f4645750509cd26d7063dc613bf54047b578d8c12d503b96e0555e",
          "md5": "34bb23dbc1aba46fbc06608e2f3b59cc",
          "sha256": "3d7169558cad6a0fd6636cbdc47f1dd4816b11a8a171957e08d8aa5d6ca87d74"
        },
        "downloads": -1,
        "filename": "apa102_pi-2.5.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "34bb23dbc1aba46fbc06608e2f3b59cc",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">3",
        "size": 24306,
        "upload_time": "2021-12-27T18:01:01",
        "upload_time_iso_8601": "2021-12-27T18:01:01.795345Z",
        "url": "https://files.pythonhosted.org/packages/fd/d4/83e3b7f4645750509cd26d7063dc613bf54047b578d8c12d503b96e0555e/apa102_pi-2.5.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2321ec7fcba0bd0b4603c252958b9d03e69142bed91d7a09af8c81e85e8acc08",
          "md5": "28cc7d7e791711eba97752ad68ad08a1",
          "sha256": "3bcc56b60e850e08443634dc6cee242b061e5a24c219c7b6b338c184bc75091f"
        },
        "downloads": -1,
        "filename": "apa102-pi-2.5.0.tar.gz",
        "has_sig": false,
        "md5_digest": "28cc7d7e791711eba97752ad68ad08a1",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">3",
        "size": 28333,
        "upload_time": "2021-12-27T18:01:03",
        "upload_time_iso_8601": "2021-12-27T18:01:03.415151Z",
        "url": "https://files.pythonhosted.org/packages/23/21/ec7fcba0bd0b4603c252958b9d03e69142bed91d7a09af8c81e85e8acc08/apa102-pi-2.5.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.5.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c73289bd1af6dae80cca0f46f854ab0d043406cb00b099346ea04ca26eb0cb90",
          "md5": "267ec09b8fc2034e57e66989eff79e61",
          "sha256": "6b37077d921b6789ec3aef173452149ab1aafec5d465a27fa43c544fc5b8fa96"
        },
        "downloads": -1,
        "filename": "apa102_pi-2.5.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "267ec09b8fc2034e57e66989eff79e61",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">3",
        "size": 24230,
        "upload_time": "2023-01-14T15:45:43",
        "upload_time_iso_8601": "2023-01-14T15:45:43.876650Z",
        "url": "https://files.pythonhosted.org/packages/c7/32/89bd1af6dae80cca0f46f854ab0d043406cb00b099346ea04ca26eb0cb90/apa102_pi-2.5.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "57bd04ad8202e480af01aafb4c892d580f4a57c0e22913877479b6f424137828",
          "md5": "57b36602e8cdf24e0b32fb13e9eef130",
          "sha256": "9ad5e2f62701568e791deae46ec44ed40767c96b5f5cd342d455f8510631fd62"
        },
        "downloads": -1,
        "filename": "apa102-pi-2.5.1.tar.gz",
        "has_sig": false,
        "md5_digest": "57b36602e8cdf24e0b32fb13e9eef130",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">3",
        "size": 28119,
        "upload_time": "2023-01-14T15:45:45",
        "upload_time_iso_8601": "2023-01-14T15:45:45.991734Z",
        "url": "https://files.pythonhosted.org/packages/57/bd/04ad8202e480af01aafb4c892d580f4a57c0e22913877479b6f424137828/apa102-pi-2.5.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "c73289bd1af6dae80cca0f46f854ab0d043406cb00b099346ea04ca26eb0cb90",
        "md5": "267ec09b8fc2034e57e66989eff79e61",
        "sha256": "6b37077d921b6789ec3aef173452149ab1aafec5d465a27fa43c544fc5b8fa96"
      },
      "downloads": -1,
      "filename": "apa102_pi-2.5.1-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "267ec09b8fc2034e57e66989eff79e61",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">3",
      "size": 24230,
      "upload_time": "2023-01-14T15:45:43",
      "upload_time_iso_8601": "2023-01-14T15:45:43.876650Z",
      "url": "https://files.pythonhosted.org/packages/c7/32/89bd1af6dae80cca0f46f854ab0d043406cb00b099346ea04ca26eb0cb90/apa102_pi-2.5.1-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "57bd04ad8202e480af01aafb4c892d580f4a57c0e22913877479b6f424137828",
        "md5": "57b36602e8cdf24e0b32fb13e9eef130",
        "sha256": "9ad5e2f62701568e791deae46ec44ed40767c96b5f5cd342d455f8510631fd62"
      },
      "downloads": -1,
      "filename": "apa102-pi-2.5.1.tar.gz",
      "has_sig": false,
      "md5_digest": "57b36602e8cdf24e0b32fb13e9eef130",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">3",
      "size": 28119,
      "upload_time": "2023-01-14T15:45:45",
      "upload_time_iso_8601": "2023-01-14T15:45:45.991734Z",
      "url": "https://files.pythonhosted.org/packages/57/bd/04ad8202e480af01aafb4c892d580f4a57c0e22913877479b6f424137828/apa102-pi-2.5.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}