{
  "info": {
    "author": "Sean Lo",
    "author_email": "seanlo96@hotmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 3 - Alpha",
      "License :: OSI Approved :: GNU General Public License v3 (GPLv3)",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# articleparser\nExtracts structured data from web documents.\n\nIf you've ever needed to automatically extract the content of web articles, you know how non-straightforward it can get. This project extracts the article text, authors, title, and more - with one command.\n\n## Installation\nInstall with `pip install articleparser`.\nRequires Python 3.8+, and the following dependencies:\n\n```\nbeautifulsoup4>=4.8\ndjango>=3.0\nhtml5lib>=1.1\nlanguage-tags>=1.0.0\nlxml>=4.5.0\npython-dateutil>=2.8.0\n```\n\n## Usage\nExample usage:\n\n```\nfrom articleparser.article import Article\n\n# this is a filepath to a HTML document.\nfilepath = \"/path/to/html/document.html\"\n\na = Article(filepath)\na.parse()\n```\n\nThe parsed content will then be stored in `a.content`. The following is an example from [the Guardian](https://www.theguardian.com/world/2020/sep/05/america-covid-autumn-winter-coronavirus):\n\n```\n{\n    \"record_categories_list\": [\n        \"World news\"\n    ],\n    \"author_list\": [\n        {\n            \"name\": \"Dominic Rushe\",\n            \"url\": \"https://www.theguardian.com/profile/dominic-rushe\",\n            \"image_url\": null\n        },\n        {\n            \"name\": \"Amanda Holpuch\",\n            \"url\": \"https://www.theguardian.com/profile/amanda-holpuch\",\n            \"image_url\": null\n        }\n    ],\n    \"record_title\": \"The bleak Covid winter? America still not on course to beat back the virus\",\n    \"record_url\": \"https://www.theguardian.com/world/2020/sep/05/america-covid-autumn-winter-coronavirus\",\n    \"record_published_isotimestamp\": \"2020-09-05T09:00:03+00:00\",\n    \"record_modified_isotimestamp\": \"2020-09-05T09:02:14+00:00\",\n    \"site\": [\n        {\n            \"name\": \"the Guardian\",\n            \"url\": null\n        }\n    ],\n    \"record_language\": \"en\",\n    \"record_content\": [\n        \"Even with three decades of experience in the travel industry, Jorge Pesquera has never seen a downturn in business like this one.\",\n        \"Summer officially ends on Monday in the US, and now is the time when many people in colder climes in North America and across the world start dreaming about a winter break on Florida\\u2019s golden shores.\",\n        \"Not this year.\",\n        \"The US is closed for many outside its borders, and many within are too scared to fly as Covid continues its deadly sweep across the country. The rate of infection has eased in Florida and elsewhere and Pesquera, president of the marketing group Discover the Palm Beaches, is hopeful business is improving. But it comes in a year of catastrophic collapse for Florida\\u2019s tourism.\",\n        \"\\u201cNobody has seen anything like this in a couple of generations,\\u201d said Pesquera.\",\n        \"As the US enters its first coronavirus winter, economists and epidemiologists see a pivotal moment \\u2013 a hinge whose swing will determine the direction of the economy and the course of the disease into 2021 and for years \\u2013 potentially generations \\u2013 to come.\",\n        \"The US announced its first death from the coronavirus in February. Donald Trump predicted it would be over by Easter \\u2013 that hope was pushed back to summer as deaths and infections soared. Seven months on, the US is still not on course to control the pandemic.\",\n        \"Soon Covid-19 will have accounted for 200,000 deaths, and reported cases have already reached 6m. By 1 January, the US coronavirus death toll could reach over 410,000 according to a forecast by researchers at the University of Washington\\u2019s Institute for Health Metrics and Evaluation (IHME). Researchers said the projection is based on the \\u201crollercoaster\\u201d of cases in the US, where governments and individuals take up protective measures when things get bad, then let them slide when the local situation improves, potentially restarting the cycle all over again.\",\n        \"The virus has hit Florida particularly hard. At least 630,000 people have been infected and more than 11,000 have died. Tourism has plummeted. In the second quarter \\u2013 April, May and June \\u2013 60% fewer people traveled to Florida compared with the same period in 2019 \\u2013 a decline of almost 20 million visitors.\",\n        \"Pesquera is confident Florida will bounce back, and hotel occupancies have been climbing as locals and tourists from neighboring states get in their cars and head for a beach break. While he is hopeful that the worst is over, Pesquera said it will be a hard winter and beyond for many in the industry.\",\n        \"But there are now worrying signs that the Covid-19 recession is reaching beyond the travel, leisure and hospitality industries that were hit so hard in the early months of the pandemic. Some of the changes will be long-lasting and some may well be permanent.\",\n        \"Already the pandemic has widened income inequality in the US. Economists including Peter Atwater, a lecturer in the economics department at William & Mary, have begun talking of a \\u201cK-shaped\\u201d recovery \\u2013 where the well-off thrive on the uptick of the K as stock markets and house prices rise, while the working poor fall further behind on the downtick.\",\n        \"The divide has once again highlighted the racial and gender wealth divide in the US. Women, Black and Latinx Americans are losing more jobs than their male, white peers and as the US goes into winter, there are signs that more of that is to come.\",\n        \"Retail, too, was crushed by quarantine measures. With 14.7m jobs, retail is the largest private employer in the country. Employment has declined sharply as online sales have picked up. The industry is dominated by women and people of color. Dozens of retailers have filed for bankruptcy since the pandemic struck, and others are hanging by a thread. The sector has regained some ground in recent months but is still down a million jobs from last year. More may soon be lost, said Jason Reed, assistant chair of finance at the University of Notre Dame.\",\n        \"With summer gone, the shopping season is approaching. This year Walmart will be closed on Thanksgiving for the first time in 30 years and so will Target, Best Buy and Kohl\\u2019s. The closures are around safety issues \\u2013 the chance of spreading the disease at a door-crushing super-sale is just too high \\u2013 but for Reed the closures are a sign of things to come.\",\n        \"\\u201cE-commerce has exploded [since the pandemic began],\\u201d said Reed. \\u201cIt\\u2019s like we have done 10 years of growth in a few months. Consumers are getting used to shopping online. I just don\\u2019t see jobs coming back in that sector, and that is a huge number of people.\\u201d\",\n        \"Other changes, like the collapse of travel, may be temporary, but they will contribute to a dark winter for many. Reed points to the fact that many offices across the US are still closed, a situation that is already shuttering businesses reliant on office workers in city centers. \\u201cSo many of these businesses are going to go under, if they haven\\u2019t already,\\u201d he said.\",\n        \"And these closures are feeding into the wider economy, eroding the tax base of cities and states and threatening swingeing job cuts. Employment in the sector is at levels unseen since 2001. New York alone is considering 22,000 jobs cuts, and Florida has a $1.9bn shortfall in its budget. The Economic Policy Institute has warned that without more federal aid, currently deadlocked in Congress, 5.3m local government jobs could go by the end of 2021. Again, women and people of color will be overrepresented in those jobs losses.\",\n        \"Unemployment has dipped back down over the last few months, reaching 8.4% in August. But the rate is still as high as the peak in the last recession and weekly claims for unemployment insurance have remained historically high at close to 1m a week.\",\n        \"\\u201cThe sense that this situation is short-lived and temporary is over,\\u201d said Atwater. \\u201cFurloughs are becoming permanent layoffs ,and the psychological damage that will do to consumer confidence is going to be a problem.\\u201d\",\n        \"Even companies that are doing well are not immune to this pivot, said Atwater. Companies \\u2013 particularly in the tech sector \\u2013 that have seen their share prices soar to sky-high valuations are now looking for ways to keep those share prices high. Atwater pointed to the recent announcement from Salesforce that it was shedding 1,000 jobs, even as the software company announced bumper sales.\",\n        \"For many of these companies their share prices are now \\u201cso high that they are scared to disappoint investors, and they are looking at cost-cutting to keep those share prices levitated,\\u201d he said.\",\n        \"Only a fundamental breakthrough in treating Covid-19 is likely to stop winter\\u2019s woes. And as the temperature drops and the leaves turn, there is little sign that one is coming soon.\",\n        \"Public health experts say the steps for reining in this pandemic are well established, and it is possible to control the spread of coronavirus in the US within months. To do so, the US would need to be in a position where it could depend on the public health interventions of rapid testing, contact tracing, isolation and quarantine to manage coronavirus cases, instead of depending on drastic measures such as having people work from home and keep their children out of school.\",\n        \"But without the government taking such steps, and maintaining them, the US could again soon be in the position it was in in June and July, when cases surged around the country, warned Caitlin Rivers, an epidemiologist at the Johns Hopkins Center for Health Security.\",\n        \"\\u201cWhat I fear is we will just see continuous hotspots coming and going around the country until we get a vaccine,\\u201d Rivers said. \\u201cThat\\u2019s what we don\\u2019t want.\\u201d\",\n        \"With her colleagues at Johns Hopkins, Rivers identified 10 recommendations for the US to reset its approach to coronavirus in a late July report. The recommendations include to scale up contact tracing, bolster personal protective equipment supplies and test supply chains and close higher-risk activities in places where the epidemic is worsening.\",\n        \"The number of cases recorded each day has drifted down from the peak, and testing is happening more frequently than in the spring, but coronavirus is still spreading an \\u201cenormous\\u201d amount in communities, Rivers said.\",\n        \"\\u201cIt is very widespread around the country,\\u201d Rivers said. \\u201cAnd we still don\\u2019t have as much diagnostic testing as we would like in order to be confident we are catching those cases. I think we still do have a long ways to go before we can feel like we are on track to be in a better place.\\u201d\",\n        \"Looking ahead, Rivers said two social factors were bringing \\u201cnew urgency\\u201d to stop the spread: school closures and people\\u2019s hopes to see family during the winter holidays.\",\n        \"\\u201cIt\\u2019s been five or six [months], and it just seems like we are not heading anywhere purposefully,\\u201d Rivers said. \\u201cWe are rather drifting along. So if we want to get to a better place, we have to set out the course for that. In some ways, the critical moment now is that if we want to be in a better spot we need to orient ourselves to that goal.\\u201d\",\n        \"Saskia Popescu, an infectious disease epidemiologist and infection preventionist, said the US has been consistently struggling to respond to coronavirus since it emerged.\",\n        \"\\u201cWe really haven\\u2019t seen a time where we\\u2019ve been able to wrap our arms around this,\\u201d Popescu said. \\u201cI think that the continued messaging from the White House down to the local state governors \\u2013 that this is not that bad, or [that] we have it under control when we really don\\u2019t \\u2013 has been really dangerous and misleading.\\u201d\",\n        \"In addition to improved rapid testing and contact tracing, Popescu said she wanted to see better leadership from federal and state officials.\",\n        \"Scientists have a much better understanding of how coronavirus is transmitted now, compared with when it first emerged. But they are fighting a tidal wave of mistrust from people who think shifts in messaging are something to be skeptical of, instead of a sign of evolving knowledge, and others who are pushing misinformation.\",\n        \"\\u201cWe need leadership across the country to be on the same page, to be supporting and promoting science and ultimately working to reduce transmission consistently, through masking, through ensuring adequate testing, all of those things,\\u201d Popescu said.\",\n        \"The slightly more positive figures reported in August put the country in a better position to control the virus compared with when cases were surging around the country, but improvements come with their own challenges. \\u201cI do think it is really hard when cases start to decrease to maintain people\\u2019s attention and vigilance on it,\\u201d Popescu said.\",\n        \"Complacency will only lengthen the pain \\u2013 economic and otherwise \\u2013 of a pandemic that is already fundamentally reshaping the US for years to come and a virus that doesn\\u2019t care what we think about the latest research on masks or social distancing. \\u201cWe just don\\u2019t know how long this is going to last,\\u201d said Reed.\",\n        \"\\u2026 joining us from Singapore, we have a small favour to ask. Millions are flocking to the Guardian for open, independent, quality news every day, and readers in 180 countries around the world now support us financially.\",\n        \"We believe everyone deserves access to information that\\u2019s grounded in science and truth, and analysis rooted in authority and integrity. That\\u2019s why we made a different choice: to keep our reporting open for all readers, regardless of where they live or what they can afford to pay.\",\n        \"The Guardian has no shareholders or billionaire owner, meaning our journalism is free from bias and vested interests \\u2013 this makes us different. Our editorial independence and autonomy allows us to provide fearless investigations and analysis of those with political and commercial power. We can give a voice to the oppressed and neglected, and help bring about a brighter, fairer future. Your support protects this.\",\n        \"Supporting us means investing in Guardian journalism for tomorrow and the years ahead. The more readers funding our work, the more questions we can ask, the deeper we can dig, and the greater the impact we can have. We\\u2019re determined to provide reporting that helps each of us better understand the world, and take actions that challenge, unite, and inspire change.\",\n        \"Your support means we can keep our journalism open, so millions more have free access to the high-quality, trustworthy news they deserve. So we seek your support not simply to survive, but to grow our journalistic ambitions and sustain our model for open, independent reporting.\",\n        \"If there were ever a time to join us, and help accelerate our growth, it is now. You have the power to support us through these challenging economic times and enable real-world impact.\",\n        \"Every contribution, however big or small, makes a difference. Support us today from as little as $1 \\u2013 it only takes a minute. Thank you.\"\n    ],\n    \"record_description\": \"As summer ends, and as deaths near 200,000 amid severe economic damage, experts say the next few months are vital\",\n    \"record_images_list\": [\n        {\n            \"url\": \"https://i.guim.co.uk/img/media/f2bbbcd7f97d258a8e3a34aeb7f7fca2d3454c5a/0_0_4000_2667/master/4000.jpg?width=1300&quality=45&auto=format&fit=max&dpr=2&s=64bc860a5fc06ab269832f55aebfe4b3\",\n            \"alt_text\": \"A rainy Miami Beach. The virus had hit Florida particularly hard, and its tourism industry had been ravaged. Photograph: Crist\\u00f3bal Herrera/EPA\"\n        },\n        {\n            \"url\": \"https://i.guim.co.uk/img/media/210dbb9016a07b7550cae15fb7767542c5b91568/0_0_3000_2000/master/3000.jpg?width=860&quality=45&auto=format&fit=max&dpr=2&s=dcfe20244e7b809401fa3e5a39a94616\",\n            \"alt_text\": \"An ice-cream store in Key West in March. Photograph: Joe Raedle/Getty Images\"\n        },\n        {\n            \"url\": \"https://i.guim.co.uk/img/media/f51551f5335e9499c51c2b41dc8d8a20b026f6c9/0_0_6240_4160/master/6240.jpg?width=860&quality=45&auto=format&fit=max&dpr=2&s=c3638021539efe1ad2487d58300519cb\",\n            \"alt_text\": \"A woman walks by a closed business in Brooklyn in July. Photograph: Spencer Platt/Getty Images\"\n        },\n        {\n            \"url\": \"https://i.guim.co.uk/img/media/37079f8b236119fef568d05dcce745c7d3170ab1/0_0_3000_2000/master/3000.jpg?width=860&quality=45&auto=format&fit=max&dpr=2&s=b7a94840b1cc967342fedf1a305ccbd1\",\n            \"alt_text\": \"Nurses protest against the lack of PPE in St Petersburg, Florida. Photograph: Octavio Jones/Reuters\"\n        },\n        {\n            \"url\": \"https://i.guim.co.uk/img/media/c88b9398ca57aa1814aa95fe9314e886204fccb2/0_0_5040_3360/master/5040.jpg?width=860&quality=45&auto=format&fit=max&dpr=2&s=9872f2abf4de4f987523eb0ef533498d\",\n            \"alt_text\": \"Friends and family mourn the death of Conrad Coleman, who died of Covid in New Rochelle, New York, two months after his father died. Photograph: John Moore/Getty Images\"\n        },\n        {\n            \"url\": \"https://assets.guim.co.uk/images/acquisitions/2db3a266287f452355b68d4240df8087/payment-methods.png\",\n            \"alt_text\": \"Accepted payment methods: Visa, Mastercard, American Express  and Paypal\"\n        }\n    ],\n    \"record_links_list\": [\n        {\n            \"url\": \"https://www.thepalmbeaches.com/\",\n            \"text\": \"Discover the Palm Beaches\"\n        },\n        {\n            \"url\": \"https://www.theguardian.com/us-news/donaldtrump\",\n            \"text\": \"Donald Trump\"\n        },\n        {\n            \"url\": \"https://covid19.healthdata.org/united-states-of-america?view=total-deaths&tab=trend\",\n            \"text\": \"forecast by researchers\"\n        },\n        {\n            \"url\": \"https://www.theguardian.com/us-news/2020/aug/16/us-inequality-coronavirus-pandemic-unemployment\",\n            \"text\": \"widened income inequality\"\n        },\n        {\n            \"url\": \"https://www.theguardian.com/business/2020/aug/04/shecession-coronavirus-pandemic-economic-fallout-women\",\n            \"text\": \"Women\"\n        },\n        {\n            \"url\": \"https://www.theguardian.com/us-news/2020/apr/28/african-americans-unemployment-covid-19-economic-impact\",\n            \"text\": \"Black\"\n        },\n        {\n            \"url\": \"https://www.theguardian.com/business/2020/may/29/us-coronavirus-layoffs-hispanic-americans-hit-hardest\",\n            \"text\": \"Latinx\"\n        },\n        {\n            \"url\": \"https://cepr.net/wp-content/uploads/2020/04/2020-04-Frontline-Workers.pdf\",\n            \"text\": \"dominated by women and people of color\"\n        },\n        {\n            \"url\": \"https://www.pewtrusts.org/en/research-and-analysis/articles/2020/06/16/how-covid-19-is-driving-big-job-losses-in-state-and-local-government\",\n            \"text\": \"levels unseen since 2001\"\n        },\n        {\n            \"url\": \"https://www.epi.org/blog/without-federal-aid-to-state-and-local-governments-5-3-million-workers-will-likely-lose-their-jobs-by-the-end-of-2021-see-estimated-job-losses-by-state/#:~:text=and%20David%20Cooper-,Without%20federal%20aid%20to%20state%20and%20local%20governments%2C%205.3%20million,local%20governments%20in%20coming%20months.\",\n            \"text\": \"5.3m local government jobs\"\n        },\n        {\n            \"url\": \"https://www.epi.org/blog/cuts-to-the-state-and-local-public-sector-will-disproportionately-harm-women-and-black-workers/\",\n            \"text\": \"women and people of color\"\n        },\n        {\n            \"url\": \"https://www.usatoday.com/story/money/2020/08/26/salesforce-job-cuts-stock-employees/5634780002/\",\n            \"text\": \"shedding 1,000\"\n        },\n        {\n            \"url\": \"https://www.centerforhealthsecurity.org/our-work/publications/resetting-our-response-changes-needed-in-the-us-approach-to-covid-19\",\n            \"text\": \"in a late July report\"\n        }\n    ],\n    \"record_videos_list\": [],\n    \"record_documents_list\": [\n        {\n            \"url\": \"https://cepr.net/wp-content/uploads/2020/04/2020-04-Frontline-Workers.pdf\",\n            \"alt_text\": \"dominated by women and people of color\"\n        }\n    ],\n    \"record_keywords_list\": [\n        \"US news\",\n        \"World news\",\n        \"US politics\",\n        \"Donald Trump\",\n        \"Coronavirus outbreak\",\n        \"US economy\",\n        \"Business\"\n    ],\n    \"record_comment_areas_list\": []\n}\n```\n\n## Versioning\nWe use [semantic versioning](https://semver.org) for versioning.\n\n## License\nThis project is licensed under the GNU General Public License.\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/sean-lo/articleparser",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "articleparser",
    "package_url": "https://pypi.org/project/articleparser/",
    "platform": "",
    "project_url": "https://pypi.org/project/articleparser/",
    "project_urls": {
      "Homepage": "https://github.com/sean-lo/articleparser"
    },
    "release_url": "https://pypi.org/project/articleparser/0.1.4/",
    "requires_dist": [
      "beautifulsoup4 (>=4.8)",
      "django (>=3.0)",
      "html5lib (>=1.1)",
      "language-tags (>=1.0.0)",
      "lxml (>=4.5.0)",
      "python-dateutil (>=2.8.0)"
    ],
    "requires_python": ">=3.8",
    "summary": "Extracts structured data from web articles.",
    "version": "0.1.4",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 9518957,
  "releases": {
    "0.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6412f0adfbd596cd83c13c3be1f29ea657eefa40ccfd05162417b068aedf6c38",
          "md5": "1a1f53b6f19fd9953de15cf6bdfc9bc2",
          "sha256": "1dd601c6b6295e429117f9544e881fea758963a8f0663545e82a8f9dae4bd446"
        },
        "downloads": -1,
        "filename": "articleparser-0.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "1a1f53b6f19fd9953de15cf6bdfc9bc2",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 13919,
        "upload_time": "2020-10-02T14:53:22",
        "upload_time_iso_8601": "2020-10-02T14:53:22.596014Z",
        "url": "https://files.pythonhosted.org/packages/64/12/f0adfbd596cd83c13c3be1f29ea657eefa40ccfd05162417b068aedf6c38/articleparser-0.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "23c22d034f9f9ff094da97329177954a39a220df23ec1eefbeb6796568f78462",
          "md5": "d977d97922397e283bf7188af4ee05aa",
          "sha256": "91973b9a97576b3b61ed45a0af821c8c52993e65965f4daebffe15b212121dfe"
        },
        "downloads": -1,
        "filename": "articleparser-0.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "d977d97922397e283bf7188af4ee05aa",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 1285,
        "upload_time": "2020-10-02T14:53:25",
        "upload_time_iso_8601": "2020-10-02T14:53:25.094792Z",
        "url": "https://files.pythonhosted.org/packages/23/c2/2d034f9f9ff094da97329177954a39a220df23ec1eefbeb6796568f78462/articleparser-0.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7dd8e3fce3efe7097c7837bef251ce005f928ec41b959b527073e0c601941ea4",
          "md5": "7f9f39df4ca260c1105a4251dcc1c324",
          "sha256": "bbb8cafe351f57b2efe066b9ecfb62dde12edc3db4cb008ca960c94a3b2d2a07"
        },
        "downloads": -1,
        "filename": "articleparser-0.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "7f9f39df4ca260c1105a4251dcc1c324",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 58730,
        "upload_time": "2021-01-27T02:45:14",
        "upload_time_iso_8601": "2021-01-27T02:45:14.517736Z",
        "url": "https://files.pythonhosted.org/packages/7d/d8/e3fce3efe7097c7837bef251ce005f928ec41b959b527073e0c601941ea4/articleparser-0.1.0-py3-none-any.whl",
        "yanked": true,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b2abfb1f9a3c753235d89dcfab102f2d1840b34f415fc1c23816fef506048c58",
          "md5": "a9f52544c37f523965662f2e6d17caeb",
          "sha256": "e4220e2ccbcbbc3c5c80296a92e7d90762a913d2362aaaa9429c921de8d690e9"
        },
        "downloads": -1,
        "filename": "articleparser-0.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "a9f52544c37f523965662f2e6d17caeb",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 43771,
        "upload_time": "2021-01-27T02:45:15",
        "upload_time_iso_8601": "2021-01-27T02:45:15.979950Z",
        "url": "https://files.pythonhosted.org/packages/b2/ab/fb1f9a3c753235d89dcfab102f2d1840b34f415fc1c23816fef506048c58/articleparser-0.1.0.tar.gz",
        "yanked": true,
        "yanked_reason": null
      }
    ],
    "0.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9cd444cf6285f78cb340907e555d06a121c8d8d24f7db91dbef441b7c993b6c2",
          "md5": "6ed45af2f6d88b4f9e58c94505e5546a",
          "sha256": "d4a7a42c01fe877f07d3562b9876f46589bd1b8c95694dc83a58d91ab8665ba7"
        },
        "downloads": -1,
        "filename": "articleparser-0.1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "6ed45af2f6d88b4f9e58c94505e5546a",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 66408,
        "upload_time": "2021-01-27T03:37:13",
        "upload_time_iso_8601": "2021-01-27T03:37:13.578173Z",
        "url": "https://files.pythonhosted.org/packages/9c/d4/44cf6285f78cb340907e555d06a121c8d8d24f7db91dbef441b7c993b6c2/articleparser-0.1.1-py3-none-any.whl",
        "yanked": true,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5526edbc352431528f3b05e76bda9d7486bbdfd99159730ed3f38f58ebf827b0",
          "md5": "4ec160bf7f82557e9dadfc840d73b674",
          "sha256": "560410970f1d99fad1353f832bdb4a0cd9e49a7d06451b5de0def533ee7aaba0"
        },
        "downloads": -1,
        "filename": "articleparser-0.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "4ec160bf7f82557e9dadfc840d73b674",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 60095,
        "upload_time": "2021-01-27T03:37:15",
        "upload_time_iso_8601": "2021-01-27T03:37:15.542433Z",
        "url": "https://files.pythonhosted.org/packages/55/26/edbc352431528f3b05e76bda9d7486bbdfd99159730ed3f38f58ebf827b0/articleparser-0.1.1.tar.gz",
        "yanked": true,
        "yanked_reason": null
      }
    ],
    "0.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0b593462512a5678622e510d1e6b6c5a4ce1eb8dca367a5010403763f52ffccc",
          "md5": "a6cd2a9fe2ecc8a2e6ce9faf16a25cf5",
          "sha256": "5e5e6efc627bdb21b6e4e55f2d847fbeaf5909c09186256bd2df1c8626701379"
        },
        "downloads": -1,
        "filename": "articleparser-0.1.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "a6cd2a9fe2ecc8a2e6ce9faf16a25cf5",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 66263,
        "upload_time": "2021-01-27T05:09:10",
        "upload_time_iso_8601": "2021-01-27T05:09:10.742030Z",
        "url": "https://files.pythonhosted.org/packages/0b/59/3462512a5678622e510d1e6b6c5a4ce1eb8dca367a5010403763f52ffccc/articleparser-0.1.2-py3-none-any.whl",
        "yanked": true,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f255d8f58a75a3fe99a463cc9a0f9d8133e333a2c80472cbe6febfcfc5902f61",
          "md5": "ebc9c823d369059c75decab4a7cde051",
          "sha256": "224722ac3a67d5fb6ac7fcf9f71c00013a8386caed9b04a5e7edc11c1de5134b"
        },
        "downloads": -1,
        "filename": "articleparser-0.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "ebc9c823d369059c75decab4a7cde051",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 59842,
        "upload_time": "2021-01-27T05:09:11",
        "upload_time_iso_8601": "2021-01-27T05:09:11.996487Z",
        "url": "https://files.pythonhosted.org/packages/f2/55/d8f58a75a3fe99a463cc9a0f9d8133e333a2c80472cbe6febfcfc5902f61/articleparser-0.1.2.tar.gz",
        "yanked": true,
        "yanked_reason": null
      }
    ],
    "0.1.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "70b267d825d7381a0abd64593ce3a725c28044ebc85afc72bf792fd35f09c132",
          "md5": "712c2bf19b71de5031eb904604b1b066",
          "sha256": "793fd29c96cce5d5d5d632e2331d751b30ab051415c5b6d785e8505c378fd7da"
        },
        "downloads": -1,
        "filename": "articleparser-0.1.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "712c2bf19b71de5031eb904604b1b066",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 66534,
        "upload_time": "2021-01-27T08:47:27",
        "upload_time_iso_8601": "2021-01-27T08:47:27.541017Z",
        "url": "https://files.pythonhosted.org/packages/70/b2/67d825d7381a0abd64593ce3a725c28044ebc85afc72bf792fd35f09c132/articleparser-0.1.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0d8ecce9f32a79a79e562b9d56de1c389437115f785261659693cb5787e5f7d9",
          "md5": "65e255a8067c613d850a554c8e35601c",
          "sha256": "00089a53b982932d2f30e7fd6dc0dcb5f719026e5f2d4bc19d115aa455eb872a"
        },
        "downloads": -1,
        "filename": "articleparser-0.1.3.tar.gz",
        "has_sig": false,
        "md5_digest": "65e255a8067c613d850a554c8e35601c",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 60172,
        "upload_time": "2021-01-27T08:47:29",
        "upload_time_iso_8601": "2021-01-27T08:47:29.101978Z",
        "url": "https://files.pythonhosted.org/packages/0d/8e/cce9f32a79a79e562b9d56de1c389437115f785261659693cb5787e5f7d9/articleparser-0.1.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1adb5beb7df5afef54a6fe82144c85833592600a2fc7504994b224478032fd1f",
          "md5": "8755de941f4c510478239b58e345d2da",
          "sha256": "10e6ceb9f79a353788840d6e311444227c65026186fc5b4cb03df23ed3aeaf59"
        },
        "downloads": -1,
        "filename": "articleparser-0.1.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "8755de941f4c510478239b58e345d2da",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 68361,
        "upload_time": "2021-02-25T05:27:04",
        "upload_time_iso_8601": "2021-02-25T05:27:04.189472Z",
        "url": "https://files.pythonhosted.org/packages/1a/db/5beb7df5afef54a6fe82144c85833592600a2fc7504994b224478032fd1f/articleparser-0.1.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "42a6b7d40ec8c2518b16480c1ed2a18872b2990214d611949c9093530dbd2e2e",
          "md5": "5cbf6be8f4ad325c1b060e01d2fe48cd",
          "sha256": "b8137178b66e5cdeede77358df8ba66535a0be35cec9af14c0c7c56ba64f42cf"
        },
        "downloads": -1,
        "filename": "articleparser-0.1.4.tar.gz",
        "has_sig": false,
        "md5_digest": "5cbf6be8f4ad325c1b060e01d2fe48cd",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 61894,
        "upload_time": "2021-02-25T05:27:05",
        "upload_time_iso_8601": "2021-02-25T05:27:05.465056Z",
        "url": "https://files.pythonhosted.org/packages/42/a6/b7d40ec8c2518b16480c1ed2a18872b2990214d611949c9093530dbd2e2e/articleparser-0.1.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "1adb5beb7df5afef54a6fe82144c85833592600a2fc7504994b224478032fd1f",
        "md5": "8755de941f4c510478239b58e345d2da",
        "sha256": "10e6ceb9f79a353788840d6e311444227c65026186fc5b4cb03df23ed3aeaf59"
      },
      "downloads": -1,
      "filename": "articleparser-0.1.4-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "8755de941f4c510478239b58e345d2da",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.8",
      "size": 68361,
      "upload_time": "2021-02-25T05:27:04",
      "upload_time_iso_8601": "2021-02-25T05:27:04.189472Z",
      "url": "https://files.pythonhosted.org/packages/1a/db/5beb7df5afef54a6fe82144c85833592600a2fc7504994b224478032fd1f/articleparser-0.1.4-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "42a6b7d40ec8c2518b16480c1ed2a18872b2990214d611949c9093530dbd2e2e",
        "md5": "5cbf6be8f4ad325c1b060e01d2fe48cd",
        "sha256": "b8137178b66e5cdeede77358df8ba66535a0be35cec9af14c0c7c56ba64f42cf"
      },
      "downloads": -1,
      "filename": "articleparser-0.1.4.tar.gz",
      "has_sig": false,
      "md5_digest": "5cbf6be8f4ad325c1b060e01d2fe48cd",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.8",
      "size": 61894,
      "upload_time": "2021-02-25T05:27:05",
      "upload_time_iso_8601": "2021-02-25T05:27:05.465056Z",
      "url": "https://files.pythonhosted.org/packages/42/a6/b7d40ec8c2518b16480c1ed2a18872b2990214d611949c9093530dbd2e2e/articleparser-0.1.4.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}