{
  "info": {
    "author": "",
    "author_email": "Hang Yuan <angerhangy@gmail.com>",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 3 - Alpha",
      "Intended Audience :: Developers",
      "Intended Audience :: Education",
      "Intended Audience :: Healthcare Industry",
      "Intended Audience :: Science/Research",
      "License :: OSI Approved :: MIT License",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3 :: Only",
      "Programming Language :: Python :: 3.7",
      "Programming Language :: Python :: 3.8",
      "Programming Language :: Python :: 3.9",
      "Topic :: Scientific/Engineering :: Artificial Intelligence",
      "Topic :: Scientific/Engineering :: Medical Science Apps."
    ],
    "description": "# asleep: a sleep classifier for wearable sensor data using machine learning\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n### Testing locally\nIf you want to test the code locally, you can use `tox` to directly emulate the GitHub action tests.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "sleep,wearables,machine learning",
    "license": "# Academic Use Licence  **These licence terms apply to all licences granted by THE CHANCELLOR, MASTERS AND SCHOLARS OF THE UNIVERSITY OF OXFORD whose administrative offices are at University Offices, Wellington Square, Oxford OX1 2JD, United Kingdom (the “University”) for use of “SSL-wearables” (“the Software”) through this website (https://github.com/OxWearables) (the ”Website”).  By downloading the Software through the Website, you (the “Licensee”) are confirming that you agree that your use of the Software is subject to these licence terms**  **PLEASE READ THESE LICENCE TERMS CAREFULLY BEFORE DOWNLOADING THE SOFTWARE. IF YOU DO NOT AGREE TO THESE LICENCE TERMS YOU SHOULD NOT DOWNLOAD THE SOFTWARE.**  **THE SOFTWARE IS INTENDED FOR USE BY ACADEMICS CARRYING OUT RESEARCH AND NOT FOR USE BY CONSUMERS OR COMMERCIAL BUSINESSES.**  **1.\tAcademic Use Licence** 1.1\tThe Licensee is granted a limited non-exclusive and non-transferable royalty free licence to download and use the Software provided that the Licensee will: - (a)\tlimit their use of the Software to their own internal academic non-commercial research which is undertaken for the purposes of education or other scholarly use; - (b)\tnot use the Software for or on behalf of any third party or to provide a service or integrate all or part of the Software into a product for sale or license to third parties; - (c)\tuse the Software in accordance with the prevailing instructions and guidance for use given on the Website and comply with procedures on the Website for user identification, authentication and access; - (d)\tcomply with all applicable laws and regulations with respect to their use of the Software; and - (e)\tensure that the Copyright Notice “Copyright © 2022, University of Oxford” appears prominently wherever the Software is reproduced and is referenced or cited with the Copyright Notice when the Software is described in any research publication or on any documents or other material created using the Software.   1.2\tThe Licensee may only reproduce, modify, transmit or transfer the Software where: - (a)\tsuch reproduction, modification, transmission or transfer is for academic, research or other scholarly use; - (b)\tthe conditions of this Licence are imposed upon the receiver of the Software or any modified Software; - (c)\tall original and modified Source Code is included in any transmitted software program; and - (d)\tthe Licensee grants the University an irrevocable, indefinite, royalty free, non-exclusive unlimited licence to use and sub-licence any modified Source Code as part of the Software.   1.3\tThe University reserves the right at any time and without liability or prior notice to the Licensee to revise, modify and replace the functionality and performance of the access to and operation of the Software.   1.4\tThe Licensee acknowledges and agrees that the University owns all intellectual property rights in the Software.  The Licensee shall not have any right, title or interest in the Software.   1.5\tThis Licence will terminate immediately and the Licensee will no longer have any right to use the Software or exercise any of the rights granted to the Licensee upon any breach of the conditions in Section 1 of this Licence.   **2.\tIndemnity and Liability** 2.1\tThe Licensee shall defend, indemnify and hold harmless the University against any claims, actions, proceedings, losses, damages, expenses and costs (including without limitation court costs and reasonable legal fees) arising out of or in connection with the Licensee's possession or use of the Software, or any breach of these terms by the Licensee.  2.2\tThe Software is provided on an ‘as is’ basis and the Licensee uses the Software at their own risk. No representations, conditions, warranties or other terms of any kind are given in respect of the the Software and all statutory warranties and conditions are excluded to the fullest extent permitted by law. Without affecting the generality of the previous sentences, the University gives no implied or express warranty and makes no representation that the Software or any part of the Software: (a) will enable specific results to be obtained; or (b) meets a particular specification or is comprehensive within its field or that it is error free or will operate without interruption; or (c) is suitable for any particular, or the Licensee's specific purposes.  2.3\tExcept in relation to fraud, death or personal injury, the University's liability to the Licensee for any use of the Software, in negligence or arising in any other way out of the subject matter of these licence terms, will not extend to any incidental or consequential damages or losses, or any loss of profits, loss of revenue, loss of data, loss of contracts or opportunity, whether direct or indirect.  2.4\tThe Licensee hereby irrevocably undertakes to the University not to make any claim against any employee, student, researcher or other individual engaged by the University, being a claim which seeks to enforce against any of them any liability whatsoever in connection with these licence terms or their subject-matter.   **3.\tGeneral** **3.1\tSeverability** - If any provision (or part of a provision) of these licence terms is found by any court or administrative body of competent jurisdiction to be invalid, unenforceable or illegal, the other provisions shall remain in force. **3.2\tEntire Agreement** - These licence terms constitute the whole agreement between the parties and supersede any previous arrangement, understanding or agreement between them relating to the Software. **3.3\tLaw and Jurisdiction** - These licence terms and any disputes or claims arising out of or in connection with them shall be governed by, and construed in accordance with, the law of England. The Licensee irrevocably submits to the exclusive jurisdiction of the English courts for any dispute or claim that arises out of or in connection with these licence terms.   If you are interested in using the Software commercially, please contact Oxford University Innovation Limited to negotiate a licence. Contact details are enquiries@innovation.ox.ac.uk ",
    "maintainer": "",
    "maintainer_email": "Hang Yuan <angerhangy@gmail.com>",
    "name": "asleep",
    "package_url": "https://pypi.org/project/asleep/",
    "platform": null,
    "project_url": "https://pypi.org/project/asleep/",
    "project_urls": {
      "Bug Reports": "https://github.com/OxWearables/asleep/issues",
      "Homepage": "https://github.com/OxWearables/asleep",
      "Source": "https://github.com/OxWearables/asleep"
    },
    "release_url": "https://pypi.org/project/asleep/0.1.0/",
    "requires_dist": [
      "peppercorn",
      "check-manifest ; extra == 'dev'",
      "coverage ; extra == 'test'"
    ],
    "requires_python": ">=3.7",
    "summary": "A sleep classification tool for wearables",
    "version": "0.1.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17511128,
  "releases": {
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e82917b9525d86ac4b36a9a18177f852f7893ed795386abda1128365d6b748be",
          "md5": "fe38ae03fd2e98c4645037f68b4fd5e6",
          "sha256": "0339b3d60ea7fe0819f008561d34f4d430b05b34d0e2b5aa2749ce030fd7e3f0"
        },
        "downloads": -1,
        "filename": "asleep-0.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "fe38ae03fd2e98c4645037f68b4fd5e6",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 7323,
        "upload_time": "2023-03-30T13:30:42",
        "upload_time_iso_8601": "2023-03-30T13:30:42.689378Z",
        "url": "https://files.pythonhosted.org/packages/e8/29/17b9525d86ac4b36a9a18177f852f7893ed795386abda1128365d6b748be/asleep-0.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3d916565d253a2fd76c1a1950716540904635ff5e437ba3eb961d8b927df4dfd",
          "md5": "ba9efb4c32d640d8f4c6d7dac48d17c7",
          "sha256": "788925f5dce6daab64b684feaccd72404515e62695f2f5e92a5dc51af3cc8a20"
        },
        "downloads": -1,
        "filename": "asleep-0.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "ba9efb4c32d640d8f4c6d7dac48d17c7",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 7661,
        "upload_time": "2023-03-30T13:30:44",
        "upload_time_iso_8601": "2023-03-30T13:30:44.527509Z",
        "url": "https://files.pythonhosted.org/packages/3d/91/6565d253a2fd76c1a1950716540904635ff5e437ba3eb961d8b927df4dfd/asleep-0.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "e82917b9525d86ac4b36a9a18177f852f7893ed795386abda1128365d6b748be",
        "md5": "fe38ae03fd2e98c4645037f68b4fd5e6",
        "sha256": "0339b3d60ea7fe0819f008561d34f4d430b05b34d0e2b5aa2749ce030fd7e3f0"
      },
      "downloads": -1,
      "filename": "asleep-0.1.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "fe38ae03fd2e98c4645037f68b4fd5e6",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.7",
      "size": 7323,
      "upload_time": "2023-03-30T13:30:42",
      "upload_time_iso_8601": "2023-03-30T13:30:42.689378Z",
      "url": "https://files.pythonhosted.org/packages/e8/29/17b9525d86ac4b36a9a18177f852f7893ed795386abda1128365d6b748be/asleep-0.1.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "3d916565d253a2fd76c1a1950716540904635ff5e437ba3eb961d8b927df4dfd",
        "md5": "ba9efb4c32d640d8f4c6d7dac48d17c7",
        "sha256": "788925f5dce6daab64b684feaccd72404515e62695f2f5e92a5dc51af3cc8a20"
      },
      "downloads": -1,
      "filename": "asleep-0.1.0.tar.gz",
      "has_sig": false,
      "md5_digest": "ba9efb4c32d640d8f4c6d7dac48d17c7",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7",
      "size": 7661,
      "upload_time": "2023-03-30T13:30:44",
      "upload_time_iso_8601": "2023-03-30T13:30:44.527509Z",
      "url": "https://files.pythonhosted.org/packages/3d/91/6565d253a2fd76c1a1950716540904635ff5e437ba3eb961d8b927df4dfd/asleep-0.1.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}