{
  "info": {
    "author": "anatoly techtonik",
    "author_email": "techtonik@gmail.com",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "FAQ (or why would you need to ask this anyway?)\r\n\r\nQ: Why the version number for the first release is 0.00008?\r\nA: 0.00008 is $0.01 in BTC, the smallest indivisible coin from RL that the most generous users in the World can donate to support [1] this endeavour.\r\n\r\nQ: Why not $0.1 or $1?\r\nA: The next version will surely be more costly.\r\n\r\nQ: Wait, which money? The license is Public Domain!\r\nA: Right. Public Domain is the way software lives, money is the way to live for humans. Nobody wants to end like PKWARE founder. This action [2] will save your soul. For a few months anyway. So try recurring stuff [3].\r\n\r\nQ: Do you mean I have to pay for bablos?\r\nA: No, you don't. But this is how it works - you pay, and then you're hooked. Even if this is the first application you ever payed for, once you pay - it's already installed. You can remove it though.\r\n\r\nQ: Why are you constantly talking about money? What is this stuff anyway?\r\nA: Well, sometimes live becomes harsh and you need bablos to proceed.\r\n\r\nQ: I don't understand.\r\nA: That's not a question.\r\n\r\nQ: That's not an answer.\r\nA: Ok. Bablos is a double entry system\r\n\r\nQ: Do you mean double entry accounting?\r\nA: No, I mean I enter text twice - in English and in Russian.\r\n\r\nQ: And what about Russian?\r\nA: When you join the best of both worlds, you get bablos.\r\n\r\nQ: I am totally confused.\r\nA: Just believe. \"If you believe in bablos, bablos also believes in you\".\r\n\r\nQ: Is that Nietzsche?\r\nA: It is a religion. Show your [5] and you'll be saved.\r\n\r\nQ: What religion? It is a site with Python packages!\r\nA: Religion packed into cute Python package.\r\n\r\nQ: I am already a follower of another religion.\r\nA: That's perfectly ok. Bablos is a cooperative religious thing. No matter which religion you follow, bablos helps to keep you up.\r\n\r\nQ: And what it is about?\r\nA: It is about attaining piece of mind through self-satisfaction in knowing you made the effort to do the best of which you're capable. Here [5].\r\n\r\n\r\nQ: ...\r\nA: There is another way.\r\n\r\nQ: Way to what?\r\nA: To solve the conflict inside you.\r\n\r\nQ: I don't have any conflicts.\r\nA: Everybody who says that has one.\r\n\r\nQ: How do you know?\r\nA: Because I had too, then I did it [6] and send link to 20 friends. Now I am saved.\r\n\r\nQ: I don't want to be saved.\r\nA: Everybody wants.\r\n\r\nQ: Me not.\r\nA: You do.\r\n\r\nQ: No, I don't.\r\nA: Any amount counts [7].\r\n\r\nQ: And where I'll be saved?\r\nA: In ChangeLog.\r\n\r\nQ: Where is it?\r\nA: Will be included in the next version.\r\n\r\nQ: And what is the next version, 0.00009?\r\nA: It directly depends on contributions [8]. It is bablos after all.\r\n\r\nQ: I see it all about begging money.\r\nA: True.\r\n\r\nQ: That's mean.\r\nA: Didn't you like the experience? I am ruined. Can you please report a bug [11]?\r\n\r\nQ: Well..\r\nA: It helps software.\r\n\r\nQ: You mean religions.\r\nA: No, I mean public domain software.\r\n\r\nQ: I prefer GPL.\r\nA: Well, it may help LGPL software.\r\n\r\nQ: I want to be sure it will help.\r\nA: Guarantees for bablos are planned for version 2.0 and above.\r\n\r\nQ: Hey! That's $245.8 And you said Open Source and Public Domain!\r\nA: I see you're starting to get it. Bablos is OS, PD and about investments. Start investing now to become master [9].\r\n\r\nQ: But what I am investing into?\r\nA: It is not a fraud. That alone should be enough. There is more. There is no promises, so everything is honest.\r\n\r\nQ: But you promised to save me in the ChangeLog.\r\nA: That's planned.\r\n\r\nQ: But you said no promises.\r\nA: No bablos - no promises. Catch-22. It can be helped though [11].\r\n\r\nQ: You are cheating.\r\nA: There is only way to check [12]. Any amount will do.\r\n\r\nQ: No, I am not paying for software.\r\nA: It is not for software. Software is in public domain.\r\n\r\nQ: But there is nothing!\r\nA: There is already a future investor and a teacher. You first lesson [13].\r\n\r\nQ: What do I learn from it?\r\nA: You will learn trust (level 1) and you will also test how bablos works (unlocked achievement).\r\n\r\nQ: Achievements are sweet.\r\nA: That's planned. 1.0 may include that.\r\n\r\nQ: Still I am not convinced.\r\nA: Remember last time you've invested into honest business. Now it's your chance [10].\r\n\r\nQ: I better buy some indie bundle and help charity.\r\nA: With bablos you can buy indie bundle, help charity and invest in the future [14].\r\n\r\nQ: Into your future?\r\nA: Into Open Source future.\r\n\r\nQ: How come?\r\nA: You know, bablos can fund Python sprints.\r\n\r\nQ: Didn't even think about it. Anything else?\r\nA: Bablos can help homeless.\r\n\r\nQ: Ha-ha. Windows users have HOME directory.\r\nA: It is not funny. I am homeless.\r\n\r\nQ: Maybe I am too.\r\nA: You can help me.\r\n\r\nQ: Why should I.\r\nA: Because you want to master bablos. It is a fair deal.\r\n\r\nQ: I don't need bablos.\r\nA: Say it in Russian.\r\n\r\nQ: And what will happen?\r\nA: You become homeless.\r\n\r\nQ: Is it a threat?\r\nA: No, it is how bablos work. To own a home, you need bablos.\r\n\r\nQ: I see. Now here are your high ideals, religions, open source?\r\nA: Everything is included, and that's already in 0.00008\r\n\r\n...\r\n\r\n\r\nBablos for \"Bubble OS\" economic model.\r\nAchievents loop.\r\nSplit between projects.\r\nHave a limit per feature.\r\nBablos over limit pumps to upper streams of supported projects.",
    "description_content_type": null,
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "",
    "license": "Public Domain",
    "maintainer": "",
    "maintainer_email": "",
    "name": "bablos",
    "package_url": "https://pypi.org/project/bablos/",
    "platform": "",
    "project_url": "https://pypi.org/project/bablos/",
    "project_urls": null,
    "release_url": "https://pypi.org/project/bablos/0.00008/",
    "requires_dist": null,
    "requires_python": null,
    "summary": "Bubble OS -- Operating System for Real Life (tm)",
    "version": "0.00008",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 872164,
  "releases": {
    "0.00008": []
  },
  "urls": [],
  "vulnerabilities": []
}