{
  "info": {
    "author": "",
    "author_email": "Lukas Gessl <lukas.gessl@icloud.com>",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# batches_n_more\n\nUnfortunately, PyPI cannot render some $\\LaTeX$ instructions in this Markdown file properly. We suggest downloading the package, opening this `README.md` in VS Code and switching to the preview via <kbd>⇧ ⌘ V</kbd> (Mac) or <kbd>CTRL ⇧ V</kbd> (Unix, Windows) for a proper display.\n\n## What can `batches_n_more` do?\n\nDue to technical limitations of the GC/LC-MS platform, studies conducted on a large number of samples often need to be processed in multiple batches. The main variation in the resulting data does not come from biological variation, but can simply be explained by the batch affiliation of every single sample.\n\nTo deal with those batch effects, we propose the following pipeline:\n\n1. Find features (i.e. distinct molecules defined by retention time $t$ and mass-to-charge ratio $m$) and align them into a so-called feature table, also called peak table; e.g., every row may correspond with a feature and every column with a sample. **Do this for every batch separately** with established state-of-the-art software like [`xcms`](http://www.bioconductor.org/packages/release/bioc/html/xcms.html) or [`MZMine 2`](https://bmcbioinformatics.biomedcentral.com/articles/10.1186/1471-2105-11-395).\n\nSince step 1 requires a lot of knowledge on chemistry and technical characteristics of the GC/LC-MS platform, we suggest this be done by people that are really familiar with these topics: the chemists and bioanalytics in labs, not data scientists.\n\nThe following two steps is where this package steps in:\n\n2. Align multiple feature tables from different batches originating from the same experiment into one peak table. Difficulties we will almost certainly face here are shifts in retention time and mass-to-charge ratio for the same feature between different batches. \n\n3. Moreover, the mass spectrometer's sensitivity may vary from batch to batch; this is the main source for batch effects in the aligned peak table (apart from a poor alignment in step 2). Fight these batch effects, i.e. technically caused variability, while retaining biological variability between samples.\n\nThis means, after applying this package, you end up with a peak table comprising samples from all batches with little or no batch effect.\n\n## Theoretical background on our methods\n\n### Retention-time and mass-to-charge ratio shifts\n\nOur correction method is based on so-called *anchors*. Anchors are sets of features we can uniquely identify with each other. \n\nIn more detail: We begin by fixing a maximum retention-time and mass-to-charge ratio difference we are ready to tolerate for the same feature in different batches. These two numbers, called $\\delta_{t}$ and $\\delta_{m}$, heavily depend on your GC/LC-MS platform; you can inquire them from the colleagues in the lab. Note that you will always have to use the same units as in your initial feature tables for these two variables -- `batches_n_more` doesn't care about units. Let $N_b$ be the number of batches that our experiment comprises.\n\nWe build a network to find anchors: We draw a link between two features *from different batches* if they are *acceptable* for each other; *acceptable* again means that both retention times *and* mass-to-charge ratios lie within $\\delta_{t}$ and $\\delta_{m}$, respectively. We now want find all *isolated cliques* in this network that comprise as many features as we have batches, i.e., with exactly one feature per batch. In a network, \n\n* we call a subset of nodes *isolated* if every node in this subset is only linked to nodes that are also part of this subset -- quite a telling name. \n* Meanwhile, a *clique* is a subset of nodes from a network where every node of this subset is linked to any other node of this subset.\n\nConsequently, an *anchor* is a subset with $N_b$ features where every feature possesses exactly one acceptible feature per batch. For an *anchor*, we can be quite sure that our alignment is correct because we lack other alternatives to align the features in an *anchor* differently.\n\nWe want identical features to have identical retention times and mass-to-charge ratios. For *anchors*, we can easily infer retention-time shifts: Consider an *anchor* comprising $N_b$ features with retention times $t_i, i = 1, ..., N_b$, and plot $t_i$ versus $t_1$ for every $i = 1, ..., N_b$. Doing this for every anchor we have found, produces $N_b$ plots. In a perfect world without retention-time shifts between batches, all plots would display an identity line whereas in the real world the points in every plots hover around the identity line. For the $i$-th plot, $i = 1, ..., N_b$, we interpolate the points with a two-times differentiable cubic spline $s_i$. Now, for *every* retention time $t$ from a feature in feature table $i$, $s_i(t)$ is the retention time we would have seen for this feature if it had been processed in batch $1$. Therefore, we correct $t$ by simply replacing it with $s_i(t)$.\n\nFor mass-to-charge ratios we apply the same procedure analogously.\n\nAfter doing so, we still have $N_b$ separate feature tables, but we now have good reason to trust retention times and mass-to-charge ratios of all features: we have made them comparable.\n\n### Aligning separate feature tables into one feature table\n\nThe approach we empower in this step is largely inspired by `BiPACE` as introduced in [Hoffmann, N., Keck, M., Neuweger, H. et al. Combining peak- and chromatogram-based retention time alignment algorithms for multiple chromatography-mass spectrometry datasets. BMC Bioinformatics 13, 214 (2012)](https://doi.org/10.1186/1471-2105-13-214).\n\nFirst, we need a measure of similarity for every pair of two features $f_1 = (t_1, m_1), f_2 = (t_2, m_2)$, where $t_i, m_i, i = 1, 2$, are retention times and mass-to-charge ratios, respectively. We now want to find a similarity function $S: (0, \\infty)^2 \\to \\mathbb{R} \\cup \\{ -\\infty \\}$ that indicates a higher degree of similarity between two features with a higher output. Moreover, it should yield $- \\infty$ if\n\n* $f_1$ and $f_2$ originate from the same batch (obviously, we don't want to align features from the same batch) or\n* $| t_1 - t_2 | \\geq \\delta_{t}$ or $| m_1 - m_2 | \\geq \\delta_{m}$ (for technical reasons, we expect retention times and mass-to-charge ratios to deviate no more than our initially defined tolerances).\n\nIn all other cases, one might e.g. define $S$ to be\n\n$$\nS(f_1, f_2) = \\frac{\\delta_t - | t_1 - t_2 |}{\\delta_t} \\exp \\left ( - \\frac{(m_1 - m_2)^2}{2 \\delta_m^2} \\right ) \\in (0, 1].\n$$\n\nHere, we weight deviations in retention time just linearly while we punish deviations in mass-to-charge ratio exponentially. This reflects the fact that mass-to-charge ratios are typically more stable between multiple batches.\n\nBased on the similarity score we obtain from $S$, we can define batch-wise nearest neighbors for every feature in one of our original separate feature tables. More precisely, let $f$ be a feature from the $i$-th feature table, $i = 1, ..., N_b$. Then for $j = 1, ..., N_b, j \\neq i$, we define $f$'s *nearest neigbor in batch $j$* to be the feature in batch $j$ with maximal similarity score among all features in batch $j$. Mathematically speaking, if $F_j$ is the set of all features from batch $j$, we have\n\n$$\nn_j(f) = \\argmax_{g \\in F_j} S(f, g).\n$$\n\nAgain we want to build a network: Let $f_i, f_j$ be features from batch $i$ and $j$, respectively, with $i, j \\in \\{ 1, ..., N_b \\}, i \\neq j$. We connect two features $f_i, f_j$ in this network if and only if there is a *bidirectional best hit (BBH)* between $f_i$ and $f_j$. There is a *bidirectional best hit* between between $f_i$ and $f_j$ if $f_j$ is $f_i$'s nearest neighbor in batch $j$ *and vice-versa*. Demanding this best hit be bidirectional is crucial because a lot of naive approaches for alignment suffer from asymmetry, i.e., they treat one batch favorably.\n\nOnce we have built this network, we want to find all *maximal* cliques of size at least $k$, where we can choose $k \\in \\mathbb{N}, 2 \\leq k \\leq N_b$. A *maximal* clique is a clique which cannot be extended by another node withot losing the property of being a clique. In our case, such a maximal clique comprises $\\ell$ features from $\\ell$ different batches where every pair is a bidirectional best hit, $k \\leq \\ell \\leq N_b$ and we cannot find another feature in one of the remaining batches that is a bidirectional best hit for *all* features already present in this maximal clique.\n\nBasically, we now want to align the features in every maximal clique of size $k \\leq \\ell \\leq N_b$ into one feature in our final feature table. For cliques of size strictly less than $N_b$, there will be samples in the final feature table (namely those from batches that are not represented by a feature in the clique) for which we don't have abundances; in these cases, we set them to be zero. Unfortunately, there is one little conflict remaining: One and the same feature can come up in more than one clique. Including them all into our final feature table would mean including one and the same feature several times -- a bad idea. For that reason, we start with aligning features from cliques without conflicts and we then mediate such conflicts.\n\nTo do so, we assess a clique $C = \\{ f_i : i = 1, ..., \\ell \\}, k \\leq \\ell \\leq N_b$, with features $f_i$ by assigning a goodness score\n\n$$\nG(C) = \\sum_{\\substack{f, g \\in C\\\\ f \\neq g}} S(f, g).\n$$\n\nWe want larger cliques to be considered better; that's why we do not average over similarity scores in the above equation.\n\nWe then sort all cliques involved in a conflict by their goodness score in decreasing order. One strategy can now be:\n\n* Start with the first clique in the ordered list and look up the features in it.\n* Remove all cliques conflicting with the first clique, i.e. cliques that comprise one of the features in the first clique, from the list.\n* Go to the next (remaining) clique in the list and repeat the procedure.\n\nWe end up with a set of non-conflicting cliques. We go through this set clique by clique and align the features from every clique into one feature; as a retention time and mass-to-charge ratio we take the mean over all retention times and mass-to-charge ratios of features in the clique, respectively.\n\n\n### Correct batch effects\n\nSo far, we haven't changed at all the values, i.e. the abundances, in the feature tables; instead, we have only rearranged them. This changes in the last step where we want to get rid of batch effects in the aligned feature table. Let $A \\in \\mathbb{R}^{N_f \\times N_s}$ be our aligned feature table with $N_f$ the number of features in it. To this end, `batches_n_more` provides two options.\n\n#### Batch-wise fold changes via quality-control samples\n\nFor this method, we empower so-called quality-control samples (QCs) that are typically included in every batch of an experiment. Each QC is exactly the same substance measured as several samples in every batch. As a result, if there weren't batch effects, each feature would have exactly the same abundance in every QC. On the other hand, we can use the differences between QCs to infer systematic, technically caused differences between batches as follows.\n\n1. For every batch $i, i = 1, ..., N_b$, calculate abundance medians feature-wise. That means we obtain median vectors $m_1, ..., m_{N_b} \\in \\mathbb{R}^{N_f}$.\n2. Analyze median fold changes with batch $1$ as a reference: for $j = 1, ..., N_b$, calculate $f_j = m_1 / m_j \\in \\mathbb{R}^{N_f}$ element-wise.\n3. Correct the aligned feature table to have all abundances expressed at the level of batch $1$: replace every sample in the aligned feature table, i.e. column vector, say $c \\in \\mathbb{R}^{N_f}$, belonging to the $j$-th batch with $c \\cdot f_j$ element-wise. Do this for every $j = 1, ..., N_b$.\n\n#### Principal-component analysis (PCA) and linear models\n\nThis second approach helps you two-fold: As the above heading promises, it corrects for batch effects. Additionally, it determines whether there any batch effects in the aligned feature table. Consequently, you can first apply the above approach to correct batch effects and then apply this approach to determine whether it was successful. This approach is largely taken from [Nyamundanda, G., Poudel, P., Patil, Y. et al. A Novel Statistical Method to Diagnose, Quantify and Correct Batch Effects in Genomic Studies. Sci Rep 7, 10849 (2017)](https://doi.org/10.1038/s41598-017-11110-6) and comprises these steps:\n\n1. Choose some $N_{PC} \\in \\mathbb{N}, 1 \\leq N_{PC} \\ll N_f$, and project the columns of $A$ down to their first $N_{PC}$ principal components (PCs). This results in $A_0 \\in \\mathbb{R}^{N_{PC} \\times N_s}$.\n2. Try to predict PCs from just batch affiliation: Let $B \\in \\mathbb{R}^{N_s \\times N_b}$ represent batch affiliation, i.e., \n   $$\n   B_{i, \\ell} = \\begin{cases} 1 & \\text{if sample $i$ is in batch $\\ell$ or $\\ell = N_b$},\\\\ 0 & \\text{else}. \\end{cases}\n   $$\n   That means we don't explicitly encode belonging to batch $N_b$ since it implicitly follows from not being part of batch $1, ..., N_b - 1$ and instead use the last column of $B$ for an intercept term in the linear model. We now fit $N_{PC}$ linear models via ordinary least-squares regression and end up with regression coefficients $C \\in \\mathbb{R}^{N_b \\times N_{PC}}$ and residuals $\\epsilon \\in \\mathbb{R}^{N_s, N_{PC}}$ to predict\n   $$\n   A_0^T = B C + \\epsilon\n   $$\n   Keep in mind that the regression coefficients $C_{i, \\ell}, i = 1, ..., N_b -1, \\ell = 1, ..., N_{PC}$ express the difference in PC $\\ell$ when belonging to batch $i$ instead of batch $N_b$. That means batch $N_b$ is the baseline level in our linear model.\n3. *For coefficients that predict PCs well*, calculate the batch effect in the pricipal subspace, transform it back to original space and subtract it from $A$: To determine whether the linear models do a good job, we have a look at the p-test statistics for the regression coeffcients in $c$. We calculate them under the null hypothesis that there is no link between batch affiliation and the PC. We select a threshold $t_p \\in (0, 1)$ and modify $C$ into $C_0$ as follows:\n   $$\n   (C_0)_{i, \\ell} = \\begin{cases} 0 & \\text{if corresponding p-test statistic is above $t_p$ or $i = N_b$},\\\\ C_{i, l} & \\text{else}. \\end{cases}\n   $$\n   Calculate the batch effects in the subspace of the first $n_{PC}$ PCs via\n   $$\n   A_1^T = B C_0\n   $$\n   and perform a PCA-reverse transform of $A_1$, which yields $A_2 \\in \\mathbb{R}^{N_f \\times N_s}$, the batch effects in the orginal space. Finally,\n   $$\n   A - A_2\n   $$\n   is our feature table without batch effects.\n\n`batches_n_more` will report the p-test statistics for the regression coefficients in $C$. There are no batch effects on the data according to the ordinary linear model if and only if all p-test statistics are insignificant.\n\n## How to use `batches_n_more`\n\n`batches_n_more` not only implements the above approach in an easy-to-use manner. It also provides routines for file input and output as well as for often-needed visualizations such as 2-dimensional PCA plots, plots of retention time shifts or heatmaps of pairwise correlations between samples.\n\n### A detailed code example\n\nWe start by reading the feature tables of three batches of the same experiment. Each feature table is stored as an Excel `.xlsx` file; we are interested in the second sheet of every file called `inputR` where we have features in the rows and samples in the columns. The first row holds sample names, and the first column holds information on the features and is of the form `mz:73.52864_rt:0.97619`.\n\n```python\nimport batches_n_more as bnm\n\ndir = \"data/example/\"\nfiles = [\"First_batch.xlsx\", \"Second_batch.xlsx\", \"Third_batch.xlsx\"]\nPt_list = []\nfor i, filename in enumerate(files):\n    filepath = dir + filename\n    Pt = bnm.read_pt_excel(\n        filepath,\n        sheet_name = [\"inputR\"], # if all feature tables are in the same file as several sheets,\n        # you only need to specify them all in a list \n        rt_ident = \"rt:\",\n        mz_ident = \"mz:\",\n        qc_ident = None # here, all samples are QC samples\n    )\n    # plot histogram of retention times to get an idea of their distribution.\n    # for our retention-time and mass-to-charge ratio correction approach it's\n    # best to have them as uniformly as possible distributed\n    Pt[0].rt_hist(\"results/mz_rt_histograms/rt_batch\" + str(i) + \".pdf\")\n    Pt[0].mz_hist(\"results/mz_rt_histograms/mz_batch\" + str(i) + \".pdf\")\n    Pt_list += Pt\n```\n\nOutput:\n\n```\ndata/example/First_batch.xlsx | shape: (1113, 9)\ndata/example/Second_batch.xlsx | shape: (1114, 5)\ndata/example/Third_batch.xlsx | shape: (1417, 13)\n```\n\nReading the data is probably the nastiest part of using `batches_n_more` because there are many ways to store feature tables, but let's go through it: `batches_n_more.read_pt_excel()` expects samples as columns; retention-time as well as mass-to-charge ratio identifiers need to be in the first column and sample names (possibly with a QC identifier) in the first row. For details have a look at the documentation: `help(bnm.read_pt_excel)`. This is a format you easily get from `MZMine 2`. If you don't have data in the desired format, you may consider manipulating it first: directly in Excel or -- if there are more files or there is more to do -- with a little program written in Python or R, e.g.\n\n`batches_n_more.read_pt_excel()` returns a list of `Peaktable`s, the basic class of `batches_n_more`, which stores, manipulates and visualizes feature tables. Next we will put them into an instance of the `Peaktable_align` class, which basically holds multiple feature tables and does all of the work related to alignment.\n\n```python\nPt_align = Peaktable_align(\n    Pt_list,\n    mz_tol = 0.003, # \\delta_m in the above section, for the GC-MS platform in this example: 0.003 [millidalton]\n    rt_tol = 0.25 # \\delta_t in the above section, here: 0.25 [minutes]\n)\n```\n\n$\\delta_m$ = `mz_tol` and $\\delta_t$ = `rt_tol` are all we need to well-define the search for anchors, so we proceed with correcting shifts in retention time and mass-to-charge ratio.\n\n```python\nPt_align.find_anchors()\nfor mz_or_rt in [\"mz\", \"rt\"]:\n    Pt_align.plot_shift(mz_or_rt, filepath = \"results/\" + mz_or_rt + \"_shift.pdf\")\nPt_align.interpolate()\nPt_align.correct_mz_rt()\n```\n\nOutput:\n\n```\nFound 459 mz anchors and 310 rt anchors\n```\n\nContinue with aligning the three feature tables and do some first analysis concerning batch effects.\n\n```python\nPt_aligned = Pt_align.align(k_min = 2, mediator = \"caesar\")\n# mediator \"caesar\" for conflicts between samples is intoduced in \"Theoretical background on methods\".\n# mediator \"solon\" is more concerned with common good and less aggressive\nPt_aligned.plot_pca_2d(filepath = \"results/pca_after_align.pdf\") # plot unveils heavy batch effects\nPt_aligned.correlation_heatmap(\"results/corr_after_align.pdf\")\n# a troughout high correlation suggests batch effects are not that hard to tackle: \n# there is a simple linear link\n```\n\nOutput:\n\n```\n\nOverview on clique sizes BEFORE removing duplicates\n   size 2  size 3  total\n#     342     712   1054\nOverview on clique sizes AFTER removing duplicates\n   size 2  size 3  total\n#     328     712   1040\nAligned peak table has shape (1040, 27)\n```\n\nIn this example, we only lose 14 cliques when we give `\"caesar\"` the *imperium* to mediate conflicts. We barely lose features compared to `First_batch.xlsx` with 1113 features. Finally, we deal with batch effects. We will first apply the method \"Batch-wise fold changes via quality-control samples\" or the `qc_fold_correct` method of `Peaktable` to tackle batch effect. Afterwards we will do some checks with the `batch_correct` method and plots.\n\n```python\nPt_aligned.qc_fold_correct()\nPt_aligned.batch_correct()\nPt_aligned.plot_pca_2d(filepath = \"results/pca_after_batch_correction.pdf\")\nPt_aligned.correlation_heatmap(filepath = \"results/corr_after_batch_correction.pdf\")\n```\n\nOutput:\n```\n\np values for regression coeffcients in batch correction\n(under null hypothesis that there is no link between batch and PC):\n     batch 2 vs. 0  batch 2 vs. 1  batch 2 vs. 2\nPC1            1.0            1.0            1.0\nPC2            1.0            1.0            1.0\nPC3            1.0            1.0            1.0\n```\n\n`Peaktable.batch_correct` reveals no more batch effects: all regression coefficients are totally plausible under the assumption that there is no link between batch affiliation and PCs, meaning we cannot predict PCs from batch affilliation via a linear model. As a result, `Peaktable.batch_correct` does not step in and does not manipulate the data at all. Unlike in the previous PCA plot, in the current one there no more batch-wise clusters visible. The correlation heatmap reveals even stronger correlation between all samples. For its part, `batches_n_more` is done, so we can store the aligned feature table.\n\n```python\nPt_aligned.write_excel(\"results/aligned.xlsx\")\n```\n\n### A code example that uses wrappers\n\nThe above example is important to understand the single steps `batches_n_more` takes in aligning feature tables and battling batch effects and it reveals the structure of `batches_n_more`. Yet, in a use case, you would always leave certain parts of the above example unchanged. This is where two wrappers of `batches_n_more` get interesting, they condense several lines of the above code into one line and one command.\n\n* `Peaktable_align.align_wrapper()` takes the entire step 2 in the above section \"What `batches_n_more` can do\": find anchors, interpolate shifts in retention time and mass-to-charge ratio, correct them and actually align multiple batches into one feature table.\n* `Peaktable.batch_correct_wrapper()` takes the entire step 3 in \"What `batches_n_more` can do\": first apply qc_fold_correct(), then batch_correct() looks for batch effects on the resulting feature table and, if it finds batch effects, corrects them.\n\n```python\n# loading data must remain rather lengthy: it is highly individual for each data set\ndir = \"data/example/\"\nfiles = [\"First_batch.xlsx\", \"Second_batch.xlsx\", \"Third_batch.xlsx\"]\nPt_list = []\nfor i, filename in enumerate(files):\n    filepath = dir + filename\n    Pt = read_pt_excel(\n        filepath,\n        sheet_name = [\"inputR\"],\n        rt_ident = \"rt:\",\n        mz_ident = \"mz:\",\n        qc_ident = None\n    )\n    Pt_list += Pt\n\nPt_align = Peaktable_align(\n    Pt_list,\n    mz_tol = 0.003,\n    rt_tol = 0.25\n)\n\n# from this line forward, wrappers step in\nPt_aligned = Pt_align.align_wrapper(\n    k_min = 2,\n    mediator = \"caesar\",\n    plot_dir = \"results\"\n    )\nPt_aligned.batch_correct_wrapper(\n    n_pcs = 3,\n    significance_threshold = 0.05,\n    plot_dir = \"results\"\n    )\n\nPt_aligned.write_excel(\"results/aligned.xlsx\")\n```\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "batches-n-more",
    "package_url": "https://pypi.org/project/batches-n-more/",
    "platform": null,
    "project_url": "https://pypi.org/project/batches-n-more/",
    "project_urls": null,
    "release_url": "https://pypi.org/project/batches-n-more/1.0.0/",
    "requires_dist": [
      "numpy (>=1.21.1)",
      "scipy (>=1.7.0)",
      "scikit-learn (>=0.24.2)",
      "pandas (>=1.3.1)",
      "typing-extensions (>=4.3.0)",
      "plotnine (>=0.8.0)",
      "networkx (>=2.6.2)",
      "openpyxl (>=3.0.10)"
    ],
    "requires_python": ">=3.9",
    "summary": "Align feature tables from multiple GC/LC-MS batches into one feature table and correct for batch effects",
    "version": "1.0.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 15651684,
  "releases": {
    "0.1.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "09b7fcca0d18542c0c3250d770e8fdce0c7060f23856625a5161a28dcb39f453",
          "md5": "149d98a18c9eb67c3182bb9b16f314f2",
          "sha256": "a92c06764bd14b0f0b117b9c0b375caa31409c4ea43d92ceb4d7955771660b6d"
        },
        "downloads": -1,
        "filename": "batches_n_more-0.1.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "149d98a18c9eb67c3182bb9b16f314f2",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.9",
        "size": 29881,
        "upload_time": "2022-09-28T15:12:36",
        "upload_time_iso_8601": "2022-09-28T15:12:36.061880Z",
        "url": "https://files.pythonhosted.org/packages/09/b7/fcca0d18542c0c3250d770e8fdce0c7060f23856625a5161a28dcb39f453/batches_n_more-0.1.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "cbf6ddfd226a2097ccc723afd436e9dbdb215774ea4ece2e06a207cd2ceb7d83",
          "md5": "9725214c0f07d276550b4eafafc428bc",
          "sha256": "22169a8de290e73d777766a839f9e6d1debfdb6deb9df53bc822d096eba924c4"
        },
        "downloads": -1,
        "filename": "batches_n_more-0.1.4.tar.gz",
        "has_sig": false,
        "md5_digest": "9725214c0f07d276550b4eafafc428bc",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.9",
        "size": 763764,
        "upload_time": "2022-09-28T15:12:38",
        "upload_time_iso_8601": "2022-09-28T15:12:38.377632Z",
        "url": "https://files.pythonhosted.org/packages/cb/f6/ddfd226a2097ccc723afd436e9dbdb215774ea4ece2e06a207cd2ceb7d83/batches_n_more-0.1.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f2380c17136cfe146c0f88216f25e99115e3aecb39815fe83720730a3f0e1292",
          "md5": "c8430f18d83b0b6dc6e75eedf0f77ed1",
          "sha256": "43e658435f0eab9598d5bf0cd1fc45a51fe06b8d08f046840e741f72e93b4971"
        },
        "downloads": -1,
        "filename": "batches_n_more-0.1.5-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "c8430f18d83b0b6dc6e75eedf0f77ed1",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.9",
        "size": 29960,
        "upload_time": "2022-09-29T07:40:17",
        "upload_time_iso_8601": "2022-09-29T07:40:17.153285Z",
        "url": "https://files.pythonhosted.org/packages/f2/38/0c17136cfe146c0f88216f25e99115e3aecb39815fe83720730a3f0e1292/batches_n_more-0.1.5-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2c38d211cd848b4bc2ad59754dc3f0d42940fb0e405694fcf490b1bad7d81737",
          "md5": "1b634b73f2482a67411ff670c23694cf",
          "sha256": "bf288117e624faa5ad39295e74e82035474fde474886f6b11cf911b9e314cad0"
        },
        "downloads": -1,
        "filename": "batches_n_more-0.1.5.tar.gz",
        "has_sig": false,
        "md5_digest": "1b634b73f2482a67411ff670c23694cf",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.9",
        "size": 763977,
        "upload_time": "2022-09-29T07:40:20",
        "upload_time_iso_8601": "2022-09-29T07:40:20.022589Z",
        "url": "https://files.pythonhosted.org/packages/2c/38/d211cd848b4bc2ad59754dc3f0d42940fb0e405694fcf490b1bad7d81737/batches_n_more-0.1.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a7cc62932be2dd0656756145246b055d11bf11864d79db9ec04e931ca32cdaf3",
          "md5": "97ab2e2b2372f8da8af6e8a2f3dad22f",
          "sha256": "c8a9b164ea930a5e8cc53b44936acad68728220badf74aa5517636919e365c27"
        },
        "downloads": -1,
        "filename": "batches_n_more-0.2.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "97ab2e2b2372f8da8af6e8a2f3dad22f",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.9",
        "size": 30112,
        "upload_time": "2022-11-03T10:20:44",
        "upload_time_iso_8601": "2022-11-03T10:20:44.613482Z",
        "url": "https://files.pythonhosted.org/packages/a7/cc/62932be2dd0656756145246b055d11bf11864d79db9ec04e931ca32cdaf3/batches_n_more-0.2.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d0af53d88dda1d5f08028192d1f4da9d5591a68371fd8a4fa4c3decfa3714373",
          "md5": "41dfb5d4301ba44bb3030a0f8f131730",
          "sha256": "276ac27a327bdb1af7bd791c9ffcab75d381e6d460d9ffe0c143f0a2f54712a7"
        },
        "downloads": -1,
        "filename": "batches_n_more-0.2.0.tar.gz",
        "has_sig": false,
        "md5_digest": "41dfb5d4301ba44bb3030a0f8f131730",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.9",
        "size": 765057,
        "upload_time": "2022-11-03T10:20:47",
        "upload_time_iso_8601": "2022-11-03T10:20:47.242984Z",
        "url": "https://files.pythonhosted.org/packages/d0/af/53d88dda1d5f08028192d1f4da9d5591a68371fd8a4fa4c3decfa3714373/batches_n_more-0.2.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "73116247b8c239bdf8d10a232a1345981ddf1b128ecb1809177c2cb0bb3b2338",
          "md5": "79f572ef6a12ca428ea09274d9009746",
          "sha256": "d6a738b4353238f27da929bacb5e6add877cec4351b65ffc216f65eeb7463710"
        },
        "downloads": -1,
        "filename": "batches_n_more-0.2.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "79f572ef6a12ca428ea09274d9009746",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.9",
        "size": 30185,
        "upload_time": "2022-11-03T12:40:04",
        "upload_time_iso_8601": "2022-11-03T12:40:04.872790Z",
        "url": "https://files.pythonhosted.org/packages/73/11/6247b8c239bdf8d10a232a1345981ddf1b128ecb1809177c2cb0bb3b2338/batches_n_more-0.2.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c75fcccc577d9390d74fac55fa24823db24395fa4a8d14aaa67c06b809f341d1",
          "md5": "382008180fbb23c1f0ac0fd03a736e83",
          "sha256": "e43b12a32b543c9389c06682356b1e71d0417bc197cbb6458d6155e68278d665"
        },
        "downloads": -1,
        "filename": "batches_n_more-0.2.1.tar.gz",
        "has_sig": false,
        "md5_digest": "382008180fbb23c1f0ac0fd03a736e83",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.9",
        "size": 765038,
        "upload_time": "2022-11-03T12:40:06",
        "upload_time_iso_8601": "2022-11-03T12:40:06.861492Z",
        "url": "https://files.pythonhosted.org/packages/c7/5f/cccc577d9390d74fac55fa24823db24395fa4a8d14aaa67c06b809f341d1/batches_n_more-0.2.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ae443c6e8dc6f4f3e0bf9c8659adbc67c39a98e3d9320f9fa579af006fd0674d",
          "md5": "55bee9009c370f4c7e355da1c456e6cd",
          "sha256": "408e96c0f861712d3a4d8d7742feedf1b1b9ec48e6be4323a9a252b80a9a3e8b"
        },
        "downloads": -1,
        "filename": "batches_n_more-0.2.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "55bee9009c370f4c7e355da1c456e6cd",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.9",
        "size": 30186,
        "upload_time": "2022-11-03T14:34:27",
        "upload_time_iso_8601": "2022-11-03T14:34:27.045467Z",
        "url": "https://files.pythonhosted.org/packages/ae/44/3c6e8dc6f4f3e0bf9c8659adbc67c39a98e3d9320f9fa579af006fd0674d/batches_n_more-0.2.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "bde2018496c7f7bc1383cb2def291f72c01d26d85f1cd869356ce5ca3c068e9c",
          "md5": "66ea3815a9b635dbaa1b42ce6127d237",
          "sha256": "c57f935bdd086ea8e833024f3c0fdaae0c82d3985f7269164ad746ac6ec90b96"
        },
        "downloads": -1,
        "filename": "batches_n_more-0.2.2.tar.gz",
        "has_sig": false,
        "md5_digest": "66ea3815a9b635dbaa1b42ce6127d237",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.9",
        "size": 765039,
        "upload_time": "2022-11-03T14:34:29",
        "upload_time_iso_8601": "2022-11-03T14:34:29.032057Z",
        "url": "https://files.pythonhosted.org/packages/bd/e2/018496c7f7bc1383cb2def291f72c01d26d85f1cd869356ce5ca3c068e9c/batches_n_more-0.2.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "bed98766d2f24f8e4ec486495b701851f17a0f74d22c746e422ce06b2f06bc19",
          "md5": "4db4384d0c0693cbc5e21db865a6ae3c",
          "sha256": "85a4ddac494dfabf7a35cbc85e9a900261aa5b415a8178129478779f88e11df0"
        },
        "downloads": -1,
        "filename": "batches_n_more-0.2.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "4db4384d0c0693cbc5e21db865a6ae3c",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.9",
        "size": 30199,
        "upload_time": "2022-11-03T15:01:16",
        "upload_time_iso_8601": "2022-11-03T15:01:16.385399Z",
        "url": "https://files.pythonhosted.org/packages/be/d9/8766d2f24f8e4ec486495b701851f17a0f74d22c746e422ce06b2f06bc19/batches_n_more-0.2.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2a20509745618b84e226620c7c40e289abdbc06a6364306c3f0987ce7aba48b4",
          "md5": "55f10ed57a1d0d7a66b4229ad2493f05",
          "sha256": "1d4abcb4e17d727275f4832d1e4ab2943dbb4ae7be9e688c9f874c265d5a24d2"
        },
        "downloads": -1,
        "filename": "batches_n_more-0.2.3.tar.gz",
        "has_sig": false,
        "md5_digest": "55f10ed57a1d0d7a66b4229ad2493f05",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.9",
        "size": 765034,
        "upload_time": "2022-11-03T15:01:18",
        "upload_time_iso_8601": "2022-11-03T15:01:18.787506Z",
        "url": "https://files.pythonhosted.org/packages/2a/20/509745618b84e226620c7c40e289abdbc06a6364306c3f0987ce7aba48b4/batches_n_more-0.2.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b667ac332173c93edef5d7bc14a6bc59c5091b7be4764cd8c38d8eb0e2b508e3",
          "md5": "b19b53b7dd1a1b538c7765d8ba9dc214",
          "sha256": "a5ee403dcfdf0c714e046e322dcd99c88cc09a3ebf338ff708ce2af8f96443a3"
        },
        "downloads": -1,
        "filename": "batches_n_more-1.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "b19b53b7dd1a1b538c7765d8ba9dc214",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.9",
        "size": 30280,
        "upload_time": "2022-11-04T08:25:49",
        "upload_time_iso_8601": "2022-11-04T08:25:49.968544Z",
        "url": "https://files.pythonhosted.org/packages/b6/67/ac332173c93edef5d7bc14a6bc59c5091b7be4764cd8c38d8eb0e2b508e3/batches_n_more-1.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ddb74d1591a9b58f71282c50236a8f8c9b84fadfb327b8f414410255eaddfb7c",
          "md5": "aeb34ff6bc55d7daf721715190b8a29b",
          "sha256": "e5b351f3fb3418966455e41aed603dffb32ebad0e70c6bc7a7c3dfbec70e943b"
        },
        "downloads": -1,
        "filename": "batches_n_more-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "aeb34ff6bc55d7daf721715190b8a29b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.9",
        "size": 765149,
        "upload_time": "2022-11-04T08:25:52",
        "upload_time_iso_8601": "2022-11-04T08:25:52.121558Z",
        "url": "https://files.pythonhosted.org/packages/dd/b7/4d1591a9b58f71282c50236a8f8c9b84fadfb327b8f414410255eaddfb7c/batches_n_more-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "b667ac332173c93edef5d7bc14a6bc59c5091b7be4764cd8c38d8eb0e2b508e3",
        "md5": "b19b53b7dd1a1b538c7765d8ba9dc214",
        "sha256": "a5ee403dcfdf0c714e046e322dcd99c88cc09a3ebf338ff708ce2af8f96443a3"
      },
      "downloads": -1,
      "filename": "batches_n_more-1.0.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "b19b53b7dd1a1b538c7765d8ba9dc214",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.9",
      "size": 30280,
      "upload_time": "2022-11-04T08:25:49",
      "upload_time_iso_8601": "2022-11-04T08:25:49.968544Z",
      "url": "https://files.pythonhosted.org/packages/b6/67/ac332173c93edef5d7bc14a6bc59c5091b7be4764cd8c38d8eb0e2b508e3/batches_n_more-1.0.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "ddb74d1591a9b58f71282c50236a8f8c9b84fadfb327b8f414410255eaddfb7c",
        "md5": "aeb34ff6bc55d7daf721715190b8a29b",
        "sha256": "e5b351f3fb3418966455e41aed603dffb32ebad0e70c6bc7a7c3dfbec70e943b"
      },
      "downloads": -1,
      "filename": "batches_n_more-1.0.0.tar.gz",
      "has_sig": false,
      "md5_digest": "aeb34ff6bc55d7daf721715190b8a29b",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.9",
      "size": 765149,
      "upload_time": "2022-11-04T08:25:52",
      "upload_time_iso_8601": "2022-11-04T08:25:52.121558Z",
      "url": "https://files.pythonhosted.org/packages/dd/b7/4d1591a9b58f71282c50236a8f8c9b84fadfb327b8f414410255eaddfb7c/batches_n_more-1.0.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}