{
  "info": {
    "author": "",
    "author_email": "bcj <bcj@beocijies.com>",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 4 - Beta",
      "Environment :: Console",
      "Intended Audience :: Developers",
      "Operating System :: POSIX",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.10",
      "Programming Language :: Python :: 3.11",
      "Programming Language :: Python :: 3.8",
      "Programming Language :: Python :: 3.9",
      "Topic :: Internet",
      "Topic :: Internet :: WWW/HTTP",
      "Topic :: Internet :: WWW/HTTP :: Site Management",
      "Topic :: Utilities",
      "Typing :: Typed"
    ],
    "description": "# Beocijies\n\nBeocijies is a project for hosting tiny hand-written webpages for your friends.\n\nQuick Links:\n* [Install](#install)\n* [Prerequisites](#what-youll-need)\n* [Creating a beocijies](#creating-your-site)\n* [Adding users](#adding-users)\n  * [Updating users](#updating-users)\n  * [Removing users](#updating-users)\n* [Creating/Updating pages](#rendering-your-site)\n* [Creating/Updating mobile pages](#rendering-on-the-go)\n\n# Install\n\nBeocijies is being written/tested against Python 3.8.\n\nBeocijies is available on PyPI and can be installed by running:\n```sh\npip3 install beocijies\n```\n\nYou may also install it by, downloading this repo and then running:\n```sh\npip3 install .\n```\n\nThis will add a `beocijies` command that is used to set up and update the site.\n\n# Philosophy\n\n[beocijies.com](https://beocijies.com) was, first and foremost, made as an excuse to invite friends over.\nAll other goals for the project are in service of that.\n\nThe idea of beocijies is making personal webpages that are actually personal.\nPages are written by hand, so they're limited in scope and completely made by the user.\nPages are written directly on the computer hosting the site, so the server isn't abstract.\nPages are live-updated, so the process of making a page is made visible.\nPages include an image of the user updating the page, so this process is kept visible after the fact.\nAnd pages are made in coordination with the person who hosts the website, so changes are a social event.\n\nThe idea has since expanded to include 'mobile' pages, in an attempt to replicate the process for those that can't easily travel to the server.\nFiles for the mobile site live on a flash drive, and are added to the site when the host returns home.\n\n# Your own beocijies Site\n\nIf you want to make your own beocijies site for your friends, you should do it!\nYour site doesn't need to follow the same rules as the original beocijies, but it should be made in the same spirit.\nYou should adapt the rules to whatever is the most fun for you and your friends.\n\nSome ideas on how you can set up your site to match your needs:\n* Have people come over and make edits on the server (how beocijies.com works)\n* Have people make their pages on a flash drive you carry around (how m.beocijies.com works)\n* Allow people to create remote pages by sending you postcards with the code on it (Maggie's idea)\n* Have people describe their website to you over the phone, watching the page update as you implement it\n* Have people come over in VR chat and make their website there\n\nAlso, you really don't need to refer to it as a 'beocijies' site.\n'beocijies' is unwieldy and is just a dumb joke based on my name.\nPick something personal to you.\n\n## What you'll need\n\n### A Computer You Can Use as a Server\n\nIf you don't have a computer that's on all the time, that's fine.\nIt's more to the ethos of beocijies to have a site that goes offline than one is hosted remotely (though it would be completely reasonable to put a remote server in front of it that provides a nice error message when your server is offline).\n\nThis code has only been tested on macOS and linux.\nIt should _probably_ work with WSL 2.0 and maybe even normal Windows?\nGood luck.\n\n### Python 3.8 or later\n\nThe code used to create all the configuration files and to render people's pages (see the section on [Jinja](#jinja) for more details) needs at least this recent of Python.\n\nAs long as you're fine manually copying the files over, this actually could be done from a different computer.\n\n### A Web Server\n\nThe code in this repo will create all the required files, but doesn't come with a web-server.\nThis project officially recommends using [NGINX](https://nginx.org/en/), and can automatically generate the configuration file required for hosting your site with NGINX.\n\nThe project also has provisional support for [httpd (Apache)](https://httpd.apache.org/), but it is completely untested and has not been confirmed to work\n\nThe generated templates are all for HTTP, not HTTPS.\nThis is done with the assumption that you'll then use [certbot](https://certbot.eff.org/) to set up SSL certificates for your site.\n\n### A Domain\n\nIf you already have a separate domain, you could host your beocijies pages on a subdomain (e.g., `beocijies.yoursite.com`), or as an address within your site (e.g., `yoursite.com/beocijies`).\n\n#### Intranet sites\n\nIf you just want to run your beocijies site within a local network (e.g., your home/dorm), you can use your computer's network name.\nIf you don't supply a domain when creating a beocijies, it will default to your computer's name.\n\n#### DNS\n\nIf you want each user to have their own subdomain, you'll need to update your DNS records whenever you add a new user.\n\nIf you're ISP doesn't provide you with a static IP address, you'll need to use [Dynamic DNS](https://en.wikipedia.org/wiki/Dynamic_DNS) to point to your server.\nYour domain registrar may offer this as a free service, as might your ISP or even the manufacturer of your router.\n\n## Creating your site\n\nTo create a website, use the `create` command:\n```sh\nbeocijies create DIRECTORY --destination DESTINATION --name NAME --domain DOMAIN\n```\n\nThis will create the configuration for your site in the supplied directory (creating the directory if it doesn't already exist).\nWithin the directory, the following files and directories will be generated:\n* `settings.json`: This contains all the information about your site in a format that is, technically, readable. It is safe to edit this directly, but you generally shouldn't need to.\n* `static`: Any files in this directory will be copied to the site. Any files or folders in a user's subdirectory will be copied to their section of the site. When updating the main page for the site, you should put the update images in the `index` subdirectory.\n* `templates`: This will contain the templates for each user's personal page as well as a few extra files:\n  * `base.html.jinja2`: All of the sites pages 'extend' this page. If you would like to edit how the footer for all the pages look, you'll need to edit this page.\n  * `default.html.jinja2`: When you add a user to this site, their page will be a copy of this page. If you edit this page, it won't affect the pages of any user that already exists.\n  * `index.html.jinja2`: This is the base homepage for your site. Internally, beocijies (mostly) pretends that index is just another user of the site. This means you can adjust some settings for the user using the various user commands.\n\nIt is safe to rerun the `create` command.\nOn rerun, any settings will be updated and any files that don't exist will be created.\nNo existing files in the `static` or `templates` directories will be replaced.\n\nIf you want users to be able to access their pages at `user.yoursite.com` instead of just `yoursite.com/user`, pass the `--subdomains` flag.\nIf you make this change, you'll need to update your web server and your DNS records every time you add a user.\n\n```sh\nbeocijies create DIRECTORY --destination DESTINATION --name NAME --domain DOMAIN --subdomains\n```\n\nIf you want to have beocijies generate an NGINX template for you, use the `--nginx` flag.\nThe script will try to find the server configuration directory NGINX is expecting, but if the directory is in a unexpected location, you'll need to pass the path along with the flag.\n\nIf you plan on hosting your site over http instead of https, pass the `--http` flag.\n\n### Mobile\n\nIf you would like to have a 'mobile' version of the website, pass the `--mobile` flag.\nIf you're setting up a mobile site and plan to have user build their pages on a computer that can run the beocijies script, you should also pass `--test-destination` and supply a location on that removable storage device.\n\nIf you won't (or won't always) having people build their site on a computer with the beocijies script, don't worry.\nThere are [instructions](#rendering-on-the-go) for working around this.\n\n### Web Crawlers\n\nBy default, beocijies creates a [robots.txt](https://en.wikipedia.org/wiki/Robots.txt) file that blocks all web crawlers.\nThis means Google and others won't index your site.\nYou can enable crawling by passing the `--robots` flag.\nAdditionally, you can allow individual crawlers by passing a list of names to `--agents` and/or block individual crawlers by passing a list of names to `--bad-agents`.\n\n## Users\n\nEach user on your website will need their own unique username.\nWhile it's strongly recommended that there are restrictions on when/how a user can create or update their page, you should allow users to change their username, make their page private, or delete their page on request with none of those restrictions.\n\nBecause usernames are included in URLs, it's strongly recommended that you restrict usernames to just include Latin letters, digits, and hyphens.\nUsernames should also be considered case insensitive.\nIf you're not providing subdomains for users, you can be a bit more permissive.\n\nIf a user is public, their name will be included in the `users.json` file made available on your server and other users will be able to link to them.\nIt is recommended that you only put public users in any site directory you create.\n\n### Adding Users\n\nTo add a user, use the `add` command:\n```sh\nbeocijies add NAME\n```\n\nThis command should be run from within your beocijies configuration directory (but can be run from anywhere by passing the `--directory` flag with the path to that directory).\n\nThis command will add the user to your internal users list, create a template for them in your template directory (copied from your default template), and a static file directory for them in your static folder.\nRerunning this command is safe, and will not affect existing files in your static or template directories.\n\nUsers are made private by default, but can be made public using the `--public` flag:\n```sh\nbeocijies add NAME --public\n```\n\n**NOTE**: No Changes will take affect on your site until you [render it](#rendering-your-site).\n\n### Updating Users\n\nIf a user wants to change their public/private status, you should rerun add with/without the `--public` flag.\n\nIf a user wants to change their username, use the rename command:\n```\nbeocijies rename OLD NEW\n```\n\nThis will change their name and move their template and static files to a location matching their new name.\nThis will not edit any references to them on other people's pages (you should use your own discretion in deciding whether those references should be updated manually)\n\n**NOTE**: No Changes will take affect on your site until you [render it](#rendering-your-site).\n\n### Removing Users\n\nIf a user no longer wishes to have a page, you can remove them with the `remove` command:\n```\nbeocijies remove NAME\n```\n\nThis command will only delete their template and static files if you pass the `--delete` command.\n\nTheir page will still be accessible until you delete the rendered files.\nYou can do this by [rendering](#rendering-your-site) with the `--fresh` flag.\n\n### Managing Subdomains\n\nIf you wish to make users pages available at custom subdomains, you will need to make changes to your DNS records and server configuration each time you add or rename a user (and preferably if you remove them).\n\nYou will also need to update your server configuration and generate SSL certificates as necessary.\n\nIf you want beocijies to generate an NGINX template for you, use the `--nginx` flag when running `create`/`add`/`rename`/`remove`.\nThe script will try to find the server configuration directory NGINX is expecting, but if the directory is in a unexpected location, you'll need to pass the path along with the flag.\n\nWhen you run commands with the `--nginx` flag, it will tell you which subdomains need DNS records and the `certbot` command required to update your certificate (this assumes you've already set up a certbot account).\n\n## Rendering Your Site\n\nWhen a user is ready to create/update their website, run the `render` command:\n```sh\nbeocijies render\n```\n\nBy default, the script just updates the page once.\nIf you would like the script to watch for further changes and rerender any time it sees them, pass the `--live` flag:\n```sh\nbeocijies render --live\n```\n\nThis will watch for changes to any page.\nYou can pass any number of users (and/or 'index' for the main page) to just update those pages:\n```sh\nbeocijies render index user1 user2 --live\n```\n\nIf you configured your site with a test destination, that's what the script will default to.\nYou can render to the 'real' destination with the `--production` flag:\n```sh\nbeocijies render --production\n```\n\nIf you didn't supply a test destination in your configuration, you don't need to pass this flag.\n\nOr to a custom destination with the `--destination` flag:\n```sh\nbeocijies render --destination LOCATION\n```\n\nBy default, beocijies renders local links to other local users as absolute if you allow subdomains and relative otherwise.\nIf you want to override this behavior (e.g., you are doing local testing for a mobile site and just loading the files in the browser of your choice), use the `--relative` or `--absolute` flags.\n\n### Updating Pages\n\nWhenever a user is updating their page (or you are updating the main page), you should add a new photo that you take during the editing session.\nThe photo should go in the user folder within the `static` directory (or the `index` folder within `static` for the main page).\nAny filetype the `img` tag accepts is fine, but the file should be named `update-NUMBER`, with number starting at `1` and being incremented every time that page is updated.\nThe page will automatically display the image with the highest number for that user.\n\nThe users page will be in the `templates` directory and will be named `USERNAME.html.jinja2` (see [jinja](#jinja) for why this isn't just an html page).\nThis template will be rendered to `domain/USER/index.html`.\nThe user directory will also contain any files the user adds to their static folder.\nWhat they can add is up to your discretion, but I recommend against allowing the user additional pages or allowing them separate CSS or JavaScript files.\n\n### Jinja\n\nUser pages are [Jinja templates](https://jinja.palletsprojects.com/en/3.1.x/), not bare HTML pages.\n\nThis is done to add the 'uneditable' footer image with the page update date and the user's picture.\nThe user should be able to treat the template just like an HTML page, writing the header and body in the two provided 'blocks'.\nIt is unlikely that a user would accidentally add something to their page that Jinja would interpret weirdly (and the script will provide an error message if this does occur).\n\nA user-facing feature that the Jinja template provides, is a way to easily link to other user pages by writing `{{user(\"USERNAME\")}}`.\n\nFor use in the index page, the `users` variable has a list of all users that were willing to be included in a public directory.\nYou can link to all the users with the following code:\n\n```jinja2\n<details open=true>\n    <summary>users:</summary>\n    <ul>\n    {% for name in users | sort %}\n        <li>{{user(name)}}</li>\n    {% endfor %}\n    </ul>\n</details>\n```\n\n#### Referencing Users on Other Sites\n\nIf you have multiple sites (e.g., desktop and mobile), or have a cool webring with another beocijies site, you can make it easy for your users to reference the users on that site.\n\nUse the `connect` command to grab a server's user list:\n```sh\nbeocijies connect NAME DOMAIN\n```\n\nwhere `NAME` is how you'll refer to that site and `DOMAIN` is the base page of that site.\nE.g., for the original beocijies site:\n```sh\nbeocijies connect beocijies https://beocijies.com\n```\n\nYour users can now link to the user by saying `{{user(\"USERNAME\", \"SITENAME\")` (e.g., `{{user(\"bcj\", \"beocijies\")}}`) and if that user is public on that site, that will be replaced with a link and the text `USER (SITE)` (e.g., `bcj (beocijies)`).\n\nYou can update the user list by rerunning the command and you can forget about that site with the disconnect command:\n```sh\nbeocijies disconnect NAME\n```\n\nSite names must be unique but have no other restrictions.\n\n### Rendering on the Go\n\nIf you know in advance that a user is going to be making their page on a computer that doesn't run the beocijies script, you should add the user in advance, add a dummy update image to their static directory, then render that empty page to a location on the removable storage device they'll edit the file on.\nThey can then just edit that rendered page directly, and view the file in their browser of choice as they edit.\nWhen you get home, you can copy the information they changed back into a template.\n\nChances are, you have not heavily customized the default user page.\nBecause of this, you can also have new users write a brand new html page and deal with putting their page back into the template later.\nLikewise, you can have existing users download their current page if you have an internet connection.\n\n# Future Work\n\nI wouldn't expect a lot of it.\nThis whole project is a goofy toy and it's already good enough at being that.\nI'll add some silly features if they sound fun and fix any bugs people run into.\n\n* A number of the tests for this are pretty rudimentary, and they don't even lint the nginx/httpd configurations that are generated\n* Actually, the apache stuff hasn't been tested at all yet.\n* Nothing's in place for migrating configuration files if updates include breaking changes. It will be added once it's needed\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "",
    "license": "ANTI-CAPITALIST SOFTWARE LICENSE (v 1.4)  Copyright © 2023 bcj  This is anti-capitalist software, released for free use by individuals and organizations that do not operate by capitalist principles.  Permission is hereby granted, free of charge, to any person or organization (the \"User\") obtaining a copy of this software and associated documentation files (the \"Software\"), to use, copy, modify, merge, distribute, and/or sell copies of the Software, subject to the following conditions:  1. The above copyright notice and this permission notice shall be included in all copies or modified versions of the Software.  2. The User is one of the following: a. An individual person, laboring for themselves b. A non-profit organization c. An educational institution d. An organization that seeks shared profit for all of its members, and allows non-members to set the cost of their labor  3. If the User is an organization with owners, then all owners are workers and all workers are owners with equal equity and/or equal vote.  4. If the User is an organization, then the User is not law enforcement or military, or working for or under either.  THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT EXPRESS OR IMPLIED WARRANTY OF ANY KIND, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.",
    "maintainer": "",
    "maintainer_email": "",
    "name": "beocijies",
    "package_url": "https://pypi.org/project/beocijies/",
    "platform": null,
    "project_url": "https://pypi.org/project/beocijies/",
    "project_urls": {
      "Homepage": "https://github.com/bcj/beocijies"
    },
    "release_url": "https://pypi.org/project/beocijies/0.9.0/",
    "requires_dist": [
      "jinja2",
      "requests"
    ],
    "requires_python": ">=3.8",
    "summary": "A site generator for small handmade sites",
    "version": "0.9.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17243091,
  "releases": {
    "0.9.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "38a3977223b7acd9c9dffc58848c949464a47efbb13c988f8d9bcbc95211ce7b",
          "md5": "438b90d4ddcfba02d75859e89c9434c0",
          "sha256": "e5b849f71f52f6c44434d9ac5c8cc3e6b786d97433cfe4c4078aff31db74bcfb"
        },
        "downloads": -1,
        "filename": "beocijies-0.9.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "438b90d4ddcfba02d75859e89c9434c0",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 20101,
        "upload_time": "2023-03-10T17:45:54",
        "upload_time_iso_8601": "2023-03-10T17:45:54.116579Z",
        "url": "https://files.pythonhosted.org/packages/38/a3/977223b7acd9c9dffc58848c949464a47efbb13c988f8d9bcbc95211ce7b/beocijies-0.9.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "38a3977223b7acd9c9dffc58848c949464a47efbb13c988f8d9bcbc95211ce7b",
        "md5": "438b90d4ddcfba02d75859e89c9434c0",
        "sha256": "e5b849f71f52f6c44434d9ac5c8cc3e6b786d97433cfe4c4078aff31db74bcfb"
      },
      "downloads": -1,
      "filename": "beocijies-0.9.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "438b90d4ddcfba02d75859e89c9434c0",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.8",
      "size": 20101,
      "upload_time": "2023-03-10T17:45:54",
      "upload_time_iso_8601": "2023-03-10T17:45:54.116579Z",
      "url": "https://files.pythonhosted.org/packages/38/a3/977223b7acd9c9dffc58848c949464a47efbb13c988f8d9bcbc95211ce7b/beocijies-0.9.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}