{
  "info": {
    "author": "frier17",
    "author_email": "Bitmast Digital Services <bitmastdigital@gmail.com>",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 4 - Beta",
      "Programming Language :: Python"
    ],
    "description": "# Bitmast PayStack \n**A PayStack payment Solution implemented in python**\n\nThe PyPayStack API is a python implementation of the PayStack payment gateway, [www.paystack.co](https://www.paystack.co\n). See developer's documentation [here](https://developers.paystack.co/docs/). The current edition is built to\n support transaction in Naira. \n The driving goal of this project remains to have an easy to integrate payment solution for python based projects. \n  \n  ## Motivation\n  The existing implementation of PayStack API in python supports a subset of the payment gateway features. Support\n   for features such as BVN (Bank Verification Number) verification and many other features are not readily available\n   . Furthermore, the use of Python's language rich object model is not largely adopted. In a bid of meeting this\n    need, PyPayStack has been designed and built to allow developers focus on business application logic while the\n     payment of their application or online service remain the major concern of PyPayStack. Aside this, most online\n      resource of the PayStack gateway were written for PHP with a lot of plugins for PHP based web frameworks like\n       WordPress, Magento, PrestaShop etc. The PyPayStack was designed to be a simple framework that can be\n        integrated with Python based frameworks such as Django, Flask etc.\n        \n## Description\nPyPayStack is built to provide one primary service: process online payment in Nigeria e-commerce space using the\n PayStack payment gateway without need for detail understanding of PayStack payment system. Such knowledge is\n  beneficial but not mandatory while using PyPayStack.\n  \n  Some of the key innovative feature of the design is support for the features of PayStack gateway in an intuitive\n   manner. Others include:\n1. Use of design patterns for meeting key programming needs that will simplify code base and make for easy\n    application testing. Example, all PayStack API request can be executed as a callable objects which are implemented using the\n     Command Design Pattern. Hence, to initiate a PayStack Transaction, simply follow the steps:\n     \n\t~~~python\n\t   \n\t\t# Initiate a payment transaction\n\t\tfrom paystack.util import BusinessDataObject \n\t\tfrom paystack.transaction import initialize_transaction, verify_transaction\n\n\t\t# Create business data object from HTTP Request with validated form fields    \n\t\ttransaction_object_from_request = BusinessDataObject(**kwargs)\n\t\tinitialize = initialize_transaction(transaction_instance=transaction_object_from_request)\n\t\tserver_response = initialize()\n\t\tif server_response:\n\t\t\t# do work\n\t\t\tpass\n\n\t\t# Verify a payment transaction\n\t\t# Create business data object from HTTP Request with validated form fields\n\t\ttransaction_object_from_server = BusinessDataObject(**kwargs)\n\t\tverify = verify_transaction(transaction_instance=transaction_object_from_server)\n\t\tverify_server_response = verify()\n\n\t~~~  \n\n    All callable functions are implemented as Command object which wraps a function for executing given command. This\n function can be dynamically updated or replaced with any other function/lambda expression by the developer.\n \n2. Data across layers are passed by a mapping object (BusinessDataObject) which is immutable ensuring that\n    transaction data is not wrongly manipulated or altered unintentionally by application calls. This dictionary like\n     object can be parsed into JSON or other format for rendering.\n     \n3. Application features are grouped into processes with related/subprocesses being under the same categories. Example all subaccount features can be accessed through the `paystack.subaccount` package.\n \n4. Application specific requirement and account details can be managed from a centralized configuration system. This will enable developers extend the project for their peculiar needs.\n\n3. Application features are grouped into processes with related/subprocesses being under the same categories. Example\n all subaccount features can be accessed through the `paystack.subaccount` package.\n\n4. Application specific requirement and account details of the merchant can be managed from a centralized configuration\n system. This will enable developers extend the project for their peculiar needs.\n\n5. Rich set of data validation is provided for every request object/data being passed to the PayStack api. Furthermore, the default REGEX patterns and data validation can be replaced by the developer to suit their target  need. It is believed, however, that default validators meets the requirements for most online cases.\n\n6. A `parser` package is provided with the alpha edition. This package is considered secondary as responses from the\n server can be converted into BusinessDataObject or passed along to calling function for further processing.\n\n7. Integration with a communication and database layer can be achieved using the Mediator Design Pattern. This will\n enable system\n send information to third party application using a single channel or given interface. Default Mediator\n  implementation is available in the `toolkit` package.\n\n8. All HTTP requests are made through the Python `requests` API. See documentation [here](https://2.python-requests.org/en/master/) for more information.\n      \n## Dependencies\nThe PyPayStack requires `toolkit` which can be downloaded [here](https://gitlab.com/frier17/toolkit)\nThe target Python language for current implmentation is Python 3.6.8     \n   \n## Build Status\n**Version: 0.1.0**\n\nCurrent development of PyPayStack is version 0.1.0. This is considered the Alpha Edition. Future releases will\n support export of application data to communication interface to enable information exchange between payment systems.\n \n## Features\nSupport PayStack features includes:\n+ Initialize Transaction\n+ Verify Transaction\n+ List Transactions  \n+ Fetch Transaction  \n+ Change Authorization  \n+ View Transaction Timeline  \n+ Transaction Totals  \n+ Export Transactions  \n+ Request Reauthorization  \n+ Check Authorization  \n+ Create Customer\n+ List Customers\n+ Fetch Customer\n+ Update Customer\n+ Customer Access Control\n+ Deactivate Authorization\n+ Create Subaccount\n+ List Subaccounts\n+ Fetch Subaccount\n+ Update Subaccount\n+ Create Plan\n+ List Plans\n+ Fetch Plan\n+ Update Plan\n+ Create Subscription\n+ List Subscriptions\n+ Fetch Subscription\n+ Disable Subscription\n+ Enable Subscription\n+ Create Product\n+ List Products\n+ Fetch Product\n+ Update Product\n+ Create Page\n+ List Pages\n+ Fetch Page\n+ Update Page\n+ Check Slug Availability\n+ Add Products\n+ Create Invoice\n+ List Invoices\n+ View Invoice\n+ Verify Invoice\n+ Send Notification\n+ Invoice Metrics\n+ Finalize Draft\n+ Fetch Invoice\n+ Update Invoice\n+ Archive Invoice\n+ Mark As Paid\n+ Fetch Settlements\n+ Create Transfer Recipient\n+ List Transfer Recipients\n+ Update Transfer Recipient\n+ Delete Transfer Recipient\n+ Initiate Transfer\n+ List Transfers\n+ Fetch Transfer\n+ Finalize Transfer\n+ Initiate Bulk Transfer\n+ Check Balance\n+ Resend Transfer Otp\n+ Disable Otp Requirement\n+ Finalize Disabling Otp\n+ Enable Otp Requirement\n+ Initiate Bulk Charge\n+ List Bulk Charges\n+ Fetch Bulk Charge Batch\n+ Fetch Bulk Charges In Batch\n+ Pause Bulk Charge Batch\n+ Resume Bulk Charge Batch\n+ Fetch Payment Session Timeout\n+ Update Payment Session Timeout\n+ Charge\n+ Submit PIN\n+ Submit OTP\n+ Submit Phone\n+ Submit Birthday\n+ Check Pending Charge\n+ Create Refund\n+ List Refunds\n+ Fetch Refund\n+ Resolve BVN\n+ Bvn Match\n+ Resolve Account Number\n+ Resolve Card BIN\n+ Resolve Phone Number\n+ List Banks\n\n## Sample Usage\nPyPayStack is designed to provide support for all PayStack gateway feature. It can also be adopted to provide full\n financial services like payment settlement etc. for various business model. This tool does ot provide accounting\n  packages or financial asset management etc. It simply does one core thing: process and management payment as\n   prescribed by PayStack.\n\nSample test run:\nInitiating Transaction\n![Transaction Run](paystack/initiating_transaction.png)    \n \n## Contributing\nPlease visit application repo for further information on extending project. Ideas and comments will be reasonably\n appreciated. \n \n## Author\nCurrent development is by Aniefiok Friday [@frier17](https://gitlab.com/frier17). \n\n## License\nApache License\n\nVersion 2.0, January 2004\n\nhttp://www.apache.org/licenses/\n\nFor details read license contract [here](http://www.apache.org/licenses/LICENSE-2.0)\n\nCopyright 2019 @frier17\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "payment,bank,card,account,PayStack,fintech",
    "license": "Apache License Version 2.0, January 2004 http://www.apache.org/licenses/  TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION  1. Definitions.  \"License\" shall mean the terms and conditions for use, reproduction, and distribution as defined by Sections 1 through 9 of this document.  \"Licensor\" shall mean the copyright owner or entity authorized by the copyright owner that is granting the License.  \"Legal Entity\" shall mean the union of the acting entity and all other entities that control, are controlled by, or are under common control with that entity. For the purposes of this definition, \"control\" means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity.  \"You\" (or \"Your\") shall mean an individual or Legal Entity exercising permissions granted by this License.  \"Source\" form shall mean the preferred form for making modifications, including but not limited to software source code, documentation source, and configuration files.  \"Object\" form shall mean any form resulting from mechanical transformation or translation of a Source form, including but not limited to compiled object code, generated documentation, and conversions to other media types.  \"Work\" shall mean the work of authorship, whether in Source or Object form, made available under the License, as indicated by a copyright notice that is included in or attached to the work (an example is provided in the Appendix below).  \"Derivative Works\" shall mean any work, whether in Source or Object form, that is based on (or derived from) the Work and for which the editorial revisions, annotations, elaborations, or other modifications represent, as a whole, an original work of authorship. For the purposes of this License, Derivative Works shall not include works that remain separable from, or merely link (or bind by name) to the interfaces of, the Work and Derivative Works thereof.  \"Contribution\" shall mean any work of authorship, including the original version of the Work and any modifications or additions to that Work or Derivative Works thereof, that is intentionally submitted to Licensor for inclusion in the Work by the copyright owner or by an individual or Legal Entity authorized to submit on behalf of the copyright owner. For the purposes of this definition, \"submitted\" means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Work, but excluding communication that is conspicuously marked or otherwise designated in writing by the copyright owner as \"Not a Contribution.\"  \"Contributor\" shall mean Licensor and any individual or Legal Entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Work.  2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare Derivative Works of, publicly display, publicly perform, sublicense, and distribute the Work and such Derivative Works in Source or Object form.  3. Grant of Patent License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this section) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Work, where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Work to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Work or a Contribution incorporated within the Work constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for that Work shall terminate as of the date such litigation is filed.  4. Redistribution. You may reproduce and distribute copies of the Work or Derivative Works thereof in any medium, with or without modifications, and in Source or Object form, provided that You meet the following conditions:  (a) You must give any other recipients of the Work or Derivative Works a copy of this License; and  (b) You must cause any modified files to carry prominent notices stating that You changed the files; and  (c) You must retain, in the Source form of any Derivative Works that You distribute, all copyright, patent, trademark, and attribution notices from the Source form of the Work, excluding those notices that do not pertain to any part of the Derivative Works; and  (d) If the Work includes a \"NOTICE\" text file as part of its distribution, then any Derivative Works that You distribute must include a readable copy of the attribution notices contained within such NOTICE file, excluding those notices that do not pertain to any part of the Derivative Works, in at least one of the following places: within a NOTICE text file distributed as part of the Derivative Works; within the Source form or documentation, if provided along with the Derivative Works; or, within a display generated by the Derivative Works, if and wherever such third-party notices normally appear. The contents of the NOTICE file are for informational purposes only and do not modify the License. You may add Your own attribution notices within Derivative Works that You distribute, alongside or as an addendum to the NOTICE text from the Work, provided that such additional attribution notices cannot be construed as modifying the License.  You may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions for use, reproduction, or distribution of Your modifications, or for any such Derivative Works as a whole, provided Your use, reproduction, and distribution of the Work otherwise complies with the conditions stated in this License.  5. Submission of Contributions. Unless You explicitly state otherwise, any Contribution intentionally submitted for inclusion in the Work by You to the Licensor shall be under the terms and conditions of this License, without any additional terms or conditions. Notwithstanding the above, nothing herein shall supersede or modify the terms of any separate license agreement you may have executed with Licensor regarding such Contributions.  6. Trademarks. This License does not grant permission to use the trade names, trademarks, service marks, or product names of the Licensor, except as required for reasonable and customary use in describing the origin of the Work and reproducing the content of the NOTICE file.  7. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Work (and each Contributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Work and assume any risks associated with Your exercise of permissions under this License.  8. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Work (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages.  9. Accepting Warranty or Additional Liability. While redistributing the Work or Derivative Works thereof, You may choose to offer, and charge a fee for, acceptance of support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability.  END OF TERMS AND CONDITIONS  APPENDIX: How to apply the Apache License to your work.  To apply the Apache License to your work, attach the following boilerplate notice, with the fields enclosed by brackets \"{}\" replaced with your own identifying information. (Don't include the brackets!)  The text should be enclosed in the appropriate comment syntax for the file format. We also recommend that a file or class name and description of purpose be included on the same \"printed page\" as the copyright notice for easier identification within third-party archives.  Copyright 2019 frier17  Licensed under the Apache License, Version 2.0 (the \"License\"); you may not use this file except in compliance with the License. You may obtain a copy of the License at  http://www.apache.org/licenses/LICENSE-2.0  Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License. ",
    "maintainer": "frier17",
    "maintainer_email": "",
    "name": "bitmast-paystack",
    "package_url": "https://pypi.org/project/bitmast-paystack/",
    "platform": null,
    "project_url": "https://pypi.org/project/bitmast-paystack/",
    "project_urls": {
      "repository": "https://gitlab.com/frier17/pypaystack.git"
    },
    "release_url": "https://pypi.org/project/bitmast-paystack/2023.1.1/",
    "requires_dist": [
      "requests",
      "dotenv"
    ],
    "requires_python": ">=3.7",
    "summary": "Python wrapper for PayStack Gateway API",
    "version": "2023.1.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17389010,
  "releases": {
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "670cca9a5dd3b5387f7f09a352dcf94b6b03b8d5dc89567e55907bcebeaa69e7",
          "md5": "38bd650fd9199ebb81a71e147f80b78a",
          "sha256": "202d77d342003e61721d8a42b986588faa9e3c654cd17dd8da0752c06114041b"
        },
        "downloads": -1,
        "filename": "bitmast_paystack-1.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "38bd650fd9199ebb81a71e147f80b78a",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 28667,
        "upload_time": "2021-10-09T17:04:37",
        "upload_time_iso_8601": "2021-10-09T17:04:37.538607Z",
        "url": "https://files.pythonhosted.org/packages/67/0c/ca9a5dd3b5387f7f09a352dcf94b6b03b8d5dc89567e55907bcebeaa69e7/bitmast_paystack-1.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1001471a171c320a1468bd112a1d89695da3ae5a445c9b4d2bf79f2d4a868476",
          "md5": "a6369f36da1b3ce4a134b65a8a5059af",
          "sha256": "f7fc38586ffb52246695d4c4ad1d5a52e72ea4a55743add868009eaa47978240"
        },
        "downloads": -1,
        "filename": "bitmast_paystack-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "a6369f36da1b3ce4a134b65a8a5059af",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 17632,
        "upload_time": "2021-10-09T17:04:39",
        "upload_time_iso_8601": "2021-10-09T17:04:39.500996Z",
        "url": "https://files.pythonhosted.org/packages/10/01/471a171c320a1468bd112a1d89695da3ae5a445c9b4d2bf79f2d4a868476/bitmast_paystack-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0a4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a922c7fbe77f913e7d0915aaaea6fd4c3086bbcbbab9b28a02897d5c3776f4b3",
          "md5": "7614c65d6f075886a86fc2b9cc987cfc",
          "sha256": "8494a5adafcf4f8cbd0d8d2b35d7c65635bde6de646f4399471685ef50ba1a8d"
        },
        "downloads": -1,
        "filename": "bitmast_paystack-1.0a4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "7614c65d6f075886a86fc2b9cc987cfc",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 28295,
        "upload_time": "2020-08-25T21:32:25",
        "upload_time_iso_8601": "2020-08-25T21:32:25.860981Z",
        "url": "https://files.pythonhosted.org/packages/a9/22/c7fbe77f913e7d0915aaaea6fd4c3086bbcbbab9b28a02897d5c3776f4b3/bitmast_paystack-1.0a4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f7a625f5e5083b0febac6a034f1a5f6a7e49cd115676f863db5e2ed8c4fb2b4d",
          "md5": "1a6846820f4f902fb63a631671f87888",
          "sha256": "f06911ff9f2b09f866eeb324a5cce4a42f0ecb0065463ec923f72faea97c58da"
        },
        "downloads": -1,
        "filename": "bitmast_paystack-1.0a4.tar.gz",
        "has_sig": false,
        "md5_digest": "1a6846820f4f902fb63a631671f87888",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 18134,
        "upload_time": "2020-08-25T21:32:31",
        "upload_time_iso_8601": "2020-08-25T21:32:31.819280Z",
        "url": "https://files.pythonhosted.org/packages/f7/a6/25f5e5083b0febac6a034f1a5f6a7e49cd115676f863db5e2ed8c4fb2b4d/bitmast_paystack-1.0a4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0a5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c0e4c4b98fc105cc2329c22f560667fc2a32050c356bd2dcf40e3bfb5cc6ce4c",
          "md5": "f1ba5c0640e9f5f095162a1fe050c324",
          "sha256": "75fb876d084eb463bcfeceb96fe18e72a06e259bd72ef5470dffdb7e6593e60b"
        },
        "downloads": -1,
        "filename": "bitmast_paystack-1.0a5-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "f1ba5c0640e9f5f095162a1fe050c324",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 28259,
        "upload_time": "2020-08-26T09:44:14",
        "upload_time_iso_8601": "2020-08-26T09:44:14.961322Z",
        "url": "https://files.pythonhosted.org/packages/c0/e4/c4b98fc105cc2329c22f560667fc2a32050c356bd2dcf40e3bfb5cc6ce4c/bitmast_paystack-1.0a5-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "33f4bcbfc9d33d3252ce8b1b6f2a465c5fe980c9cfcc5857b67c63977747fb4f",
          "md5": "2a38b0d054e6a3c7df8261f1420123fc",
          "sha256": "112c43fd2011239c292588cbac0995b8bc3c6d95a27b72d046312861ed23ad33"
        },
        "downloads": -1,
        "filename": "bitmast_paystack-1.0a5.tar.gz",
        "has_sig": false,
        "md5_digest": "2a38b0d054e6a3c7df8261f1420123fc",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 18216,
        "upload_time": "2020-08-26T09:44:17",
        "upload_time_iso_8601": "2020-08-26T09:44:17.676240Z",
        "url": "https://files.pythonhosted.org/packages/33/f4/bcbfc9d33d3252ce8b1b6f2a465c5fe980c9cfcc5857b67c63977747fb4f/bitmast_paystack-1.0a5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0a6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "97b028363cd5a2eefeaf134dadbc0befaf2ca1688180490a59bffcf37fb2c901",
          "md5": "26e24c2c9a1fc520f70529cb12a5bbf6",
          "sha256": "f571aee3e015cd05d60ce49293e4398a7a514aaf9fd93c675cdfaeb535b857f0"
        },
        "downloads": -1,
        "filename": "bitmast_paystack-1.0a6-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "26e24c2c9a1fc520f70529cb12a5bbf6",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 28167,
        "upload_time": "2020-09-28T20:53:22",
        "upload_time_iso_8601": "2020-09-28T20:53:22.244951Z",
        "url": "https://files.pythonhosted.org/packages/97/b0/28363cd5a2eefeaf134dadbc0befaf2ca1688180490a59bffcf37fb2c901/bitmast_paystack-1.0a6-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "dec7b459369e35e7101211a0d8898a99f742d6c241dc1e60d9c6a11bc35d677c",
          "md5": "2792b8fa28632b8d540b6f69192a9ec3",
          "sha256": "5a121d1941967af0c096ca289ac29317c30dc4559a745ccc768fd534f671b794"
        },
        "downloads": -1,
        "filename": "bitmast_paystack-1.0a6.tar.gz",
        "has_sig": false,
        "md5_digest": "2792b8fa28632b8d540b6f69192a9ec3",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 18142,
        "upload_time": "2020-09-28T20:53:26",
        "upload_time_iso_8601": "2020-09-28T20:53:26.494856Z",
        "url": "https://files.pythonhosted.org/packages/de/c7/b459369e35e7101211a0d8898a99f742d6c241dc1e60d9c6a11bc35d677c/bitmast_paystack-1.0a6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0a7": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "fdad139e1e626808f0cc5ca3ee5118b4c9f3b9423b3fcd43b67c6e8f6f5c7107",
          "md5": "8ebbf58e8d9c81569316199da5372b02",
          "sha256": "2d382383b0e436f51fce7a544d2de45b1f0e89ecf25372349d5ecce9fa5ad331"
        },
        "downloads": -1,
        "filename": "bitmast_paystack-1.0a7-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "8ebbf58e8d9c81569316199da5372b02",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 28224,
        "upload_time": "2020-11-05T22:11:28",
        "upload_time_iso_8601": "2020-11-05T22:11:28.253070Z",
        "url": "https://files.pythonhosted.org/packages/fd/ad/139e1e626808f0cc5ca3ee5118b4c9f3b9423b3fcd43b67c6e8f6f5c7107/bitmast_paystack-1.0a7-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3fa9df1b6ee476150ba95f5f88d15ee5c477acb4b5f1e2832393213bdc3ca598",
          "md5": "e13943d73099fb78b6661d19d35b1c7f",
          "sha256": "c278d87557bbdc9096dc9a1ff4b9b2689f3ace84e4c07e592713a08e84106963"
        },
        "downloads": -1,
        "filename": "bitmast_paystack-1.0a7.tar.gz",
        "has_sig": false,
        "md5_digest": "e13943d73099fb78b6661d19d35b1c7f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 18215,
        "upload_time": "2020-11-05T22:11:30",
        "upload_time_iso_8601": "2020-11-05T22:11:30.370476Z",
        "url": "https://files.pythonhosted.org/packages/3f/a9/df1b6ee476150ba95f5f88d15ee5c477acb4b5f1e2832393213bdc3ca598/bitmast_paystack-1.0a7.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2023.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b6cf4ccb38de58134dab434e24e0481dfbd9e2525113d6740d76df6300150951",
          "md5": "10985d0daef16870f1639ddb1ad6e434",
          "sha256": "f7cadaa918218d00ee84815622019c454aa055c4a6d86e4f3814c19fb96f45c2"
        },
        "downloads": -1,
        "filename": "bitmast_paystack-2023.1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "10985d0daef16870f1639ddb1ad6e434",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 35336,
        "upload_time": "2023-03-21T21:52:15",
        "upload_time_iso_8601": "2023-03-21T21:52:15.888848Z",
        "url": "https://files.pythonhosted.org/packages/b6/cf/4ccb38de58134dab434e24e0481dfbd9e2525113d6740d76df6300150951/bitmast_paystack-2023.1.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "25a5b8d8d5b42f6f9e4085b1dc14bdf78c046dc1a8aa96148e5f257fdcf13741",
          "md5": "b85f04899c189af6df302795b4e4d9ea",
          "sha256": "76b8794918e1f46a8ad01a06605568148c4086df86efca624073560fad9c4bdc"
        },
        "downloads": -1,
        "filename": "bitmast_paystack-2023.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "b85f04899c189af6df302795b4e4d9ea",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 27419,
        "upload_time": "2023-03-21T21:52:20",
        "upload_time_iso_8601": "2023-03-21T21:52:20.204646Z",
        "url": "https://files.pythonhosted.org/packages/25/a5/b8d8d5b42f6f9e4085b1dc14bdf78c046dc1a8aa96148e5f257fdcf13741/bitmast_paystack-2023.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "b6cf4ccb38de58134dab434e24e0481dfbd9e2525113d6740d76df6300150951",
        "md5": "10985d0daef16870f1639ddb1ad6e434",
        "sha256": "f7cadaa918218d00ee84815622019c454aa055c4a6d86e4f3814c19fb96f45c2"
      },
      "downloads": -1,
      "filename": "bitmast_paystack-2023.1.1-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "10985d0daef16870f1639ddb1ad6e434",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.7",
      "size": 35336,
      "upload_time": "2023-03-21T21:52:15",
      "upload_time_iso_8601": "2023-03-21T21:52:15.888848Z",
      "url": "https://files.pythonhosted.org/packages/b6/cf/4ccb38de58134dab434e24e0481dfbd9e2525113d6740d76df6300150951/bitmast_paystack-2023.1.1-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "25a5b8d8d5b42f6f9e4085b1dc14bdf78c046dc1a8aa96148e5f257fdcf13741",
        "md5": "b85f04899c189af6df302795b4e4d9ea",
        "sha256": "76b8794918e1f46a8ad01a06605568148c4086df86efca624073560fad9c4bdc"
      },
      "downloads": -1,
      "filename": "bitmast_paystack-2023.1.1.tar.gz",
      "has_sig": false,
      "md5_digest": "b85f04899c189af6df302795b4e4d9ea",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7",
      "size": 27419,
      "upload_time": "2023-03-21T21:52:20",
      "upload_time_iso_8601": "2023-03-21T21:52:20.204646Z",
      "url": "https://files.pythonhosted.org/packages/25/a5/b8d8d5b42f6f9e4085b1dc14bdf78c046dc1a8aa96148e5f257fdcf13741/bitmast_paystack-2023.1.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}