{
  "info": {
    "author": "Scott Green/Nano Nano Ltd",
    "author_email": "bittytax@nanonano.co.uk",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 4 - Beta",
      "Environment :: Console",
      "Intended Audience :: End Users/Desktop",
      "License :: OSI Approved :: GNU Affero General Public License v3",
      "Natural Language :: English",
      "Operating System :: MacOS",
      "Operating System :: Microsoft :: Windows",
      "Operating System :: POSIX",
      "Programming Language :: Python :: 2.7",
      "Programming Language :: Python :: 3.6",
      "Programming Language :: Python :: 3.7",
      "Programming Language :: Python :: 3.8",
      "Programming Language :: Python :: 3.9",
      "Topic :: Office/Business :: Financial :: Accounting"
    ],
    "description": "![BittyTax logo](https://github.com/BittyTax/BittyTax/raw/master/img/BittyTax.png)\n[![Version badge][version-badge]][version]\n[![License badge][license-badge]][license]\n[![Python badge][python-badge]][python]\n[![Downloads badge][downloads-badge]][downloads]\n[![Stars badge][github-stars-badge]][github-stars]\n[![Twitter badge][twitter-badge]][twitter]\n[![Discord badge][discord-badge]][discord]\n[![PayPal badge][paypal-badge]][PayPal]\n[![Bitcoin badge][bitcoin-badge]][bitcoin]\n# BittyTax\nBittyTax is a collection of command-line tools to help you calculate your cryptoasset taxes in the UK.\n\nIt's open-source, free to use, fully transparent, and protects your privacy since there is no need to share data with a 3rd party.\n\nAlthough UK focused, many of the tools can be used for other countries and currencies, see [International support](https://github.com/BittyTax/BittyTax/wiki/International-Support).\n\nBittyTax comprises of the following tools.\n\n1. `bittytax` - process your transaction records and generate a PDF tax report (see [Accounting Tool](#accounting-tool)) \n\n2. `bittytax_conv` - convert your wallet and exchange files into transaction records (see [Conversion Tool](#conversion-tool))\n\n3. `bittytax_price` - (optional) lookup historic price data for cryptoassets and foreign currencies (see [Price Tool](#price-tool))\n\nThis tool is designed to be used by someone who is already familiar with cryptoasset taxation rules in the UK. HMRC has published guidance on this. We've collected some useful links in the [Resources](#resources) section at the end.\n\n## Disclaimer\nThis software is copyright (c) Nano Nano Ltd, and licensed for use under the AGPLv3 License, see [LICENSE](https://github.com/BittyTax/BittyTax/blob/master/LICENSE) file for details.\n\nNano Nano Ltd does not provide tax, legal, accounting or financial advice. This software and its content are provided for information only, and as such should not be relied upon for tax, legal, accounting or financial advice.\n\nYou should obtain specific professional advice from a [professional accountant](https://github.com/BittyTax/BittyTax/wiki/Crypto-Tax-Accountants-in-the-UK), tax or legal/financial advisor before you take any action.\n\nThis software is provided 'as is', Nano Nano Ltd does not give any warranties of any kind, express or implied, as to the suitability or usability of this software, or any of its content.\n\n## Getting Started\n\nYou will need Python installed on your machine before you can install BittyTax, see the [installation](https://github.com/BittyTax/BittyTax/wiki/Installation) guide which covers Windows, macOS and Linux for full details.\n\nIf you are upgrading from BittyTax v0.4.x, please follow the [upgrade](https://github.com/BittyTax/BittyTax/wiki/Upgrade) instructions.\n\n## Transaction Records\nBittyTax is only as accurate as the data you provide it. This means it's essential that you keep records of ALL cryptoasset transactions, which includes not just trades but also records of spending, income, gifts sent or received, etc.\n\nThe `bittytax_conv` tool is provided to assist with this transaction record keeping, it allows data exported from various different wallets and exchanges to be processed into the format required by the `bittytax` accounting tool. Manual entry or editing of this data may also be required. It is vital that converted data files are reviewed against the raw data and audited before use.\n\nTransaction records can be stored in an Excel or CSV file. Excel is preferred as it makes editing and managing your data easier. Data can be split across multiple worksheets, for example, you might want to split up transactions by wallet or exchange, or by transaction type. With Excel you can also annotate your records, append additional data columns, or even include the original raw data for reference.\n\nA transaction record is represented as a row of data which contains the following fields in the order given.\n\n| Field | Type | Description |\n| --- | --- | ---|\n| Type | `Deposit` | Tokens deposited to a wallet you own  \n| | `Mining` | Tokens received as income from mining |\n| | `Staking` | Tokens received as income from staking |\n| | `Interest` | Tokens received as interest |\n| | `Dividend` | Tokens received as a dividend |\n| | `Income` | Tokens received as other income |\n| | `Gift-Received` | Tokens received as a gift |\n| | `Airdrop` | Tokens received from an airdrop |\n| | `Withdrawal` | Tokens withdrawn from a wallet you own |\n| | `Spend` | Tokens spent on goods or services |\n| | `Gift-Sent` | Tokens sent as a gift |\n| | `Gift-Spouse` | Tokens gifted to your spouse or civil partner |\n| | `Charity-Sent` | Tokens sent to a charity as a gift |\n| | `Lost` | Tokens that have been lost or stolen |\n| | `Trade` | Tokens exchanged for another token or fiat currency |\n| Buy Quantity | | Quantity of the asset acquired |\n| Buy Asset | | Symbol name of the asset acquired |\n| Buy Value in GBP | | Value in UK pounds of the asset acquired |\n| Sell Quantity | |  Quantity of the asset disposed |\n| Sell Asset | | Symbol name  of the asset disposed |\n| Sell Value in GBP | | Value in UK pounds of the asset disposed |\n| Fee Quantity | | Quantity of the fee |\n| Fee Asset | | Symbol name of the asset used for fees |\n| Fee Value in GBP | | Value in UK pounds of the fee |\n| Wallet | | Name of wallet |\n| Timestamp | | Date/time of transaction |\n| Note | | Description of transaction |\n\nThe transaction Type dictates which fields in the row are required, either (M)andatory or (O)ptional.   \n\n| Type | Buy Quantity | Buy Asset | Buy Value in GBP | Sell Quantity | Sell Asset | Sell Value in GBP | Fee Quantity | Fee Asset | Fee Value in GBP | Wallet | Timestamp | Note |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | ---| --- | --- |\n| `Deposit` | M | M |   |||| O | O |  | O | M | O |\n| `Mining` | M | M | O |||| O | O | O| O | M | O |\n| `Staking` | M | M | O |||| O | O | O| O | M | O |\n| `Interest` | M | M | O |||| O | O | O| O | M | O |\n| `Dividend` | M | M | O |||| O | O | O| O | M | O |\n| `Income` | M | M | O |||| O | O | O| O | M | O |\n| `Gift-Received` | M | M | O |||| O | O | O| O | M | O |\n| `Airdrop` | M | M | O |||| O | O | O| O | M | O |\n| `Withdrawal` |||| M | M |   | O | O |   | O | M | O |\n| `Spend` |||| M | M | O | O | O | O | O | M | O |\n| `Gift-Sent` |||| M | M | O | O | O | O | O | M | O |\n| `Gift-Spouse` |||| M | M |  | O | O | O | O | M | O |\n| `Charity-Sent` |||| M | M | O | O | O | O | O | M | O |\n| `Lost` |||| M | M | O | O | O | O | O | M | O |\n| `Trade` | M | M | O | M | M | O | O | O | O | O | M | O |\n\n- If the Fee Asset is the same as Sell Asset, then the Sell Quantity must be the net amount (after fee deduction), not gross amount.\n\n- If the Fee Asset is the same as Buy Asset, then the Buy Quantity must be the gross amount (before fee deduction), not net amount.\n\n- The Buy Value in GBP, Sell Value in GBP and Fee Value in GBP fields are always optional, if you don't provide a fixed value, bittytax will calculate the value for you via one of its price data sources.\n\n- Wallet name is optional, but recommended if you want to audit your cryptoasset balances across multiple wallets.  \n\n- Timestamps should be in Excel Date & Time format (as UTC), or if text, in the format `YYYY-MM-DDTHH:MM:SS.000000 ZZZ`, where timezone (ZZZ) can be GMT, BST or UTC. Milliseconds or microseconds are optional. \n\n- Cryptoasset symbol names need to be consistent throughout your transaction records. The symbol name you choose should match the symbol name used by the price data source, otherwise valuations will fail. See [Price Tool](#price-tool) for more information.\n\n- Transaction records can be listed in any order. Bittytax will sort them by Timestamp before processing.\n\nExample files are provided in both [Excel](https://github.com/BittyTax/BittyTax/blob/master/data/example.xlsx) and [CSV](https://github.com/BittyTax/BittyTax/blob/master/data/example.csv) format.\n\n### Deposit\nA `Deposit` is a transfer transaction record, indicating the receipt of cryptoasset tokens to a wallet you control. For example, you might have deposited tokens to a wallet on a cryptocurrency exchange.\n\nDeposit should NOT be used to record transfers to someone else's wallet, this would be categorised as either a `Gift-Sent` or a `Spend`.\n\nThere should always be an equivalent `Withdrawal` transaction record for every deposit, since tokens are always moving out of one wallet into another.\n\nIt is important that any deposit fee paid is specified, the deposit quantity should be the gross amount (before fee deduction).\n\nDeposits and Withdrawals are not taxable events, but paying the transfer fee is (unless otherwise configured), see [transfer_fee_disposal](#transfer_fee_disposal).\n\nThe Deposit type can also be used to record fiat deposits into an exchange. Although this is not used for tax calculations, it will be used for auditing purposes.\n\n### Withdrawal\nA `Withdrawal` is a transfer transaction record, indicating tokens being sent from a wallet you control. It is always used in combination with a `Deposit` transaction.\n\nIt is important that any withdrawal fee paid is specified, the withdrawal quantity should be the net amount (after fee deduction).\n\nIt's corresponding Deposit quantity should match the Withdrawal quantity, this is important, as the transfers will be removed from the tax calculations.\n\nThe Withdrawal type can also be used to record fiat withdrawals from an exchange.\n\n### Mining\nThe `Mining` transaction type is used to identify tokens received as income from mining. The `Income` transaction type could also be used to record this - its use is purely descriptive.\n\nThese transaction records will appear within your income tax report. See [HMRC guidance on mining transactions](https://www.gov.uk/hmrc-internal-manuals/cryptoassets-manual/crypto21150).\n\n### Staking\nThe `Staking` transaction type is used to identify tokens received as income from staking.\n\nThese transaction records will appear within your income tax report. See [HMRC guidance on staking](https://www.gov.uk/hmrc-internal-manuals/cryptoassets-manual/crypto21200).\n\n### Interest\nThe `Interest` transaction type is used to identify tokens received as interest.\n\nThese transaction records will appear within your income tax report.\n\n### Dividend\nThe `Dividend` transaction type is used to identify tokens received as a dividend.\n\nThese transaction records will appear within your income tax report.\n\n### Income\nThe `Income` transaction type is used to identify tokens received as other income, i.e. income which cannot be categorised as `Mining`, `Staking`, `Interest` or `Dividend`.\n\nThese transaction records will appear within your income tax report.\n\n### Gift-Received\nThe `Gift-Received` transaction type is used to record cryptoasset tokens received as a gift.\n\nA gift received is not taxed as income.\n\n### Airdrop\nThe `Airdrop` transaction type is used to record cryptoassets tokens received from an airdrop.\n\nAirdrop tokens are not taxed as income, as it is assumed that nothing was done in return for them.\n\nIf the airdrop distribution was dependant upon providing a service or other conditions, then they should be recorded as `Income`. See [HMRC guidance on airdrops](https://www.gov.uk/hmrc-internal-manuals/cryptoassets-manual/crypto21250). \n\n### Spend\nA `Spend` is a disposal transaction record, which is used to capture the spending of tokens on goods or services.\n\nAs a disposal transaction, it is applicable for Capital Gains tax.\n\n### Gift-Sent\nA `Gift-Sent` is a disposal transaction record, which identifies cryptoasset tokens sent as a gift.\n\nAs a disposal transaction, it is applicable for Capital Gains tax.\n\n### Gift-Spouse\n`Gift-Spouse` is a disposal transaction record, it identifies cryptoasset tokens gifted to your spouse or civil partner.\n\nThis disposal is recorded as \"No-Gain/No-Loss\", there will be no gain as the proceeds is calculated to match the acquisition cost (including fees).\n\nYour spouses' accounts should contain an equivalent `Gift-Received` transaction record, with a Buy Value that matches the acquisition cost (minus any fees) as shown in your \"No-Gain/No-Loss\" disposal.\n\nNote, BittyTax does not take into consideration the \"same day\" and \"bed & breakfast\" rules for \"No-Gain/No-Loss\" disposals.\n\n### Charity-Sent\nA `Charity-Sent` is a disposal transaction record, it identifies cryptoasset tokens sent to a registered charity as a gift.\n\nThese are not applicable for capital gains, and are considered a \"No-Gain/No-Loss\" disposal.\n\nNote, BittyTax does not take into consideration the \"same day\" and \"bed & breakfast\" rules for \"No-Gain/No-Loss\" disposals.\n\n### Lost\nThe `Lost` transaction type is used to record tokens that have been lost or stolen (i.e. private keys are unrecoverable) and a \"negligible value claim\" has been reported/accepted by HMRC. See [HMRC guidance on losing private keys](https://www.gov.uk/hmrc-internal-manuals/cryptoassets-manual/crypto22400).\n\nThe lost tokens are treated as a disposal (for the quantity and value as agreed with HMRC) followed by a reacquisition for the quantity lost, since technically you still own the tokens. If a value is not specified, a default disposal value of zero is assumed.\n\n### Trade\nThe `Trade` transaction type records the exchange of one cryptoasset for another, or for fiat currency.\n\nThis could be for one for the following reasons.\n\n- Fiat-to-crypto *(acquisition)*\n- Crypto-to-crypto *(disposal)*\n- Crypto-to-fiat *(disposal)*\n\nIn the case of a fiat-to-crypto trade, the Sell Asset would be fiat (i.e. GBP or whatever currency you used) and Sell Quantity would contain the amount. There is no reason to specify the Sell Value if the currency is GBP.\n\nIn the opposite case, crypto-to-fiat, the Buy Asset would be fiat, and the Buy Quantity the amount in fiat.\n\nTrades which are a *disposal* are applicable for Capital Gains tax.\n\n### Other types?\nBelow is a list of some other situations which you might need to record, but which don't have a specific transaction type defined.\n\n1. **Dust clean** - Some exchanges remove very small amounts (dust) of cryptoasset tokens from wallets after a period of time, since these are too small to be traded or withdrawn. This can be captured as a `Spend` with a Sell Value of 0.  \n1. **Fork** - If a cryptoasset you own is forked and a new cryptoasset is created, this can be recorded as a `Gift-Received` but with a Buy Value of 0. This assumes that you are not splitting the cost between the original and new cryptoasset. Currently, it is not possible to derive a cost from the original cryptoasset and apportion this to the new one. See [HMRC guidance on Blockchain forks](https://www.gov.uk/hmrc-internal-manuals/cryptoassets-manual/crypto22300).\n\n## Accounting Tool\nOnce you have all of your transaction records stored in an Excel or CSV file, you can use `bittytax` to process them and generate your report.\n\n    bittytax <filename>\n\n### PDF Report\nBy default the report is given the filename `BittyTax_Report.pdf`. You can see an example file [here](https://github.com/BittyTax/BittyTax/blob/master/data/BittyTax_Report.pdf).\n\nIf you want to use a different filename or to specify a folder, you can use the `-o` option as shown below.\n\n    bittytax <filename> -o <output_filename>\n\nThe PDF generator can be a bit slow when handling large amounts of data. If you prefer, you can output the report to the terminal window by using the `--nopdf` option.\n\n    bittytax <filename> --nopdf\n\nThe report is split into the following sections.\n\n1. [Audit](#audit)\n2. [Tax Report](#tax-report) (per year)\n3. Appendix - [Price Data](#price-data) (per year)\n4. Appendix - [Current Holdings](#current-holdings)\n\n#### Audit\nThe imported transaction records are audited by calculating what the final balances should be for each asset in your wallet.\n\nIf the balances listed in the report don't match, it could be that your transaction records are incomplete.\n\nIf you do get issues, you can use the `-d` or `--debug` option to turn on logging (see [Audit Transaction Records](#audit-transaction-records)).\n\n#### Tax Report\nBy default, tax reports are produced for all years which contain taxable events.\n\nIf you only want a report for a specific year you can do this using the `-ty` or `--taxyear` option. \n\n    bittytax <filename> -ty 2021\n\nFull details of the tax calculations can be seen by turning on the debug output (see [Processing](#processing)).\n\n#### Capital Gains\nCryptoasset disposals are listed in date order and by asset.\n\nFor a \"Bed and Breakfast\" disposal, the date of the buyback is given in brackets.\n\nIf a disposal results in a loss, the negative amount is highlighted in red.\n\nTotals are listed per asset (if more than 1 disposal) as well as the totals for that tax year.\n\nThe **Summary** section provides enough information for you to complete the \"Other property, assets and gains\" section within your self assessment tax return, or to give to your [accountant](https://github.com/BittyTax/BittyTax/wiki/Crypto-Tax-Accountants-in-the-UK) to complete.\n\nIf the disposal proceeds exceed more than 4 times the annual tax-free allowance this is shown. HMRC requires you to report this in your self assessment even if the gain was within your annual allowance.\n\nHMRC also requires you to include details of each gain or loss. You can use the `--summary` option in combination with `--taxyear` to generate a PDF report which only includes the capital gains disposals and summary for that specific tax year, this can then be attached to your self assessment. You can see an example summary report [here](https://github.com/BittyTax/BittyTax/blob/master/data/BittyTax_Report_Summary.pdf).\n\nThe **Tax Estimate** section is given purely as an estimate. Capital gains tax figures are calculated at both the basic and higher rate, and take into consideration the full tax-free allowance.  \n\nObviously you would need to take into account other capital gains/losses in the same year, and use the correct tax rate according to your income. Always consult with a [professional accountant](https://github.com/BittyTax/BittyTax/wiki/Crypto-Tax-Accountants-in-the-UK) before filing.\n\n#### Income\nIncome events are listed in date order and by asset, with totals per asset (if more than 1 event).\n\nTotals are also given per Income Type (`Mining`, `Staking`, `Interest`, `Dividend` and `Income`), as well as the totals for that tax year.\n\nYou should check with an [accountant](https://github.com/BittyTax/BittyTax/wiki/Crypto-Tax-Accountants-in-the-UK) for how this should be reported according to your personal situation.\n\n#### Price Data\nThe appendix section contains all the historic price data which bittytax has used in the tax calculations.\n\nThis includes both fiat and crypto prices, split by tax year.\n\nIt is important to check that the symbol names of your assets have been interpreted correctly, and that the prices look reasonable, otherwise your tax calculations will be incorrect. See [Price Tool](#price-tool) for more information on how price data is retrieved.\n\nLinks are provided against each price, pointing to the exact data source API which was used to retrieve the data. \n\n#### Current Holdings\nThe appendix section also contains details of your remaining cryptoasset balances. The cost (including fees), the current valuation, and the calculated gain (or loss) are shown.\n\nBy default, empty wallets are excluded, this setting can be changed in the config file, see [Config](#config).\n\nThe data source used to get the latest price is the same as for the historic price data.\n\n### Processing\nYou can turn on debug using the `-d` or `--debug` option to see full details of how the transaction records are processed.\n\n1. [Import Transaction Records](#import-transaction-records)\n1. [Audit Transaction Records](#audit-transaction-records)\n1. [Split Transaction Records](#split-transaction-records)\n1. [Pool Same Day](#pool-same-day)\n1. [Match \"same day\" Rule](#match-same-day-rule)\n1. [Match \"bed and breakfast\" Rule](#match-bed-and-breakfast-rule)\n1. [Process Unmatched (Section 104)](#process-unmatched-section-104)\n1. [Integrity Check](#integrity-check)\n1. [Process Income](#process-income)\n\n#### Import Transaction Records\nFirst the transaction records are imported and validated according to their transaction type, making sure that the correct mandatory and optional fields are included.\n\nIn the log, the worksheet name (Excel only) and row number are shown against the raw record data being imported.\n\nEmpty rows are allowed, and filtered out during the import. Worksheets with a name prefixed by '--' are also filtered, these can be used for doing your own calculations.\n\n\n\nEach record is given a unique Transaction ID (TID), these are allocated in chronological order (using the timestamp) regardless of the file ordering.\n\n```\nExcel file: example.xlsx\nimporting 'Sheet1' rows\n...\nimport: 'Sheet1' row[2] ['Deposit', '870.0', 'GBP', '', '', '', '', '', '', '', 'LocalBitcoins', '2013-05-24 20:16:46', 'from Bank'] [TID:1]\nimport: 'Sheet1' row[3] ['Trade', '10.0', 'BTC', '', '870.0', 'GBP', '', '', '', '', 'LocalBitcoins', '2013-05-24 20:17:40', ''] [TID:2]\nimport: 'Sheet1' row[4] ['Withdrawal', '', '', '', '10.0', 'BTC', '', '', '', '', 'LocalBitcoins', '2013-05-24 20:20:49', 'to Desktop wallet'] [TID:3]\nimport: 'Sheet1' row[5] ['Deposit', '10.0', 'BTC', '', '', '', '', '', '', '', 'Desktop wallet', '2013-05-24 20:20:49', 'from LocalBitcoins'] [TID:4]\nimport: 'Sheet1' row[6] ['Deposit', '2693.8', 'USD', '', '', '', '', '', '', '', 'Bitstamp', '2014-05-29 08:33:00', 'from Bank'] [TID:5]\nimport: 'Sheet1' row[7] ['Spend', '', '', '', '0.002435', 'BTC', '0.8', '', '', '', 'Desktop wallet', '2014-06-26 11:25:02', ''] [TID:6]\nimport: 'Sheet1' row[8] ['Gift-Sent', '', '', '', '0.02757', 'BTC', '', '', '', '', 'Desktop wallet', '2014-07-18 13:12:47', ''] [TID:7]\nimport: 'Sheet1' row[9] ['Trade', '0.41525742', 'BTC', '', '257.53', 'USD', '', '1.29', 'USD', '', 'Bitstamp', '2014-07-23 10:58:00', ''] [TID:8]\nimport: 'Sheet1' row[10] ['Trade', '0.58474258', 'BTC', '', '362.63', 'USD', '', '1.82', 'USD', '', 'Bitstamp', '2014-07-23 10:58:00', ''] [TID:9]\nimport: 'Sheet1' row[11] ['Trade', '0.86', 'BTC', '', '521.16', 'USD', '', '2.51', 'USD', '', 'Bitstamp', '2014-07-24 13:08:00', ''] [TID:10]\n```\n\n#### Audit Transaction Records\nThe audit function takes the transaction records, and then replays them in chronological order.\n\nThe simulation of tokens (and also fiat) being moved between wallets allows you to compare the calculated final balances against your real world wallets and exchange balances.\n\nBittytax will raise a warning if a cryptoasset balance goes negative during the audit. This could happen if the time ordering of your transaction records is not accurate.\n\nThe log shows for each transaction record (TR) which wallets are being updated.\n\nThe wallet name and asset name are shown with its balance, and in brackets the quantity that has been added or subtracted.\n\n```console\naudit transaction records\n...\naudit: TR Trade 0.41525742 BTC <- 257.53 USD + fee=1.29 USD 'Bitstamp' 2014-07-23T10:58:00 UTC [TID:8]\naudit:   Bitstamp:BTC=0.41525742 (+0.41525742)\naudit:   Bitstamp:USD=2,436.27 (-257.53)\naudit:   Bitstamp:USD=2,434.98 (-1.29)\naudit: TR Trade 0.58474258 BTC <- 362.63 USD + fee=1.82 USD 'Bitstamp' 2014-07-23T10:58:00 UTC [TID:9]\naudit:   Bitstamp:BTC=1 (+0.58474258)\naudit:   Bitstamp:USD=2,072.35 (-362.63)\naudit:   Bitstamp:USD=2,070.53 (-1.82)\naudit: TR Trade 0.86 BTC <- 521.16 USD + fee=2.51 USD 'Bitstamp' 2014-07-24T13:08:00 UTC [TID:10]\naudit:   Bitstamp:BTC=1.86 (+0.86)\naudit:   Bitstamp:USD=1,549.37 (-521.16)\naudit:   Bitstamp:USD=1,546.86 (-2.51)\naudit: TR Trade 0.9 BTC <- 545.7 USD + fee=2.51 USD 'Bitstamp' 2014-07-24T13:08:00 UTC [TID:11]\naudit:   Bitstamp:BTC=2.76 (+0.9)\naudit:   Bitstamp:USD=1,001.16 (-545.7)\naudit:   Bitstamp:USD=998.65 (-2.51)\naudit: TR Trade 1.64037953 BTC <- 994.07 USD + fee=4.58 USD 'Bitstamp' 2014-07-24T13:09:00 UTC [TID:12]\naudit:   Bitstamp:BTC=4.40037953 (+1.64037953)\naudit:   Bitstamp:USD=4.58 (-994.07)\naudit:   Bitstamp:USD=0 (-4.58)\naudit: TR Withdrawal 4.40027953 BTC + fee=0.0001 BTC 'Bitstamp' 2014-07-24T21:01:00 UTC 'to Desktop wallet' [TID:13]\naudit:   Bitstamp:BTC=0.0001 (-4.40027953)\naudit:   Bitstamp:BTC=0 (-0.0001)\n```\n\n#### Split Transaction Records\nBefore any tax calculations can take place, transaction records need to be split into their constitute parts, in terms of cryptoasset buys and cryptoasset sells (each with their own valuation in GBP).\n\nThis requires the buy, sell and fee assets in the transaction record first to be given a valuation, that is unless a fixed value has already been specified, or the asset is already in GBP.\n\nValuations are calculated via one of the historic price date sources, see [Price Tool](#price-tool) for how.\n\nNote that `Deposit` and `Withdrawal` transactions are not taxable events so no valuation is required.\n\nIn the log, any transaction buys (BUY) or sells (SELL) that are created by the split are shown below the transaction record (TR). These transactions have unique TIDs allocated sequentially based on the parent transaction ID, i.e. (34.1, 34.2, 34.3, etc).\n\nIf historic price data has been used for the valuation, it is indicated by the `~` symbol, fixed values are show as `=`.\n\nGBP values are displayed with 2 decimal places, although no actual rounding has taken place. Rounding only happens when a taxable event is recorded.\n\nTimestamps are normalised to be in local time (GMT or BST). This is so that tax calculations for the same day will be correct.\n\n##### Fee Handling\nEach buy or sell transaction can include a fee. Its value is populated by the fee specified in the transaction record.\n\nIf a transaction record involves more than one cryptoasset (i.e. a `Trade` crypto-to-crypto) then the fee's valuation has to be split evenly between the buy and sell transactions.\n\nIf the fee asset is also a cryptoasset, then paying the fee counts as a separate disposal. This is recorded by adding an additional `Spend` transaction.\n\nNon-taxable transactions (i.e. `Deposit` and `Withdrawal`) are marked with `*` in the log and have no GBP valuation.\n\n```console\nsplit transaction records\n...\nsplit: TR Trade 10 BTC <- 870 GBP 'LocalBitcoins' 2013-05-24T20:17:40 UTC [TID:2]\nsplit:   BUY Trade 10 BTC (=£870.00 GBP) 'LocalBitcoins' 2013-05-24T21:17:40 BST [TID:2.1]\n...\nsplit: TR Withdrawal 7 BTC + fee=0.0002 BTC 'Desktop wallet' 2017-03-24T22:57:44 UTC 'to Poloniex' [TID:32]\nprice: 2017-03-24, 1 BTC=750.4677 GBP via CoinDesk (Bitcoin)\nprice: 2017-03-24, 1 BTC=£750.47 GBP, 0.0002 BTC=£0.15 GBP\nsplit:   SELL* Withdrawal 7 BTC 'Desktop wallet' 2017-03-24T22:57:44 GMT 'to Poloniex' [TID:32.1]\nsplit:   SELL Spend 0.0002 BTC (~£0.15 GBP) 'Desktop wallet' 2017-03-24T22:57:44 GMT 'to Poloniex' [TID:32.2]\nsplit: TR Deposit 7 BTC 'Poloniex' 2017-03-24T22:57:44 UTC 'from Desktop wallet' [TID:33]\nsplit:   BUY* Deposit 7 BTC 'Poloniex' 2017-03-24T22:57:44 GMT 'from Desktop wallet' [TID:33.1]\nsplit: TR Trade 1.00000013 ETH <- 0.03729998 BTC + fee=0.0015 ETH 'Poloniex' 2017-04-12T19:38:26 UTC [TID:34]\nprice: 2017-04-12, 1 BTC=969.6202 GBP via CoinDesk (Bitcoin)\nprice: 2017-04-12, 1 BTC=£969.62 GBP, 0.03729998 BTC=£36.17 GBP\nsplit:   BUY Trade 1.00000013 ETH (~£36.17 GBP) + fee=~£0.03 GBP 'Poloniex' 2017-04-12T20:38:26 BST [TID:34.1]\nsplit:   SELL Trade 0.03729998 BTC (~£36.17 GBP) + fee=~£0.03 GBP 'Poloniex' 2017-04-12T20:38:26 BST [TID:34.2]\nsplit:   SELL Spend 0.0015 ETH (~£0.05 GBP) 'Poloniex' 2017-04-12T20:38:26 BST [TID:34.3]\n```\n\n### Pool Same Day\nHMRC stipulates that [\"*All shares of the same class in the same company acquired by the same person on the same day and in the same capacity are treated as though they were acquired by a single transaction*\"](https://www.gov.uk/hmrc-internal-manuals/capital-gains-manual/cg51560#IDATX33F). This applies in the same way to disposals.\n\nTokens of the same cryptoasset acquired on the same day are pooled together into a single buy transaction. The same applies for tokens disposed of on the same day - they are pooled into a single sell transaction.\n\nOnly taxable transactions (i.e. acquisitions and disposals) are included within these pools.\n\nThe transaction types (`Gift-Spouse`, `Charity-Sent` and `Lost`) are not included within these pools because of their special handling.\n\nPooled transactions are indicated by a transaction count at the end. The transactions contained within the pool are then indented below it, and shown with brackets.\n\n```console\npool same day transactions\npool: BUY Trade 1 BTC (~£364.22 GBP) + fee=~£1.83 GBP 'Bitstamp' 2014-07-23T11:58:00 BST [TID:8.1] (2)\npool:   (BUY Trade 0.41525742 BTC (~£151.25 GBP) + fee=~£0.76 GBP 'Bitstamp' 2014-07-23T11:58:00 BST [TID:8.1])\npool:   (BUY Trade 0.58474258 BTC (~£212.97 GBP) + fee=~£1.07 GBP 'Bitstamp' 2014-07-23T11:58:00 BST [TID:9.1])\npool: BUY Trade 3.40037953 BTC (~£1,211.83 GBP) + fee=~£5.64 GBP 'Bitstamp' 2014-07-24T14:08:00 BST [TID:10.1] (3)\npool:   (BUY Trade 0.86 BTC (~£306.44 GBP) + fee=~£1.48 GBP 'Bitstamp' 2014-07-24T14:08:00 BST [TID:10.1])\npool:   (BUY Trade 0.9 BTC (~£320.87 GBP) + fee=~£1.48 GBP 'Bitstamp' 2014-07-24T14:08:00 BST [TID:11.1])\npool:   (BUY Trade 1.64037953 BTC (~£584.51 GBP) + fee=~£2.69 GBP 'Bitstamp' 2014-07-24T14:09:00 BST [TID:12.1])\n```\n\n### Match \"same day\" Rule\nSee [\"*The “same day” rule TCGA92/S105(1)*\"](https://www.gov.uk/hmrc-internal-manuals/capital-gains-manual/cg51560#IDATX33F).\n\nThis tax function matches any buy and sell transactions, of the same cryptoasset, that occur on the same day. \n\nIf the buy and sell quantities do not match, the transaction with the larger quantity will be split into two, and the cost and fee apportioned between them.\n\nThis allows a gain or a loss to be calculated for the matching transactions, taking into consideration the combined fees. The transaction containing the remainder is then carried forward, and used in further tax calculations.\n\nIn the log, you can see which transactions have been \"*same day*\" matched, if a buy or sell has been split, and the resulting disposal event.\n\nNew transactions created by a split are allocated the next TID in sequence.\n\n```console\nmatch same day transactions\n...\nmatch: BUY Trade 249.23062521 ETH (~£9,012.71 GBP) + fee=~£11.25 GBP 'Poloniex' 2017-04-12T20:38:26 BST [TID:34.1] (4)\nmatch: SELL Spend 0.62207655 ETH (~£22.50 GBP) 'Poloniex' 2017-04-12T20:38:26 BST [TID:34.3] (4)\nmatch:   split: BUY Trade 0.62207655 ETH (~£22.50 GBP) + fee=~£0.03 GBP 'Poloniex' 2017-04-12T20:38:26 BST [TID:34.4] (4)\nmatch:   split: BUY Trade 248.60854866 ETH (~£8,990.22 GBP) + fee=~£11.22 GBP 'Poloniex' 2017-04-12T20:38:26 BST [TID:34.5] (4)\nmatch:   Disposal(same day) gain=£-0.03 (proceeds=£22.50 - cost=£22.50 - fees=£0.03)\n```\n\n### Match \"bed and breakfast\" Rule\n\nSee [\"*The “bed and breakfast” rule TCGA92/S106A(5) and (5A)*\"](https://www.gov.uk/hmrc-internal-manuals/capital-gains-manual/cg51560#IDATR33F).\n\nThis tax functions matches sells to buybacks of the same cryptoasset which occur within 30 days.\n\nAs with the [\"same day\"](#match-same-day-rule) rule, if the buy and sell quantities do not match, a transaction will be split.\n\nTransactions are sorted by timestamp, and matched in chronological order.\n\nAny matched \"same day\" transactions are excluded from this rule.\n\nIn the log, you can see which transactions have been matched by the \"*bed & breakfast*\" rule, and the resulting disposal event.\n\n```console\nmatch bed & breakfast transactions\n...\nmatch: SELL Spend 5.32306861 BTC (~£1,474.73 GBP) + fee=~£1.47 GBP '<pooled>' 2016-01-27T22:09:19 GMT '<pooled>' [TID:17.2] (6)\nmatch: BUY Trade 5.54195456 BTC (~£1,471.32 GBP) + fee=~£1.47 GBP 'Poloniex' 2016-01-29T13:51:01 GMT [TID:23.5] (9)\nmatch:   split: BUY Trade 5.32306861 BTC (~£1,413.21 GBP) + fee=~£1.41 GBP 'Poloniex' 2016-01-29T13:51:01 GMT [TID:23.6] (9)\nmatch:   split: BUY Trade 0.21888595 BTC (~£58.11 GBP) + fee=~£0.06 GBP 'Poloniex' 2016-01-29T13:51:01 GMT [TID:23.7] (9)\nmatch:   Disposal(bed & breakfast) gain=£58.63 (proceeds=£1,474.73 - cost=£1,413.21 - fees=£2.89)\n```\n\n### Process Unmatched (Section 104)\nAny transactions which remain unmatched are processed according to Section 104 Taxation of Capital Gains Act 1992.\n\nEach cryptoasset is held in its own pool, known as a Section 104 holding. The unmatched transactions are processed in chronological order.\n\nAs tokens are acquired, the total cost and total fees for that cryptoasset holding increases.\n\nIf all tokens in a holding are disposed of, the cost will be the total cost of that cryptoasset holding, and likewise, the fees would be the total fees.\n\nIf only some tokens are disposed of, the cost is calculated as a fraction of the total cost. This fraction is calculated by the number of tokens disposed of divided by the total number of tokens held. The fees are also calculated as a fraction in the same way.\n\nThe gain or loss is then calculated by subtracting this cost and any fees from the proceeds of the disposal. Fees are included from both the Section 104 holding (acquisition fees) and also the disposal fee.\n\nTransactions which have been \"matched\", or \"transfer\" (non-taxable) transactions are excluded from the Section 104 holding, and denoted with // at the start.\n\nAs the unmatched transactions are processed, the impact it has on the individual holding is shown in the log.\n\nWhen a disposal takes place, the gain calculation is then shown below. \n\n```console\nprocess unmatched transactions\n...\nsection104: BUY Trade 0.21888595 BTC (~£58.11 GBP) + fee=~£0.06 GBP 'Poloniex' 2016-01-29T13:51:01 GMT [TID:23.7] (9)\nsection104:   BTC=17.58916048 (+0.21888595) cost=£2,943.19 GBP (+£58.11 GBP) fees=£7.47 GBP (+£0.06 GBP)\nsection104: //SELL Spend 0.01110608 BTC (~£2.95 GBP) 'Poloniex' 2016-01-29T14:12:31 GMT [TID:23.3] (7) <- matched\nsection104: //SELL* Withdrawal 7 BTC 'Desktop wallet' 2017-03-24T22:57:44 GMT 'to Poloniex' [TID:32.1] <- transfer\nsection104: //BUY* Deposit 7 BTC 'Poloniex' 2017-03-24T22:57:44 GMT 'from Desktop wallet' [TID:33.1] <- transfer\nsection104: SELL Spend 0.0002 BTC (~£0.15 GBP) 'Desktop wallet' 2017-03-24T22:57:44 GMT 'to Poloniex' [TID:32.2]\nsection104:   BTC=17.58896048 (-0.0002) cost=£2,943.16 GBP (-£0.03 GBP) fees=£7.47 GBP (-£0.00 GBP)\nsection104:   Disposal(section 104) gain=£0.12 (proceeds=£0.15 - cost=£0.03 - fees=£0.00)\n```\n\n### Integrity Check \nThe integrity check compares the final balances from the audit against the final balances of the Section 104 pools.\n\nIt's purpose is to find issues with transfer transactions which might impact your tax calculations.\n\nThe integrity check will only be successful if your transaction records are complete (i.e. there is a matching Deposit for every Withdrawal).\n\nYou can bypass this check by using the `--skipint` option.\n\nPossible reasons for failure:\n\n1. Withdrawal has a missing Deposit.\n1. A Withdrawal and it's corresponding Deposit have mismatching quantities.\n1. The Withdrawal quantity is not the net amount (after fee deduction), with the fee specified.\n1. The Deposit quantity is not the gross amount (before fee deduction), with the fee specified.\n1. Withdrawal/Deposit transactions have been used incorrectly (they should only be used to move existing tokens between your own wallets).\n\nIn this example, the Section 104 Pool has a difference of 0.0002 BTC.\n\n```console\nintegrity check: failed\nWARNING Integrity check failed: audit does not match section 104 pools, please check Withdrawals and Deposits for missing fees\n\nAsset                Audit Balance          Section 104 Pool                Difference\nBTC                    14.00369127               14.00389127                   +0.0002\n```\n\nIn the log, there is a Withdrawal (from 'Desktop wallet') of 7.0002 BTC, but the corresponding Deposit (to 'Poloniex') is 7 BTC. The Withdrawal quantity is the gross amount (before the 0.0002 fee), instead of being the net amount with the fee specified.\n\n```console\nprocess section 104\n...\nsection104: BUY Trade 0.21888595 BTC (~£58.11 GBP) + fee=~£0.06 GBP 'Poloniex' 2016-01-29T13:51:01 GMT [TID:23.7] (9)\nsection104:   BTC=17.58916048 (+0.21888595) cost=£2,943.19 GBP (+£58.11 GBP) fees=£7.47 GBP (+£0.06 GBP)\nsection104: //SELL Spend 0.01110608 BTC (~£2.95 GBP) 'Poloniex' 2016-01-29T14:12:31 GMT [TID:23.3] (7) <- matched\nsection104: //SELL* Withdrawal 7.0002 BTC 'Desktop wallet' 2017-03-24T22:57:44 GMT 'to Poloniex' [TID:32.1] <- transfer\nsection104: //BUY* Deposit 7 BTC 'Poloniex' 2017-03-24T22:57:44 GMT 'from Desktop wallet' [TID:33.1] <- transfer\nsection104: //SELL Trade 1.0003 BTC (~£969.91 GBP) + fee=~£1.21 GBP 'Poloniex' 2017-04-12T20:38:26 BST [TID:34.6] (4) <- matched\n```\n\nUnfortunately the tool cannot do this checking for you, as it does not know what is the correct Deposit for the Withdrawal.\n\nAn easy way to find any discrepancies, is to filter the debug log to see just the transfers.\n\n```console\n$ bittytax <filename> -d | grep \"<- transfer\"\nsection104: //SELL* Withdrawal 10 BTC 'LocalBitcoins' 2013-05-24T21:20:49 BST 'to Desktop wallet' [TID:3.1] <- transfer\nsection104: //BUY* Deposit 10 BTC 'Desktop wallet' 2013-05-24T21:20:49 BST 'from LocalBitcoins' [TID:4.1] <- transfer\nsection104: //SELL* Withdrawal 4.40027953 BTC 'Bitstamp' 2014-07-24T22:01:00 BST 'to Desktop wallet' [TID:13.1] <- transfer\nsection104: //BUY* Deposit 4.40027953 BTC 'Desktop wallet' 2014-07-24T22:53:37 BST 'from Bitstamp' [TID:14.1] <- transfer\nsection104: //BUY* Deposit 6 BTC 'Poloniex' 2016-01-27T21:01:03 GMT 'to Desktop wallet' [TID:16.1] <- transfer\nsection104: //SELL* Withdrawal 6 BTC 'Desktop wallet' 2016-01-27T21:15:41 GMT 'from Poloniex' [TID:17.1] <- transfer\nsection104: //SELL* Withdrawal 7.0002 BTC 'Desktop wallet' 2017-03-24T22:57:44 GMT 'to Poloniex' [TID:32.1] <- transfer\nsection104: //BUY* Deposit 7 BTC 'Poloniex' 2017-03-24T22:57:44 GMT 'from Desktop wallet' [TID:33.1] <- transfer\nsection104: //SELL* Withdrawal 2 BTC 'Poloniex' 2017-12-24T12:01:33 GMT 'to Coinfloor' [TID:51.1] <- transfer\nsection104: //BUY* Deposit 2 BTC 'Coinfloor' 2017-12-24T13:53:19 GMT 'from Poloniex' [TID:52.1] <- transfer\n```\n\n### Process Income\nThis function searches through all the original transactions, and records any that are applicable for income tax. Currently this is `Mining`, `Staking`, `Interest`, `Dividend` and `Income` transaction types.\n\nNote, only cryptoasset income is recorded not fiat.\n\n## Conversion Tool\nThe bittytax conversion tool `bittytax_conv` takes all of the data files exported from your wallets and exchanges, normalises them into the transaction record format required by bittytax, and consolidates them into a single Excel spreadsheet for you to review, make edits, and add any missing records.\n\nDon't worry if you don't have Microsoft Excel installed. These spreadsheets will work with [OpenOffice](https://www.openoffice.org) or [LibreOffice](https://www.libreoffice.org). You can also use [Google Sheets](https://www.google.co.uk/sheets/about/) or [Numbers for Mac](https://www.apple.com/uk/numbers/), although some conditional formatting is not supported.\n\nEach converted file appears within its own worksheet. Data files of the same format are aggregated together. The transaction records and the original raw data appear side by side, sorted by timestamp, making it easier for you to review and to provide traceability.\n\nThe converter takes care of all the cell formatting to ensure that all decimal places are displayed correctly, and if numbers exceed 15-digits of precision (an Excel limitation) they are stored as text to prevent any truncation.\n\nFor most wallet files, transactions can only be categorised as deposits or withdrawals. You will need to edit these to reflect your real transactions (i.e. spends, gifts, income, etc.). This is easy with Excel, as the valid options are selectable via a dropdown menu.\n\n**Wallets:**\n- Blockchain.com\n- Coinomi\n- Electrum\n- Exodus\n- HandCash\n- Helium\n- Ledger Live\n- Qt Wallet (i.e. Bitcoin Core)\n- Trezor\n\n**Exchanges:**\n- Binance\n- Bitfinex\n- Bitstamp\n- Bittrex\n- ChangeTip \n- Circle\n- Coinbase\n- Coinbase Pro\n- Coinfloor\n- Crypto.com\n- Cryptopia\n- Cryptsy\n- Gatehub\n- Gravity (Bitstocks)\n- HitBTC\n- Hotbit\n- Kraken\n- KuCoin\n- Liquid\n- OKEx\n- Poloniex\n- TradeSatoshi\n- Uphold\n- Wirex\n\n**Savings & Loans**\n- BlockFi\n- Celsius\n- Nexo\n\n**Explorers:**\n- BscScan\n- Energy Web\n- Etherscan\n- HecoInfo\n- Zerion\n\n**Accounting:**\n- Accointing\n- CoinTracking\n\n### Usage\nThe help option displays a full list of recognised data file formats, as well as details of all command line arguments.\n\n    bittytax_conv --help\n\nTo use the conversion tool (assuming you've already exported your data), just enter the filenames of all your data files, in any order, as command arguments.\n\nMost terminals allow you to drag and drop files from the desktop into the terminal window, this saves you time by giving you the correct file path without having to enter it manually.\n\n    bittytax_conv <filename> [<filename> ...]\n\nEach file is analysed to try and match it against one of the recognised formats. If successful, an Excel file will be generated with the default filename `BittyTax_Records.xlsx`. Unrecognised files are skipped and a warning displayed.\n\nIf you want to change the default filename you can use the `-o` argument followed by the output filename.\n\n    bittytax_conv <filename> [<filename> ...] -o <output filename>\n\nNote, it is important that you always pass the original raw files into the conversion tool. If you open your CSV files in Excel first and make edits, it can mess with the date formats, etc and cause issues with the conversion. \n\n### Duplicate Records\n\nFor some exchanges you have to repeatedly download your transaction history, this can happen if the exchange only lets you run a report for the previous 3 months.\n\nIf you have multiple export files for the same exchange, these can all be passed into the conversion tool which by default will group them together into the same worksheet and sort them by timestamp.\n\nIf there is any overlap in the reporting period this can result in duplicate entries which will cause your data not to balance out. One solution to this is to manually remove these duplicates, another is for the conversion tool to do it for you by specifying the `--duplicates` argument.\n\nThis option should be used with care, since some exchange files can appear to have exact duplicates but can be due to partially filled orders within the exact same time period, with same order id and even the same amount!\n\n### Unidentified Cryptoassets\n\nSome wallet exports do not specify the actual cryptoasset being used. This will result in an error when the file is processed.\n\nThe `-ca` or `--cryptoasset` argument can be used to manually specify the asset.\n\n    bittytax_conv -ca BTC <filename>\n\nIf you have multiple wallet files with this issue, you can either process each one individually, and then consolidate them into a single spreadsheet. Or you could edit the asset name in the spreadsheet for any which are incorrect.\n\n### Output Formats\n\nThe default output format is Excel, but you can also choose CSV or RECAP by using the `--format` argument.\n\n**CSV**\n\nCSV is the legacy format used by bittytax which outputs transaction records directly into the terminal window, unless an output filename is specified.\n\nA useful feature of the CSV format is that the output can be piped directly into bittytax.\n\n    bittytax_conv --format CSV <filename> | bittytax\n\nThis will instantly show you what the remaining balance of each asset should be for that wallet or exchange file.\n\n**Recap**\n\nYou can also use the conversion tool to convert your wallet or exchange files into the import CSV format used by Recap (see https://help.recap.io/en/articles/2631702-importing-csvs-into-custom-accounts).\n\n    bittytax_conv --format RECAP <filename>\n\n### Notes:\n1. Some exchanges only allow the export of trades. This means transaction records of deposits and withdrawals will have to be created manually, otherwise the assets will not balance.\n1. Bitfinex - when exporting your data, make sure the \"*Date Format*\" is set to \"*DD-MM-YY*\" which is the default.\n1. ChangeTip - the conversion tool requires your username(s) to be configured. This is to identify which transactions are a gift received or a gift sent. See [Config](#config).\n1. Coinbase - the latest \"*Transaction history (all-time)*\" report format from Coinbase is not as complete and detailed as previous reports. Below is a list of issues I'm aware of, there may be others.\n    * Early referral rewards appear as BTC buys. These are filtered from real buys by checking if the fee is zero.\n    * EUR buys/sells are listed as GBP. The actual currency is identified from the description in the \"*Notes*\" field.\n    * Fiat deposits/withdrawals are not shown in the report so will not balance.\n    * Crypto deposits/withdrawals which are relayed to/from Coinbase Pro are missing so will not balance.\n\n    If you are also using Coinbase Pro, and your account does not balance, see below.\n1. Coinbase Pro - generate the \"*Account Statement*\" report and export. This report on its own should balance correctly.\n\n    If you are also using Coinbase, the only way to get these accounts to both balance, is to manually add the missing relayed deposit/withdrawal transaction records into your Coinbase accounts.\n\n    This converter can be very slow with large amounts of data.\n1. CoinTracking - export the \"*Trade Prices*\" report, but first change the date and time format to include seconds. This can be found under \"*Account Settings*\" -> \"*Display Settings*\". Select the special format \"*d.m.Y H:i:s*\".\n1. Etherscan - for ERC-20 (Tokens) and ERC-721 (NFTs) exports, it is important that the filename contains your ethereum address (Etherscan does this by default), as it is used to determine if transactions are being sent or received.\n1. GateHub - some exports contain incomplete data (i.e. no counter asset in an \"*exchange*\"), which are possibly failed transactions. The tool will filter them and raise a warning for you to review, the data still appears to balance correctly. Any XRP network fees which cannot be attributed to a \"*payment*\" or an \"*exchange*\" will be included separately as a spend transaction record.\n1. Hotbit - the exported file (.xls) is actually a html file, you will need to open this file in Excel and then \"*Save As*\" the Excel workbook format (.xlsx) before you can convert it.\n1. Kraken - export both the \"*Trades*\" and \"*Ledgers*\" history.\n1. Qt Wallet - by default, unconfirmed transactions are filtered by the conversion tool. If you want to include them, use the `-uc` or `--unconfirmed` command argument.\n\n## Price Tool\nThe bittytax price tool `bittytax_price` allows you to get the latest and historic prices of cryptoassets and foreign currencies. Its use is not strictly required as part of the process of completing your accounts, but provides a useful insight into the prices which bittytax will assign when it comes to value your cryptoassets in UK pounds (or other [local currency](https://github.com/BittyTax/BittyTax#local_currency)).\n\n**Data Sources:**\nThe following price data sources are used.\n\n- [BittyTaxAPI](https://github.com/BittyTax/BittyTax/wiki/BittyTaxAPI) - foreign currency exchange rates *(primary fiat)*\n- [Frankfurter](https://www.frankfurter.app) - foreign currency exchange rates \n- [CoinDesk BPI](https://old.coindesk.com/coindesk-api) - bitcoin price index *(primary bitcoin)*\n- [Crypto Compare](https://min-api.cryptocompare.com) - cryptoasset prices *(primary crypto, secondary bitcoin)*\n- [Coin Gecko](https://www.coingecko.com/en/api) - cryptoasset prices *(secondary crypto)*\n- [Coin Paprika](https://coinpaprika.com/api/) - cryptoasset prices\n\nThe priority (primary, secondary, etc) to which data source is used and for which asset is controlled by the `bittytax.conf` config file, (see [Config](#config)). If your cryptoasset cannot be identified by the primary data source, the secondary source will be used, and so on. \n\nAll historic price data is cached within the .bittytax/cache folder in your home directory. This is to prevent repeated lookups and reduce load on the APIs which could fail due to throttling.\n\n### Usage\n\nTo get the latest price of an asset, use the `latest` command, followed by the asset symbol name. This can be a cryptoasset (i.e. BTC) or a foreign currency (i.e. USD). An optional quantity can also be specified.\n\n    bittytax_price latest asset [quantity]\n\nIf the lookup is successful not only will the price be displayed in the terminal window, but also the data source used and the full name of the asset. This is useful in making sure the asset symbol you are using in your transaction records is the correct one.\n\n```console\n$ bittytax_price latest ETH 0.5\n1 ETH=0.07424 BTC via CryptoCompare (Ethereum)\n1 BTC=45,906.6862 GBP via CoinDesk (Bitcoin)\n1 ETH=£3,408.11 GBP\n0.5 ETH=£1,704.06 GBP\n```\n\nIf you wish to perform a historic data lookup, use the `historic` command instead, followed by the asset symbol name and the date.  The date can be in either `YYYY-MM-DD` or `DD/MM/YYYY` formats.\n\n    bittytax_price historic asset date [quantity]\n\nBy specifying a quantity to price, you can use the tool to calculate the historic price of a specific transaction. This can be used as a memory jogger if you are looking at old wallet transactions and trying to remember what it was you spent your crypto on!\n\n```console\n$ bittytax_price historic BTC 2014-06-24 0.002435\n1 BTC=338.5947 GBP via CoinDesk (Bitcoin)\n1 BTC=£338.59 GBP\n0.002435 BTC=£0.82 GBP\n```\n\nSince there is no standardisation of cryptoasset symbols, it's possible that the same symbol will have different meanings across data sources. For example, EDG is Edgeless on CryptoCompare, CoinGecko and CoinPaprika, but can also be Edgeware on CoinGecko.\n\nA quick way to check this is to use the `list` command, followed by an asset symbol name.\n\n    bittytax_price list [asset]\n\nThis command will return any matches it finds for that asset symbol name across all the data sources. Some data sources use an asset ID to differentiate between those with the same symbol name.\n\nThe `<-` arrow to the right indicates which data source/asset ID will be automatically selected by the price tool.\n\n```console\n$ bittytax_price list EDG\nEDG (Edgeless) via CryptoCompare <-\nEDG (Edgeless) via CoinGecko [ID:edgeless]\nEDG (Edgeware) via CoinGecko [ID:edgeware]\nEDG (Edgeless) via CoinPaprika [ID:edg-edgeless]\n```\n\nIf you are having trouble identifing the symbol name to use, you can use the `-s` option, followed by a search term.\n\n```console\n$ bittytax_price list -s edgeware\nEDG (Edgeware) via CoinGecko [ID:edgeware]\nEDGEW (Edgeware) via CryptoCompare\n```\n\nYou can also get a complete list of all the supported assets (in alphabetical order) by not specifying any asset or search term.\n\nIf bittytax is not picking up the correct asset price for you, you can change the config so the symbol name uses a different data source and asset ID. See [Config](#config).\n\nThe `latest` and `historic` price commands also give you the `-ds` option to override the config and specify the data source directly. It's a quick way to check asset prices are correct before updating your config.\n\n```console\n$ bittytax_price historic EDG 2020-07-04 -ds CoinGecko\n1 EDG=0.0000008391983861113843 BTC via CoinGecko (Edgeless)\n1 BTC=7,276.0537 GBP via CoinDesk (Bitcoin)\n1 EDG=£0.01 GBP\n1 EDG=0.000000637935405438 BTC via CoinGecko (Edgeware)\n1 BTC=7,276.0537 GBP via CoinDesk (Bitcoin)\n1 EDG=£0.00 GBP\n```\n\nYou can also set the data source to `ALL`, this will return price data for all data sources which have a match. If the [Price Data](#price-data) appendix in your tax report has any missing data, you can use this method to find prices. Some data sources have price history going back further than others.\n\n```console\n$ bittytax_price historic EDG 2020-07-04 -ds ALL\n1 EDG=0.000001 BTC via CryptoCompare (Edgeless) <-\n1 BTC=7,276.0537 GBP via CoinDesk (Bitcoin)\n1 EDG=£0.01 GBP\n1 EDG=0.0000008391983861113843 BTC via CoinGecko (Edgeless)\n1 BTC=7,276.0537 GBP via CoinDesk (Bitcoin)\n1 EDG=£0.01 GBP\n1 EDG=0.000000637935405438 BTC via CoinGecko (Edgeware)\n1 BTC=7,276.0537 GBP via CoinDesk (Bitcoin)\n1 EDG=£0.00 GBP\n1 EDG=0.00000089 BTC via CoinPaprika (Edgeless)\n1 BTC=7,276.0537 GBP via CoinDesk (Bitcoin)\n1 EDG=£0.01 GBP\n```\n\nTo get a full details of all arguments, use the help option, either on its own or for a specific command.\n\n    bittytax_price [command] --help\n\n### Notes:\n1. Not all data source APIs return prices in UK pounds (GBP), for this reason cryptoasset prices are requested in BTC and then converted from BTC into UK pounds (GBP) as a two step process. This may change in the near future for stablecoins, see [#82](https://github.com/BittyTax/BittyTax/issues/82).\n1. Some APIs return multiple price points for the same day. CoinDesk and CryptoCompare use the 'close' price. CoinGecko and CoinPaprika use the 'open' price. See [#45]( https://github.com/BittyTax/BittyTax/issues/45).\n1. Historical price data is cached for each data source as a separate JSON file in the .bittytax/cache folder within your home directory. Beware if you are changing a symbol name to point to a different data source/asset ID as previous data might be cached.\n1. CoinPaprika does not support BTC/GBP historic prices.\n\n## Config\nThe `bittytax.conf` file resides in the .bittytax folder within your home directory.\n\nThe [default](https://github.com/BittyTax/BittyTax/blob/master/bittytax/config/bittytax.conf) file created at runtime should cater for most users.\n\nIf you need to change anything, the parameters are described below. The file is in YAML format.\n\nIf you want to check your config settings, turn on debug.\n\n```\nbittytax -d\n```\n\n| Parameter | Default | Description |\n| --- | --- | --- |\n| `local_currency:` | `GBP` | Local currency used for pricing assets |\n| `fiat_list:` | `['GBP', 'EUR', 'USD']` | List of fiat symbols used |\n| `crypto_list:` | `['BTC', 'ETH', 'XRP', 'LTC', 'BCH', 'BNB', 'USDT']` | List of prioritised cryptoasset symbols |\n| `trade_asset_type:` | `2` | Method used to calculate asset value in a trade |\n| `trade_allowable_cost_type:` | `2` | Method used to attribute the trade fee |\n| `show_empty_wallets:` | `True` | Include empty wallets in current holdings report |\n| `transfers_include:` | `False` | Include transfer transactions in the tax calculations |\n| `transfer_fee_disposal:` | `True` | Transfer fees are a disposal |\n| `transfer_fee_allowable_cost:` | `False` | Transfer fees are an allowable cost |\n| `lost_buyback:` | `True` | Lost tokens should be reacquired |\n| `data_source_select:` | `{'BTC': ['CoinDesk']}` | Map asset to a specific data source(s) for prices |\n| `data_source_fiat:` | `['BittyTaxAPI']` | Default data source(s) to use for fiat prices |\n| `data_source_crypto:` | `['CryptoCompare', 'CoinGecko']` | Default data source(s) to use for cryptoasset prices |\n| `coinbase_zero_fees_are_gifts:` | `False` | Coinbase parser, treat zero fees as gifts |\n| `usernames:` | | List of usernames as used by ChangeTip |\n\n### local_currency\nThe local currency used for pricing assets, default is GBP. See [International support](https://github.com/BittyTax/BittyTax/wiki/International-Support).\n\n### fiat_list\nUsed to differentiate between fiat and cryptoassets symbols. Make sure you configure all fiat currencies which appear within your transaction records here.\n\n### crypto_list\nIdentifies which cryptoasset takes priority when calculating the value of a crypto-to-crypto trade (see [trade_asset_type](#trade_asset_type)). The priority is taken in sequence, so in an ETH/BTC trade, the value of the BTC would be used in preference to ETH when pricing the trade.\n\nThe list should contain the most prevalent cryptoassets which appear in exchange trading pairs. These are predominantly the higher market cap. tokens.\n\n### trade_asset_type\nControls the method used to calculate the asset value of a trade:\n\n- `0` = Buy asset value  \n- `1` = Sell asset value  \n- `2` = Priority asset value *(recommended)*  \n\nFor every trade there are always two assets involved: fiat-to-crypto, crypto-to-fiat or crypto-to-crypto. When bittytax is trying to calculate the value of a trade, it uses this parameter to determine which asset value should be used to price the trade in UK pounds.\n\nFor trades involving fiat, it's obvious that we want to price the asset using the fiat value. However, it's not so straight forward for crypto-to-crypto trades.\n\nThe recommended setting is `2` (Priority). This means that the asset value chosen will be selected according to the priority order defined by the `fiat_list` and `crypto_list` parameters combined. Fiat will always be chosen first, followed by the most prevalent cryptoasset.\n\nSetting this parameter to `1` or `2` will result in either the buy asset value or the sell asset value always being used, regardless of whether the trades involved fiat or not. \n\n### trade_allowable_cost_type\nControls the method used to attribute the trade fee (an allowable cost) to the assets in a crypto-to-crypto trade.\n\n- `0` = Buy asset\n- `1` = Sell asset\n- `2` = Split evenly between the buy and sell asset (default)\n\nThe guidance from [HMRC on allowable expenses](https://www.gov.uk/hmrc-internal-manuals/cryptoassets-manual/crypto22150#exchange-fees), indicates that \"*the fee is attributable to both assets*\" when swapping one token for another.\n\n### show_empty_wallets\nInclude empty wallets in the current holdings report. Can be set to `True` or `False`.\n\n### transfers_include\nControls the method used to handle transfer transactions types (`Deposit` and `Withdrawal`) in the tax calculations. \n\n- `True` = Transfers included\n- `False` = Transfers excluded (default)\n\nThe pros and cons of each method are listed below:\n\n#### \"Transfers included\"\n1. Disposals NOT allowed between a Withdrawal and a Deposit (this is because the cost basis would be wrong, as the tokens are temporarily removed and then re-added).\n1. Fees do NOT need to be specified for transfers; they are implied by the difference between the 2 transfer transactions (i.e. what is lost is the fee).\n1. Integrity check will verify that no disposals occur during a transfer.\n1. Transfer fees are removed from the section 104 pool at zero cost.\n1. Not possible to configure transfer fees as disposal (taxable event).\n1. Not possible to configure transfer fees as an allowable cost.\n\n#### \"Transfers excluded (default)\"\n1. Disposals between a Withdrawal and a Deposit are allowed.\n1. All transfer fees have to be specified, the Withdrawal quantity and its corresponding Deposit quantity should match, so everything will balance when they are excluded from the tax calculations.\n1. Integrity check will verify that the audit balances match the section 104 pools. This is to make sure transfers have been recorded correctly and no transfer fees are missing.\n1. Transfer fees can be configured as zero cost.\n1. Transfer fees can be configured as a disposal (taxable event).\n1. Transfer fees can be configured as an allowable cost.\n\n### transfer_fee_disposal\nThis parameter is only relevant if transfers are excluded from the tax calculations (i.e. transfer fees have been specified).\n\n- `True` = The transfer fee is a disposal, a taxable event (default)\n- `False` = Not a disposal, transfer fee removed from the pool at zero cost\n\nFrom the [HMRC guidance on what is a disposal](https://www.gov.uk/hmrc-internal-manuals/cryptoassets-manual/crypto22100), \"*There is no disposal if the individual retains beneficial ownership of the tokens throughout the transaction, for example moving tokens between public addresses that the individual beneficially controls (commonly described as moving tokens between wallets).*\"\n\nAlthough not explicitly stated, this implies that those tokens used to pay the transfer fee (i.e. paid to the miner to add the transaction to a block), would be disposal, under the rule \"*using tokens to pay for goods or services*\".\n\n### transfer_fee_allowable_cost\nThis parameter is only relevant if transfer fees are disposals.\n\n- `True` = Transfer fee is an allowable cost, results in the disposal with zero gain.\n- `False` = Transfer fee is NOT an allowable cost (default) \n\nThe [HMRC guidance on allowable expenses](https://www.gov.uk/hmrc-internal-manuals/cryptoassets-manual/crypto22150#exchange-fees) does not specifically cover transfer fees, \"*transaction fees paid for having the transaction included on the distributed ledger*\" is an allowable cost, but only for a disposal, transfers between your own wallets are not disposals, but paying the fee is? The guidance could be interpreted either way, our default and recommendation is that they are NOT an allowable cost.   \n### lost_buyback\nThis controls whether a `Lost` transaction type results in a reacquisition, as per the [HMRC guidance on losing private keys](https://www.gov.uk/hmrc-internal-manuals/cryptoassets-manual/crypto22400).\n\n- `True` = Lost tokens are reacquired (default)\n- `False` = Lost tokens are removed\n\nThis could be used in the future when implementing tax rules for different countries.\n\n### data_source_select\nMaps a specific asset symbol to a list of data sources in priority order.\n\nThis parameter overrides the any data sources defined by `data_source_fiat` and `data_source_crypto` (see below).\n\nBy default, only an entry for BTC exists. This selects CoinDesk as the primary data source for bitcoin prices and CryptoCompare as the secondary. \n\nIf, for example you wanted EDG to use only the CoinGecko data source, overriding the default which is CryptoCompare. You would change the config as follows.\n\n```yaml\ndata_source_select: {\n    'BTC': ['CoinDesk', 'CryptoCompare'],\n    'EDG': ['CoinGecko'],\n    }\n```\n\nTo identify a specific asset ID for a datasource, you can use the `:` colon separator.\n\n```yaml\ndata_source_select: {\n    'BTC': ['CoinDesk', 'CryptoCompare'],\n    'EDG': ['CoinGecko:edgeless'],\n    }\n```\n\nYou can also define a custom asset symbol. In the example, EDGW is used to avoid a clash with EDG.\n\n```yaml\ndata_source_select: {\n    'BTC': ['CoinDesk', 'CryptoCompare'],\n    'EDG': ['CoinGecko:edgeless'],\n    'EDGW': ['CoinGecko:edgeware'],\n    }\n```\n\n### data_source_fiat\nSpecifies which data source(s), in priority order, will be used for retrieving foreign currency exchange rates.\n\n```yaml\ndata_source_fiat:\n    ['BittyTaxAPI']\n```\n\nSupported data sources for fiat are:\n- `BittyTaxAPI`\n- `Frankfurter`\n\n### data_source_crypto\nSpecifies which data source(s), in priority order, will be used for retrieving cryptoasset prices.\n\n```yaml\ndata_source_crypto:\n    ['CryptoCompare', 'CoinGecko']\n```\n\nSupported data sources for cryptoassets are:\n- `CoinDesk`\n- `CryptoCompare`\n- `CoinGecko`\n- `CoinPaprika`\n\n### coinbase_zero_fees_are_gifts\nThis parameter is only used by the conversion tool. It controls how the Coinbase parser will handle a zero fee \"Buy\" trade.\n\n- `True` = Zero fee \"Buy\" is a `Gift-Received`\n- `False` = Zero fee \"Buy\" is a `Trade` (default) \n\nSome old Coinbase transactions show referrals/airdrops as trades, the only way to differentiate these is they have zero fees. This is not fool proof since it's possible (but not common) for a trade to also have zero fees.\n\n### usernames\nThis parameter is only used by the conversion tool.\n\nIt's required for ChangeTip data files. The list of username(s) is used to identify which transactions are gifts received and gifts sent.\n\nAn example is shown below.\n```yaml\nusernames:\n    ['Bitty_Bot', 'BittyBot']\n```\n\n## Future\nHere are some ideas for the project roadmap. \n\n### General\n- Document code.\n- Add tests.\n\n### Conversion Tool\n- Convert data from clipboard. Some wallets/exchanges don't provide an export function. It should be possible to copy the transaction data directly from the webpage and have the conversion tool analyse this data and then convert it into the transaction record format.\n- Add exchange APIs to automatically convert new trades into the transaction record format.\n\n### Accounting Tool\n- Add support for Margin/Futures trading.\n- Tax rules for other countries, see [International support](https://github.com/BittyTax/BittyTax/wiki/International-Support).\n- BittyTax integration with Excel. The command line interface is not for everyone. By integrating with Excel (or OpenOffice), this would greatly improve the user experience.\n- Add Excel macro to find corresponding Deposit for a Withdrawal, and validate quantities in your transaction records.\n- Add export function for QuickBooks (QBXML format), to include transactions records with exchange rate data added.\n\n## Resources\n**HMRC Links:**\n- https://www.gov.uk/government/publications/tax-on-cryptoassets\n- https://www.gov.uk/guidance/check-if-you-need-to-pay-tax-when-you-receive-cryptoassets\n- https://www.gov.uk/guidance/check-if-you-need-to-pay-tax-when-you-sell-cryptoassets\n- https://www.gov.uk/guidance/non-cash-pay-shares-commodities-you-provide-to-your-employees\n- https://www.gov.uk/hmrc-internal-manuals/vat-finance-manual/vatfin2330\n- https://www.gov.uk/hmrc-internal-manuals/capital-gains-manual/cg12100\n- https://www.gov.uk/government/publications/cryptoassets-taskforce\n\n**HMRC Webinar**\n- https://www.youtube.com/watch?v=EzNebqkw13w\n\n## Donations\nIf you would like to support this project, you can donate via [PayPal] or in [bitcoin]. All donations are gratefully received.\n\nDisclosure: All donations go to Nano Nano Ltd, the creator and maintainer of this project. Nano Nano Ltd is not a charity, or non-profit organisation.\n\n[version-badge]: https://img.shields.io/pypi/v/BittyTax.svg\n[license-badge]: https://img.shields.io/pypi/l/BittyTax.svg\n[python-badge]: https://img.shields.io/pypi/pyversions/BittyTax.svg\n[downloads-badge]: https://img.shields.io/pypi/dm/bittytax\n[github-stars-badge]: https://img.shields.io/github/stars/BittyTax/BittyTax?color=yellow\n[twitter-badge]: https://img.shields.io/twitter/follow/bitty_tax?color=%231DA1F2&style=flat\n[discord-badge]: https://img.shields.io/discord/581493570112847872.svg\n[paypal-badge]: https://img.shields.io/badge/donate-PayPal-179bd7.svg\n[bitcoin-badge]: https://img.shields.io/badge/donate-bitcoin-orange.svg\n[version]: https://pypi.org/project/BittyTax/\n[license]: https://github.com/BittyTax/BittyTax/blob/master/LICENSE\n[python]: https://wiki.python.org/moin/BeginnersGuide/Download\n[downloads]: https://pypistats.org/packages/bittytax\n[github-stars]: https://github.com/BittyTax/BittyTax/stargazers\n[twitter]: https://twitter.com/intent/follow?screen_name=bitty_tax\n[discord]: https://discord.gg/NHE3QFt\n[PayPal]: https://www.paypal.com/donate?hosted_button_id=HVBQW8TBEHXLC\n[bitcoin]: https://donate.bitty.tax \n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "https://github.com/BittyTax/BittyTax/archive/v0.5.0.zip",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/BittyTax/BittyTax",
    "keywords": "bittytax cryptoasset cryptocurrency crypto tax",
    "license": "AGPLv3",
    "maintainer": "",
    "maintainer_email": "",
    "name": "BittyTax",
    "package_url": "https://pypi.org/project/BittyTax/",
    "platform": "",
    "project_url": "https://pypi.org/project/BittyTax/",
    "project_urls": {
      "Changes": "https://github.com/BittyTax/BittyTax/blob/master/CHANGELOG.md",
      "Discord": "https://discord.com/invite/NHE3QFt",
      "Donate": "https://www.paypal.com/donate?hosted_button_id=HVBQW8TBEHXLC",
      "Download": "https://github.com/BittyTax/BittyTax/archive/v0.5.0.zip",
      "Homepage": "https://github.com/BittyTax/BittyTax",
      "Source": "https://github.com/BittyTax/BittyTax",
      "Tracker": "https://github.com/BittyTax/BittyTax/issues",
      "Twitter": "https://twitter.com/bitty_tax"
    },
    "release_url": "https://pypi.org/project/BittyTax/0.5.0/",
    "requires_dist": [
      "python-dateutil (>=2.7.0)",
      "requests",
      "pyyaml",
      "xlrd (<=1.2.0)",
      "xlsxwriter",
      "jinja2",
      "xhtml2pdf",
      "colorama",
      "tqdm"
    ],
    "requires_python": "",
    "summary": "Crypto-currency tax calculator for UK tax rules. Produces a PDF report of your capital gains and income. Import your data from popular wallets and exchanges (i.e. Coinbase, Binance, etc).",
    "version": "0.5.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17137773,
  "releases": {
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0f9e93286cb8ce0f7b109781cfc56737e1c60937e841607c5b68b808135cbbe0",
          "md5": "0e005fa0060d32ae51ff919bfdeb8a03",
          "sha256": "084fb5ec1d2969fd7b197e1cd7c1a90af5f5744060e409ee93c58acda64e244b"
        },
        "downloads": -1,
        "filename": "BittyTax-0.1.0-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "0e005fa0060d32ae51ff919bfdeb8a03",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": null,
        "size": 70125,
        "upload_time": "2019-05-23T22:54:54",
        "upload_time_iso_8601": "2019-05-23T22:54:54.403730Z",
        "url": "https://files.pythonhosted.org/packages/0f/9e/93286cb8ce0f7b109781cfc56737e1c60937e841607c5b68b808135cbbe0/BittyTax-0.1.0-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8777a5c99e8bf0c135f95b257a49027f8f76526434448fa37b34d443baf56a53",
          "md5": "b506dcda54c0795684a4a8dce5b6b259",
          "sha256": "23c49095719c04642352d3062d068857e1d5e8d713545fc64faafa3055fdd793"
        },
        "downloads": -1,
        "filename": "BittyTax-0.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "b506dcda54c0795684a4a8dce5b6b259",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 82326,
        "upload_time": "2019-05-23T22:54:57",
        "upload_time_iso_8601": "2019-05-23T22:54:57.146349Z",
        "url": "https://files.pythonhosted.org/packages/87/77/a5c99e8bf0c135f95b257a49027f8f76526434448fa37b34d443baf56a53/BittyTax-0.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6fc1b67b16773962f9c37db74cc36c0ed5546262851552bdc3d6726ac9eeb463",
          "md5": "a54fc6fc17b99e5da090bfb4788df3e7",
          "sha256": "21f220267883c8a744a419e5e21326f8f4e7d9adc5da46bfeef1d51ac024b7f1"
        },
        "downloads": -1,
        "filename": "BittyTax-0.1.1-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "a54fc6fc17b99e5da090bfb4788df3e7",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": null,
        "size": 65584,
        "upload_time": "2019-05-29T20:30:14",
        "upload_time_iso_8601": "2019-05-29T20:30:14.871239Z",
        "url": "https://files.pythonhosted.org/packages/6f/c1/b67b16773962f9c37db74cc36c0ed5546262851552bdc3d6726ac9eeb463/BittyTax-0.1.1-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9a98d2219672bd31a0b3116975372b18d9d475210cbdc3017b3949f163f6fdb4",
          "md5": "0dd58d6523783cdd460bce04908bc4ee",
          "sha256": "aa3ae9e6621c37d964d71a818bd81c00cebb91be3910679653419698aff58d3f"
        },
        "downloads": -1,
        "filename": "BittyTax-0.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "0dd58d6523783cdd460bce04908bc4ee",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 83314,
        "upload_time": "2019-05-29T20:30:16",
        "upload_time_iso_8601": "2019-05-29T20:30:16.906797Z",
        "url": "https://files.pythonhosted.org/packages/9a/98/d2219672bd31a0b3116975372b18d9d475210cbdc3017b3949f163f6fdb4/BittyTax-0.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "26a3dd10a6f6e47c84511c7678e11224cf088e375ef722aad2a1ea47117a754f",
          "md5": "0d0a1201930cfa2dba46f9c43b450f27",
          "sha256": "c477fa11ab310dfb9dad32e4f5cfb32f64a1549444558d83aa03995a5fb396ea"
        },
        "downloads": -1,
        "filename": "BittyTax-0.1.2-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "0d0a1201930cfa2dba46f9c43b450f27",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": null,
        "size": 67926,
        "upload_time": "2019-06-30T15:24:33",
        "upload_time_iso_8601": "2019-06-30T15:24:33.245615Z",
        "url": "https://files.pythonhosted.org/packages/26/a3/dd10a6f6e47c84511c7678e11224cf088e375ef722aad2a1ea47117a754f/BittyTax-0.1.2-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d4e7d298311177c8286742b2b45d2094746fa2640c7e1ea1e93d3a6ff846be99",
          "md5": "3966df8820101cccbee3a15301d3b5fb",
          "sha256": "8d93758b681421cda8fa1b3221f55d9faf788df38c51b2edd80d6887c501c768"
        },
        "downloads": -1,
        "filename": "BittyTax-0.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "3966df8820101cccbee3a15301d3b5fb",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 84477,
        "upload_time": "2019-06-30T15:24:35",
        "upload_time_iso_8601": "2019-06-30T15:24:35.407186Z",
        "url": "https://files.pythonhosted.org/packages/d4/e7/d298311177c8286742b2b45d2094746fa2640c7e1ea1e93d3a6ff846be99/BittyTax-0.1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "639e1673f86d6124a6cac12b207d7a89a0ddcd548244eb5b787eb564238eff1c",
          "md5": "6ddb407c55e0d35310cfc915fa54c153",
          "sha256": "9decfe26dc4013d2391504197e6c7c8a6e86a6d645f41b812485b1c3166a0b75"
        },
        "downloads": -1,
        "filename": "BittyTax-0.1.3-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "6ddb407c55e0d35310cfc915fa54c153",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": null,
        "size": 71899,
        "upload_time": "2019-08-14T09:14:39",
        "upload_time_iso_8601": "2019-08-14T09:14:39.279908Z",
        "url": "https://files.pythonhosted.org/packages/63/9e/1673f86d6124a6cac12b207d7a89a0ddcd548244eb5b787eb564238eff1c/BittyTax-0.1.3-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "34023924e2fa93fd7bb143d46531f745713d28ecd56ba8a1ec4742513f540650",
          "md5": "976e8b2f34c9483daa4d80e4f5c0fe2d",
          "sha256": "06083770f0c5fdd46855276f68bb81df65331ce94886ec84afae7d2dc6e51c8d"
        },
        "downloads": -1,
        "filename": "BittyTax-0.1.3.tar.gz",
        "has_sig": false,
        "md5_digest": "976e8b2f34c9483daa4d80e4f5c0fe2d",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 87319,
        "upload_time": "2019-08-14T09:14:41",
        "upload_time_iso_8601": "2019-08-14T09:14:41.368908Z",
        "url": "https://files.pythonhosted.org/packages/34/02/3924e2fa93fd7bb143d46531f745713d28ecd56ba8a1ec4742513f540650/BittyTax-0.1.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "326c113dc9cf55a93e39b4195b3b8df44cf1b1b14f3438cd5c1a8f38519d2849",
          "md5": "a52ae5aad4123afbd354fec7db82fc7d",
          "sha256": "29b574e7778d3e67532aa3c77c8b132e083692e89391e21a1e2d9e3dc33271de"
        },
        "downloads": -1,
        "filename": "BittyTax-0.1.4-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "a52ae5aad4123afbd354fec7db82fc7d",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": null,
        "size": 72148,
        "upload_time": "2019-08-28T12:49:02",
        "upload_time_iso_8601": "2019-08-28T12:49:02.127197Z",
        "url": "https://files.pythonhosted.org/packages/32/6c/113dc9cf55a93e39b4195b3b8df44cf1b1b14f3438cd5c1a8f38519d2849/BittyTax-0.1.4-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3e32b253243a135257bf1998e4378d44df6b2348f25b9dd963c7dc93a53afb2c",
          "md5": "03b223dc1356b88e020293ebf32df3e0",
          "sha256": "55606f6236b663538e793288556a9be0119a0915f26851cc8599ef92a05a75e2"
        },
        "downloads": -1,
        "filename": "BittyTax-0.1.4.tar.gz",
        "has_sig": false,
        "md5_digest": "03b223dc1356b88e020293ebf32df3e0",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 87545,
        "upload_time": "2019-08-28T12:49:03",
        "upload_time_iso_8601": "2019-08-28T12:49:03.925119Z",
        "url": "https://files.pythonhosted.org/packages/3e/32/b253243a135257bf1998e4378d44df6b2348f25b9dd963c7dc93a53afb2c/BittyTax-0.1.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ab2339e638159a62ea3476406e3f70c6c1bb95f8d2a87d26141741fbeff83969",
          "md5": "92539b379366fe4b334e306c5139616d",
          "sha256": "26a31a96ceef0f4bfa321466742fafaecfd3ddaee0aaf921508cebb3cee42e34"
        },
        "downloads": -1,
        "filename": "BittyTax-0.2.0-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "92539b379366fe4b334e306c5139616d",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": null,
        "size": 81436,
        "upload_time": "2019-10-30T13:57:00",
        "upload_time_iso_8601": "2019-10-30T13:57:00.998312Z",
        "url": "https://files.pythonhosted.org/packages/ab/23/39e638159a62ea3476406e3f70c6c1bb95f8d2a87d26141741fbeff83969/BittyTax-0.2.0-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0681ae94904dabd6eae6f949a25e166ba76bca41373948721f6414ac6a3cb525",
          "md5": "e753e8b7877f90e391f2dcfe5bd10b1f",
          "sha256": "e2c3881eef09d20437571c359923458787ffafca1763f0e0b277418c5632793f"
        },
        "downloads": -1,
        "filename": "BittyTax-0.2.0.tar.gz",
        "has_sig": false,
        "md5_digest": "e753e8b7877f90e391f2dcfe5bd10b1f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 93618,
        "upload_time": "2019-10-30T13:57:02",
        "upload_time_iso_8601": "2019-10-30T13:57:02.884987Z",
        "url": "https://files.pythonhosted.org/packages/06/81/ae94904dabd6eae6f949a25e166ba76bca41373948721f6414ac6a3cb525/BittyTax-0.2.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "cbff67295dd3c607fc85a185ac0f62ea3a1c516cd8f339b165da844850aa7100",
          "md5": "b20364c0226c05f1685cdd65338e3d96",
          "sha256": "b12eec14303acda6577649db168bdc7a8dcb989db77ffa4df062a10b57656036"
        },
        "downloads": -1,
        "filename": "BittyTax-0.2.1-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "b20364c0226c05f1685cdd65338e3d96",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": null,
        "size": 73464,
        "upload_time": "2020-03-07T18:19:02",
        "upload_time_iso_8601": "2020-03-07T18:19:02.486912Z",
        "url": "https://files.pythonhosted.org/packages/cb/ff/67295dd3c607fc85a185ac0f62ea3a1c516cd8f339b165da844850aa7100/BittyTax-0.2.1-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "56c9e2ca2b2ff502bb529cd71209cfdaff2e23c48df4b3f1fc3d73c4025cd0b6",
          "md5": "5245132c0e125aebb98cb533191b77f0",
          "sha256": "11fb3ae6ca2fe021cbc2e284d37d20ed19a8fb714fbf93fa295ff8d12d9767bc"
        },
        "downloads": -1,
        "filename": "BittyTax-0.2.1.tar.gz",
        "has_sig": false,
        "md5_digest": "5245132c0e125aebb98cb533191b77f0",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 98957,
        "upload_time": "2020-03-07T18:19:04",
        "upload_time_iso_8601": "2020-03-07T18:19:04.199336Z",
        "url": "https://files.pythonhosted.org/packages/56/c9/e2ca2b2ff502bb529cd71209cfdaff2e23c48df4b3f1fc3d73c4025cd0b6/BittyTax-0.2.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "96e9c9c6356e31644ad7bf1597f6d271f00706df773c8503bdb94aecac548429",
          "md5": "36efb90c20e3147b31140d3650036f71",
          "sha256": "0e02edce1736573fb27a1753eabf0e5b45827c0c3afd23584ea3227c9703a4de"
        },
        "downloads": -1,
        "filename": "BittyTax-0.3.0-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "36efb90c20e3147b31140d3650036f71",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": null,
        "size": 41379,
        "upload_time": "2020-04-11T11:48:41",
        "upload_time_iso_8601": "2020-04-11T11:48:41.813933Z",
        "url": "https://files.pythonhosted.org/packages/96/e9/c9c6356e31644ad7bf1597f6d271f00706df773c8503bdb94aecac548429/BittyTax-0.3.0-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3f246d630387451359156d29d8c72e9f881a3eac5c2e9bc808b3bb956d822e31",
          "md5": "87ad3758f837fbab17fc3deaed7f1eee",
          "sha256": "0b3bd120d189bd7d2b83a1eeb8a411b5749a023e0afc6ff39ff238240f82faac"
        },
        "downloads": -1,
        "filename": "BittyTax-0.3.0.tar.gz",
        "has_sig": false,
        "md5_digest": "87ad3758f837fbab17fc3deaed7f1eee",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 82294,
        "upload_time": "2020-04-11T11:48:43",
        "upload_time_iso_8601": "2020-04-11T11:48:43.585754Z",
        "url": "https://files.pythonhosted.org/packages/3f/24/6d630387451359156d29d8c72e9f881a3eac5c2e9bc808b3bb956d822e31/BittyTax-0.3.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0eecd4b921aada8fea8c276b931abef225102c4c1d6a863c4a8176855c617c58",
          "md5": "3759269c3f9b6cf091ea197e61f1a939",
          "sha256": "88ea015bc635f3c9a3ed1ef9ec113274dea7af87e007f623615fe3894d68dea0"
        },
        "downloads": -1,
        "filename": "BittyTax-0.3.1-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "3759269c3f9b6cf091ea197e61f1a939",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": null,
        "size": 58987,
        "upload_time": "2020-04-11T12:19:49",
        "upload_time_iso_8601": "2020-04-11T12:19:49.133935Z",
        "url": "https://files.pythonhosted.org/packages/0e/ec/d4b921aada8fea8c276b931abef225102c4c1d6a863c4a8176855c617c58/BittyTax-0.3.1-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3f8f55a45e56899800cc83f8f785ec5beaf4ae72252f90842f605ecb20df5e6a",
          "md5": "28e8d0e283ef6532ef73d73bf367fe3b",
          "sha256": "c1bab9e2c18c3b3f43059c4f47a04af65e58c6b47fb386702fb0dd04417b38a0"
        },
        "downloads": -1,
        "filename": "BittyTax-0.3.1.tar.gz",
        "has_sig": false,
        "md5_digest": "28e8d0e283ef6532ef73d73bf367fe3b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 94029,
        "upload_time": "2020-04-11T12:19:50",
        "upload_time_iso_8601": "2020-04-11T12:19:50.852619Z",
        "url": "https://files.pythonhosted.org/packages/3f/8f/55a45e56899800cc83f8f785ec5beaf4ae72252f90842f605ecb20df5e6a/BittyTax-0.3.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "69e5bb947561cc85bef7ac825bf963318c1cef63b0be6f284949fd3fe3a866b0",
          "md5": "3ee2a14d9d6b1305083cb85e25d381aa",
          "sha256": "d66c98711450860851a6534c8f14a31d55b75c5ab2ea6f5a6498153fcb8e18a6"
        },
        "downloads": -1,
        "filename": "BittyTax-0.3.2-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "3ee2a14d9d6b1305083cb85e25d381aa",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": null,
        "size": 81233,
        "upload_time": "2020-04-11T21:29:37",
        "upload_time_iso_8601": "2020-04-11T21:29:37.114298Z",
        "url": "https://files.pythonhosted.org/packages/69/e5/bb947561cc85bef7ac825bf963318c1cef63b0be6f284949fd3fe3a866b0/BittyTax-0.3.2-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "16b2d8bf8a60ca8e0b6b9d1016bda473b778ef800b3cb5f8c1664e88869471ff",
          "md5": "09720b55f053c50a930bbfb4433afca5",
          "sha256": "95bf468cac2e439192a08400eca37dc884554b07bfd0d2871ea195111950ee52"
        },
        "downloads": -1,
        "filename": "BittyTax-0.3.2.tar.gz",
        "has_sig": false,
        "md5_digest": "09720b55f053c50a930bbfb4433afca5",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 103108,
        "upload_time": "2020-04-11T21:29:38",
        "upload_time_iso_8601": "2020-04-11T21:29:38.907881Z",
        "url": "https://files.pythonhosted.org/packages/16/b2/d8bf8a60ca8e0b6b9d1016bda473b778ef800b3cb5f8c1664e88869471ff/BittyTax-0.3.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "bb7545b9bacfd5e2a3018ca0251db199c4d666d59ee23b4ea71725674b363fe5",
          "md5": "7572dbb56541cd6f18e45c4d873ad57a",
          "sha256": "1c271ecc0ad51389f743e233b380eea798bc2375b2f21422317b101bf724fead"
        },
        "downloads": -1,
        "filename": "BittyTax-0.3.3-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "7572dbb56541cd6f18e45c4d873ad57a",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": null,
        "size": 94235,
        "upload_time": "2020-06-29T16:47:43",
        "upload_time_iso_8601": "2020-06-29T16:47:43.481394Z",
        "url": "https://files.pythonhosted.org/packages/bb/75/45b9bacfd5e2a3018ca0251db199c4d666d59ee23b4ea71725674b363fe5/BittyTax-0.3.3-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c60c232b6796a213439a79f8608231069383686000ae1b4f3f17e6dff16dfe70",
          "md5": "7be0b0cdc77203c368673445d34a1377",
          "sha256": "4776e743bc211de563028f2fe6af78e1e1a971e3409944d2657292a29302203a"
        },
        "downloads": -1,
        "filename": "BittyTax-0.3.3.tar.gz",
        "has_sig": false,
        "md5_digest": "7be0b0cdc77203c368673445d34a1377",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 104055,
        "upload_time": "2020-06-29T16:47:45",
        "upload_time_iso_8601": "2020-06-29T16:47:45.262781Z",
        "url": "https://files.pythonhosted.org/packages/c6/0c/232b6796a213439a79f8608231069383686000ae1b4f3f17e6dff16dfe70/BittyTax-0.3.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.4.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1ad1d275b249aa6495c0ba21211dcc7972da1af01c4adcceeadff854a60003d4",
          "md5": "f20bccb7a6db7d73bcd8a477a8844ed9",
          "sha256": "c5a9c4ed52556cde5426af3cb6afa659cb11d706acd579725388d488e5e405eb"
        },
        "downloads": -1,
        "filename": "BittyTax-0.4.0-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "f20bccb7a6db7d73bcd8a477a8844ed9",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": null,
        "size": 86434,
        "upload_time": "2020-07-18T15:43:41",
        "upload_time_iso_8601": "2020-07-18T15:43:41.472152Z",
        "url": "https://files.pythonhosted.org/packages/1a/d1/d275b249aa6495c0ba21211dcc7972da1af01c4adcceeadff854a60003d4/BittyTax-0.4.0-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e52793836fbe18a88e7ec63ad0078cae60e83303a11e047219915aeba8dd989f",
          "md5": "a7e17385e36b0e3955e3bd0db25a9574",
          "sha256": "2a241f24ee7c471942f84550d9e02b51e069d05b0b46ed1a92962d5a9eeec7aa"
        },
        "downloads": -1,
        "filename": "BittyTax-0.4.0.tar.gz",
        "has_sig": false,
        "md5_digest": "a7e17385e36b0e3955e3bd0db25a9574",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 106246,
        "upload_time": "2020-07-18T15:43:43",
        "upload_time_iso_8601": "2020-07-18T15:43:43.856570Z",
        "url": "https://files.pythonhosted.org/packages/e5/27/93836fbe18a88e7ec63ad0078cae60e83303a11e047219915aeba8dd989f/BittyTax-0.4.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.4.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e4f23cd94b17ddc4bfb464748747d2bbec9b4ebc3070ed4e9372581febaba6a9",
          "md5": "d1f7d173268d583c43181ce268140699",
          "sha256": "f568db758dc4a7eadf7d9a8e08304a9952a66ed695a402173c9f4d165ee280f5"
        },
        "downloads": -1,
        "filename": "BittyTax-0.4.1-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "d1f7d173268d583c43181ce268140699",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": null,
        "size": 87408,
        "upload_time": "2020-07-25T19:28:30",
        "upload_time_iso_8601": "2020-07-25T19:28:30.054985Z",
        "url": "https://files.pythonhosted.org/packages/e4/f2/3cd94b17ddc4bfb464748747d2bbec9b4ebc3070ed4e9372581febaba6a9/BittyTax-0.4.1-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "80f6cc11ea9c3a1fff3eb2b10b7387be5f258e23714f58b3458c78eb50767042",
          "md5": "a1cb565f5413d416821c5bdbec569bab",
          "sha256": "a58b78fa3640fcc0cc55ef86ec723718b0b4bc9e8806933373baa2b470fa5639"
        },
        "downloads": -1,
        "filename": "BittyTax-0.4.1.tar.gz",
        "has_sig": false,
        "md5_digest": "a1cb565f5413d416821c5bdbec569bab",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 106968,
        "upload_time": "2020-07-25T19:28:31",
        "upload_time_iso_8601": "2020-07-25T19:28:31.864682Z",
        "url": "https://files.pythonhosted.org/packages/80/f6/cc11ea9c3a1fff3eb2b10b7387be5f258e23714f58b3458c78eb50767042/BittyTax-0.4.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.4.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ffc31d352327c030614d6037f3a4cf611016380e13502d6da8c8ae3823a4c1be",
          "md5": "a65d2794dd2c04582e6989d331ff894b",
          "sha256": "74144f74dec2bacc576b84580444e9b032287a38b638dca68ac5f34c0276f84e"
        },
        "downloads": -1,
        "filename": "BittyTax-0.4.2-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "a65d2794dd2c04582e6989d331ff894b",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": null,
        "size": 112867,
        "upload_time": "2020-10-30T18:01:17",
        "upload_time_iso_8601": "2020-10-30T18:01:17.477885Z",
        "url": "https://files.pythonhosted.org/packages/ff/c3/1d352327c030614d6037f3a4cf611016380e13502d6da8c8ae3823a4c1be/BittyTax-0.4.2-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f0622e5cc6afa46f02f5e8a4758254d88e1cf9a5c74ce08859bcc4aec9b9a822",
          "md5": "d7a5ac9d3636026b1419f4906b1d0942",
          "sha256": "20f1b80bbe42b1394f7aa61888f013e18bfe66378f30b11084bd12351b8d5c17"
        },
        "downloads": -1,
        "filename": "BittyTax-0.4.2.tar.gz",
        "has_sig": false,
        "md5_digest": "d7a5ac9d3636026b1419f4906b1d0942",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 119237,
        "upload_time": "2020-10-30T18:01:19",
        "upload_time_iso_8601": "2020-10-30T18:01:19.385152Z",
        "url": "https://files.pythonhosted.org/packages/f0/62/2e5cc6afa46f02f5e8a4758254d88e1cf9a5c74ce08859bcc4aec9b9a822/BittyTax-0.4.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.4.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3ad94fb3fcdb4986291dd147388d1d657418e066acfd5f7083ee306d78e8d777",
          "md5": "f867d8b39ccd9097e474f31217925408",
          "sha256": "164eb84dbd2ff85132e49050352405dd56309a686c1093e5820fa9d82f23193d"
        },
        "downloads": -1,
        "filename": "BittyTax-0.4.3-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "f867d8b39ccd9097e474f31217925408",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": null,
        "size": 118900,
        "upload_time": "2020-12-04T16:08:27",
        "upload_time_iso_8601": "2020-12-04T16:08:27.945979Z",
        "url": "https://files.pythonhosted.org/packages/3a/d9/4fb3fcdb4986291dd147388d1d657418e066acfd5f7083ee306d78e8d777/BittyTax-0.4.3-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3a9fdef87b2d7762f0bfaebac2b0dbe2dbd14d2ca738ed7c381366aaf59c8098",
          "md5": "7969b82f0febb06e2a667c0bead6baaa",
          "sha256": "35bc32b8e1a13c87706cb869508c8aba383d580c5d8931d818d121ec1367b34d"
        },
        "downloads": -1,
        "filename": "BittyTax-0.4.3.tar.gz",
        "has_sig": false,
        "md5_digest": "7969b82f0febb06e2a667c0bead6baaa",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 124026,
        "upload_time": "2020-12-04T16:08:29",
        "upload_time_iso_8601": "2020-12-04T16:08:29.778769Z",
        "url": "https://files.pythonhosted.org/packages/3a/9f/def87b2d7762f0bfaebac2b0dbe2dbd14d2ca738ed7c381366aaf59c8098/BittyTax-0.4.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.5.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "132e9c98e54a399d81df85b23eeb012a6e9cd54f874b5b4a7f2788f0e66a6eb0",
          "md5": "bb2b0d67cffb8e395180fd68c2b6102b",
          "sha256": "6d39fc459d64af43b2d6780d8842b7d41ffccf1ccbb7261fff3e3ded2d7f9a33"
        },
        "downloads": -1,
        "filename": "BittyTax-0.5.0-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "bb2b0d67cffb8e395180fd68c2b6102b",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": null,
        "size": 152431,
        "upload_time": "2021-11-11T22:50:20",
        "upload_time_iso_8601": "2021-11-11T22:50:20.244546Z",
        "url": "https://files.pythonhosted.org/packages/13/2e/9c98e54a399d81df85b23eeb012a6e9cd54f874b5b4a7f2788f0e66a6eb0/BittyTax-0.5.0-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2d263c9b7fd59f223e4d790bfba25aa1d9d3c63d7a5a88faf0ac16da97b15104",
          "md5": "5c435389f7bbd65d144d366779b287ec",
          "sha256": "82afa40644bdceeeb75cd199be241c27e438aa47067995e6076ce610b006ed74"
        },
        "downloads": -1,
        "filename": "BittyTax-0.5.0.tar.gz",
        "has_sig": false,
        "md5_digest": "5c435389f7bbd65d144d366779b287ec",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 157904,
        "upload_time": "2021-11-11T22:50:21",
        "upload_time_iso_8601": "2021-11-11T22:50:21.954467Z",
        "url": "https://files.pythonhosted.org/packages/2d/26/3c9b7fd59f223e4d790bfba25aa1d9d3c63d7a5a88faf0ac16da97b15104/BittyTax-0.5.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "132e9c98e54a399d81df85b23eeb012a6e9cd54f874b5b4a7f2788f0e66a6eb0",
        "md5": "bb2b0d67cffb8e395180fd68c2b6102b",
        "sha256": "6d39fc459d64af43b2d6780d8842b7d41ffccf1ccbb7261fff3e3ded2d7f9a33"
      },
      "downloads": -1,
      "filename": "BittyTax-0.5.0-py2.py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "bb2b0d67cffb8e395180fd68c2b6102b",
      "packagetype": "bdist_wheel",
      "python_version": "py2.py3",
      "requires_python": null,
      "size": 152431,
      "upload_time": "2021-11-11T22:50:20",
      "upload_time_iso_8601": "2021-11-11T22:50:20.244546Z",
      "url": "https://files.pythonhosted.org/packages/13/2e/9c98e54a399d81df85b23eeb012a6e9cd54f874b5b4a7f2788f0e66a6eb0/BittyTax-0.5.0-py2.py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "2d263c9b7fd59f223e4d790bfba25aa1d9d3c63d7a5a88faf0ac16da97b15104",
        "md5": "5c435389f7bbd65d144d366779b287ec",
        "sha256": "82afa40644bdceeeb75cd199be241c27e438aa47067995e6076ce610b006ed74"
      },
      "downloads": -1,
      "filename": "BittyTax-0.5.0.tar.gz",
      "has_sig": false,
      "md5_digest": "5c435389f7bbd65d144d366779b287ec",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 157904,
      "upload_time": "2021-11-11T22:50:21",
      "upload_time_iso_8601": "2021-11-11T22:50:21.954467Z",
      "url": "https://files.pythonhosted.org/packages/2d/26/3c9b7fd59f223e4d790bfba25aa1d9d3c63d7a5a88faf0ac16da97b15104/BittyTax-0.5.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}