{
  "info": {
    "author": "Yogesh Khatri",
    "author_email": "yogesh@swiftforensics.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# BlackBox Protobuf Library\n\n### _Note: This is a fork of the library found [here](https://github.com/nccgroup/blackboxprotobuf). This original was written for adding protobuf reading to burp, this version strips out all burp related code and dependencies, and works with python3._\n\n## Description\nBlackbox protobuf library is a Python module for decoding and re-encoding protobuf\nmessages without access to the source protobuf descriptor file. This library\nprovides a simple Python interface to encode/decode messages that can be\nintegrated into other tools.\n\nThis library is targeted towards use in DFIR investigations where being able to\nread the content messages is critical and a protocol buffer definition may not be readily\navailable.\n\n## Background\nProtocol Buffers (protobufs)  are a standard published by Google with\naccompanying libraries for binary serialization of data. Protocol buffers are\ndefined by a `.proto` file known to both the sender and the receiver. The actual\nbinary message does not contain information such as field names or most type\ninformation.\n\nFor each field, the serialized protocol buffer includes two pieces of metadata,\na field number and the wire type. The wire type tells a parser how to parse the\nlength of the field, so that it can be skipped if it is not known (one protocol\nbuffer design goal is being able to handle messages with unknown fields). A\nsingle wire-type generally encompasses multiple protocol buffer types, for\nexample the length delimited wire-type can be used for string, bytestring,\ninner message or packed repeated fields. See\n<https://developers.google.com/protocol-buffers/docs/encoding#structure> for\nthe breakdown of wire types.\n\nThe protocol buffer compiler (`protoc`) does support a similar method of\ndecoding protocol buffers without the definition with the `--decode_raw`\noption. However, it does not provide any functionality to re-encode the decoded\nmessage.\n\n## How it works\nThe library makes a best effort guess of the type based on the provided wire type (and\noccasionally field content) and builds a type definition that can be used to\nre-encode the data. In general, most fields of interest are likely to be parsed\ninto a usable form. Users can optionally pass in custom type definitions that\noverride the guessed type. Custom type definitions also allow naming of fields to\nimprove user friendliness.\n\n## Future Work\n- Allow import and export of type definitions to protobuf definition files.\n\n# Usage\n## Installation    \n\n```\npip install blackboxprotobuf\n```\n\n## Interface\nThe main `blackboxprotobuf` module defines five functions, the core\nencoding/decoding functions, two convenience functions that encode/decode JSON\nstrings and a function to validate type definition changes.\n\n### Decode \nDecoding functions takes a protobuf bytestring, and optionally\neither a type definition or a known message name mapped to a type definition\n(in `blackboxprotobuf.known_messages`). If a type definition isn't provided, an\nempty message type is assumed and all types are derived from the protobuf\nbinary.\n\nThe decoder returns a tuple containing a dictionary with the decoded data and a\ndictionary containing the generated type definition. If the input type\ndefinition does not include types for all fields in the message, the output\ntype definitions will include type guesses for those fields.\n\nExample use:\n```python\nimport blackboxprotobuf\nimport base64\n\ndata = base64.b64decode('KglNb2RpZnkgTWU=')\nmessage,typedef = blackboxprotobuf.protobuf_to_json(data)\nprint(message)\nprint(typedef)\n```\n\n### Encode\nThe encoding functions takes a Python dictionary containing the data and a type\ndefinition. Unlike decoding, the type definition is required and will fail if\nany fields are not defined. Generally, the type definition should be the output\nfrom the decoding function or a modified version thereof.\n\nExample use:\n```python\nimport blackboxprotobuf\nimport base64\n\ndata = base64.b64decode('KglNb2RpZnkgTWU=')\nmessage,typedef = blackboxprotobuf.decode_message(data)\n\nmessage['5'] = 'Modified Me'\n\nnew_data = bytes(blackboxprotobuf.encode_message(message,typedef))\nprint(data)\nprint(new_data)\n```\n\n### Type definition structure\nThe type definition object is a Python dictionary representing the type\nstructure of a message, it includes a type for each field and optionally a\nname. Each entry in the dictionary represents a field in the message. The key\nshould be the field number and the value is a dictionary containing attributes.\n\nAt the minimum the dictionary should contain the 'type' entry which contains a\nstring identifier for the type. Valid type identifiers can be found in\n`blackboxprotobuf/lib/types/type_maps.py`.\n\nMessage fields will also contain one of two entries, 'message_typedef' or\n'message_type_name'. 'message_typedef' should contain a second type definition\nstructure for the inner message. 'message_type_name' should contain the string\nidentifier for a message type previously stored in\n`blackboxprotobuf.known_messages`. If both are specified, the 'message_type_name'\nwill be ignored.\n\n## Type Breakdown\nThe following is a quick breakdown of wire types and default values. See\n<https://developers.google.com/protocol-buffers/docs/encoding> for more detailed\ninformation from Google.\n\n### Variable Length Integers (varint)\nThe `varint` wire type represents integers with multiple bytes where one bit of\neach is dedicated to indicating if it is the last byte. This can be used to\nrepresent integers (signed/unsigned), boolean values or enums. Integers can be\nencoded using three variations:\n\n- `uint`: Varint encoding with no representation of negative numbers.\n- `int`: Standard encoding but inefficient for negative numbers (always 10 bytes).\n- `sint`: Uses ZigZag encoding to efficiently represent negative numbers by\n  mapping negative numbers into the integer space. For example -1 is converted\n  to 1, 1 to 2, -2 to 3, and so on. This can result in drastically different\n  numbers if a type is misinterpreted and either the original or incorrect type\n  is `sint`.\n\nThe default is currently `int` with no ZigZag encoding.\n\n### Fixed32/64\nThe fixed length wire types have an implicit size based on the wire type. These\nsupport either fixed size integers (signed/unsigned) or fixed size floating\npoint numbers (float/double). The default type for these is the floating point\ntype as most integers are more likely to be represented by a varint.\n\n### Length Delimited\nLength delimited wire types are prefixed with a `varint` indicating the length.\nThis is used for strings, bytestrings, inner messages and packed repeated\nfields. Messages can generally be identified by validating if it is a valid\nprotobuf binary. If it is not a message, the default type is a string/byte\nwhich are relatively interchangeable in Python.\n\nPacked repeated fields are arrays of either `varints` or a fixed length wire\ntype. Non-packed repeated fields use a separate tag (wire type + field number)\nfor each element, allowing them to be easily identified and parsed. However,\npacked repeated fields only have the initial length delimited wire type tag.\nThe parser is assumed to know the full type already for parsing out the\nindividual elements. This makes this field type difficult to differentiate from\nan arbitrary byte string and will require user intervention to identify. In\nprotobuf version 2, repeated fields had to be explicitly declared packed in the\ndefinition. In protobuf version 3, repeated fields are packed by default and\nare likely to become more common.",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/ydkhatri/blackboxprotobuf",
    "keywords": "",
    "license": "MIT License",
    "maintainer": "",
    "maintainer_email": "",
    "name": "blackboxprotobuf",
    "package_url": "https://pypi.org/project/blackboxprotobuf/",
    "platform": "",
    "project_url": "https://pypi.org/project/blackboxprotobuf/",
    "project_urls": {
      "Homepage": "https://github.com/ydkhatri/blackboxprotobuf"
    },
    "release_url": "https://pypi.org/project/blackboxprotobuf/1.0.1/",
    "requires_dist": null,
    "requires_python": ">=3.6",
    "summary": "Library for reading protobuf buffers without .proto definitions",
    "version": "1.0.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 7860908,
  "releases": {
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a539d6a88c629f525113072625a6f8a15b4c5d17c17b47da3a208c6b1a1b23ce",
          "md5": "7bf754c4143ffbc8f69bca8924fe289f",
          "sha256": "233b714e6c24ce9d1c20b871462a220af9177e4fec01c1b797ac5ab86a1e1cea"
        },
        "downloads": -1,
        "filename": "blackboxprotobuf-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "7bf754c4143ffbc8f69bca8924fe289f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 14435,
        "upload_time": "2020-08-01T05:49:04",
        "upload_time_iso_8601": "2020-08-01T05:49:04.552547Z",
        "url": "https://files.pythonhosted.org/packages/a5/39/d6a88c629f525113072625a6f8a15b4c5d17c17b47da3a208c6b1a1b23ce/blackboxprotobuf-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "a539d6a88c629f525113072625a6f8a15b4c5d17c17b47da3a208c6b1a1b23ce",
        "md5": "7bf754c4143ffbc8f69bca8924fe289f",
        "sha256": "233b714e6c24ce9d1c20b871462a220af9177e4fec01c1b797ac5ab86a1e1cea"
      },
      "downloads": -1,
      "filename": "blackboxprotobuf-1.0.1.tar.gz",
      "has_sig": false,
      "md5_digest": "7bf754c4143ffbc8f69bca8924fe289f",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 14435,
      "upload_time": "2020-08-01T05:49:04",
      "upload_time_iso_8601": "2020-08-01T05:49:04.552547Z",
      "url": "https://files.pythonhosted.org/packages/a5/39/d6a88c629f525113072625a6f8a15b4c5d17c17b47da3a208c6b1a1b23ce/blackboxprotobuf-1.0.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}