{
  "info": {
    "author": "",
    "author_email": "Ryan Julyan <ryan@julyan.biz>",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 2 - Pre-Alpha",
      "Intended Audience :: Developers",
      "License :: Other/Proprietary License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# BSPEC\n> BSPEC: A python based Plugin, Entity Component System (ECS) architecture designed with Business Specifications in mind. This package allows you to easily set up and use existing systems and components. Write custom systems and components that can be dynamically loaded. Its minimal dependencies and extensions make it ideal for projects that use Python 3.\n\n# Status of the project\n\nThe BSPEC is still under initial development and is being tested with the Python 3.9.6 version.\n\nThe BSPEC will follow semantic versioning for its releases, with a `{MAJOR}.{MINOR}.{PATCH}{PYTAGNUM}` scheme for versions numbers, where:\n\n* `MAJOR` versions might introduce breaking changes\n* `MINOR` versions usually introduce new features and might introduce deprecations\n* `PATCH` versions only introduce bug fixes\n* `PYTAGNUM` PYTAG + NUM (no white-space in between), Tags are converted to a short form (-alpha -> a0)\n\n# Overview\n* [Status of the project](#status-of-the-project)\n* [Requirements](#requirements)\n  * [Python](#python)\n  * [Dependencies](#dependencies)\n* [Quickstart](#quickstart)\n* [Changes to Repo](#changes-to-repo)\n\n## Requirements\n### Python\n* Download and install [Python](https://www.python.org/downloads/) (suggested [3.9.6](https://www.python.org/downloads/release/python-396/)) if you do not already have it installed.\n    * Ensure `pip` is installed (pip should be installed already because it comes with the latest versions of python) in case it is not, please install it from here: https://pip.pypa.io/en/stable/installing/\n        * To check if pip is installed, you can run the following command in your terminal\n```shell\npython -m pip --version\n\n```\n\n## Setup\n\n### Windows\n* Open new terminal\n    * \"Windows-Key + R\" will show you the 'RUN' box\n    * Type \"cmd\" to open the terminal\n```shell\ncd <Path To>/my_awesome_project\n\npython -m venv venv\n\nvenv\\Scripts\\activate\n\n```\n### Linux / Mac\n* Open new terminal\n    * \"Control + Option + Shift + T\" to open the terminal\n```shell\ncd <Path To>/my_awesome_project\n\npython -m venv venv\n\nsource venv/bin/activate\n\n```\n\n### Dependencies\n\n> Once you have installed Python and `pip` and activated your `environment`, you will need to install a dependency for the any plugins:\n```shell\npip install --no-cache-dir -r requirements.txt\n\nbumpver init\n\n```\n\n## Quickstart\n\n### Windows\n* Open new terminal\n    * \"Windows-Key + R\" will show you the 'RUN' box\n    * Type \"cmd\" to open the terminal\n```shell\npip install BSPEC\n\n```\n### Linux / Mac\n* Open new terminal\n    * \"Control + Option + Shift + T\" to open the terminal\n```shell\npip install BSPEC\n\n```\n\n\n## Changes to Repo\n\n### Windows\n* Open new terminal\n    * \"Windows-Key + R\" will show you the 'RUN' box\n    * Type \"cmd\" to open the terminal\n```shell\nbumpver update --minor\n\n```\n### Linux / Mac\n* Open new terminal\n    * \"Control + Option + Shift + T\" to open the terminal\n```shell\nbumpver update --minor\n\n```\n>**Note:** BumpVer integrates with your version control system. It’ll refuse to update your files if you have uncommitted changes in your repository.\n\n\nYou can change different versions with different key words:\n> **Note:** `test` lets you see what the changes to a given version string would look like\n```shell\nbumpver test '1.2.3' 'MAJOR.MINOR.PATCH[PYTAGNUM]' --major\nNew Version: 2.0.0\n\nbumpver test '1.2.3' 'MAJOR.MINOR.PATCH[PYTAGNUM]' --minor\nNew Version: 1.3.0\n\nbumpver test '1.2.3' 'MAJOR.MINOR.PATCH[PYTAGNUM]' --patch\nNew Version: 1.2.4\n\nbumpver test '1.2.3' 'MAJOR.MINOR.PATCH[PYTAGNUM]' --patch --tag=beta\nNew Version: 1.2.4b0\n\nbumpver test '1.2.4b0' 'MAJOR.MINOR.PATCH[PYTAGNUM]' --tag-num\nNew Version: 1.2.4b1\n```\n\nTo do this on a commit version, remove `test`, the number e.g. `'1.2.3'` and the structure format `'MAJOR.MINOR.PATCH[PYTAGNUM]'` resulting in:\n```shell\nbumpver update --patch\n\n```\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "ECS,Plugin,Dynamic,Dynamic",
    "license": "The BSPEC License  BSPEC is created and distributed under the developer-friendly BSPEC License. The BSPEC License is derived from the popular Apache 2.0 license.  The BSPEC License is the legal requirement for you or your company to use and distribute BSPEC and derivative works such as the applications you make with it. Your application or project can have a different license, but it still needs to comply with the original one.  The license grants you the following permissions: • You are free to commercialise any software created using original or modified (derivative) versions of BSPEC • You are free to commercialise any plugin, extension or tool created for use with BSPEC • You are free to modify BSPEC and you are not required to share the changes • You are free to distribute original or modified (derivative) versions of BSPEC • You are given a license to any patent that covers BSPEC  The license prevents you from doing the following: • You can not commercialise original or modified (derivative) versions of the BSPEC editor, creator and/or engine • You can not hold BSPEC or contributing developers liable for damages caused by the use of BSPEC • You can not bring any warranty claims to BSPEC or contributing developers • You can not use the BSPEC trademark unless express permission has been given (see exceptions and additional information) The license requires that you do the following: • You must include the BSPEC license and copyright notice in any work you create • You must state significant changes made to BSPEC  License and copyright notice inclusion  The BSPEC License requires that you must include the license and copyright notice with all copies of BSPEC and in any derived work created using BSPEC. It is up to you to decide how you wish to distribute the license and notice. Below are some examples of how this can be done: • Show the license and notice at the end of a credits screen if your application has one • Show the license and notice from a dedicated license screen or popup in your application • Print the license and notice to an output log when your application starts • Put the license and notice in a text file and include it with the distribution of your application • Put the license and notice in a printed manual included with your application  The BSPEC license and copyright notice can be seen below. Marked text (i.e. `like this`) highlights the changes made from the original Apache 2.0 license. ________________________________________ `BSPEC License` `Version 0.0.1, September 2022` `https://github.com/BSPEC/BSPEC`  TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION  1. Definitions.  \"License\" shall mean the terms and conditions for use, reproduction, and distribution as defined by Sections 1 through 9 of this document.  \"Licensor\" shall mean the copyright owner or entity authorized by the copyright owner that is granting the License.  \"Legal Entity\" shall mean the union of the acting entity and all other entities that control, are controlled by, or are under common control with that entity. For the purposes of this definition, \"control\" means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity.  \"You\" (or \"Your\") shall mean an individual or Legal Entity exercising permissions granted by this License.  \"Source\" form shall mean the preferred form for making modifications, including but not limited to software source code, documentation source, and configuration files.  \"Object\" form shall mean any form resulting from mechanical transformation or translation of a Source form, including but not limited to compiled object code, generated documentation, and conversions to other media types.  \"Work\" shall mean the work of authorship, whether in Source or Object form, made available under the License, as indicated by a copyright notice that is included in or attached to the work (an example is provided in the Appendix below).  \"Derivative Works\" shall mean any work, whether in Source or Object form, that is based on (or derived from) the Work and for which the editorial revisions, annotations, elaborations, or other modifications represent, as a whole, an original work of authorship. For the purposes of this License, Derivative Works shall not include works that remain separable from, or merely link (or bind by name) to the interfaces of, the Work and Derivative Works thereof.  \"Contribution\" shall mean any work of authorship, including the original version of the Work and any modifications or additions to that Work or Derivative Works thereof, that is intentionally submitted to Licensor for inclusion in the Work by the copyright owner or by an individual or Legal Entity authorized to submit on behalf of the copyright owner. For the purposes of this definition, \"submitted\" means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Work, but excluding communication that is conspicuously marked or otherwise designated in writing by the copyright owner as \"Not a Contribution.\"  \"Contributor\" shall mean Licensor and any individual or Legal Entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Work.  `\"Application Development Product\" shall mean software used for application development. This includes both the content authoring software and the software used to show the created content.`  2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare Derivative Works of, publicly display, publicly perform, sublicense, and distribute the Work and such Derivative Works in Source or Object form.  3. Grant of Patent License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this section) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Work, where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Work to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Work or a Contribution incorporated within the Work constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for that Work shall terminate as of the date such litigation is filed.  4. Redistribution. You may reproduce and distribute copies of the Work or Derivative Works thereof in any medium, with or without modifications, and in Source or Object form, provided that You meet the following conditions: `a) You do not sell or otherwise commercialise the Work or Derivative Works as an Application Development Product; and` b) You must give any other recipients of the Work or Derivative Works a copy of this License; and c) You must cause any modified files to carry prominent notices stating that You changed the files; and d) You must retain, in the Source form of any Derivative Works that You distribute, all copyright, patent, trademark, and attribution notices from the Source form of the Work, excluding those notices that do not pertain to any part of the Derivative Works; and e) If the Work includes a \"NOTICE\" text file as part of its distribution, then any Derivative Works that You distribute must include a readable copy of the attribution notices contained within such NOTICE file, excluding those notices that do not pertain to any part of the Derivative Works, in at least one of the following places: within a NOTICE text file distributed as part of the Derivative Works; within the Source form or documentation, if provided along with the Derivative Works; or, within a display generated by the Derivative Works, if and wherever such third-party notices normally appear. The contents of the NOTICE file are for informational purposes only and do not modify the License. You may add Your own attribution notices within Derivative Works that You distribute, alongside or as an addendum to the NOTICE text from the Work, provided that such additional attribution notices cannot be construed as modifying the License. You may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions for use, reproduction, or distribution of Your modifications, or for any such Derivative Works as a whole, provided Your use, reproduction, and distribution of the Work otherwise complies with the conditions stated in this License.  5. Submission of Contributions. Unless You explicitly state otherwise, any Contribution intentionally submitted for inclusion in the Work by You to the Licensor shall be under the terms and conditions of this License, without any additional terms or conditions. Notwithstanding the above, nothing herein shall supersede or modify the terms of any separate license agreement you may have executed with Licensor regarding such Contributions.  6. Trademarks. This License does not grant permission to use the trade names, trademarks, service marks, or product names of the Licensor, except as required for reasonable and customary use in describing the origin of the Work and reproducing the content of the NOTICE file.  7. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Work (and each Contributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Work and assume any risks associated with Your exercise of permissions under this License.  8. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Work (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages.  9. Accepting Warranty or Additional Liability. While redistributing the Work or Derivative Works thereof, You may choose to offer, and charge a fee for, acceptance of support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability.  ________________________________________ Copyright 2022 BSPEC, BSPEC Licensed under the BSPEC License version 0.1 (the \"License\"); you may not use `BSPEC` except in compliance with the License. You may obtain a copy of the License, at `https://github.com/BSPEC/BSPEC/blob/main/LICENSE` Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License.",
    "maintainer": "",
    "maintainer_email": "",
    "name": "BSPEC",
    "package_url": "https://pypi.org/project/BSPEC/",
    "platform": null,
    "project_url": "https://pypi.org/project/BSPEC/",
    "project_urls": {
      "Bug Tracker": "https://github.com/BSPEC/BSPEC/issues",
      "Homepage": "https://github.com/BSPEC/BSPEC"
    },
    "release_url": "https://pypi.org/project/BSPEC/0.1.10/",
    "requires_dist": [
      "esper (>=2.1)",
      "Deprecated (>=1.2.13)",
      "black ; extra == 'dev'",
      "bumpver ; extra == 'dev'",
      "isort ; extra == 'dev'",
      "pip-tools ; extra == 'dev'",
      "pytest ; extra == 'dev'",
      "build ; extra == 'dev'",
      "twine ; extra == 'dev'"
    ],
    "requires_python": ">=3.9",
    "summary": "A python based Plugin, Entity Component System (ECS) architecture designed with Business Specifications in mind. This package allows you to easily set up and use existing systems and components.",
    "version": "0.1.10",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 15457297,
  "releases": {
    "0.1.10": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "fd85aa7ee43bb5a7f265bbf03cb0285d407c2a6ef33268a52808464d911c015f",
          "md5": "846fc1189708d63ea88611814921ceef",
          "sha256": "536efecd7d6cf8fda314d69c83cc44a8e174444242f72b9a3a1e9bdc550a7811"
        },
        "downloads": -1,
        "filename": "BSPEC-0.1.10-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "846fc1189708d63ea88611814921ceef",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.9",
        "size": 36038,
        "upload_time": "2022-10-19T04:50:55",
        "upload_time_iso_8601": "2022-10-19T04:50:55.769809Z",
        "url": "https://files.pythonhosted.org/packages/fd/85/aa7ee43bb5a7f265bbf03cb0285d407c2a6ef33268a52808464d911c015f/BSPEC-0.1.10-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5b646f6cf618a9b531b05b2a90de2af31251f13e45a3478d297534d0df4c8e20",
          "md5": "ba077cb97bcdfa618304f7ddec9c2fb0",
          "sha256": "7941c1b6ae838025b3a5bdc1d0acee9aeabd122c4123eef1b266cbfaf4da6b92"
        },
        "downloads": -1,
        "filename": "BSPEC-0.1.10.tar.gz",
        "has_sig": false,
        "md5_digest": "ba077cb97bcdfa618304f7ddec9c2fb0",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.9",
        "size": 28410,
        "upload_time": "2022-10-19T04:50:57",
        "upload_time_iso_8601": "2022-10-19T04:50:57.510740Z",
        "url": "https://files.pythonhosted.org/packages/5b/64/6f6cf618a9b531b05b2a90de2af31251f13e45a3478d297534d0df4c8e20/BSPEC-0.1.10.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2f3f193bd8babd81d54cfe844e69130702df6bf96c84d41094464a890a7e1a5b",
          "md5": "e7c7831b48f91e3c79ce70e971dad5d4",
          "sha256": "41ccd114d78fd55b07067be75f9617e3cf10dfbeef151dd7d6b3bdbd854f62fc"
        },
        "downloads": -1,
        "filename": "BSPEC-0.1.5-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "e7c7831b48f91e3c79ce70e971dad5d4",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.9",
        "size": 33199,
        "upload_time": "2022-10-17T05:39:34",
        "upload_time_iso_8601": "2022-10-17T05:39:34.650316Z",
        "url": "https://files.pythonhosted.org/packages/2f/3f/193bd8babd81d54cfe844e69130702df6bf96c84d41094464a890a7e1a5b/BSPEC-0.1.5-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5db1eb0a0bcef57b4edf8f9395c3076cb0603b9e4b285942217af1378468ca14",
          "md5": "abd3ebc463a69e96af87442a651580a1",
          "sha256": "a951dd19f22da1f9067414b3599368ac4766be4874e131889200f4a936cfb826"
        },
        "downloads": -1,
        "filename": "BSPEC-0.1.5.tar.gz",
        "has_sig": false,
        "md5_digest": "abd3ebc463a69e96af87442a651580a1",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.9",
        "size": 26837,
        "upload_time": "2022-10-17T05:39:37",
        "upload_time_iso_8601": "2022-10-17T05:39:37.304362Z",
        "url": "https://files.pythonhosted.org/packages/5d/b1/eb0a0bcef57b4edf8f9395c3076cb0603b9e4b285942217af1378468ca14/BSPEC-0.1.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1bc5d1662dab9a3367695285250dbe929dd91fb87fd3a6b9ea24a7476c93b51d",
          "md5": "6e216a12dd1f6012ca53c36530dd157b",
          "sha256": "b15671a5ef749f2f77398c990aa4a47c174921b6a7fd46552991b88877fc3cee"
        },
        "downloads": -1,
        "filename": "BSPEC-0.1.6-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "6e216a12dd1f6012ca53c36530dd157b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.9",
        "size": 33239,
        "upload_time": "2022-10-17T18:25:23",
        "upload_time_iso_8601": "2022-10-17T18:25:23.767402Z",
        "url": "https://files.pythonhosted.org/packages/1b/c5/d1662dab9a3367695285250dbe929dd91fb87fd3a6b9ea24a7476c93b51d/BSPEC-0.1.6-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "bc70b435e9e8574a72b780df3dc6fe58213743def374fed6e7c8e1ffecce2d2c",
          "md5": "e70c9bc86d2dfa041f33041909940695",
          "sha256": "73e01f7b906f224a3f2f753f949e41cf2d9da354b8ba287ca29149b870630991"
        },
        "downloads": -1,
        "filename": "BSPEC-0.1.6.tar.gz",
        "has_sig": false,
        "md5_digest": "e70c9bc86d2dfa041f33041909940695",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.9",
        "size": 26884,
        "upload_time": "2022-10-17T18:25:25",
        "upload_time_iso_8601": "2022-10-17T18:25:25.349091Z",
        "url": "https://files.pythonhosted.org/packages/bc/70/b435e9e8574a72b780df3dc6fe58213743def374fed6e7c8e1ffecce2d2c/BSPEC-0.1.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.7": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a533ed83f9ba139dad108cd6e3d26f66037e0494eb719b395cee1ea77ed5661d",
          "md5": "77d3db4348842b7de04f9735b5da0658",
          "sha256": "04680494770593947feea2ad21a9b20cb44be121d076e8a87d57c5a84b562b5e"
        },
        "downloads": -1,
        "filename": "BSPEC-0.1.7-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "77d3db4348842b7de04f9735b5da0658",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.9",
        "size": 33253,
        "upload_time": "2022-10-17T18:46:37",
        "upload_time_iso_8601": "2022-10-17T18:46:37.581366Z",
        "url": "https://files.pythonhosted.org/packages/a5/33/ed83f9ba139dad108cd6e3d26f66037e0494eb719b395cee1ea77ed5661d/BSPEC-0.1.7-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1ce64f6c92308ddb743a0239fbc7a9e0d66bbe48004155e52560152a49d678b6",
          "md5": "004b3e8983a833ec573cbea1ea97bb09",
          "sha256": "3e2404c643b449206497939b588b2cdbd8020443f5f6149c14f178c3a227fdee"
        },
        "downloads": -1,
        "filename": "BSPEC-0.1.7.tar.gz",
        "has_sig": false,
        "md5_digest": "004b3e8983a833ec573cbea1ea97bb09",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.9",
        "size": 26903,
        "upload_time": "2022-10-17T18:46:39",
        "upload_time_iso_8601": "2022-10-17T18:46:39.188301Z",
        "url": "https://files.pythonhosted.org/packages/1c/e6/4f6c92308ddb743a0239fbc7a9e0d66bbe48004155e52560152a49d678b6/BSPEC-0.1.7.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.8": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c915df93888ed6a55dd8d56796b40f2a26fd7e7759193d42178728098579ed1a",
          "md5": "e7c62507a9c4c30d4f828524280b967f",
          "sha256": "9d6baebfab0c3f0ad7f049528cfa2d0b788642662e07a335657b722df074276d"
        },
        "downloads": -1,
        "filename": "BSPEC-0.1.8-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "e7c62507a9c4c30d4f828524280b967f",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.9",
        "size": 33252,
        "upload_time": "2022-10-17T18:58:36",
        "upload_time_iso_8601": "2022-10-17T18:58:36.815495Z",
        "url": "https://files.pythonhosted.org/packages/c9/15/df93888ed6a55dd8d56796b40f2a26fd7e7759193d42178728098579ed1a/BSPEC-0.1.8-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d8c0a9e845381da213f13945df0d03983997058a3c26f03a4095d37f3e86999c",
          "md5": "0e59f53d0c51891e6216c60aea6d74e1",
          "sha256": "a28b824424e21c603061fdd443706e5c5416c9613725a85c315ad7233581133b"
        },
        "downloads": -1,
        "filename": "BSPEC-0.1.8.tar.gz",
        "has_sig": false,
        "md5_digest": "0e59f53d0c51891e6216c60aea6d74e1",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.9",
        "size": 26898,
        "upload_time": "2022-10-17T18:58:38",
        "upload_time_iso_8601": "2022-10-17T18:58:38.515459Z",
        "url": "https://files.pythonhosted.org/packages/d8/c0/a9e845381da213f13945df0d03983997058a3c26f03a4095d37f3e86999c/BSPEC-0.1.8.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.9": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "088409ff0ba1f445e4e514647c36eadfe5df2ad5612e23db6ce22662b834726d",
          "md5": "f6c1b02156ff5ab2aca0881995e30011",
          "sha256": "a507ec38758991e3ad16288ba8d9dea8f4170368f7fa9da0195ef290bbe99b35"
        },
        "downloads": -1,
        "filename": "BSPEC-0.1.9-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "f6c1b02156ff5ab2aca0881995e30011",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.9",
        "size": 35045,
        "upload_time": "2022-10-17T19:03:20",
        "upload_time_iso_8601": "2022-10-17T19:03:20.852897Z",
        "url": "https://files.pythonhosted.org/packages/08/84/09ff0ba1f445e4e514647c36eadfe5df2ad5612e23db6ce22662b834726d/BSPEC-0.1.9-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9ea4d2b45a804113ebbd70f7c77025886fe9b61a50437a880c37f7d1aead7bf3",
          "md5": "cd4e8d0c9a94262cac9f6cf82a3d9be3",
          "sha256": "17137250affa46d8e8a75e5572d2303c208910d7f543a24b198b86fb07f0f099"
        },
        "downloads": -1,
        "filename": "BSPEC-0.1.9.tar.gz",
        "has_sig": false,
        "md5_digest": "cd4e8d0c9a94262cac9f6cf82a3d9be3",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.9",
        "size": 27880,
        "upload_time": "2022-10-17T19:03:22",
        "upload_time_iso_8601": "2022-10-17T19:03:22.463451Z",
        "url": "https://files.pythonhosted.org/packages/9e/a4/d2b45a804113ebbd70f7c77025886fe9b61a50437a880c37f7d1aead7bf3/BSPEC-0.1.9.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "fd85aa7ee43bb5a7f265bbf03cb0285d407c2a6ef33268a52808464d911c015f",
        "md5": "846fc1189708d63ea88611814921ceef",
        "sha256": "536efecd7d6cf8fda314d69c83cc44a8e174444242f72b9a3a1e9bdc550a7811"
      },
      "downloads": -1,
      "filename": "BSPEC-0.1.10-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "846fc1189708d63ea88611814921ceef",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.9",
      "size": 36038,
      "upload_time": "2022-10-19T04:50:55",
      "upload_time_iso_8601": "2022-10-19T04:50:55.769809Z",
      "url": "https://files.pythonhosted.org/packages/fd/85/aa7ee43bb5a7f265bbf03cb0285d407c2a6ef33268a52808464d911c015f/BSPEC-0.1.10-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "5b646f6cf618a9b531b05b2a90de2af31251f13e45a3478d297534d0df4c8e20",
        "md5": "ba077cb97bcdfa618304f7ddec9c2fb0",
        "sha256": "7941c1b6ae838025b3a5bdc1d0acee9aeabd122c4123eef1b266cbfaf4da6b92"
      },
      "downloads": -1,
      "filename": "BSPEC-0.1.10.tar.gz",
      "has_sig": false,
      "md5_digest": "ba077cb97bcdfa618304f7ddec9c2fb0",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.9",
      "size": 28410,
      "upload_time": "2022-10-19T04:50:57",
      "upload_time_iso_8601": "2022-10-19T04:50:57.510740Z",
      "url": "https://files.pythonhosted.org/packages/5b/64/6f6cf618a9b531b05b2a90de2af31251f13e45a3478d297534d0df4c8e20/BSPEC-0.1.10.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}