{
  "info": {
    "author": "Rory Flynn",
    "author_email": "rory.flynn@colostate.edu",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "# BETA RELEASE\n\nThe CAMPER software and data is currently in a testing state and needs more validations before it should be used for any publication or production task. This RELEASE is for early adopters to get a taste of what CAMPER can do and how it can be incorporated into a workflow. An official release will be available soon.\n\n# License Pending\n\nThis software remains unlicensed and the Wrighton Lab reserves all rights for the time being. Contributions will be welcomed once an appropriate license or licenses can be written. This should serve as another reminder that this project is in beta.\n\n# CAMPER (BETA)\n\n<p align=\"center\">\n<img width=\"660\" alt=\"camper_logo\" src=\"https://user-images.githubusercontent.com/95941779/176459947-c5497a73-2b77-42f0-99ee-6a836f23d6a7.png\">\n</p>\n\n\nTable of Contents\n=================\n  * [Overview](https://github.com/WrightonLabCSU/CAMPER#overview)\n  * [Installation and Usage](https://github.com/WrightonLabCSU/CAMPER#installation-and-usage)\n    * [Using CAMPER within DRAM](https://github.com/WrightonLabCSU/CAMPER#1-using-camper-within-dram)\n    * [Standalone CAMPER](https://github.com/WrightonLabCSU/CAMPER#2-camper-standalone-tool-camper_dramkit)\n    * [I just want your profiles to search on my own](https://github.com/WrightonLabCSU/CAMPER#3-i-just-want-to-run-your-blast-and-hmm-searches-on-my-own)\n  * [CAMPER Outputs](https://github.com/WrightonLabCSU/CAMPER#camper-outputs)\n  * [CAMPER Road Map](https://github.com/WrightonLabCSU/CAMPER#camper-map)\n\n\n# Overview\n**C**urated **A**nnotations for **M**icrobial (**P**oly)phenol **E**nzymes and **R**eactions (**CAMPER**) is a tool that annotates genes likely involved in transforming polyphenols, and provides chemical context for these transformations in a summarized form. CAMPER aims to address a blind spot in microbial metabolism. It is currently challenging to infer polyphenol metabolism from genomic data because:\n1) Genes encoding characterized enzymes have not been propagated into annotation databases\n3) Genes in databases can often be involved in multiple pathways, requiring expert knowledge to get polyphenol context\n4) Polyphenols can be transformed in many ways – oxidized, reduced, demethylated, deglycosylated, etc.\n5) Polyphenols are a complex class of compounds\n\nThese challenges limit widespread understanding of the transformation of these compounds across environments.\n\nTo facilitate the inference of polyphenol metabolism from genomes, CAMPER includes 8 Hidden-Markov Model (HMM) profiles and 33 Basic Local Alignment Search Tool (BLAST) searches for (poly)phenol-active genes. We also provide recommended score cut-offs for searches using two ranks: a more stringent, trusted rank (A) and a more relaxed, exploratory rank (B). The development of these profiles will be described in McGivern et al (in prep). Beyond these 41 profiles, nearly 300 other annotations from other databases (KEGG, dbCAN) are included in the CAMPER summarization.\n\nCAMPER summarizes the gene annotations into 101 modules representing different polyphenol transformations. These modules are classified by the family and sub-family of polyphenols used as substrates (following [Phenol-Explorer](http://phenol-explorer.eu/compounds/classification) Ontology) and by the oxygen requirements for the genes involved. These modules can be as small as a single gene, up to a maximum of 12 genes in the largest module.\n![camper_pathways_tree_for_github-01](https://user-images.githubusercontent.com/95941779/171468538-3f2cc169-2170-4612-880b-22ad11d7c9e9.png)\n**Figure 1. CAMPER consists of 101 polyphenol transformation modules, organized by substrates (Family and Subfamily) and oxygen requirements. Modules can be composed of 1-12 reaction steps.**\n\nFor more detailed information on the organization and outputs, see the [CAMPER Outputs](https://github.com/WrightonLabCSU/CAMPER#camper-outputs) section below, and for module visuals, see the [CAMPER Map](https://github.com/WrightonLabCSU/CAMPER#camper-map).\n\n# Installation and Usage\nThere are currently three ways to run CAMPER, depending on your goals.\n\n## CAMPER DATA\nThe CAMPER data set consists of 5 files, each serving a key role in enabling reproducible annotation of gene data.\n  - CAMPER_blast.faa: A fasta file of CAMPER genes used as a target in a BLAST style search provided by mmseqs search.\n  - CAMPER.hmm: A HMM file used as the target in an HMM profile search provide by MMseqs profilesearch\n  - CAMPER_blast_scores.tsv: Provides the minimum cut off scores for search results and quality ranks with BLAST style searches.\n  - CAMPER_hmm_scores.tsv: Provides the minimum cut off scores for search results and quality ranks with HMM Profile searches.\n  - CAMPER_distillate.tsv: A custom distillate, for use with DRAM or with CAMPER_DRAMKit, to summarize the annotation results.\n\n## 1. Using CAMPER within DRAM\n\nIf your goal is to integrate CAMPER into your regular genome annotation pipeline, we recommend running it as part of [DRAM](https://github.com/WrightonLabCSU/DRAM). **You will also get the benefit of summarizing 300 annotations derived from KEGG and dbCAN databases, if you have these databases installed, in addition to the 41 CAMPER annotations.** This will provide curated annotation and summarization of polyphenol transformation genes in addition to the regular DRAM databases.\n\nThere are two steps to running CAMPER in DRAM: (1) annotation and (2) summarization (distillation, in DRAM lingo).\nSupply the `--use_camper` flag during the annotation step, like so:\n\n```\nDRAM.py annotate --use_camper -i 'my_bins/*.fa' -o DRAM_wCAMPER\nDRAM.py distill -a DRAM_wCAMPER/annotations.tsv -o DRAM_wCAMPER_distilled\n```\n\nThe difference in outputs between this and default DRAM is that you will find CAMPER-specific columns added to the `annotations.tsv` and you will find a CAMPER tab in your `metabolism_summary.xlsx` output.\n\nFor descriptions of the content in output files, see the [CAMPER Outputs](https://github.com/WrightonLabCSU/CAMPER#camper-outputs) section below.\n\n## 2. CAMPER Standalone Tool: CAMPER_DRAMKit\n\nIf your goal is to only look at CAMPER annotations, we recommend running CAMPER_DRAMKit, a standalone tool that provides curated annotation and summarization of polyphenol transformation genes. **Unless you run with DRAM as described below and have KEGG and dbCAN databases, here you will only get the 41 custom annotations within CAMPER.** CAMPER_DRAMKit is really a smaller version of DRAM that follows much the same workflow as DRAM and has similar capabilities. There are three ways to set up the CAMPER_DRAMKit:\n\n#### A. Setup with Conda\n\nThe simplest way to get started with the CAMPER_DRAMKit is with Conda, using the enviroment.yaml provided in this repository.\n\nCAMPER_DRAMKit comes with the latest version of CAMPER preloaded, so if all you want to do is annotate and distill called genes with CAMPER, you only need the following commands.\n\n```\n  wget https://raw.githubusercontent.com/WrightonLabCSU/CAMPER/main/CAMPER_DRAMKit/environment.yaml\n  conda env create --name CAMPER -f ./environment.yaml\n```\n\nHowever, if you want to have all of CAMPER at your fingertips, you can use the following command to both download this repository, including all the CAMPER data and install the CAMPER_DRAMKit tool.\n\n```\ngit clone https://github.com/WrightonLabCSU/CAMPER.git\ncd CAMPER/CAMPER_DRAMKit\nconda env create --name CAMPER -f ./environment.yaml\n```\n\nIn both cases, you can activate the newly made environments with the command:\n\n```\nconda activate CAMPER\n```\n\nProvided all things have gone smoothly, you will be able to activate this environment at any time and use any of the commands outlined in the Usage section below. If there are any problems, please open an issue in the GitHub repository.\n\n#### B. Setup with pip\n\nIf you are not able to use Conda, you can still install CAMPER_DRAMKit with pip using the command below. Note that first you will need to install manually install [scikit-bio](http://scikit-bio.org/), and [MMseqs2](https://github.com/soedinglab/mmseqs2), as these tools can't be installed with the other pip dependencies.\n\n```\npip install camper_dramkit\n```\n\n#### C. Installing with DRAM\n\nIf you intend to use CAMPER_DRAMKit with DRAM, it may be expedient to install them in the same Conda environment. This is easy to do if you have already made a DRAM Conda environment with the [instructions in the DRAM README](https://github.com/WrightonLabCSU/DRAM), then you can add CAMPER with the following commands:\n\n```\nwget https://raw.githubusercontent.com/WrightonLabCSU/CAMPER/main/CAMPER_DRAMKit/environment.yaml\nconda env update --name DRAM -f ./environment.yaml\n```\n\nNote: If you install CAMPER_DRAMKit, you will get the latest version of the CAMPER database with it. If you want more control over the database, you can override the default data with the instructions in [Other Tools and flags](https://github.com/WrightonLabCSU/CAMPER#other-tools-and-flags).\n\n### Using CAMPER_DRAMKit\n\nOnce installed, CAMPER_DRAMKit will provide three commands: `camper_annotate`, `camper_distill` and `combine_annotations_lowmem`.  These commands alongside DRAM enable a variety of workflows.\n\n### Standalone Workflow\n\nThe simplest workflow is the two-step annotation and summarization of a single amino acid fasta file. An example of such a workflow is shown below.\n\n```\ncamper_annotate -i my_genes.faa -o my_output #annotate\ncamper_distill  -a my_output/annotations.tsv -o my_output/distillate.tsv #summarize\n```\n\nThese commands will make two files in the output directory (above named `my_output`, but this is customizable): `annotations.tsv` and `distillate.tsv` (or whatever you name it in your `-o` command). For descriptions of these files, see the [CAMPER Outputs](https://github.com/WrightonLabCSU#camper-outputs) section below.\n\n### DRAM Combination Workflow\n\nIt is possible to use CAMPER with any version of DRAM after 1.3, with one additional command. First follow the instructions above to update your DRAM environment with CAMPER_DRAMKit. Then with that environment activated, you should be able to run the following commands to make a new raw annotations file with all the DRAM data you expect, and the CAMPER data added in.\n\nIf you are not able to update your DRAM environment for whatever reason, you will simply need to switch environments mid-workflow.\n\n```\nDRAM.py annotate -i 'my_bins/*.fa' -o dram_output\ncamper_annotate -i my_genes.faa -a dram_output_annotation -o camper_dram_output\n```\n\nThis will create a new set of raw annotations with CAMPER data added, in this case the path of the new file will be `camper_dram_output/annotations.tsv`. Then,  use the `camper_distill` command to get a distillate with all the key genes from both DRAM and CAMPER.\n\n```\ncamper_distill  -a camper_dram_output/annotations.tsv -o camper_dram_output/camper_distillate.tsv\n```\nFor descriptions of the `annotations.tsv` and summary file, see the [CAMPER Outputs](https://github.com/WrightonLabCSU/CAMPER#camper-outputs) section below.\n\n### Other Tools and flags\n\nIn order to further customize your workflow, you can take advantage of a few more options in the CAMPER_DRAMKit package:\n\n**Combine Annotations With low memory:** You may want to **re-annotate** many existing DRAM annotation files, possibly from more than one version of DRAM. To this end we include the `combine_annotations_lowmem` command which should combine many annotation files quickly and with a small memory footprint, even if they come from different versions of DRAM. The command is used like so:\n```\nCombine_annotations_lowmem -i /path/to/many/dramfolders/*/annotations.tsv -o combined_annotation.tsv\n```\nThe input path needs to be a wild card pointing to a set of DRAM annotation files, this is passed to the python glob command, but the format should be familiar to anyone who uses bash and you can test it with the `ls` command.\n\n**Manually Specifying the Location of CAMPER Files:** The behavior of the `camper_annotate` and `camper_distill` commands is controlled by the latest version of the CAMPER dataset. If you want to use an older version of CAMPER, it is suggested you install the older version of the CAMPER_DRAMKit tool, as they will be released together and be mutually compatible. However, if you must, you can also specify the files to use with  `camper_annotate` and `camper_distill` using the appropriate arguments. An example is shown below.\n```\ncamper_annotate -i my_genes.faa -o my_output \\\n    --camper_fa_db_loc CAMPER_blast.faa \\\n    --camper_fa_db_cutoffs_loc CAMPER_blast_scores.tsv \\\n    --camper_hmm_loc CAMPER.hmm  \\\n   --camper_hmm_cutoffs_loc CAMPER_hmm_scores.tsv\ncamper_distill  -a my_output/annotations.tsv -o my_output/distillate.tsv \\\n    --camper_distillate CAMPER_distillate.tsv\n```\nIf at any time you forget these arguments, remember that running any script with the `--help` flag will provide more information. Also note that if you do not specify one or more arguments, the default data will be used.\n\n## 3. I just want to run your BLAST and HMM searches on my own!\nWe get that sometimes this is all you want to do! This is the simplest way to use our annotations. See the above [CAMPER Data](https://github.com/WrightonLabCSU/CAMPER#camper-data) section and download the `CAMPER_blast.faa` and `CAMPER.hmm` files. These can be run using blast, hmmsearch, or mmseqs2 searches of your data, for example:\n```\nmakeblastdb -in CAMPER_blast.faa -dbtype prot\nblastp -query my_genes.faa -db CAMPER_blast.faa -out BLAST_my_genes_CAMPER.txt -outfmt 6\n```\n```\nhmmsearch --tblout hmmsearch_my_genes_CAMPER.txt CAMPER.hmm my_genes.faa\n```\n\n**We strongly recommend curating these outputs with the scores given in the `CAMPER_blast_scores.tsv` and `CAMPER_hmm_scores.tsv` files for each profile search.**\n\n# CAMPER Outputs\nApproaches [1](https://github.com/WrightonLabCSU/CAMPER#1-using-camper-within-dram) and [2](https://github.com/WrightonLabCSU/CAMPER#2-camper-standalone-tool-camper_dramkit) output two files: the raw information for given searches (`annotations.tsv`) and the summarized information across searches (the distillate, either the `metabolism_summary.xlsx` if run through DRAM or the `distillate.tsv` from CAMPER_DRAMKit).\n\n**Raw annotations**: This is either a standalone file, or columns added to a file, depending on the search approach. This file tells you the genes in your dataset that pass CAMPER annotation thresholds, what they are annotated as, and the scores. It includes the following columns:\n  - `camper_hits`, A longer ID giving the CAMPER ID, gene abbreviation, and gene description.\n  - `camper_rank`, A match quality rank based on the value of the bit score (A or B). For BLAST-style searches, an A rank is a bitscore >=200 and B >=120. For HMM-style searches, scores are specific to each profile (see `CAMPER_hmm_scores.tsv`).\n  - `camper_bitScore`, The bitscore from the best search result. If more than one search meets at least a B-rank for a given gene, the search with the higher score is reported.\n  - `camper_id`: Unique CAMPER ID used in the distillation step, of the form D000XX.\n  - `camper_definition`: A short description of the CAMPER match in the database.\n  - `camper_search_type`: Tells you if a HMM profile or blast search found this match.\n\n**Distillate**: This is either a single file, or the **CAMPER** tab in the `metabolism_summary.xlsx` file. Each row in this file corresponds to a gene in a CAMPER module. This file gives you gene counts of genes in CAMPER modules. It includes the following columns:\n - `gene_id`, the database IDs assigned to this gene. These can be from CAMPER (D000XX), KEGG (KXXXX), dbCAN (AAX), or EC numbers. Note, some IDs are included more than once in the sheet if they are involved in more than one module!\n- `gene_description`, A more informative description of the gene in the step including gene abbreviation and gene name.\n- `module`, The CAMPER module that the given gene belongs to. There are 101 modules in CAMPER.\n- `header`, The classification for the polyphenol substrate following [Phenol-Explorer](http://phenol-explorer.eu/compounds/classification) Ontology. In the form: Polyphenol;Family;Sub-Family;Compound.\n- `subheader`, This contains information about routes, steps, and subunits. Sometimes, a given transformation can be accomplished in more than one sequence of steps: these are termed 'Routes'. Steps indicate the sequential transformations in the module. Subunits denote if the given gene encodes a subunit of a larger complex that carries out a step. Sometimes steps are labeled as \"optional\" if they are not required.\n- `specifc_reaction`, This gives examples of reactions when possible.\n- `oxygen`, This is either \"oxic\", \"anoxic\",\" or \"both\" for reactions that require oxygen, don't require oxygen, or can function with or without, respectively. Note: these are largely based on literature reporting and the systems they were characterized in, and should be used as guidelines.\n- `EC`, The EC number (if known) for a reaction.\n- `Notes`, Any important information to know about the genes, for example: manual curation to do, note on gene clusters, should they be extracellular etc.\n**The remaining columns will be counts of each gene in your input files.**\n\n# CAMPER Map\nThis is also provided as a PDF file.\n![CAMPER_RoadMap_v1-01](https://user-images.githubusercontent.com/95941779/171663024-4e53989c-f88b-4689-98b6-5f4df2c03b45.png)\n\n# Happy CAMPER-ing!\nAnnotations, organization, and conceptualization by [Bridget McGivern](https://github.com/bmcgivern13). Coding and implementation by [Rory Flynn](https://github.com/rmFlynn).\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "https://github.com/WrightonLabCSU/CAMPER/tarball/1.0.0",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/WrightonLabCSU/CAMPER",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "camper-dramkit",
    "package_url": "https://pypi.org/project/camper-dramkit/",
    "platform": null,
    "project_url": "https://pypi.org/project/camper-dramkit/",
    "project_urls": {
      "Download": "https://github.com/WrightonLabCSU/CAMPER/tarball/1.0.0",
      "Homepage": "https://github.com/WrightonLabCSU/CAMPER"
    },
    "release_url": "https://pypi.org/project/camper-dramkit/1.0.0/",
    "requires_dist": null,
    "requires_python": ">=3.8",
    "summary": "A tool to use the CAMPER dataset",
    "version": "1.0.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16079650,
  "releases": {
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ad941ec3406037605b3e8bd888f3aa0d4f470b3130a0df5b854613f7c43d2b76",
          "md5": "ba39f17ac3a3a7a52c90af301c0b7c96",
          "sha256": "a1a00a8abff6f1890836f9916e055f2e3ce50d574e44a355ad16a7819fde1133"
        },
        "downloads": -1,
        "filename": "camper_dramkit-1.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "ba39f17ac3a3a7a52c90af301c0b7c96",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 433969,
        "upload_time": "2022-12-09T21:11:08",
        "upload_time_iso_8601": "2022-12-09T21:11:08.441133Z",
        "url": "https://files.pythonhosted.org/packages/ad/94/1ec3406037605b3e8bd888f3aa0d4f470b3130a0df5b854613f7c43d2b76/camper_dramkit-1.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b17d3150bcee7af2a2ae6ad42da4493bcf2021e4edbebf2ba3ed6938752f5d1b",
          "md5": "e9d156717c3a9fb70eb78eb55e383206",
          "sha256": "2000499f4851fa748b56d1569ff179d7421c72c758e355eea995dd281a0ccc2b"
        },
        "downloads": -1,
        "filename": "camper_dramkit-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "e9d156717c3a9fb70eb78eb55e383206",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 432375,
        "upload_time": "2022-12-09T21:10:24",
        "upload_time_iso_8601": "2022-12-09T21:10:24.136191Z",
        "url": "https://files.pythonhosted.org/packages/b1/7d/3150bcee7af2a2ae6ad42da4493bcf2021e4edbebf2ba3ed6938752f5d1b/camper_dramkit-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.0b1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "22c6c233a45d712e398291c2b5e53d62c95e0020b6e146f1805982b4517bffd4",
          "md5": "e04564620b3d8c26f0ab3cc71e47bdee",
          "sha256": "bb36998e2d39e51ae238fc796076d99d21fa1d0e551fb12b5646455926c74f09"
        },
        "downloads": -1,
        "filename": "camper_dramkit-1.0.0b1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "e04564620b3d8c26f0ab3cc71e47bdee",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 431007,
        "upload_time": "2022-05-04T20:50:48",
        "upload_time_iso_8601": "2022-05-04T20:50:48.301946Z",
        "url": "https://files.pythonhosted.org/packages/22/c6/c233a45d712e398291c2b5e53d62c95e0020b6e146f1805982b4517bffd4/camper_dramkit-1.0.0b1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5c387aef33e1d42c468a6694adaeebd5fbda8da226fa08aad499deae5c6eac10",
          "md5": "36d57c4565b081e672e0c44615b99fcc",
          "sha256": "b8438d4dc8d23538aa3f6a92f2ecf319596e1f9ea17a2b3a7eb7cd74ea4c3bea"
        },
        "downloads": -1,
        "filename": "camper_dramkit-1.0.0b1.tar.gz",
        "has_sig": false,
        "md5_digest": "36d57c4565b081e672e0c44615b99fcc",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 427282,
        "upload_time": "2022-05-04T20:51:03",
        "upload_time_iso_8601": "2022-05-04T20:51:03.208764Z",
        "url": "https://files.pythonhosted.org/packages/5c/38/7aef33e1d42c468a6694adaeebd5fbda8da226fa08aad499deae5c6eac10/camper_dramkit-1.0.0b1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.0b2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c787ad65564b83ce2e41e6aababff309f5a03d80b294152c1242ef05c0e930c6",
          "md5": "2d7f0450c0b4d621468a9454e7ca78d2",
          "sha256": "31f696b41d21011db7b247af4900d545da1d5be489a0b70823468e3bf52059e8"
        },
        "downloads": -1,
        "filename": "camper_dramkit-1.0.0b2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "2d7f0450c0b4d621468a9454e7ca78d2",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 434182,
        "upload_time": "2022-06-13T20:10:38",
        "upload_time_iso_8601": "2022-06-13T20:10:38.432717Z",
        "url": "https://files.pythonhosted.org/packages/c7/87/ad65564b83ce2e41e6aababff309f5a03d80b294152c1242ef05c0e930c6/camper_dramkit-1.0.0b2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e024940d610ca28ba92c20d2e1b3e1049a85d8747594fb7a14fdcefedffccd81",
          "md5": "4812de8d77ead27b2c6725bd4055dfef",
          "sha256": "856a58595e577e0d56d8a50a701e5a04449a32fcc225f8ea4502130de679178b"
        },
        "downloads": -1,
        "filename": "camper_dramkit-1.0.0b2.tar.gz",
        "has_sig": false,
        "md5_digest": "4812de8d77ead27b2c6725bd4055dfef",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 432757,
        "upload_time": "2022-06-13T20:10:48",
        "upload_time_iso_8601": "2022-06-13T20:10:48.637362Z",
        "url": "https://files.pythonhosted.org/packages/e0/24/940d610ca28ba92c20d2e1b3e1049a85d8747594fb7a14fdcefedffccd81/camper_dramkit-1.0.0b2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.0b3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3913e9755de6c114b8b006f7c341786f0ffe68638a2fff18a9f0bd5c12e52320",
          "md5": "6b92dab2f556b465d7f1bf5bad9d7774",
          "sha256": "320e160075eec2ec9ad5652008037874968298770f3ba005e0c62ab2570466bc"
        },
        "downloads": -1,
        "filename": "camper_dramkit-1.0.0b3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "6b92dab2f556b465d7f1bf5bad9d7774",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 435392,
        "upload_time": "2022-12-12T22:39:09",
        "upload_time_iso_8601": "2022-12-12T22:39:09.537305Z",
        "url": "https://files.pythonhosted.org/packages/39/13/e9755de6c114b8b006f7c341786f0ffe68638a2fff18a9f0bd5c12e52320/camper_dramkit-1.0.0b3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "ad941ec3406037605b3e8bd888f3aa0d4f470b3130a0df5b854613f7c43d2b76",
        "md5": "ba39f17ac3a3a7a52c90af301c0b7c96",
        "sha256": "a1a00a8abff6f1890836f9916e055f2e3ce50d574e44a355ad16a7819fde1133"
      },
      "downloads": -1,
      "filename": "camper_dramkit-1.0.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "ba39f17ac3a3a7a52c90af301c0b7c96",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.8",
      "size": 433969,
      "upload_time": "2022-12-09T21:11:08",
      "upload_time_iso_8601": "2022-12-09T21:11:08.441133Z",
      "url": "https://files.pythonhosted.org/packages/ad/94/1ec3406037605b3e8bd888f3aa0d4f470b3130a0df5b854613f7c43d2b76/camper_dramkit-1.0.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "b17d3150bcee7af2a2ae6ad42da4493bcf2021e4edbebf2ba3ed6938752f5d1b",
        "md5": "e9d156717c3a9fb70eb78eb55e383206",
        "sha256": "2000499f4851fa748b56d1569ff179d7421c72c758e355eea995dd281a0ccc2b"
      },
      "downloads": -1,
      "filename": "camper_dramkit-1.0.0.tar.gz",
      "has_sig": false,
      "md5_digest": "e9d156717c3a9fb70eb78eb55e383206",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.8",
      "size": 432375,
      "upload_time": "2022-12-09T21:10:24",
      "upload_time_iso_8601": "2022-12-09T21:10:24.136191Z",
      "url": "https://files.pythonhosted.org/packages/b1/7d/3150bcee7af2a2ae6ad42da4493bcf2021e4edbebf2ba3ed6938752f5d1b/camper_dramkit-1.0.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}