{
  "info": {
    "author": "AlexSpradling",
    "author_email": "alexspradling@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# Capella\r\n\r\n## Installation\r\n\r\n`pip install Capella`\r\n\r\n### To Run:\r\nNavigate to your python installation and go to `lib\\site-packages` open the `Capella` directory in your terminal and run `main.py`, the GUI will open from the terminal.\r\n\r\n\r\n### Introduction\r\n\r\nCapella is a simple-to-use Astronavigation aid. The program will derive a celestial position from a minimum of inputs and plot the position on a chartlet, with an analysis of the accuracy of  computed position provided. The program  additionally features some helper functions for celestial observation session planning, DR computation and compass correction. \r\n\r\n## Section 1: Sight Entry\r\n\r\n**DR Information**\r\n\r\nAll effective navigation starts with keeping a DR. Capella is no different. For the program to work effectively, first provide a DR position, time, course and speed. \r\n\r\nCapella uses the standard nautical conventions for time and position formatting, and all times are kept in UTC. Capella will format the input for you---just type in the numbers for the respective field and when you are finished press tab or click to advance to the next input field. If erroneous information has been inputted, the field will flag RED. \r\n\r\n**Sight Entry**\r\n\r\nIn the Step 2 section, complete the four required fields. All the input fields will assist with autocompletion and formatting. The fields are: 1. Body 2. Hs Value 3. Sight Date 4. Sight Time. \r\nAll sextant altitude corrections are handled internally, simply input the Hs value for the observation.\r\n\r\nWhen you have completed the four input fields, hit the *Add* button and the sight will appear in the Sight List at the top of the screen. To edit previously entered information, click on the sight in the *Sight List*, the sight's information will populate the sight entry fields under Step 2. Make any required changes and hit *Update* and the sight entry will change in the *Sight List*. To remove a sight from the *Sight List*, simply click on the sight and hit *Delete*. Multiple sight handling is easily achieved using the conventional Shift or Ctrl + click features. \r\n\r\n*Averaging*\r\n\r\nIf you have multiple observations of the same body, you can CTRL or SHIFT click on them in the Sight Entry area, and the average of their Hs and time/date values will appear in the Step 2-Entry area. Press the *Add* button to add the averaged sight. It is recommended you first compute the position with all sights unaveraged and use the *Fit-Slope Analysis* feature to find which values should be eschewed or kept for averaging.\r\n\r\n*Almanac Computation*\r\n\r\nCapella features a high-accuracy perpetual almanac valid from the years 1900-2050, with the data taken from the JPL de421 database. Once the fix is computed, all almanac data is displayed in the *Sight Data/Planning* section. \r\n\r\n**Fix Computation**\r\n\r\nCapella will calculate a fix from the DR information provided in Step 1 and the sights added to the Sight List. A fix can be calculated from just one sight and the provided DR information, however the algorithm needs at least 2 sights to provide a more accurate fix. Once two or more sights are present in the *Sight List* and a *Fix Time* and *Fix Date* has been provided in the *Step 1* field, hit the *Compute* button or press *CTRL-l*. Capella will calculate a running fix based on the DR and *Fix Time* information provided. The calculated results as well as a DR position for the requested *Fix Time* will appear highlighted at the bottom. \r\n\r\nThe position calculation is provided by the robust Limited Memory-BFGS algorithm. This algorithm is robust with respect to erroneous DR information, will not converge to a local minimum and can effectively handle high altitude sights. Prudent navigation always requires the most accurate DR possible, however, the fitting algorithm is somewhat robust with respect to DR accuracy. \r\n\r\n*Example 1:*\r\n\r\nThe Sight Information below yields the fix: **40-14.0-N, 049-58.0-W**.\r\n```\r\n| DR Date   | DR Time  | DR L      | DR λ       | Course | Speed | I.C. | H.O.E | Temp. | Press. | Fix Date  | Fix Time |\r\n| --------- | -------- | --------- | ---------- | ------ | ----- | ---- | ----- | ----- | ------ | --------- | -------- |\r\n| 1993-5-13 | 07:30:00 | 40-10.0-N | 050-15.0-W | 090    | 5.5   | -1.2 | 7     | 10    | 1010   | 1993-5-13 | 07:44:00 |\r\n\r\n| Body       | Hs      | Date       | Time     |\r\n| ---------- | ------- | ---------- | -------- |\r\n| Kochab     | 43-23.8 | 1993-05-13 | 07:33:45 |\r\n| Rasalhague | 51-05.2 | 1993-05-13 | 07:35:16 |\r\n| Alkaid     | 30-15.9 | 1993-05-13 | 07:37:15 |\r\n| Altair     | 58-38.0 | 1993-05-13 | 07:39:02 |\r\n| Venus      | 15-15.3 | 1993-05-13 | 07:41:24 |\r\n| MoonLL     | 34-05.6 | 1993-05-13 | 07:44:08 |\r\n```\r\nby changing the DR Position to 00-00.0-N and 000-00.0-W *--a position 3673 nm away--* and keeping the same observation data, Capella yields the fix: **40-14.3-N, 049-57.8-W**. \r\n\r\n**Systematic Error**\r\n\r\nIf Capella's systematic error algorithm detects uncorrected index and personal error, a prompt will appear asking you could like to remove the error from your observations and recompute the fix. Click *Ok* and then click *Compute*. This process can be iterative and the prompt might appear multiple times, with each cycle bringing the calculated fix closer to the observer's true position. This method isn't a magic bullet, but can yield impressive results in certain circumstances. \r\n\r\n**Loading and Saving Observation Records**\r\n\r\nCapella uses the computer's clipboard as a means of loading and saving observations. Rather than saving the observations in a proprietary format, the observations are copied to the clipboard as a simple markdown format table than can be pasted into any .txt file the navigator wishes to use as a sight log. \r\n\r\n*To Save Sights*\r\n1. In Capella, click File-Save Sights to Clipboard or CTRL-s. \r\n2. 2 markdown format tables will be saved to your computer's clipboard.\r\n3. Paste them in any .txt file you would like to use as a log. \r\n\r\n*To Load Sights*\r\n1. Highlight the 2 tables that you pasted into the .txt file of choice. \r\n2. Copy to the computer's clipboard via CTRL-C or using the mouse.\r\n3. In Capella, click File-Load Sights from Clipboard or CTRL-l\r\n\r\n*Why do it like this?*\r\n1. Simplicity. You can use one E-log for record keeping, note taking and to interact with the program. \r\n2. Using the \"Windows-Snap\" features on a computer allows you to snap Capella to one side of the screen and snap the `.txt` sight log of choice to the other. Using the `ctrl` quick keys you can rapidly edit the observations in the `.txt` log and compute the observations in Capella side by side. \r\n3. Most celestial navigation programs have UI issues that are difficult and frustrating to navigate, using this method, you can use any text editor as the primary controller of the program if you'd like. Simply use the below template:\r\n```\r\n| DR Date    | DR Time   | DR L      | DR λ       |   Course |   Speed |   I.C. |   H.O.E |   Temp. |   Press. | Fix Date   | Fix Time   |\r\n|------------|-----------|-----------|------------|----------|---------|--------|---------|---------|----------|------------|------------|\r\n| 2012-07-06 | 12:30:00  | 47-25.9-N | 007-08.0-W |      208 |      17 |    0.4 |      86 |      10 |     1010 | 2012-07-06 | 12:33:22   |\r\n \r\n| Body   | Hs      | Date       | Time     |\r\n|--------|---------|------------|----------|\r\n| SunLL  | 65-03.4 | 2012-07-06 | 12:29:22 |\r\n```\r\n\r\n\r\n\r\n## Section 2: LOP Plot\r\n\r\n**Exploring the plot**\r\n\r\nOnce the fix is computed from the *Sight Entry* page, the LOP's for the observations are automatically plotted. The plot is highly customizable with respect to  size, aspect and zoom via the buttons located in the lower right corner. Click the *NSEW arrow* icon and then left-click and drag on the plot to move the plot, the Latitude and Longitude scales will automatically change. A right-click and drag will change the plots aspect. To reset the plot back to the default at any time, click on the *House* icon. To zoom in on the plot, click the *Magnifying Glass* icon and then left-click and drag to zoom-in and right-click and drag to zoom-out. \r\n\r\nWherever the mouse travels in the plot area, the Lat/Long position will appear in the lower right corner. To save the plot as a PNG image, select the *Floppy Disk* image in the lower right corner.\r\n\r\n**Plot Information**\r\n\r\nThe LOPS are automatically advanced with the course and speed information provided in the *Sight Entry* section and bodies are labeled on the plot and in the sight key area. Additionally, the computed DR position for the *Fix Time* is also plotted. If the DR is very far from the LOP plot, the plot will need to be zoomed for a better aspect, however, if a good DR is being kept, this should not be necessary in most cases. \r\n\r\n**Fix + Confidence**\r\n\r\nThe red dot on the LOP plot marks the computed position and the golden ellipse surrounding the computed fix represents an area of 95% confidence. That is, there is a 95% probability, *given the sight information provided* that the true position lies within the ellipse.\r\n\r\n## Section 3: Fit Slope Analysis\r\n\r\nThis is an implementation of Dr. David Burch's Fit Slope method. It is a means of deriving greater accuracy from our sight observations and attempting to spot any outliers or potential blunders. \r\n\r\n**How  Fit-Slope Analysis works**\r\n\r\nThe vessel is moving all the time at sea and and the celestial objects are moving all the time as well. If we take 3 observations of the Sun, how do we know which observations were accurate and which weren't? \r\n\r\nA simple averaging of the sights and times may not yield more accurate results if one of the observations is erroneous--However, the ascending or descending slope of the body can be computed and plotted as a function of time and estimated position, and the slope will be mostly linear as long as the timescale is fairly short.\r\n\r\nWe can then plot our observation relative to this sloping line. If our observation is way off of the slope, the sight is likely a blunder, if it is close to the slope it was likely O.K. With multiple observations this allows us to find any outliers. Using the 3 Sun observation example, if 2 observations scatter close to the fitted slope and another scatters way off of the slope, we know we can discard that observation as it was likely a blunder. If All three observations scatter within 1 or 2 arc minutes of the fitted slope, we can safely average the sights to reduce the amount of error in our observations. \r\n\r\n**Plot Information**\r\n \r\nEach plot on the *Fit-Slope* page has a fitted *slope* and a *red dot*. The *slope* represents the computed altitude at the DR Position one minute behind the DR position of the observation and the computed altitude at the DR position one minute ahead of the DR position of the observation. A red dot is the observed altitude at the time of the observation. With this information you can see if your observation was under-observed or over-observed. the *Scatter* value at the top of each plot tells you how by how many minutes of arc your observation was over or under the computed slope.  The X-axis scale is minutes after the hour of observation, and covers a 2 minute timescale. The Y-axis scale is the computed range of altitudes for the observed body over that 2 minute scale. As with the LOP Plot page, every plot is fully interactive and explorable using the buttons in the lower left corner, and the values for any point on the plot will appear in the lower right corner.\r\n\r\n*Example 2:*\r\n\r\nThe following observations are taken and a fix of 21-11.0-N, 157-34.7-W is computed, the observer's actual position is: 21-12.0-N, 157-30.0-W. \r\n```\r\n| DR Date    | DR Time   | DR L      | DR λ       |   Course |   Speed |   I.C. |   H.O.E |   Temp. |   Press. | Fix Date   | Fix Time   |\r\n|------------|-----------|-----------|------------|----------|---------|--------|---------|---------|----------|------------|------------|\r\n| 1990-01-02 | 03:00:00  | 21-12.0-N | 157-30.0-W |        0 |       0 |      0 |       0 |      10 |     1010 | 1990-01-02 | 03:12:00   |\r\n\r\n| Body      | Hs      | Date       | Time     |\r\n| --------- | ------- | ---------- | -------- |\r\n| Deneb     | 50-15.0 | 1990-01-02 | 03:00:00 |\r\n| Fomalhaut | 38-54.0 | 1990-01-02 | 03:01:00 |\r\n| Aldebaran | 15-32.0 | 1990-01-02 | 03:02:00 |\r\n| Deneb     | 49-27.0 | 1990-01-02 | 03:05:00 |\r\n| Fomalhaut | 38-46.0 | 1990-01-02 | 03:06:00 |\r\n| Aldebaran | 16-30.0 | 1990-01-02 | 03:07:00 |\r\n| Deneb     | 48-38.0 | 1990-01-02 | 03:10:00 |\r\n| Fomalhaut | 38-37.0 | 1990-01-02 | 03:11:00 |\r\n| Aldebaran | 17-50.0 | 1990-01-02 | 03:12:00 |\r\n```\r\n\r\nThe fit slope analysis shows that the Aldebaran observation at 03:07:00 scatters 9.79 arc minutes under the computed slope while the other Aldebaran observations are + 0.64' and + 1.74' respectively. This observation is clearly a blunder, and the LOP plot confirms that it is far away from our other LOPS so it is removed altogether from the *Sight List* and a new position is computed: \r\n21-12.0-N, 157-31.5-W. The position can be further refined, by either selecting the individual sights with the least scatter, or averaging each set since the Fit-Slope analysis confirms their normal distribution, both methods will yield a fix with a similar level of accuracy. \r\n\r\n## Section 4: Planning/Session Data\r\n\r\n\r\n**Sight Planning** \r\n\r\nThe *Sight Planning* utility provides a quick and convenient means of plotting a round of observations prior to a sight session. Enter a UTC date and time in the provided sight fields and then hit the *Set Time* button. Using the provided DR date/time, Lat/Long and course/speed in the *Sight Entry* page, a DR position for the selected time and will appear in the two fields below. The *Time of Phenomena*, *Body List* and *Optimal Triads* will now be populated with information. \r\n\r\n*Time of Phenomena*\r\n\r\nA list of major celestial phenomena for a 24 hour period is displayed. All the times are corrected with a \"second estimate\" based on the DR information provided.\r\n\r\n*Body List*\r\n\r\nA list of all celestial bodies that are visible at the specified time and computed DR position that are between 25 and 65 degrees in altitude. Their altitude, azimuth and magnitude are calculated for the specified time and calculated DR position and listed in a scrollable table. \r\n\r\n*Optimal Triads*\r\n\r\nA weighting algorithm will list optimal groupings of 3 celestial objects based on azimuthal distribution, magnitude and altitude and list them in a scrollable table.\r\n\r\n*Example 3:*\r\n\r\nit is 2012-07-06 at 09:00:00 UTC and we wish to plan for the day's observations. We input the below information in the *Sight Entry* DR fields. \r\n```\r\n| DR Date    | DR Time  | DR L      | DR λ       | Course | Speed | I.C. | H.O.E | Temp. | Press. |\r\n| ---------- | -------- | --------- | ---------- | ------ | ----- | ---- | ----- | ----- | ------ | \r\n| 2012-07-06 | 09:00:00 | 48-18.4-N | 006-26.5-W | 208    | 17    | 0.4  | 86    | 10    | 1010   | \r\n```\r\n\r\nWe enter the 2012-07-06, 09:00:00 UTC in the input fields in the Planning Controls tab and hit *Set Time*. We click on the time of phenomena tab and see that L.A.N. will occur at 12:33:21 UTC. and PM Nautical Twilight will be around 21:00:00 UTC. \r\n\r\nAt 12:30:00 UTC we begin a round of noon sights:\r\n```\r\n| DR Date    | DR Time   | DR L      | DR λ       |   Course |   Speed |   I.C. |   H.O.E |   Temp. |   Press. | Fix Date   | Fix Time   |\r\n|------------|-----------|-----------|------------|----------|---------|--------|---------|---------|----------|------------|------------|\r\n| 2012-07-06 | 12:30:00  | 47-25.9-N | 007-08.0-W |      208 |      17 |    0.4 |      86 |      10 |     1010 | 2012-07-06 | 12:33:22   |\r\n \r\n| Body   | Hs      | Date       | Time     |\r\n|--------|---------|------------|----------|\r\n| SunLL  | 65-03.4 | 2012-07-06 | 12:29:22 |\r\n| SunLL  | 65-05.3 | 2012-07-06 | 12:33:22 |\r\n| SunLL  | 65-05.4 | 2012-07-06 | 12:34:22 |\r\n| SunLL  | 65-05.6 | 2012-07-06 | 12:35:22 |\r\n| SunLL  | 65-05.6 | 2012-07-06 | 12:36:22 |\r\n| SunLL  | 65-05.6 | 2012-07-06 | 12:37:22 |\r\n| SunLL  | 65-05.4 | 2012-07-06 | 12:38:22 |\r\n```\r\nThe *Fit Slope Analysis* tab confirms that our 12:33:22 observation was the meridian transit, agreeing with the computed 12:33:21 estimate. Our 12:33:00 computed Latitude at LAN is therefore 47-24.7- N, and the GHA of our LAN observation is 007-08.1 - this is listed in the *Sight Data* table. Our computed position is therefore 47-24.7-N, 007-08.1-W. \r\n\r\nWe enter our fix as our new DR on the *Sight Entry* page and enter 21:00:00 UTC - the approximate time of Nautical Twilight we computed earlier - in the time field under *Planning Controls*. Our 21:00:00 UTC DR position updates to 45-18.3-N, 008-46.0-W. Under *Body List* we see all of the optimal bodies to shoot for 21:00:00 UTC Star Time, calculated for DR position 45-18.3-N, 008-46.0-W. Under *Optimal Triads* we see the best 3-body groupings listed in order, weighted by azimuthal distribution, altitude and magnitude. \r\n\r\nOur plan is preset our sextant with the below listed values and try to get at least 3 observations of each body, weather permitting. \r\n\r\n*Optimal Triad 1*\r\n\r\n| Body          | Alt     | Az  | Mag  |\r\n| ------------- | ------- | --- | ---- |\r\n| Alioth        | 64-10.1 | 308 | 1.76 |\r\n| Zubenelgenubi | 28-06.5 | 189 | 2.75 |\r\n| Deneb         | 36-51.7 | 60  | 1.25 |\r\n\r\n**Sight Data**\r\n\r\nThe *Sight Data* table lists relevant almanac and observation data for the sights that were used for the sight reduction process. Capella DR's automatically using the time of each sight and the listed Session DR time and position in order to compute the Alt, Az and Intercept values. These values are not used in the automatic plotting process, but can be used if the navigator wishes to use a paper plot. 'Best Sights'  with the lowest scatter from the *Fit Slope Analysis* are highlighted in green for easy identification.\r\n\r\n**Analytics**\r\n\r\n*Best Sights*\r\n\r\nA list of the observations with the lowest scatter values per body. If only one body is observed but at distinct times, then the 'best' value is computed for each block of time. For example, in the below example the 'best' values are computed for 3 distinct blocks of time, the 1993-07-07 21:00:00 and 23:00:00 sessions and the 1993-07-08, 00:30:00 session. \r\n```\r\n| DR Date   | DR Time   | DR L    | DR λ     |   Course |   Speed |   I.C. |   H.O.E |   Temp. |   Press. | Fix Date   | Fix Time   |\r\n|-----------|-----------|---------|----------|----------|---------|--------|---------|---------|----------|------------|------------|\r\n| 1993-7-7  | 15:21:00  | 39-46-N | 161-20-W |      265 |       6 |   -1.5 |       9 |      10 |     1010 | 1993-7-8   | 00:33:12   |\r\n \r\n| Body  | Hs      | Date     | Time     |\r\n| ----- | ------- | -------- | -------- |\r\n| SunLL | 65-04.7 | 1993-7-7 | 21:30:17 |\r\n| SunLL | 65-19.7 | 1993-7-7 | 21:31:55 |\r\n| SunLL | 72-23.8 | 1993-7-7 | 23:02:04 |\r\n| SunLL | 72-19.4 | 1993-7-7 | 23:03:49 |\r\n| SunLL | 63-00.2 | 1993-7-8 | 00:31:28 |\r\n| SunLL | 62-44.9 | 1993-7-8 | 00:33:12 |\r\n```\r\nIn a case where all of the bodies are distinct, they are all their own 'best' and every sight will be listed under *Best Sights*  and will be highlighted green in the *Sight Data* field. \r\n\r\n*Position Errors*\r\n\r\nA table with the one and two Sigma errors for the fitting algorithm converted into nautical mile estimates. The goal is to provide the navigator with an estimate as to where their celestial fix has placed them vs. where they might actually be. However, It is important to remember that these errors are only relevant to the fit of the *information provided* and are not a magic bullet. For example, a two body fix is by definition an *exact* position, X marks the spot so to speak, and the 95% error estimate will be close to zero, however(!), the *exact* position is likely not *exactly* where you are. \r\n\r\nCelestial Navigation under the most optimal and rigorous circumstances can provide a positional accuracy of around 1 nm, it is not a GPS. As always the prudent navigator uses more than one means of position fixing to navigate.\r\n\r\n## Section 5: Azimuth\r\n\r\n\r\n**Observation Input**\r\n\r\nIn the *Observation Input* section, fill in the required input fields with the body observed, the gyro bearing and time and position of the observation. As with all other fields of their type in the program, autocompletion and format checking are provided to assist the navigator. \r\n\r\nThe output is provided in the *Compass Observations Records* field in the exact format used in the usual *Compass Observation Book* required by IMO standards. The Gyro Error, Compass Error, and Magnetic Variation and Magnetic Deviation are calculated. Magnetic Variation can be calculated for any position in the world and uses the World Magnetic Model Epoch 2020. The list of gaussian coefficients is internal to the program and is valid through 2025. \r\n\r\n\r\n\r\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/AlexSpradling/Capellav.git",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "Capella",
    "package_url": "https://pypi.org/project/Capella/",
    "platform": null,
    "project_url": "https://pypi.org/project/Capella/",
    "project_urls": {
      "Homepage": "https://github.com/AlexSpradling/Capellav.git"
    },
    "release_url": "https://pypi.org/project/Capella/1.0.3/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "Capella Beta",
    "version": "1.0.3",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 15910009,
  "releases": {
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d37482ffc7a6897c75d2db2bc1c27fd671fab3f6ce91c81f706595c316b488c6",
          "md5": "a02fbe75ad12a94d71b18ab1b0cedd23",
          "sha256": "d5d30b04c4351f90ed69c5ee87b0f88f7ad193d3f962e64f4781364daf50ae70"
        },
        "downloads": -1,
        "filename": "Capella-1.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "a02fbe75ad12a94d71b18ab1b0cedd23",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 9000,
        "upload_time": "2022-11-28T03:00:02",
        "upload_time_iso_8601": "2022-11-28T03:00:02.488016Z",
        "url": "https://files.pythonhosted.org/packages/d3/74/82ffc7a6897c75d2db2bc1c27fd671fab3f6ce91c81f706595c316b488c6/Capella-1.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9e266600d7477182fccfe83583dc534174729e511b8d0c7a53943210ca69d9e9",
          "md5": "a07cd7f32f2e40a8525459972f6cb569",
          "sha256": "8f274711d7ce6f65b0fc9f67286720813cc2d66d2cb5176caf496f34648986ec"
        },
        "downloads": -1,
        "filename": "Capella-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "a07cd7f32f2e40a8525459972f6cb569",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 10032,
        "upload_time": "2022-11-28T03:00:04",
        "upload_time_iso_8601": "2022-11-28T03:00:04.549489Z",
        "url": "https://files.pythonhosted.org/packages/9e/26/6600d7477182fccfe83583dc534174729e511b8d0c7a53943210ca69d9e9/Capella-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "57766e894960fa72543348861f4eed86548f0885dfc9b13ed38e3130745deb90",
          "md5": "3a6fd04a7208946c1006c5922d629875",
          "sha256": "627cd82167722f6df7dbc1cdbeddb7f758a6b0da146d850aa03abebcf2260695"
        },
        "downloads": -1,
        "filename": "Capella-1.0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "3a6fd04a7208946c1006c5922d629875",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 38599,
        "upload_time": "2022-11-28T03:13:32",
        "upload_time_iso_8601": "2022-11-28T03:13:32.989148Z",
        "url": "https://files.pythonhosted.org/packages/57/76/6e894960fa72543348861f4eed86548f0885dfc9b13ed38e3130745deb90/Capella-1.0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c06b0057db0723cb8feac3893394a73a9308e56cb4825f0e57b15a5086a3bb79",
          "md5": "21c2cfee05378b08d1f8c2b6c3076da7",
          "sha256": "9335c15107291e5b46e425fc40887cc2b3c5e5237fd2b120a8afe065131c1ea5"
        },
        "downloads": -1,
        "filename": "Capella-1.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "21c2cfee05378b08d1f8c2b6c3076da7",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 38724,
        "upload_time": "2022-11-28T03:13:34",
        "upload_time_iso_8601": "2022-11-28T03:13:34.808214Z",
        "url": "https://files.pythonhosted.org/packages/c0/6b/0057db0723cb8feac3893394a73a9308e56cb4825f0e57b15a5086a3bb79/Capella-1.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "34535ce00455c244d4528af15b66b306e265716d22f5a20f937805812fc06f41",
          "md5": "533c9b1da22442f6592196ffc6284333",
          "sha256": "4f060c002f6ab601a5803a287bb60bddbadd8a99e2a4004f28569742cc60dbba"
        },
        "downloads": -1,
        "filename": "Capella-1.0.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "533c9b1da22442f6592196ffc6284333",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 38703,
        "upload_time": "2022-11-28T04:48:36",
        "upload_time_iso_8601": "2022-11-28T04:48:36.829560Z",
        "url": "https://files.pythonhosted.org/packages/34/53/5ce00455c244d4528af15b66b306e265716d22f5a20f937805812fc06f41/Capella-1.0.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ab08b93ed99661cf2c34c986c8cf487a220f3818094febe5f69b0b3efc65c950",
          "md5": "2bc095a6ce1d182a7ddda554d40e76c7",
          "sha256": "aeca774b210d68306969beb6057c36f2e0d2e9274b67d398e6d6cfe8e97a1ddf"
        },
        "downloads": -1,
        "filename": "Capella-1.0.3.tar.gz",
        "has_sig": false,
        "md5_digest": "2bc095a6ce1d182a7ddda554d40e76c7",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 38832,
        "upload_time": "2022-11-28T04:48:38",
        "upload_time_iso_8601": "2022-11-28T04:48:38.777001Z",
        "url": "https://files.pythonhosted.org/packages/ab/08/b93ed99661cf2c34c986c8cf487a220f3818094febe5f69b0b3efc65c950/Capella-1.0.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "34535ce00455c244d4528af15b66b306e265716d22f5a20f937805812fc06f41",
        "md5": "533c9b1da22442f6592196ffc6284333",
        "sha256": "4f060c002f6ab601a5803a287bb60bddbadd8a99e2a4004f28569742cc60dbba"
      },
      "downloads": -1,
      "filename": "Capella-1.0.3-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "533c9b1da22442f6592196ffc6284333",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 38703,
      "upload_time": "2022-11-28T04:48:36",
      "upload_time_iso_8601": "2022-11-28T04:48:36.829560Z",
      "url": "https://files.pythonhosted.org/packages/34/53/5ce00455c244d4528af15b66b306e265716d22f5a20f937805812fc06f41/Capella-1.0.3-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "ab08b93ed99661cf2c34c986c8cf487a220f3818094febe5f69b0b3efc65c950",
        "md5": "2bc095a6ce1d182a7ddda554d40e76c7",
        "sha256": "aeca774b210d68306969beb6057c36f2e0d2e9274b67d398e6d6cfe8e97a1ddf"
      },
      "downloads": -1,
      "filename": "Capella-1.0.3.tar.gz",
      "has_sig": false,
      "md5_digest": "2bc095a6ce1d182a7ddda554d40e76c7",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 38832,
      "upload_time": "2022-11-28T04:48:38",
      "upload_time_iso_8601": "2022-11-28T04:48:38.777001Z",
      "url": "https://files.pythonhosted.org/packages/ab/08/b93ed99661cf2c34c986c8cf487a220f3818094febe5f69b0b3efc65c950/Capella-1.0.3.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}