{
  "info": {
    "author": "",
    "author_email": "Ben Vincent <ben.vincent@pymc-labs.io>",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "# CausalPy\n\n![Build](https://github.com/pymc-labs/CausalPy/workflows/ci/badge.svg)\n[![Code style: black](https://img.shields.io/badge/code%20style-black-000000.svg)](https://github.com/psf/black)\n[![PyPI version](https://badge.fury.io/py/CausalPy.svg)](https://badge.fury.io/py/CausalPy)\n![GitHub Repo stars](https://img.shields.io/github/stars/pymc-labs/causalpy?style=social)\n![Read the Docs](https://img.shields.io/readthedocs/causalpy)\n![PyPI - Downloads](https://img.shields.io/pypi/dm/causalpy)\n![Interrogate](img/interrogate_badge.svg)\n\nA Python package focussing on causal inference in quasi-experimental settings. The package allows for sophisticated Bayesian model fitting methods to be used in addition to traditional OLS.\n\n_**STATUS:** Feel free to explore and experiment with the repository, and we very much welcome feedback (via [Issues](https://github.com/pymc-labs/CausalPy/issues)). But be aware that this code is very alpha! Expect the codebase and API to change for a while, so it is not appropriate to rely on this package for in-production or research pipelines._\n\n## Comparison to related packages\n\nRather than focussing on one particular quasi-experimental setting, this package aims to have broad applicability.\n\nAnother distinctive feature of this package is the ability to use different models. Currently, users can fit with `scikit-learn` models or Bayesian models with `PyMC`.\n\n|                           | [CausalImpact](https://google.github.io/CausalImpact/) from Google | [GeoLift](https://github.com/facebookincubator/GeoLift/) from Meta | CausalPy from [PyMC Labs](https://www.pymc-labs.io) |\n|---------------------------|--------------------------------|---------|----------------------------------------|\n| Synthetic control         | ✅                              | ✅       | ✅                                      |\n| Regression discontinuity  | ❌                              | ❌       | ✅                                      |\n| Difference in differences | ❌                              | ❌       | ✅                                      |\n| Language                  | R (but see [tfcausalimpact](https://github.com/WillianFuks/tfcausalimpact))  | R       | Python                                 |\n| Models                    | Bayesian structural timeseries | Augmented synthetic control      | Flexible: Traditional OLS and Bayesian models |\n\n## Installation\n\nTo get the latest release:\n```bash\npip install CausalPy\n```\n\nAlternatively, if you want the very latest version of the package you can install from GitHub:\n\n```bash\npip install git+https://github.com/pymc-labs/CausalPy.git\n```\n\n## Quickstart\n\n```python\nimport causalpy as cp\n\n\n# Import and process data\ndf = (\n    cp.load_data(\"drinking\")\n    .rename(columns={\"agecell\": \"age\"})\n    .assign(treated=lambda df_: df_.age > 21)\n    )\n\n# Run the analysis\nresult = cp.pymc_experiments.RegressionDiscontinuity(\n    df,\n    formula=\"all ~ 1 + age + treated\",\n    running_variable_name=\"age\",\n    model=cp.pymc_models.LinearRegression(),\n    treatment_threshold=21,\n    )\n\n# Visualize outputs\nfig, ax = result.plot();\n\n# Get a results summary\nresult.summary()\n```\n\n## Roadmap\n\nPlans for the repository can be seen in the [Issues](https://github.com/pymc-labs/CausalPy/issues).\n\n## Overview of package capabilities\n\n### Synthetic control\nThis is appropriate when you have multiple units, one of which is treated. You build a synthetic control as a weighted combination of the untreated units.\n\n| Time | Outcome   | Control 1 | Control 2 | Control 3 |\n|------|-----------|-----------|-----------|-----------|\n| 0    | $y_0$ | $x_{1,0}$ | $x_{2,0}$ | $x_{3,0}$ |\n| 1    | $y_1$ | $x_{1,1}$ | $x_{2,1}$ | $x_{3,1}$ |\n|$\\ldots$ | $\\ldots$  | $\\ldots$  | $\\ldots$  | $\\ldots$  |\n| T    | $y_T$ | $x_{1,T}$ | $x_{2,T}$ | $x_{3,T}$ |\n\n\n| Frequentist | Bayesian |\n|--|--|\n| ![](img/synthetic_control_skl.svg) | ![](img/synthetic_control_pymc.svg) |\n\n> The data (treated and untreated units), pre-treatment model fit, and counterfactual (i.e. the synthetic control) are plotted (top). The causal impact is shown as a blue shaded region. The Bayesian analysis shows shaded Bayesian credible regions of the model fit and counterfactual. Also shown is the causal impact (middle) and cumulative causal impact (bottom).\n\n### Geographical lift (Geolift)\nWe can also use synthetic control methods to analyse data from geographical lift studies. For example, we can try to evaluate the causal impact of an intervention (e.g. a marketing campaign) run in one geographical area by using control geographical areas which are similar to the intervention area but which did not recieve the specific marketing intervention.\n\n### ANCOVA\n\nThis is appropriate for non-equivalent group designs when you have a single pre and post intervention measurement and have a treament and a control group.\n\n| Group | pre | post |\n|------|---|-------|\n| 0    | $x_1$ | $y_1$ |\n| 0    | $x_2$ | $y_2$ |\n| 1    | $x_3$ | $y_3$ |\n| 1    | $x_4$ | $y_4$ |\n\n| Frequentist | Bayesian |\n|--|--|\n| coming soon | ![](img/anova_pymc.svg) |\n\n> The data from the control and treatment group are plotted, along with posterior predictive 94% credible intervals. The lower panel shows the estimated treatment effect.\n\n### Difference in Differences\n\nThis is appropriate for non-equivalent group designs when you have pre and post intervention measurement and have a treament and a control group. Unlike the ANCOVA approach, difference in differences is appropriate when there are multiple pre and/or post treatment measurements.\n\nData is expected to be in the following form. Shown are just two units - one in the treated group (`group=1`) and one in the untreated group (`group=0`), but there can of course be multiple units per group. This is panel data (also known as repeated measures) where each unit is measured at 2 time points.\n\n| Unit | Time | Group | Outcome         |\n|------|---|-------|-----------|\n| 0    | 0 | 0     | $y_{0,0}$ |\n| 0    | 1 | 0     | $y_{0,0}$ |\n| 1    | 0 | 1     | $y_{1,0}$ |\n| 1    | 1 | 1     | $y_{1,1}$ |\n\n| Frequentist | Bayesian |\n|--|--|\n| ![](img/difference_in_differences_skl.svg) | ![](img/difference_in_differences_pymc.svg) |\n\n>The data, model fit, and counterfactual are plotted. Frequentist model fits result in points estimates, but the Bayesian analysis results in posterior distributions, represented by the violin plots. The causal impact is the difference between the counterfactual prediction (treated group, post treatment) and the observed values for the treated group, post treatment.\n\n### Regression discontinuity designs\n\nRegression discontinuity designs are used when treatment is applied to units according to a cutoff on the running variable (e.g. $x$) which is typically _not_ time. By looking for the presence of a discontinuity at the precise point of the treatment cutoff then we can make causal claims about the potential impact of the treatment.\n\n| Running variable | Outcome | Treated  |\n|-----------|-----------|----------|\n| $x_0$     | $y_0$     | False    |\n| $x_1$     | $y_0$     | False    |\n| $\\ldots$  | $\\ldots$  | $\\ldots$ |\n| $x_{N-1}$ | $y_{N-1}$ | True     |\n| $x_N$     | $y_N$     | True     |\n\n\n| Frequentist | Bayesian |\n|--|--|\n| ![](img/regression_discontinuity_skl.svg) | ![](img/regression_discontinuity_pymc.svg) |\n\n> The data, model fit, and counterfactual are plotted (top). Frequentist analysis shows the causal impact with the blue shaded region, but this is not shown in the Bayesian analysis to avoid a cluttered chart. Instead, the Bayesian analysis shows shaded Bayesian credible regions of the model fits. The Frequentist analysis visualises the point estimate of the causal impact, but the Bayesian analysis also plots the posterior distribution of the regression discontinuity effect (bottom).\n\n## Learning resources\n\nHere are some general resources about causal inference:\n\n* The official [PyMC examples gallery](https://www.pymc.io/projects/examples/en/latest/gallery.html) has a set of examples specifically relating to causal inference.\n* Angrist, J. D., & Pischke, J. S. (2009). Mostly harmless econometrics: An empiricist's companion. Princeton university press.\n* Angrist, J. D., & Pischke, J. S. (2014). Mastering'metrics: The path from cause to effect. Princeton university press.\n* Cunningham, S. (2021). [Causal inference: The Mixtape](https://mixtape.scunning.com). Yale University Press.\n* Huntington-Klein, N. (2021). [The effect: An introduction to research design and causality](https://theeffectbook.net). Chapman and Hall/CRC.\n* Reichardt, C. S. (2019). Quasi-experimentation: A guide to design and analysis. Guilford Publications.\n\n## License\n\n[Apache License 2.0](LICENSE)\n\n---\n\n## Support\n\n<img src=\"img/pymc-labs-log.png\" align=\"right\" width=\"50%\" />\n\nThis repository is supported by [PyMC Labs](https://www.pymc-labs.io).\n\nIf you are interested in seeing what PyMC Labs can do for you, then please email [ben.vincent@pymc-labs.io](mailto:ben.vincent@pymc-labs.io). We work with companies at a variety of scales and with varying levels of existing modeling capacity. We also run corporate workshop training events and can provide sessions ranging from introduction to Bayes to more advanced topics.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "",
    "license": "Apache License Version 2.0, January 2004 http://www.apache.org/licenses/  TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION  1. Definitions.  \"License\" shall mean the terms and conditions for use, reproduction, and distribution as defined by Sections 1 through 9 of this document.  \"Licensor\" shall mean the copyright owner or entity authorized by the copyright owner that is granting the License.  \"Legal Entity\" shall mean the union of the acting entity and all other entities that control, are controlled by, or are under common control with that entity. For the purposes of this definition, \"control\" means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity.  \"You\" (or \"Your\") shall mean an individual or Legal Entity exercising permissions granted by this License.  \"Source\" form shall mean the preferred form for making modifications, including but not limited to software source code, documentation source, and configuration files.  \"Object\" form shall mean any form resulting from mechanical transformation or translation of a Source form, including but not limited to compiled object code, generated documentation, and conversions to other media types.  \"Work\" shall mean the work of authorship, whether in Source or Object form, made available under the License, as indicated by a copyright notice that is included in or attached to the work (an example is provided in the Appendix below).  \"Derivative Works\" shall mean any work, whether in Source or Object form, that is based on (or derived from) the Work and for which the editorial revisions, annotations, elaborations, or other modifications represent, as a whole, an original work of authorship. For the purposes of this License, Derivative Works shall not include works that remain separable from, or merely link (or bind by name) to the interfaces of, the Work and Derivative Works thereof.  \"Contribution\" shall mean any work of authorship, including the original version of the Work and any modifications or additions to that Work or Derivative Works thereof, that is intentionally submitted to Licensor for inclusion in the Work by the copyright owner or by an individual or Legal Entity authorized to submit on behalf of the copyright owner. For the purposes of this definition, \"submitted\" means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Work, but excluding communication that is conspicuously marked or otherwise designated in writing by the copyright owner as \"Not a Contribution.\"  \"Contributor\" shall mean Licensor and any individual or Legal Entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Work.  2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare Derivative Works of, publicly display, publicly perform, sublicense, and distribute the Work and such Derivative Works in Source or Object form.  3. Grant of Patent License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this section) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Work, where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Work to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Work or a Contribution incorporated within the Work constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for that Work shall terminate as of the date such litigation is filed.  4. Redistribution. You may reproduce and distribute copies of the Work or Derivative Works thereof in any medium, with or without modifications, and in Source or Object form, provided that You meet the following conditions:  (a) You must give any other recipients of the Work or Derivative Works a copy of this License; and  (b) You must cause any modified files to carry prominent notices stating that You changed the files; and  (c) You must retain, in the Source form of any Derivative Works that You distribute, all copyright, patent, trademark, and attribution notices from the Source form of the Work, excluding those notices that do not pertain to any part of the Derivative Works; and  (d) If the Work includes a \"NOTICE\" text file as part of its distribution, then any Derivative Works that You distribute must include a readable copy of the attribution notices contained within such NOTICE file, excluding those notices that do not pertain to any part of the Derivative Works, in at least one of the following places: within a NOTICE text file distributed as part of the Derivative Works; within the Source form or documentation, if provided along with the Derivative Works; or, within a display generated by the Derivative Works, if and wherever such third-party notices normally appear. The contents of the NOTICE file are for informational purposes only and do not modify the License. You may add Your own attribution notices within Derivative Works that You distribute, alongside or as an addendum to the NOTICE text from the Work, provided that such additional attribution notices cannot be construed as modifying the License.  You may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions for use, reproduction, or distribution of Your modifications, or for any such Derivative Works as a whole, provided Your use, reproduction, and distribution of the Work otherwise complies with the conditions stated in this License.  5. Submission of Contributions. Unless You explicitly state otherwise, any Contribution intentionally submitted for inclusion in the Work by You to the Licensor shall be under the terms and conditions of this License, without any additional terms or conditions. Notwithstanding the above, nothing herein shall supersede or modify the terms of any separate license agreement you may have executed with Licensor regarding such Contributions.  6. Trademarks. This License does not grant permission to use the trade names, trademarks, service marks, or product names of the Licensor, except as required for reasonable and customary use in describing the origin of the Work and reproducing the content of the NOTICE file.  7. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Work (and each Contributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Work and assume any risks associated with Your exercise of permissions under this License.  8. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Work (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages.  9. Accepting Warranty or Additional Liability. While redistributing the Work or Derivative Works thereof, You may choose to offer, and charge a fee for, acceptance of support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability.  END OF TERMS AND CONDITIONS  APPENDIX: How to apply the Apache License to your work.  To apply the Apache License to your work, attach the following boilerplate notice, with the fields enclosed by brackets \"[]\" replaced with your own identifying information. (Don't include the brackets!)  The text should be enclosed in the appropriate comment syntax for the file format. We also recommend that a file or class name and description of purpose be included on the same \"printed page\" as the copyright notice for easier identification within third-party archives.  Copyright [yyyy] [name of copyright owner]  Licensed under the Apache License, Version 2.0 (the \"License\"); you may not use this file except in compliance with the License. You may obtain a copy of the License at  http://www.apache.org/licenses/LICENSE-2.0  Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License. ",
    "maintainer": "",
    "maintainer_email": "",
    "name": "CausalPy",
    "package_url": "https://pypi.org/project/CausalPy/",
    "platform": null,
    "project_url": "https://pypi.org/project/CausalPy/",
    "project_urls": {
      "Bug Reports": "https://github.com/pymc-labs/CausalPy/issues",
      "Homepage": "https://github.com/pymc-labs/CausalPy",
      "Source": "https://github.com/pymc-labs/CausalPy"
    },
    "release_url": "https://pypi.org/project/CausalPy/0.0.10/",
    "requires_dist": [
      "arviz (>=0.14.0)",
      "graphviz",
      "ipython (!=8.7.0)",
      "matplotlib (>=3.5.3)",
      "numpy",
      "pandas",
      "patsy",
      "pymc (>=5.0.0)",
      "scikit-learn (>=1)",
      "scipy",
      "seaborn (>=0.11.2)",
      "xarray (>=v2022.11.0)",
      "pathlib ; extra == 'dev'",
      "pre-commit ; extra == 'dev'",
      "twine ; extra == 'dev'",
      "interrogate ; extra == 'dev'",
      "ipykernel ; extra == 'docs'",
      "linkify-it-py ; extra == 'docs'",
      "myst-parser ; extra == 'docs'",
      "nbsphinx ; extra == 'docs'",
      "pathlib ; extra == 'docs'",
      "sphinx ; extra == 'docs'",
      "sphinx-autodoc-typehints ; extra == 'docs'",
      "sphinx-design ; extra == 'docs'",
      "sphinx-rtd-theme ; extra == 'docs'",
      "statsmodels ; extra == 'docs'",
      "black ; extra == 'lint'",
      "flake8 ; extra == 'lint'",
      "interrogate ; extra == 'lint'",
      "isort ; extra == 'lint'",
      "nbqa ; extra == 'lint'",
      "pre-commit ; extra == 'lint'",
      "pytest ; extra == 'test'",
      "pytest-cov ; extra == 'test'"
    ],
    "requires_python": ">=3.8",
    "summary": "Causal inference for quasi-experiments in Python",
    "version": "0.0.10",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16334200,
  "releases": {
    "0.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "28a35f3591ae105e5cef08d7b6daa36f6271844fe52e36361f3d645df6bdfafb",
          "md5": "d2f063096e72b274d9ad5b69365dcbe8",
          "sha256": "d22c5f8223ddaa6daea8ee9d3e26487437a203f0813d1901d06333736a1d68a9"
        },
        "downloads": -1,
        "filename": "CausalPy-0.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "d2f063096e72b274d9ad5b69365dcbe8",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 13842,
        "upload_time": "2022-11-01T13:59:46",
        "upload_time_iso_8601": "2022-11-01T13:59:46.311075Z",
        "url": "https://files.pythonhosted.org/packages/28/a3/5f3591ae105e5cef08d7b6daa36f6271844fe52e36361f3d645df6bdfafb/CausalPy-0.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.10": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "949c420f62452c1c04b89fd5963acd37cd9fb580f612b4f37563571baedd72dc",
          "md5": "738973dd23cc03b96fa0e562dc53db21",
          "sha256": "af1b6bcd6f3b07ced6a7c567a29dd4b7b0135e05148bc876969791cffbce4452"
        },
        "downloads": -1,
        "filename": "CausalPy-0.0.10-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "738973dd23cc03b96fa0e562dc53db21",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 91757,
        "upload_time": "2023-01-06T19:13:15",
        "upload_time_iso_8601": "2023-01-06T19:13:15.499837Z",
        "url": "https://files.pythonhosted.org/packages/94/9c/420f62452c1c04b89fd5963acd37cd9fb580f612b4f37563571baedd72dc/CausalPy-0.0.10-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ac7d30bead7424feb91612ca87f7596eca168c718b57bff16c687c070a5f937c",
          "md5": "da5d519771f8379ecd358091bea3a0e3",
          "sha256": "dd9cbfa6c1adc87a681a9c04540f3aef08af7fa93627ed08f7110cb36fccdc7f"
        },
        "downloads": -1,
        "filename": "CausalPy-0.0.10.tar.gz",
        "has_sig": false,
        "md5_digest": "da5d519771f8379ecd358091bea3a0e3",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 94592,
        "upload_time": "2023-01-06T19:13:17",
        "upload_time_iso_8601": "2023-01-06T19:13:17.913408Z",
        "url": "https://files.pythonhosted.org/packages/ac/7d/30bead7424feb91612ca87f7596eca168c718b57bff16c687c070a5f937c/CausalPy-0.0.10.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.10b0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "69738078b6482876fd8ee8e656ea6d20feea137cd73d48187ef9901089ca926b",
          "md5": "bb2ba5ba742f750ae63e869355785ed3",
          "sha256": "0f96a835531baa6c44930fd298c1ba6a238925df812463ebd0e6fc24682a1fcb"
        },
        "downloads": -1,
        "filename": "CausalPy-0.0.10b0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "bb2ba5ba742f750ae63e869355785ed3",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 91780,
        "upload_time": "2023-01-06T19:31:19",
        "upload_time_iso_8601": "2023-01-06T19:31:19.496171Z",
        "url": "https://files.pythonhosted.org/packages/69/73/8078b6482876fd8ee8e656ea6d20feea137cd73d48187ef9901089ca926b/CausalPy-0.0.10b0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "eeed877794cd2159317df86bc1eb78a6343b1228ad0df43ddfbb3930b590c1d3",
          "md5": "a2345a8469ec7012ab2ec76738b11795",
          "sha256": "b9b1cfc9e5ae957d0607d3ca9acfff62bd168267091356c5c1d4357f926b4234"
        },
        "downloads": -1,
        "filename": "CausalPy-0.0.10b0.tar.gz",
        "has_sig": false,
        "md5_digest": "a2345a8469ec7012ab2ec76738b11795",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 94428,
        "upload_time": "2023-01-06T19:31:21",
        "upload_time_iso_8601": "2023-01-06T19:31:21.991371Z",
        "url": "https://files.pythonhosted.org/packages/ee/ed/877794cd2159317df86bc1eb78a6343b1228ad0df43ddfbb3930b590c1d3/CausalPy-0.0.10b0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a17f749201501fd5ce1c39847c3e803caa31ab3e0a3c7c5beb3800472f98ef23",
          "md5": "02fc1766311c0f8a0aa5381880add2ee",
          "sha256": "a65afd91e50006f0775b4252a14f9c7a92c1e271aedac7f4b6466c69ed48fecb"
        },
        "downloads": -1,
        "filename": "CausalPy-0.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "02fc1766311c0f8a0aa5381880add2ee",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 14095,
        "upload_time": "2022-11-01T14:05:41",
        "upload_time_iso_8601": "2022-11-01T14:05:41.194107Z",
        "url": "https://files.pythonhosted.org/packages/a1/7f/749201501fd5ce1c39847c3e803caa31ab3e0a3c7c5beb3800472f98ef23/CausalPy-0.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "22353ae21f265760ad7a5a8df057d6b50da6b5270d116d11c24b13b3c49f4b21",
          "md5": "9c3907d86005f4f2faed9627663d452c",
          "sha256": "ee01be75bf83e5c24de975c5df799637a4f529c684bf214a60c577e692ce9cd7"
        },
        "downloads": -1,
        "filename": "CausalPy-0.0.3.tar.gz",
        "has_sig": false,
        "md5_digest": "9c3907d86005f4f2faed9627663d452c",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 55081,
        "upload_time": "2022-11-23T17:32:39",
        "upload_time_iso_8601": "2022-11-23T17:32:39.289193Z",
        "url": "https://files.pythonhosted.org/packages/22/35/3ae21f265760ad7a5a8df057d6b50da6b5270d116d11c24b13b3c49f4b21/CausalPy-0.0.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.3b0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "db40643c567fc08e922bb4e4237fb8a5cb61e68dccc6cad9db2b957879c16057",
          "md5": "f739a98411b57d7296f015d09356ac56",
          "sha256": "a2e443c8031db31bd7ec0fa1e8423edc89d8163a4291706ef46dcbfd2382b824"
        },
        "downloads": -1,
        "filename": "CausalPy-0.0.3b0.tar.gz",
        "has_sig": false,
        "md5_digest": "f739a98411b57d7296f015d09356ac56",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 55245,
        "upload_time": "2022-11-23T23:58:31",
        "upload_time_iso_8601": "2022-11-23T23:58:31.772008Z",
        "url": "https://files.pythonhosted.org/packages/db/40/643c567fc08e922bb4e4237fb8a5cb61e68dccc6cad9db2b957879c16057/CausalPy-0.0.3b0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3ecb48e8deb0abdcc097b6fb501089fc83f9e6498f9205fb444e68978001d80c",
          "md5": "599f54154df5a94f694c11db6dcc0d96",
          "sha256": "299cf2966d2697ad864f5d8db218ee43db3c0f6bff1f06e7e8cc194bf7c20237"
        },
        "downloads": -1,
        "filename": "CausalPy-0.0.4.tar.gz",
        "has_sig": false,
        "md5_digest": "599f54154df5a94f694c11db6dcc0d96",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 55256,
        "upload_time": "2022-11-24T00:18:13",
        "upload_time_iso_8601": "2022-11-24T00:18:13.734207Z",
        "url": "https://files.pythonhosted.org/packages/3e/cb/48e8deb0abdcc097b6fb501089fc83f9e6498f9205fb444e68978001d80c/CausalPy-0.0.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3bf221a6da05864ed657027db1596b96789e0a0f9336529f2da2c9fa2e2061aa",
          "md5": "25752964352136b788e6ef10bd2e8ea1",
          "sha256": "a48665af4a2239f3da17a3e4b13cedd382913663cdf0bbed4727cd6bc7453f17"
        },
        "downloads": -1,
        "filename": "CausalPy-0.0.5.tar.gz",
        "has_sig": false,
        "md5_digest": "25752964352136b788e6ef10bd2e8ea1",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 61615,
        "upload_time": "2022-12-01T15:44:59",
        "upload_time_iso_8601": "2022-12-01T15:44:59.646810Z",
        "url": "https://files.pythonhosted.org/packages/3b/f2/21a6da05864ed657027db1596b96789e0a0f9336529f2da2c9fa2e2061aa/CausalPy-0.0.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0170e84afd9ec374c0169b428a3a011e3cc1d4a3ebd256a7203cf72d43dc9d60",
          "md5": "d450622560992eb78125bde7f30c6f03",
          "sha256": "6fd0d9f98ec573b791d80d4ac54382868b07a326d6f64772a0c837ba61dfac41"
        },
        "downloads": -1,
        "filename": "CausalPy-0.0.6.tar.gz",
        "has_sig": false,
        "md5_digest": "d450622560992eb78125bde7f30c6f03",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 61600,
        "upload_time": "2022-12-01T16:41:39",
        "upload_time_iso_8601": "2022-12-01T16:41:39.049802Z",
        "url": "https://files.pythonhosted.org/packages/01/70/e84afd9ec374c0169b428a3a011e3cc1d4a3ebd256a7203cf72d43dc9d60/CausalPy-0.0.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.7": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1247c1331ad3096a630df223315c60d6dffb6c046c632afa32c0208da103222c",
          "md5": "e34eef37b4853abde28316b26e512c08",
          "sha256": "8bea895f499987ae1aff910a9160bd4b90458a508a29220ab699ef8e67bcc70e"
        },
        "downloads": -1,
        "filename": "CausalPy-0.0.7.tar.gz",
        "has_sig": false,
        "md5_digest": "e34eef37b4853abde28316b26e512c08",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 89439,
        "upload_time": "2022-12-22T16:54:03",
        "upload_time_iso_8601": "2022-12-22T16:54:03.107692Z",
        "url": "https://files.pythonhosted.org/packages/12/47/c1331ad3096a630df223315c60d6dffb6c046c632afa32c0208da103222c/CausalPy-0.0.7.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.8": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "58a15ef70803ec1f2b3929956ef61756ade2bbfb64bea47c4cbfb590f34adcf1",
          "md5": "b59973cf2d273e1bfb3efb333ec83877",
          "sha256": "7b84cfa039a82569e58af3098cbdd7179c672f81d90f3a640014d98042f0f181"
        },
        "downloads": -1,
        "filename": "CausalPy-0.0.8.tar.gz",
        "has_sig": false,
        "md5_digest": "b59973cf2d273e1bfb3efb333ec83877",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 90016,
        "upload_time": "2023-01-04T14:17:17",
        "upload_time_iso_8601": "2023-01-04T14:17:17.433759Z",
        "url": "https://files.pythonhosted.org/packages/58/a1/5ef70803ec1f2b3929956ef61756ade2bbfb64bea47c4cbfb590f34adcf1/CausalPy-0.0.8.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.9": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ad4e44a6554d1516e44e7307c532ab52f046be22879de63b9fc058f788d93279",
          "md5": "cb67be34b12e67c4408a1abc805a177c",
          "sha256": "8f849317b164e54c359a5a09dd414824660db6c0f921e905f0e9de7ced13f74c"
        },
        "downloads": -1,
        "filename": "CausalPy-0.0.9.tar.gz",
        "has_sig": false,
        "md5_digest": "cb67be34b12e67c4408a1abc805a177c",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 90553,
        "upload_time": "2023-01-04T19:28:34",
        "upload_time_iso_8601": "2023-01-04T19:28:34.230546Z",
        "url": "https://files.pythonhosted.org/packages/ad/4e/44a6554d1516e44e7307c532ab52f046be22879de63b9fc058f788d93279/CausalPy-0.0.9.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "949c420f62452c1c04b89fd5963acd37cd9fb580f612b4f37563571baedd72dc",
        "md5": "738973dd23cc03b96fa0e562dc53db21",
        "sha256": "af1b6bcd6f3b07ced6a7c567a29dd4b7b0135e05148bc876969791cffbce4452"
      },
      "downloads": -1,
      "filename": "CausalPy-0.0.10-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "738973dd23cc03b96fa0e562dc53db21",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.8",
      "size": 91757,
      "upload_time": "2023-01-06T19:13:15",
      "upload_time_iso_8601": "2023-01-06T19:13:15.499837Z",
      "url": "https://files.pythonhosted.org/packages/94/9c/420f62452c1c04b89fd5963acd37cd9fb580f612b4f37563571baedd72dc/CausalPy-0.0.10-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "ac7d30bead7424feb91612ca87f7596eca168c718b57bff16c687c070a5f937c",
        "md5": "da5d519771f8379ecd358091bea3a0e3",
        "sha256": "dd9cbfa6c1adc87a681a9c04540f3aef08af7fa93627ed08f7110cb36fccdc7f"
      },
      "downloads": -1,
      "filename": "CausalPy-0.0.10.tar.gz",
      "has_sig": false,
      "md5_digest": "da5d519771f8379ecd358091bea3a0e3",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.8",
      "size": 94592,
      "upload_time": "2023-01-06T19:13:17",
      "upload_time_iso_8601": "2023-01-06T19:13:17.913408Z",
      "url": "https://files.pythonhosted.org/packages/ac/7d/30bead7424feb91612ca87f7596eca168c718b57bff16c687c070a5f937c/CausalPy-0.0.10.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}