{
  "info": {
    "author": "",
    "author_email": "Kyle Hofmann <kyle.hofmann@gmail.com>",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "Intended Audience :: Science/Research",
      "License :: CC0 1.0 Universal (CC0 1.0) Public Domain Dedication",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3",
      "Topic :: Multimedia :: Graphics",
      "Topic :: Scientific/Engineering :: Visualization"
    ],
    "description": "Chromophile color maps\n======================\n\nThe Chromophile color maps are designed for the accurate display\nof quantitative data.  This package contains the Chromophile\ncolor maps in both `Matplotlib <https://matplotlib.org/>`_ and\n`Bokeh <https://bokeh.org/>`_ formats.\n\nInstallation\n------------\n\nThe Chromophile color maps are distributed as a Python package.\nTo install it, open a terminal and execute:\n\n   pip install chromophile\n\nOr, in IPython or Jupyter, use the `%pip` magic command:\n\n   %pip install chromophile\n\nThe `chromophile` package has no required dependencies.  To use\nthe Chromophile color maps with Matplotlib, the `matplotlib`\npackage must be available at the time `chromophile` is imported.\n\nThe tools used to develop the Chromophile color maps, and the\nsource for the online documentation, are in a separate package\ncalled `chromophile-dev`.  Most users will not need this package.\n\nUsage\n-----\n\nTo use the color maps, import the Chromophile package:\n\n>>> import chromophile as cp\n\nThe Chromophile color maps are stored in two formats:\n\n* Matplotlib `Colormap` objects are stored in `cmap`.  If\n  Matplotlib is not available, `cmap` will equal `None`.  The\n  color maps are also added to Matplotlib's color map registry.\n\n* Bokeh palettes are stored in `palette`.\n\nIndividual color maps can be accessed either as dictionary items\nor as attributes of these objects.  For example:\n\n>>> cp.cmap.cp_dawn\n<matplotlib.colors.ListedColormap object at ...>\n>>> cp.palette['cp_peacock']\n('#06003c', '#06013d', '#06023e', '#07043e', ...)\n\nThe same color map is returned regardless of how it is accessed:\n\n>>> cp.cmap.cp_lemon_lime is cp.cmap['cp_lemon_lime']\nTrue\n>>> cp.palette.cp_blue is cp.palette['cp_blue']\nTrue\n\nMost IDEs should support tab completion for `cmap` and `palette`.\n\nThe available color maps can be listed using the `.keys()` method\nof `cmap` or `palette` or by calling `dir()` on either of these\nobjects.  They are also displayed in the online documentation.\n",
    "description_content_type": "text/x-rst",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "",
    "license": "Creative Commons Legal Code  CC0 1.0 Universal  CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE LEGAL SERVICES. DISTRIBUTION OF THIS DOCUMENT DOES NOT CREATE AN ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS INFORMATION ON AN \"AS-IS\" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES REGARDING THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS PROVIDED HEREUNDER, AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS PROVIDED HEREUNDER.  Statement of Purpose  The laws of most jurisdictions throughout the world automatically confer exclusive Copyright and Related Rights (defined below) upon the creator and subsequent owner(s) (each and all, an \"owner\") of an original work of authorship and/or a database (each, a \"Work\").  Certain owners wish to permanently relinquish those rights to a Work for the purpose of contributing to a commons of creative, cultural and scientific works (\"Commons\") that the public can reliably and without fear of later claims of infringement build upon, modify, incorporate in other works, reuse and redistribute as freely as possible in any form whatsoever and for any purposes, including without limitation commercial purposes. These owners may contribute to the Commons to promote the ideal of a free culture and the further production of creative, cultural and scientific works, or to gain reputation or greater distribution for their Work in part through the use and efforts of others.  For these and/or other purposes and motivations, and without any expectation of additional consideration or compensation, the person associating CC0 with a Work (the \"Affirmer\"), to the extent that he or she is an owner of Copyright and Related Rights in the Work, voluntarily elects to apply CC0 to the Work and publicly distribute the Work under its terms, with knowledge of his or her Copyright and Related Rights in the Work and the meaning and intended legal effect of CC0 on those rights.  1. Copyright and Related Rights. A Work made available under CC0 may be protected by copyright and related or neighboring rights (\"Copyright and Related Rights\"). Copyright and Related Rights include, but are not limited to, the following:  i. the right to reproduce, adapt, distribute, perform, display, communicate, and translate a Work; ii. moral rights retained by the original author(s) and/or performer(s); iii. publicity and privacy rights pertaining to a person's image or likeness depicted in a Work; iv. rights protecting against unfair competition in regards to a Work, subject to the limitations in paragraph 4(a), below; v. rights protecting the extraction, dissemination, use and reuse of data in a Work; vi. database rights (such as those arising under Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, and under any national implementation thereof, including any amended or successor version of such directive); and vii. other similar, equivalent or corresponding rights throughout the world based on applicable law or treaty, and any national implementations thereof.  2. Waiver. To the greatest extent permitted by, but not in contravention of, applicable law, Affirmer hereby overtly, fully, permanently, irrevocably and unconditionally waives, abandons, and surrenders all of Affirmer's Copyright and Related Rights and associated claims and causes of action, whether now known or unknown (including existing as well as future claims and causes of action), in the Work (i) in all territories worldwide, (ii) for the maximum duration provided by applicable law or treaty (including future time extensions), (iii) in any current or future medium and for any number of copies, and (iv) for any purpose whatsoever, including without limitation commercial, advertising or promotional purposes (the \"Waiver\"). Affirmer makes the Waiver for the benefit of each member of the public at large and to the detriment of Affirmer's heirs and successors, fully intending that such Waiver shall not be subject to revocation, rescission, cancellation, termination, or any other legal or equitable action to disrupt the quiet enjoyment of the Work by the public as contemplated by Affirmer's express Statement of Purpose.  3. Public License Fallback. Should any part of the Waiver for any reason be judged legally invalid or ineffective under applicable law, then the Waiver shall be preserved to the maximum extent permitted taking into account Affirmer's express Statement of Purpose. In addition, to the extent the Waiver is so judged Affirmer hereby grants to each affected person a royalty-free, non transferable, non sublicensable, non exclusive, irrevocable and unconditional license to exercise Affirmer's Copyright and Related Rights in the Work (i) in all territories worldwide, (ii) for the maximum duration provided by applicable law or treaty (including future time extensions), (iii) in any current or future medium and for any number of copies, and (iv) for any purpose whatsoever, including without limitation commercial, advertising or promotional purposes (the \"License\"). The License shall be deemed effective as of the date CC0 was applied by Affirmer to the Work. Should any part of the License for any reason be judged legally invalid or ineffective under applicable law, such partial invalidity or ineffectiveness shall not invalidate the remainder of the License, and in such case Affirmer hereby affirms that he or she will not (i) exercise any of his or her remaining Copyright and Related Rights in the Work or (ii) assert any associated claims and causes of action with respect to the Work, in either case contrary to Affirmer's express Statement of Purpose.  4. Limitations and Disclaimers.  a. No trademark or patent rights held by Affirmer are waived, abandoned, surrendered, licensed or otherwise affected by this document. b. Affirmer offers the Work as-is and makes no representations or warranties of any kind concerning the Work, express, implied, statutory or otherwise, including without limitation warranties of title, merchantability, fitness for a particular purpose, non infringement, or the absence of latent or other defects, accuracy, or the present or absence of errors, whether or not discoverable, all to the greatest extent permissible under applicable law. c. Affirmer disclaims responsibility for clearing rights of other persons that may apply to the Work or any use thereof, including without limitation any person's Copyright and Related Rights in the Work. Further, Affirmer disclaims responsibility for obtaining any necessary consents, permissions or other rights required for any use of the Work. d. Affirmer understands and acknowledges that Creative Commons is not a party to this document and has no duty or obligation with respect to this CC0 or use of the Work. ",
    "maintainer": "",
    "maintainer_email": "",
    "name": "chromophile",
    "package_url": "https://pypi.org/project/chromophile/",
    "platform": null,
    "project_url": "https://pypi.org/project/chromophile/",
    "project_urls": {
      "Bug Tracker": "https://github.com/kylehofmann/chromophile_dev/issues",
      "Homepage": "https://github.com/kylehofmann/chromophile_dev"
    },
    "release_url": "https://pypi.org/project/chromophile/1.0.1/",
    "requires_dist": null,
    "requires_python": ">=3.7",
    "summary": "Color maps for continuous quantitative data",
    "version": "1.0.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16264772,
  "releases": {
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "45692a729976a0d250d856a0a79253c5724c5c7f7610095fb3d77d525d0e3822",
          "md5": "d39d13ba06792393e7611da4ab016d36",
          "sha256": "0997ba1096d1c3c3efb7d83ace182455c3246b0912bf052d38bdbba9417398bd"
        },
        "downloads": -1,
        "filename": "chromophile-1.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "d39d13ba06792393e7611da4ab016d36",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 50143,
        "upload_time": "2022-12-27T05:59:37",
        "upload_time_iso_8601": "2022-12-27T05:59:37.461444Z",
        "url": "https://files.pythonhosted.org/packages/45/69/2a729976a0d250d856a0a79253c5724c5c7f7610095fb3d77d525d0e3822/chromophile-1.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "93e6e51932c1f78b2f60601625fc233963828448555378b3f31b887c79550f77",
          "md5": "2b1c505f1994a9f33826d800298624d7",
          "sha256": "0a69b5a826c82972172202037638c2bcef3d995477cd1c5d68316253c043352f"
        },
        "downloads": -1,
        "filename": "chromophile-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "2b1c505f1994a9f33826d800298624d7",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 53088,
        "upload_time": "2022-12-27T05:59:39",
        "upload_time_iso_8601": "2022-12-27T05:59:39.243530Z",
        "url": "https://files.pythonhosted.org/packages/93/e6/e51932c1f78b2f60601625fc233963828448555378b3f31b887c79550f77/chromophile-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6f8f42b9c24aa91666474541c5a8719312c7cd5bba0490e4a3ce7a7d0ed7d777",
          "md5": "65295f4b0e8fc40e8cb30e1907fde22e",
          "sha256": "cb149bd05a770de60faebdf01c19384f285da2415747583695e300496b5e279f"
        },
        "downloads": -1,
        "filename": "chromophile-1.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "65295f4b0e8fc40e8cb30e1907fde22e",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 50140,
        "upload_time": "2022-12-31T05:16:21",
        "upload_time_iso_8601": "2022-12-31T05:16:21.877807Z",
        "url": "https://files.pythonhosted.org/packages/6f/8f/42b9c24aa91666474541c5a8719312c7cd5bba0490e4a3ce7a7d0ed7d777/chromophile-1.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3b480ee28b3065440e5e3bb3fd3bd47717fdc3de454577dcf9a812bcdb2359bc",
          "md5": "3efd47ba60f48c7beae2af8135db795a",
          "sha256": "5d085ee1074d5229d6d92e18565a392d5c8da3828946e01abcc0c47a06e2bd77"
        },
        "downloads": -1,
        "filename": "chromophile-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "3efd47ba60f48c7beae2af8135db795a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 53095,
        "upload_time": "2022-12-31T05:16:23",
        "upload_time_iso_8601": "2022-12-31T05:16:23.312998Z",
        "url": "https://files.pythonhosted.org/packages/3b/48/0ee28b3065440e5e3bb3fd3bd47717fdc3de454577dcf9a812bcdb2359bc/chromophile-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "6f8f42b9c24aa91666474541c5a8719312c7cd5bba0490e4a3ce7a7d0ed7d777",
        "md5": "65295f4b0e8fc40e8cb30e1907fde22e",
        "sha256": "cb149bd05a770de60faebdf01c19384f285da2415747583695e300496b5e279f"
      },
      "downloads": -1,
      "filename": "chromophile-1.0.1-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "65295f4b0e8fc40e8cb30e1907fde22e",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.7",
      "size": 50140,
      "upload_time": "2022-12-31T05:16:21",
      "upload_time_iso_8601": "2022-12-31T05:16:21.877807Z",
      "url": "https://files.pythonhosted.org/packages/6f/8f/42b9c24aa91666474541c5a8719312c7cd5bba0490e4a3ce7a7d0ed7d777/chromophile-1.0.1-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "3b480ee28b3065440e5e3bb3fd3bd47717fdc3de454577dcf9a812bcdb2359bc",
        "md5": "3efd47ba60f48c7beae2af8135db795a",
        "sha256": "5d085ee1074d5229d6d92e18565a392d5c8da3828946e01abcc0c47a06e2bd77"
      },
      "downloads": -1,
      "filename": "chromophile-1.0.1.tar.gz",
      "has_sig": false,
      "md5_digest": "3efd47ba60f48c7beae2af8135db795a",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7",
      "size": 53095,
      "upload_time": "2022-12-31T05:16:23",
      "upload_time_iso_8601": "2022-12-31T05:16:23.312998Z",
      "url": "https://files.pythonhosted.org/packages/3b/48/0ee28b3065440e5e3bb3fd3bd47717fdc3de454577dcf9a812bcdb2359bc/chromophile-1.0.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}