{
  "info": {
    "author": "Gioele Crispo",
    "author_email": "crispogioele@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "Intended Audience :: Developers",
      "License :: OSI Approved :: MIT License",
      "Programming Language :: Python",
      "Programming Language :: Python :: 2.7",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.10",
      "Programming Language :: Python :: 3.11",
      "Programming Language :: Python :: 3.4",
      "Programming Language :: Python :: 3.5",
      "Programming Language :: Python :: 3.6",
      "Programming Language :: Python :: 3.7",
      "Programming Language :: Python :: 3.8",
      "Programming Language :: Python :: 3.9",
      "Programming Language :: Python :: Implementation :: PyPy",
      "Topic :: Software Development :: Libraries :: Python Modules"
    ],
    "description": "# Chunkipy\n\n![Python 3.5, 3.6, 3.7, 3.8, 3.9, 3.10, 3.11](https://img.shields.io/badge/python-3.5%2C%203.6%2C%203.7%2C%203.8%2C%203.9%2C%203.10%2C%203.11-blue.svg)\n[![PyPI version](https://badge.fury.io/py/chunkipy.svg)](https://badge.fury.io/py/chunkipy)\n\n\n`chunkipy` is an extremely useful tool for segmenting long texts into smaller chunks, \n based on either a character or token count. With customizable chunk sizes and splitting strategies, `chunkipy` provides flexibility and control \n for various text processing tasks.\n\n## Motivation and Features\n`chunkipy` was created to address the need within the field of natural language processing (NLP) \nto chunk text so that it does not exceed the input size of **neural networks** such as BERT, \nbut it could be used for several other use cases.\n\nThe library offers some useful features:\n - **Tokenizer function**: unlike other text chunking libraries, `chunkipy` offers the possibility of\nproviding a tokenizer function, in order to build the chunks taking into account the tokenizer \nthat will use those chunks.\n - **Split text into meaningful sentences**: in its default configuration, `chunkipy`, \nin creating the chunks, avoids cutting sentences, and always tries to have a complete and syntactically correct sentence. \nThis is achieved through the use of the `stanza` library, which utilizes semantic models to cut text \ninto meaningful sentences.\n - **Flexibility in choosing split strategies**: Additionally, `chunkipy` offers complete flexibility \nin choosing how to split, allowing users to define their own text splitting function or choose from a list \nof pre-defined splitting strategies.\n \nBy default, `chunkipy` uses `stanza` are main text splitting method; however, if `stanza` produces \nsentences with a number of tokens greater than the chunk size, other split strategy are used. \nHere the list of predefined strategies, sorted by priority (the first one is executed first, \nif the chunk of text is larger than the chunk size, it is further split using a lower priority \nstrategy).\n\n| Priority | Name | Effect                                                              |\n|:--------:| :--- |:--------------------------------------------------------------------|\n|    0     | `split_by_sentences` | It uses `stanza` to split the text into meaningful sentences.       |\n|    1     | `split_by_semicolon` | It splits the text using the semicolon and space `; ` as separator. |\n|    2     | `split_by_colon` | It splits the text using the colon and space `: ` as separator.     |\n|    3     | `split_by_comma` | It splits the text using the comma and space `, ` as separator.     |\n|    4     | `split_by_word` | It splits the text using the space ` ` as separator.                |\n\n\n\n## Installation\nYou can install `chunkipy` using pip:\n\n```bash\npip install chunkipy\n```\n\n## Usage\nThe main class in `chunkipy` is `TextChunkizer`, which takes a text and splits it into chunks of a given size. \nYou can use the default settings or specify custom parameters for the **chunk size**, \nwhether to split by **characters or tokens**, the **tokenizer function** to use (if `tokens` is set to True`), and the list of **split strategies** to apply. \n\nHere's an example of using it to chunk text that has a number of tokens \ngreater than the input size of BERT:\n\n```python\nfrom chunkipy import TextChunkizer\nfrom transformers import AutoTokenizer  \n\ntext = \"\"\"Napoleon Bonaparte (born Napoleone Buonaparte; 15 August 1769 – 5 May 1821), later known by his regnal name Napoleon I, was a French military commander and political leader who rose to prominence during the French Revolution and led successful campaigns during the Revolutionary Wars. He was the de facto leader of the French Republic as First Consul from 1799 to 1804, then Emperor of the French from 1804 until 1814 and again in 1815. Napoleon's political and cultural legacy endures to this day, as a highly celebrated and controversial leader. He initiated many liberal reforms that have persisted in society, and is considered one of the greatest military commanders in history. His wars and campaigns are studied by militaries all over the world. Between three and six million civilians and soldiers perished in what became known as the Napoleonic Wars.\nNapoleon was born on the island of Corsica, not long after its annexation by France, to a native family descending from minor Italian nobility. He supported the French Revolution in 1789 while serving in the French army, and tried to spread its ideals to his native Corsica. He rose rapidly in the Army after he saved the governing French Directory by firing on royalist insurgents. In 1796, he began a military campaign against the Austrians and their Italian allies, scoring decisive victories and becoming a national hero. Two years later, he led a military expedition to Egypt that served as a springboard to political power. He engineered a coup in November 1799 and became First Consul of the Republic.\nDifferences with the United Kingdom meant France faced the War of the Third Coalition by 1805. Napoleon shattered this coalition with victories in the Ulm campaign, and at the Battle of Austerlitz, which led to the dissolution of the Holy Roman Empire. In 1806, the Fourth Coalition took up arms against him. Napoleon defeated Prussia at the battles of Jena and Auerstedt, marched the Grande Armée into Eastern Europe, and defeated the Russians in June 1807 at Friedland, forcing the defeated nations of the Fourth Coalition to accept the Treaties of Tilsit. Two years later, the Austrians challenged the French again during the War of the Fifth Coalition, but Napoleon solidified his grip over Europe after triumphing at the Battle of Wagram.\nHoping to extend the Continental System, his embargo against Britain, Napoleon invaded the Iberian Peninsula and declared his brother Joseph the King of Spain in 1808. The Spanish and the Portuguese revolted in the Peninsular War aided by a British army, culminating in defeat for Napoleon's marshals. Napoleon launched an invasion of Russia in the summer of 1812. The resulting campaign witnessed the catastrophic retreat of Napoleon's Grande Armée. In 1813, Prussia and Austria joined Russian forces in a Sixth Coalition against France, resulting in a large coalition army defeating Napoleon at the Battle of Leipzig. The coalition invaded France and captured Paris, forcing Napoleon to abdicate in April 1814. He was exiled to the island of Elba, between Corsica and Italy. In France, the Bourbons were restored to power.\"\"\"\n\nbert_tokenizer = AutoTokenizer.from_pretrained(\"bert-base-uncased\")\n\nprint(f\"Num of chars: {len(text)}\") # --> Num of chars: 3149\nprint(f\"Num of tokens (using BertTokenizer): {len(bert_tokenizer.encode(text))}\") # --> Num of tokens (using BertTokenizer): 603\n\n# This creates an instance of the TextChunkizer class with a chunk size of 512, \n# using token-based segmentation and a custom tokenizer function bert_tokenizer.encode to count tokens.\nchunkizer = TextChunkizer(512, tokens=True, tokenizer_func=bert_tokenizer.encode)\nchunks = chunkizer.chunkize(text)\nfor i, chunk in enumerate(chunks):\n    print(f\"Chunk {i+1}, num of tokens: {len(bert_tokenizer.encode(chunk))} -> {chunk}\")\n```\nThis code returns: \n```\nChunk 1, num of tokens 476: -> Napoleon Bonaparte (born Napoleone Buonaparte; 15 August 1769 – 5 May 1821), later known by his regnal name Napoleon I, was a French military commander and political leader who rose to prominence during the French Revolution and led successful campaigns during the Revolutionary Wars. He was the de facto leader of the French Republic as First Consul from 1799 to 1804, then Emperor of the French from 1804 until 1814 and again in 1815. Napoleon's political and cultural legacy endures to this day, as a highly celebrated and controversial leader. He initiated many liberal reforms that have persisted in society, and is considered one of the greatest military commanders in history. His wars and campaigns are studied by militaries all over the world. Between three and six million civilians and soldiers perished in what became known as the Napoleonic Wars. Napoleon was born on the island of Corsica, not long after its annexation by France, to a native family descending from minor Italian nobility. He supported the French Revolution in 1789 while serving in the French army, and tried to spread its ideals to his native Corsica. He rose rapidly in the Army after he saved the governing French Directory by firing on royalist insurgents. In 1796, he began a military campaign against the Austrians and their Italian allies, scoring decisive victories and becoming a national hero. Two years later, he led a military expedition to Egypt that served as a springboard to political power. He engineered a coup in November 1799 and became First Consul of the Republic. Differences with the United Kingdom meant France faced the War of the Third Coalition by 1805. Napoleon shattered this coalition with victories in the Ulm campaign, and at the Battle of Austerlitz, which led to the dissolution of the Holy Roman Empire. In 1806, the Fourth Coalition took up arms against him. Napoleon defeated Prussia at the battles of Jena and Auerstedt, marched the Grande Armée into Eastern Europe, and defeated the Russians in June 1807 at Friedland, forcing the defeated nations of the Fourth Coalition to accept the Treaties of Tilsit. Two years later, the Austrians challenged the French again during the War of the Fifth Coalition, but Napoleon solidified his grip over Europe after triumphing at the Battle of Wagram. Hoping to extend the Continental System, his embargo against Britain, Napoleon invaded the Iberian Peninsula and declared his brother Joseph the King of Spain in 1808.\nChunk 2, num of tokens 129: -> The Spanish and the Portuguese revolted in the Peninsular War aided by a British army, culminating in defeat for Napoleon's marshals. Napoleon launched an invasion of Russia in the summer of 1812. The resulting campaign witnessed the catastrophic retreat of Napoleon's Grande Armée. In 1813, Prussia and Austria joined Russian forces in a Sixth Coalition against France, resulting in a large coalition army defeating Napoleon at the Battle of Leipzig. The coalition invaded France and captured Paris, forcing Napoleon to abdicate in April 1814. He was exiled to the island of Elba, between Corsica and Italy. In France, the Bourbons were restored to power.\n```\n\nAs you can see, `chunkipy` created chunks smaller than the given input size, \n`512`, counted the tokens using BERT's tokenizer, and didn't cut sentences in half, \nproducing syntactically correct chunks of text.\n\nYou can also use `TextChunkizer`'s `segment()` method to split a text into smaller parts \nwithout actually creating the chunks. \nThis can be useful, for example, when you want to apply further processing to \nthe text parts before creating the final chunks.\n\n\n### Provide a custom text split strategy\nIf you don't want to use `stanza` or you need to use your custom text splitting logic, \nyou can provide it in the constructor, as shown in this example:\n\n```python\nfrom chunkipy import TextChunkizer\n\n\ndef split_by_arrow(text):\n    return [t for t in text.split(\"->\") if t != '' and ' ']\n\n\ntext = \"This is a tokenized text -> with custom split strategy.\"\n\n\n# Create a TextChunkizer object with custom split strategy\nchunkizer = TextChunkizer(chunk_size=8, tokens=True,\n                          split_strategies=[split_by_arrow])\nchunks = chunkizer.chunkize(text)\n\n# Print the resulting chunks\nfor i, chunk in enumerate(chunks):\n    print(f\"Chunk {i+1}: {chunk}\")\n```\n\nThis would output:\n\n```\nChunk 1: This is a tokenized text\nChunk 2: with custom split strategy.\n```\n\n## Contributing\nIf you find a bug or have a feature request, please open an issue on [GitHub](https://github.com/gioelecrispo/chunkipy/issues).\nContributions are welcome! Just fork the repository, create a new branch with your changes, and submit a pull request. Please make sure to write tests for your changes and to follow the [code style](https://www.python.org/dev/peps/pep-0008/).\n\n## License\nTextChunkizer is licensed under the [MIT License](https://opensource.org/licenses/MIT).\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/gioelecrispo/chunkipy.git",
    "keywords": "",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "chunkipy",
    "package_url": "https://pypi.org/project/chunkipy/",
    "platform": null,
    "project_url": "https://pypi.org/project/chunkipy/",
    "project_urls": {
      "Homepage": "https://github.com/gioelecrispo/chunkipy.git"
    },
    "release_url": "https://pypi.org/project/chunkipy/0.0.1/",
    "requires_dist": [
      "stanza (==1.4.2)",
      "langdetect (==1.0.9)"
    ],
    "requires_python": ">=2.7",
    "summary": "Chunkipy is an easy-to-use library for chunking text based on the tokenizer function you provide.",
    "version": "0.0.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17017226,
  "releases": {
    "0.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5ac667f0e98db3a4f61e3c5231d145432c68f87e6fb0bcd0b03f296be5b64ae4",
          "md5": "2d2245d25318c45cf8153a555c5b0561",
          "sha256": "0a9af3135e923c76e01dfaba78dcc9dfa13457836c2d487ce09b91be28dc8559"
        },
        "downloads": -1,
        "filename": "chunkipy-0.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "2d2245d25318c45cf8153a555c5b0561",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=2.7",
        "size": 7901,
        "upload_time": "2023-02-24T17:54:42",
        "upload_time_iso_8601": "2023-02-24T17:54:42.978211Z",
        "url": "https://files.pythonhosted.org/packages/5a/c6/67f0e98db3a4f61e3c5231d145432c68f87e6fb0bcd0b03f296be5b64ae4/chunkipy-0.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "5ac667f0e98db3a4f61e3c5231d145432c68f87e6fb0bcd0b03f296be5b64ae4",
        "md5": "2d2245d25318c45cf8153a555c5b0561",
        "sha256": "0a9af3135e923c76e01dfaba78dcc9dfa13457836c2d487ce09b91be28dc8559"
      },
      "downloads": -1,
      "filename": "chunkipy-0.0.1-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "2d2245d25318c45cf8153a555c5b0561",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=2.7",
      "size": 7901,
      "upload_time": "2023-02-24T17:54:42",
      "upload_time_iso_8601": "2023-02-24T17:54:42.978211Z",
      "url": "https://files.pythonhosted.org/packages/5a/c6/67f0e98db3a4f61e3c5231d145432c68f87e6fb0bcd0b03f296be5b64ae4/chunkipy-0.0.1-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}