{
  "info": {
    "author": "Joeri van Strien",
    "author_email": "joerivanstrien@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# CompaCt\n\n![Tests](https://github.com/joerivstrien/compact-bio/actions/workflows/tests.yml/badge.svg)\n\n### Comparative Clustering of (protein) interaction data\n\n## Contents\n\n- [About](#about)\n- [Installation](#installation)\n- [Usage](#usage)\n- [Output](#output)\n- [Python Package](#python-package)\n- [License](#licence)\n- [Issues](#issues)\n- [Citing CompaCt](#citing-compact)\n\n\n## About\n\nCompaCt performs automated integrative comparative analysis of large-scale (protein) interaction datasets, identifying groups of interactors (e.g., protein complexes) in parallel in multiple species, allowing systematic identification and comparison of conserved as well as taxon-specific components of protein complexes and other interactions. For a more complete description of the software and its applications, please refer to the manuscript (see [here](#citing-compact)).\n\n## Installation\n\nCompaCt is implemented as a user-friendly command-line tool, as well as a flexible python package. Both are available after installing the python package and its dependencies. Installing with conda or using docker ensures the required dependencies are available without requiring manual installation.\n\n**dependencies**\n- [Python >= 3.7](https://www.python.org/)\n- [pandas](https://pandas.pydata.org/)\n- [numpy](https://numpy.org/)\n- [rbo](https://github.com/changyaochen/rbo)\n- [MCL](https://micans.org/mcl/)\n- [optional]: [fastrbo](https://github.com/joerivstrien/fastrbo) -- optional alternative to \"rbo\" package\n    -  faster implementation of rank biased overlap, manual installation required. Follow the link for installation instructions. Fastrbo is automatically available when using the docker image\n\n### pip\n    publication on pip is pending\n\n### conda\n    publication on conda is pending\n\n### docker\n    docker image is pending\n\n### installation from repository\n    git clone git@github.com:joerivstrien/compact-bio.git\n    cd compact-bio\n    pip install .\n\n# Usage\n\n## Input Data\n\nBelow follows a description of the different types of input files that the CompaCt tool expects as input. The format of all input files is the tab-separated plain text format, as these are easy to create/edit with both spreadsheet software (e.g., excel, google-docs etc.) and programming languages like python or R.\n\n\n### interaction data\n\nCompaCt performs comparative clustering on a collection of (protein) correlation datasets. It expects a symmetric matrix of correlation or interaction scores, that represent interaction strength or likelihood. CompaCt does not require a specific metric or range of interaction scores, and can handle any numeric score as long as it can be used to sort or assign ranks to interactors.\n\nThe aim of CompaCt is to compare (protein) correlation datasets from different species or biological systems. To allow for prioritization of proteins that consistently cluster together in multiple experiments, multiple \"replicated\" correlation datasets that represent the same system can be provided. In the corresponding manuscript we have demonstrated that this can greatly improve quality of the CompaCt clustering results. A set of correlation datasets representing the same species or system (\"replicates\") are reffered to as a \"collection\". \n\nWhen using the command-line tool, the files containing these interaction scores should be provided as a tab-separated text file, with the first row and column containing the identifiers of the proteins,genes, etc. An example of an interaction file is available [here](https://github.com/joerivstrien/compact-bio/blob/master/example_data/correlated_profile.tsv).\n\nAside from directly providing correlation/interaction scores between proteins, CompaCt can automatically compute Pearson correlation scores from a matrix of expression/abundance data, like a complexome profile. These will then be used as interaction scores in subsequent CompaCt analysis. Similar to the interaction files, when using the command-line tool these data should be provided as a tab-separated text file, with the first row containing identifiers. An example of a file containing protein protein expression data is available [here](https://github.com/joerivstrien/compact-bio/blob/master/example_data/abundance_profile.tsv)\n\n\n### pairwise orthology data\n\nto enable comparison between species, or other datasets with different identifiers, pairwise orthology or identifier mappings need to be provided. The identifier pairs should correspond to the identifiers used in the interaction or expression data. When using the command-line tool, the identifier pairs should be provided as a text file, with two columns separated by a tab. each column contains identifiers of one of the two species this orthology file relates to. An example mapping file is available [here](https://github.com/joerivstrien/compact-bio/blob/master/example_data/pairwise_orthology.tsv)\n\n### settings file\n\nTo prevent an extensive list of input commands when performing CompaCt analysis using the command-line tool on a large number of datasets, the list and path of all input files are provided in a settings file. This should be a \"tab\" delimited plain text file, where each input file is listed per row. Each file is desribed with four fields (delimited by tab characters). below follows a description of these four fields for interaction and orthology files.\n\n<ins>interaction data file</ins>\n\n1. file type identifier: should be \"INT\" specifying that this is an interaction data file.\n2. \"collection\" identifier: an identifier for the \"collection\" (e.g., species, cell-type, tissue, etc.) this correlation dataset represents.\n3. \"replicate\" identifier: an identifier for this specific interaction dataset.\n4. the location and name of the file (e.g., path/to/file.tsv)   \n\n<ins>pairwise orthology file</ins>\n\n1. file type identifier: should be \"ORTH\" specifying that this is a pairwise orthology file.\n2. FROM collection identifier: the collection identifier for the collection whose identifiers are in the first column of the pairwise orthology file.\n3. TO collection identifier: the collection identifier for the collection whose identifiers are in the second column of the pairwise orthology file.\n4. the location and name of the file (e.g., path/to/file.tsv)   \n\nThe ordering of the files in the input settings file does not matter, as long as the fields are correctly describing it. An example settings file is available [here](https://github.com/joerivstrien/compact-bio/blob/master/example_data/input_settings.tsv)\n\n### <ins>annotation reference file</ins>\n\nCompaCt is optionally able to automatically annotate the resulting clusters based on overlap with a provided reference set of protein complexes or pathways. The reference should be provided in a file with the [GMT format](https://software.broadinstitute.org/cancer/software/gsea/wiki/index.php/Data_formats#GMT:_Gene_Matrix_Transposed_file_format_.28.2A.gmt.29), a commonly used and available format to store gene sets for use in for example gene set enrichment analysis. The identifiers used in the reference file should match those of one of the analysed collections/species. An example GMT file with reference complexes is available [here](https://github.com/joerivstrien/compact-bio/blob/master/example_data/reference_complexes.gmt).\n\n## CompaCt Command line Tool\n\n### when installed with pip or conda\n    compact [options] path/to/settings.tsv\n\n### when using Docker\n    coming soon\n\n### Command Line Arguments\n    #################################\n    #### commonly useful options ####\n    #################################\n\n    -h, --help          show a complete list of all command line arguments\n    -v, --version       show program's version\n    -i {abun,int}, --in-type {abun,int}\n                        whether provided input interaction data are abundance/expression\n                        values or correlation matrices. default='abun'\n    -o [OUTPUT_LOC], --output-loc [OUTPUT_LOC]\n                        preferred location of the result folder. defaults to current\n                        working directory\n    -j JOB_NAME, --job-name JOB_NAME\n                        name of current job, used in name of result folder name.\n                        defaults to concatenated collection names\n    -t [PROCESSES], --processes [PROCESSES]\n                        number of threads or processes to use. default=1\n    -p [P]              rank biased overlap p parameter, value between 0 and 1. \n                        default=0.9.\n                        determines \"top-heaviness\" of the rank biased overlap metric.\n                        Lower values correspond to more weight towards the top of the\n                        ranked interactor profilewhen computing similarity.\n    --mcl-inflation [MCL_INFLATION]\n                        inflation param of MCL tool, determines cluster granularity. default=2. \n                        higher values will typically result in more coarse-grained clusters\n    --perf-cluster-annot\n                        perform automatic annotation of clusters using reference\n                        groups\n    --ref-file [REF_FILE]  \n                        gmt format file with reference groups, when perf-cluster-\n                        annot is used\n    --ref-tag [REF_TAG]   tag of collection that the annotation reference represents.\n    \n\n    ##############################################################\n    #### more obscure options, ignoring these is usually fine ####\n    ##############################################################\n\n    -m [MIN_SEARCH_WEIGHT], --min-search-weight [MIN_SEARCH_WEIGHT]\n                        minimum search weight for rank biased overlap, default=0.99\n    --th-criterium {percent,best}\n                        threshold criterium for determination of reciprocal top hits.\n                        default='percent'\n    --th-percent [TH_PERCENT]\n                        if th-criterium='percent': top % to consider top hits.\n                        default=1.\n    --include_within    include within-sample interaction scores in clustering input.\n                        default=False\n    --wbratio [WBRATIO]   ratio of within/between score averages. default=1\n    --skip-filter-clusters\n                        use if low-scoring clusters should not be filtered\n    --annot-ref-th [ANNOT_REF_TH]\n                        min fraction of reference group that must be present in\n                        cluster. default=0.5\n    --annot-mem-th [ANNOT_MEM_TH]\n                        min fraction-present of clust members to be counted for\n                        annot-ref-th. default=0.25\n\n## Output\n\nWhen running the compact command line tool, the results will be saved to a results folder containing several files. We will describe the content of each file in more detail below.\nAll result files are in tab separated text format (.tsv), so they are easy to load into a spreadsheet software (e.g., google docs, excel, etc.) or work with using a programming language like R or python. \n\n#### <ins> clust info file</ins>: \"clust_info.tsv\"\n\nThis file contains the full list of result clusters that passed CompaCt's filtering steps.\nIt contains various columns with information regarding the cluster, like their size, coherence and other metrics. Below follows a description of the information available in each of the various columns:\n- *_size: number of members of each subcluster and total cluster\n- n_represented: number of complexomes that have cluster members in this cluster\n- *_over_0.5_size: number of members with a fraction clustered score (FC) of 0.5 or greater\n- robust_represented: number of complexomes that have cluster members in this cluster with a FC of 0.5 or greater\n- *_match_fraction: the fraction of total possible “matches” within each complexome, or overall. A metric to quantify the coherence of a cluster across datasets\n\n#### <ins>cluster member files</ins>: \"*_cluster_members.tsv\"\nFor each collection of datasets (e.g., all datasets corresponding to the same species) that was provided as input, a cluster member file is available, containing all the clustered proteins and their cluster assignments, along with additional information like their orthologs in other species as well as their FC (fraction clustered) scores. Below follows a description of the information available in each of the various columns:\n\n- clust_id: id of cluster this protein/gene entry is clustered with\n- id: identifier of clustered protein/gene\n- fraction_clustered: the FC score of this protein with this cluster. Defined as: number of replicate datasets in which this protein clusters with this cluster divided by the total number of replicates for this collection\n- *_mapping: orthologous protein in other collection, based on provided pairwise orthology\n- best_guess_selection: whether this protein is part of the \"best guess\" selection criterion of the respective cluster\n- match_over_threshold: whether this protein has an ortholog in another collection that has a FC score over 0.5\n\n#### <ins>MCL result file</ins>: \"MCL_result.tsv\"\nThe raw cluster output from the MCL clustering software. for each line contains the members of one of the MCL clusters, separated by tab characters. The protein/gene identifiers used are prepended by the replicate dataset identifier that they originate from. for more details regarding the MCL clustering software and its output please refer to [their documentation](https://micans.org/mcl/)\n\n#### <ins>combined network file</ins>: \"combined_network.tsv\"\nThe combined network generated by compact, containing proteins/genes from all provided datasets, to be used as input for clustering by MCL. The protein/gene identifiers used are prepended by the replicate dataset identifier that they originate from.\n\n#### <ins>clust_nodes</ins>: \"clust_nodes.tsv\"\ncontains all clustered proteins, along with additional information. Can be used together with the clust_eges.tsv file for visualization with tools like cytoscape or analysis of CompaCt's output clusters\n\n#### <ins>clust_edges</ins>: \"clust_edges.tsv\"\ncontains all edges between proteins part of the same cluster, along with additional information. Can be used together with the clust_nodes.tsv file for network vizualisation with tools like cytoscape or analysis of CompaCt's output clusters \n\n## Python Package\n\nAside from using the CompaCt command line tool, that performs the complete analysis from expression/abundance datasets to annotated species-specific clusters, CompaCt can also be used as a python package. From python CompaCt can be used more flexibly, for example to rerun only specific steps in the analysis with changed parameters. For complete documentation of all the modules and functions available in the CompaCt package refer to the [package documentation](LINK TO PACKAGE DOCUMENTATION)\n\nRunning a complete CompaCt analysis from python\n\n    from compact.main import main\n    import compact.process_data as prd\n    import compact.utils as ut\n\n    # parse complexome profiles and orthology files as listed in settings.tsv\n    sample_data,mapping_data = prd.parse_settings('path/to/settings_file.tsv')\n    samples = prd.parse_profiles(sample_data)\n    mappings = prd.parse_mappings(mapping_data)\n\n    # get collection/replicate structure from settings file\n    nested_tags = prd.get_nested_tags(sample_data)\n\n    # generate Pearson correlation matrices from the complexome profile abundance data\n    corr_matrices = ut.correlate_samples(samples)\n\n    # run complete CompaCt analysis\n    main(\n        nested_tags,corr_matrices,mappings,\n        output_location='results/',\n        job_name='example_run',\n        processes=4)\n\nNow let's say you would like to use a different granularity for the clustering step of the analysis, without having to rerun the computationally expensive rbo score computation. You could do this as follows:\n\n    from compact.MCL_clustering import run_MCL\n    from compact.main import process_mcl_result,save_results\n\n    # rerun MCL with a different inflation parameter value\n    run_MCL('results/example_run_results/combined_network.tsv',\n            'results/rerun_results/mcl_rerun_result.tsv',\n             inflation=2.5,processes=4)\n\n    # process the MCL results\n    # to get scored and filtered species-specific clusters\n    mcl_res = process_mcl_result(\n        'results/rerun_results/mcl_rerun_result.tsv',nested_tags,\n        'results/example_run_results/combined_network.tsv',mappings)\n\n    # save the results to an output folder for manual inspection\n    save_results(mcl_res,'../results/rerun_results/',mappings)\n\n## Licence\n\n    CompaCt -- Comparative Clustering\n    Copyright (C) 2022 Radboud University Medical Center\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU Affero General Public License as\n    published by the Free Software Foundation, either version 3 of the\n    License, or (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU Affero General Public License for more details.\n\n    You should have received a copy of the GNU Affero General Public License\n\talong with this program.  If not, see <https://www.gnu.org/licenses/>.\n\n## Issues\nIf you have questions or encounter any problems or bugs, please report them in the [issue channel](https://github.com/joerivstrien/compact-bio/issues).\n\n\n## Citing Compact\n\nPublication Pending\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/joerivstrien/compact-bio",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "compact-bio",
    "package_url": "https://pypi.org/project/compact-bio/",
    "platform": null,
    "project_url": "https://pypi.org/project/compact-bio/",
    "project_urls": {
      "Bug Tracker": "https://github.com/joerivstrien/compact/issues",
      "Homepage": "https://github.com/joerivstrien/compact-bio"
    },
    "release_url": "https://pypi.org/project/compact-bio/0.1.0/",
    "requires_dist": [
      "numpy",
      "pandas",
      "rbo",
      "pytest ; extra == 'test'",
      "coverage ; extra == 'test'",
      "pytest-cov ; extra == 'test'"
    ],
    "requires_python": ">=3.7",
    "summary": "CompaCt -- comparative clustering of interaction data",
    "version": "0.1.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16534243,
  "releases": {
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6312b3bc9af3939a7954c9abaabc0c9442de5b723854617e58b9ad7ffe3da255",
          "md5": "30cba8e66de8327bf4ede647c3575626",
          "sha256": "7f3ad91633603baf8b8efb62297d8899046c8255fb5b74510ac8c95782d5eb5e"
        },
        "downloads": -1,
        "filename": "compact_bio-0.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "30cba8e66de8327bf4ede647c3575626",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 55037,
        "upload_time": "2023-01-23T15:43:27",
        "upload_time_iso_8601": "2023-01-23T15:43:27.094623Z",
        "url": "https://files.pythonhosted.org/packages/63/12/b3bc9af3939a7954c9abaabc0c9442de5b723854617e58b9ad7ffe3da255/compact_bio-0.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "913a646ba4440c4aa0d9c9d65aa3a4894a4ae42d5b5647c31021ce876b6fa01b",
          "md5": "f6e093bc76cafd3a2de1345711c3d38c",
          "sha256": "fde778e18bc3d8b9769a231e2ec209f15cc712bbaa16e1ffbb5051e3786fac53"
        },
        "downloads": -1,
        "filename": "compact-bio-0.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "f6e093bc76cafd3a2de1345711c3d38c",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 55081,
        "upload_time": "2023-01-23T15:43:29",
        "upload_time_iso_8601": "2023-01-23T15:43:29.235463Z",
        "url": "https://files.pythonhosted.org/packages/91/3a/646ba4440c4aa0d9c9d65aa3a4894a4ae42d5b5647c31021ce876b6fa01b/compact-bio-0.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "6312b3bc9af3939a7954c9abaabc0c9442de5b723854617e58b9ad7ffe3da255",
        "md5": "30cba8e66de8327bf4ede647c3575626",
        "sha256": "7f3ad91633603baf8b8efb62297d8899046c8255fb5b74510ac8c95782d5eb5e"
      },
      "downloads": -1,
      "filename": "compact_bio-0.1.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "30cba8e66de8327bf4ede647c3575626",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.7",
      "size": 55037,
      "upload_time": "2023-01-23T15:43:27",
      "upload_time_iso_8601": "2023-01-23T15:43:27.094623Z",
      "url": "https://files.pythonhosted.org/packages/63/12/b3bc9af3939a7954c9abaabc0c9442de5b723854617e58b9ad7ffe3da255/compact_bio-0.1.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "913a646ba4440c4aa0d9c9d65aa3a4894a4ae42d5b5647c31021ce876b6fa01b",
        "md5": "f6e093bc76cafd3a2de1345711c3d38c",
        "sha256": "fde778e18bc3d8b9769a231e2ec209f15cc712bbaa16e1ffbb5051e3786fac53"
      },
      "downloads": -1,
      "filename": "compact-bio-0.1.0.tar.gz",
      "has_sig": false,
      "md5_digest": "f6e093bc76cafd3a2de1345711c3d38c",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7",
      "size": 55081,
      "upload_time": "2023-01-23T15:43:29",
      "upload_time_iso_8601": "2023-01-23T15:43:29.235463Z",
      "url": "https://files.pythonhosted.org/packages/91/3a/646ba4440c4aa0d9c9d65aa3a4894a4ae42d5b5647c31021ce876b6fa01b/compact-bio-0.1.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}