{
  "info": {
    "author": "Charmed Labs",
    "author_email": "support@charmedlabs.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# Dash for devices (dash_devices)\n\nFor devices seeking a front-end, [Dash](https://github.com/plotly/dash) can be used to provide an easy-to-program and browser-compatible user interface.  It's compelling!  You only need to know a bit of Python...  But there are some [issues](https://github.com/richlegrand/dash_devices#problems-we-encountered-with-dash-and-devices) that need to be considered when using Dash with hardware/devices.  This fork of Dash is an attempt to address these issues.\n\nAmong other changes, we've introduced _shared_ callbacks:\n\n![Shared callbacks](https://user-images.githubusercontent.com/913165/82079294-3cfb5d80-96a8-11ea-99be-35473d28a5f2.gif) \n\nHere, the shared slider and shared text box are shared across all clients, which is what you might want with a device or shared resource.  The other components are regular (not shared) to show that you can mix shared/regular components in a layout.\n\nWhen a component is shared, the property changes to that component are pushed to all clients by the Dash server over WebSocket(s).  Each client gets a logically consistent and intentional display of the state of the system, device, or shared resource.  \n\nTo give it a try:\n\n1.  Make sure you have a recent version of [Dash](https://pypi.org/project/dash/) installed.  As of this writing version 1.12.0 was the most recent version.\n2.  Install quart and quart_compress:\n`pip3 install quart`\n`pip3 install quart_compress`\n3.  Install dash_devices:\n`pip3 install dash_devices`\n4.  Download one of the examples (e.g. [example1.py](https://github.com/richlegrand/dash_devices/blob/dev/example1.py)) and run it (e.g. `python3 example1.py`).\n5.  Point your browser to `localhost:5000`. \n6.  Repeat (5) with another browser tab.  \n\n\n## Background\n\nWe had planned to launch a crowdfunding campaign for a [Raspberry Pi-based AI camera](https://www.vizycam.com/), but COVID-19 happened (it's still happening), and we hit pause on the launch of the campaign.  I eventually used some of my new free time to work on this.  Disclaimer: I'm not an expert in this space -- my main qualification is that I have a good amount of firsthand experience using Dash and Flask with devices/hardware.  And I’m a big fan of Dash.\n\n![Vizy in Motionscope mode](https://user-images.githubusercontent.com/913165/82081637-471f5b00-96ac-11ea-9649-31bf2893512f.gif)\n\nDash was designed (I'm paraphrasing) to give non-expert programmers the ability to make beautiful and informative dashboards.  Along those lines, I wanted make it easier for the Raspberry Pi/maker community to put their hardware creations/ideas online for anyone to interact with.  Dash can do this out of the box, but the required [workarounds](#problems-we-encountered-with-dash-and-devices) can be a bummer...  I also wanted to make our product work better and be easier to program.  \n\nI hope that others find these changes useful.  \n\n\n## Our additions to Dash\n\nWe didn't take anything away from Dash, we just added stuff...\n\n\n### Shared callbacks\n\nWe added `callback_shared()`.  For example:\n\n```python\n# Share slider value with all clients\n@app.callback_shared(Output('slider_output', 'children'), [Input('slider', 'value')])\ndef func(value):\n    # ... code to interact with hardware/device(?)\n    return value\n```\n\nDeclaring a callback as shared does several things:\n\n1.  The outputs/updates are shared with all clients.\n2.  The callback routine is threadsafe/serialized.\n3.  The callback routine is called upon server initialization, not upon client initialization.\n4.  Updates happen over WebSocket instead of HTTP requests.\n\nShared callbacks are useful when you want to interact with a device (all clients see the see the live state of the device and more than one client can connect.)  See [example1.py](https://github.com/richlegrand/dash_devices/blob/dev/example1.py), [example1a.py](https://github.com/richlegrand/dash_devices/blob/dev/example1a.py), [example2.py](https://github.com/richlegrand/dash_devices/blob/dev/example2.py), and [example2a.py](https://github.com/richlegrand/dash_devices/blob/dev/example2a.py). \n\n\n### Client awareness\n\n\n#### app.clients \n\nWebSockets create an active connection between the server and the client.  The connection exists as long the browser tab is present in the browser.  It allows the server to easily maintain a table of active clients.  Your dash app can access the table of active clients through `app.clients`.  Inside the table each client has a connection time, ip address, hostname and authentication value.  See [example3.py](https://github.com/richlegrand/dash_devices/blob/dev/example3.py) and [example3a.py](https://github.com/richlegrand/dash_devices/blob/dev/example3a.py).  Since a given client has a `__dict__` attribute, you can easily add whatever fields you want.  \n\n\n#### client field in callback_context\n\nWe added a `client` field to the `dash.callback_context`.  This is accessed within any callback (see [example3a.py](https://github.com/richlegrand/dash_devices/blob/dev/example3a.py).)  The `client` field is the requesting client, so the callback can do something different based on the client's authentication or some other criteria, for example.\n\n\n#### callback_connect\n\nWe also added `callback_connect` for the server to communicate when a client connection changes. \n\n```python\n@app.callback_connect\ndef func(client, connect):\n    print(client, connect, len(app.clients))    \n```\n\nThe `client` argument is the client whose connection status has changed.  The  `connect` argument is either `True` for the client connecting or `False` for the client disconnecting.  The function provided to `callback_connect` can be a coroutine. \n\nSee [example2.py](https://github.com/richlegrand/dash_devices/blob/dev/example2.py), [example2a.py](https://github.com/richlegrand/dash_devices/blob/dev/examplesa.py), [example3.py](https://github.com/richlegrand/dash_devices/blob/dev/example3.py), and [example3a.py](https://github.com/richlegrand/dash_devices/blob/dev/example3a.py).\n\n\n### push_mods()\n\n\nDevices have _state_ and the state sometimes needs to be communicated to the client(s) outside of a callback.  Modifications to layout components (mods) can be sent to an individual client or all clients.  For example, to send mods to all clients:\n\n```python\napp.push_mods({'slider': {'value': val}}) // leave off the client arg\n```\n\nor send to just one client:\n\n```python\napp.push_mods({'slider': {'value': val}}, client) // specify the client\n```\n\nTo modify multiple properties:\n\n```python\napp.push_mods({\n    'slider': {'value': val},\n    'graph': {'figure': figure},\n    'out': {'style': {'display': 'none'}}\n})\n```\n\nSee [example2.py](https://github.com/richlegrand/dash_devices/blob/dev/example2.py) and [example2a.py](https://github.com/richlegrand/dash_devices/blob/dev/example2a.py).\n\n\n### \"No output\" option for callbacks\n\nDash requires that each callback have at least one output.  But sometimes you just want a callback (no output wanted/needed.)  For example, a button to take a picture.  Here, the callback to the button exists to take the picture and store it somewhere (a side-effect), not (typically) to inject another piece of data into the layout, which is what a callback does normally. \n\nFor example:\n\n```python\n@app.callback_shared(None, [Input('Click', 'n_clicks')]) # specify None for output\ndef func(value):\n    print('Taking picture...')\n    # ...\n    # return nothing\n```\n\nSee [example1a.py](https://github.com/richlegrand/dash_devices/blob/dev/example1a.py).\n\nYou can do the same with regular (non-shared) callbacks, but our intention was to use with shared callbacks, where side-effects are sometimes the main point.  \n\n\n### Alternate outputs for callbacks\n\nSometimes you don't want to be restricted to just one given output (or set of outputs.)  Dash has the [no_update](https://dash.plotly.com/advanced-callbacks) object that helps address this, but we found that we would eventually run into the \"duplicate output\" restriction (two or more callbacks can't share an output id.property.)\n\nFor example, to return an alternate result (or set of results):\n\n```python\n@app.callback(Output('content', 'children'), [Input('submit', 'n_clicks')], \n    [State('username', 'value'), State('password', 'value')])\ndef func(submit, username, password):\n    if username=='username' and password=='password':\n        return authenticated_layout # Normal output \n    else: # Alternate output\n        return Output('message', 'children', 'Incorrect username and/or password!'), \\\n            Output('password', 'value', ''), Output('username', 'value', '')\n```\n\nSee [example3.py](https://github.com/richlegrand/dash_devices/blob/dev/example3.py).\n\nThe upshot here is to use an `Output` object (or objects) to return the alternate result.  (Note, the third argument to `Output` is something we added -- it's optional, but required here to specify the value of the given `Output`.) \n\nThis works with shared callbacks also.  \n\n\n### Asyncio\n\nWe use [Quart](https://pgjones.gitlab.io/quart/) instead of Flask.  Quart is a really nice asyncio implementation of Flask.  Quart is typically faster than Flask, but we chose it also because it has built-in WebSocket support.  Flask works well with Flask-SocketIO (as you'd expect), but it requires that you monkey-patch the Python standard library.  This can break things.  For example, we found that monkey-patching breaks Google's Oauth 2.0 library.  Asyncio seemed like a better path forward than eventlet (what's typically used for WebSockets and the reason behind monkey-patching.)  And asyncio has been really nice to work with.  For example, sending N messages to N clients is what asyncio is really good at.  Quart requires Python 3.7 or higher, however. \n\nWe gave callbacks the option of being coroutines (async) or synchronous routines.  Like the Flask implementation of Dash, synchronous routines execute in their own thread to keep things snappy.  Coroutines execute in their own asyncio task for the same reason.  Giving callbacks this option probably contributed to the biggest changes to the server-side code.  The callback_context code in dash.py needed significant refactoring.  \n\nWe haven't measured any noticeable performance improvement with Quart ([see below](https://github.com/richlegrand/dash_devices#benchmarks).)  But we expect that Dash with Quart has better CPU scaling than with Flask.   \n\n\n### Other modes/services\n\nShared callbacks assume that you have a single resource that you want to share.  We assumed this was the most common case, but what if you have N resources, e.g. 4 cameras or 2 robots, and you want each client to interact with a separate resource?  In this case, each client would get a different component view, but still need WebSocket service and serialized callbacks.  \n\nWe created the \"S2\" service with this in mind.  By using the client field in the callback_context a given callback can provide a device-specific view for a given client.  \n\nThe `Services` class in [dash.py](https://github.com/richlegrand/dash_devices/blob/dev/dash/dash.py) makes it fairly easy to customize a callback service that better meets your needs.  The custom service can be passed into `callback()`. \n\n\n## Benchmarks \n\n__TLDR: WebSockets are faster__, up to 3x faster than using HTTP requests for component updates.  That's the biggest takeaway here.  A Dash server that uses WebSockets for component updates is significantly faster.  So you might consider using dash_devices for no other reason than it runs significantly faster than normal Dash. \n\nHow long does it take for a client to send a component update and receive a response from the server?  This \"round-trip\" time or \"server latency\" captures an important performance metric for the server, and it's what we measured. \n\n\n| Service           | Flask       | Quart with synchronous callback | Quart with coroutine callback |\n| ----------------- | ----------- | ------------------------------- | ----------------------------- |\n| HTTP service      | __16.3 ms__ | 18.7 ms                         | 18.1 ms                       |\n| WebSocket service | -           | __5.6 ms__                      | __4.8 ms__                    |\n\n\nFlask with HTTP service is what Dash uses normally.  I'm guessing that WebSockets are faster mostly because a given WebSocket connection is persistent.  The overhead of opening and closing an HTTP connection takes time.  \n\nI was expecting to see Quart and asyncio add a small improvement in performance over Flask and traditional threading (HTTP service row).  The measurements didn't show this though (Quart was a bit slower, which was surprising.)  I should note that there were a few milliseconds of noise in the numbers, especially the HTTP service measurements.  I'd expect that Quart/asyncio would have better CPU scaling than Flask though. \n\nSee the [notes below](https://github.com/richlegrand/dash_devices#notes-about-benchmark-testing) for more details about these tests.\n\n\n## Problems we encountered with Dash and devices\n\n### The root of the problem\n\nThe root of the problem is that devices make the Dash server _state-ful_.  Dash's design avoids any kind of state on the server side.  When you add state to the server:\n\n1.  You want to communicate the state to the client(s).  In general, the state can change both because of client interactions and independent of client interactions.    \n2.  You want the client(s) to modify/affect the state.\n\n(1) can be challenging because there’s no push mechanism in Dash.  We [added (hacked) a WebSocket](https://community.plotly.com/t/triggering-callback-from-within-python/23321/6) and that worked reasonably well as long as there was a single client.  (2) isn’t a problem as long as there’s a single client.\n\nSo keeping things limited to a single client sounds like it might be a reasonable solution.  This limitation can be challenging to enforce though, and multiple clients/users/connections are usually a desirable feature.  \n\nWith shared callbacks the state changes are distributed to clients automatically, and multiple clients can safely modify the state.  \n\n\n### Issues with HTTP requests and ordering \n\nOne of the first problems we noticed with Dash was that the brightness slider on our camera would act flakey -- the brightness slider would be at 100% but the camera would only be 87% brightness because the most recent callback was 87%.  The reason for this: each slider update from the client is sent as a separate HTTP request, and the receive order, while usually correct, sometimes isn't correct -- the 100% message might be received _before_ the 87% message.  *This is the nature of HTTP requests -- the ordering isn't guaranteed.*  It isn’t a problem within the normal Dash scheme of things, it’s only a problem when the server needs messages to be delivered in order (e.g. when you are interacting with a device.)\n\nThe issue is fixed by using a WebSocket to send component updates.  The WebSocket guarantees ordering, and it's faster -- see [benchmarks](https://github.com/richlegrand/dash_devices#benchmarks).\n\n\n### Thread safety and callbacks \n\nEach Dash callback is executed in a separate thread.  This keeps the Dash server snappy:  it doesn't wait for a given callback to complete.  But when you have a shared resource being accessed in the callback (e.g. a device) the callback code is typically no longer threadsafe.  So we added a lock to each shared callback.  The WebSocket queue guarantees ordering and the lock guarantees serialization of shared callbacks.  This only applies to shared callbacks -- regular callbacks are unchanged.  \n\nFor shared callbacks, \"serialization\" can be disabled in the `service` argument to `callback()`. \n\n\n### Race conditions\n\nThere is a more general issue of race conditions that arises when you mix HTTP requests with WebSocket communication.  So we made all communication (layout upload, dependencies and component updates) happen over WebSocket by default, but this can be set as a config option (via `server_service`).   With all component-related communication happening over WebSocket, messages are delivered in order, and the odd race condition is avoided. \n\n\n## Notes about benchmark testing\n\n*  The tests were conducted on a Ubuntu 18.04 i7 machine (server).  \n*  Python 3.7.7\n*  The client was a Windows 10 machine, Chrome browser.\n*  Network was 100BT, local.\n*  For Flask tests, Dash 1.12.0, git HEAD revision count 3200\n*  Flask 1.1.2\n*  Quart 0.11.5\n\nThe tests were done by modifying dash_renderer -- inserting a timer in `handleServerside()`.  Start the timer before fetch, stop the timer when `data` is received, then take the time difference and insert into a running averager until the average sufficiently converges.  This usually happens after 100 or so measurements, but to keep things consistent I ran each test for 300 clicks (I would click on a slider object.)  The test program is [here](https://github.com/richlegrand/dash_devices/blob/dev/timer.py).\n\nThe timer code is [here](https://github.com/richlegrand/dash_devices/blob/dev/dash-renderer/src/timer.js).  For example, to insert into (unmodified) [index.js](https://github.com/richlegrand/dash_devices/blob/dev/dash-renderer/src/actions/index.js):\n\n```javascript\nfunction handleServerside(config, payload, hooks) {\n    if (hooks.request_pre !== null) {\n        hooks.request_pre(payload);\n    }\n    // *********** here\n    const timer = startTimer();\n\n    return fetch(\n        `${urlBase(config)}_dash-update-component`,\n        mergeDeepRight(config.fetch, {\n            method: 'POST',\n            headers: getCSRFHeader(),\n            body: JSON.stringify(payload),\n        })\n    ).then(\n        res => {\n            const {status} = res;\n            if (status === STATUS.OK) {\n                return res.json().then(data => {\n                    // *************** and here\n                    stopTimer(timer);\n    ...\n```\n\nWe also ran tests using localhost (client and server running on the same Ubuntu machine.)  The results are below, included for fun and/or for whomever is interested:  \n\n| Service           | Flask       | Quart with synchronous callback | Quart with coroutine callback |\n| ----------------- | ----------- | ------------------------------- | ----------------------------- |\n| HTTP service      | __18.0 ms__ | 19.5 ms                         | 19.0 ms                       |\n| WebSocket service | -           | __5.2 ms__                      | __4.7 ms__                    |\n\n\n### Potential future features/improvements\n\n*  All callback functions within Dash need to be defined upon initialization.  WebSockets make it possible to send new callbacks dynamically as the page content changes. \n\n*  Other frameworks such as [FastAPI](https://fastapi.tiangolo.com/) can potentially improve [latency/performance](https://www.techempower.com/benchmarks/) compared to Quart. \n\n*  You can chain callbacks together in Dash -- the output of one callback is the input for another, the output of that callback is the input for yet another, etc.  Dash handles chaining at the client.  The client dispatches the callback at the server, gets the result and then dispatches the next callback.  The process continues until the end of the chain is reached.  Using this method, the network latency is added two times for each callback in the chain. For shared callbacks, callbacks are initiated and chained together at the server.  The callbacks are called in order and the outputs are sent to the client(s) over WebSocket(s) in order.  Using this method, a slow network will result in a delayed propagation of the callback results to the client(s), but no significant delays in the execution of the callbacks.  The same can be done for non-shared (regular) callbacks for a potential a speed-up.   \n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/richlegrand/dash_devices",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "dash-devices",
    "package_url": "https://pypi.org/project/dash-devices/",
    "platform": "",
    "project_url": "https://pypi.org/project/dash-devices/",
    "project_urls": {
      "Homepage": "https://github.com/richlegrand/dash_devices"
    },
    "release_url": "https://pypi.org/project/dash-devices/0.1.3/",
    "requires_dist": null,
    "requires_python": ">=3.7",
    "summary": "Dash for devices.",
    "version": "0.1.3",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 7527570,
  "releases": {
    "0.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "fa82b70d374b09a5fa5948fd6467026a63b36fd269f9cacea871ab66415e596c",
          "md5": "b113a7fabbbd22cbf2367f452473a82a",
          "sha256": "3cc8c82950a1692cf09ceb85be9b0f6a5348c4bfb3d5165c166805bd2c8221ee"
        },
        "downloads": -1,
        "filename": "dash_devices-0.1.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "b113a7fabbbd22cbf2367f452473a82a",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 933695,
        "upload_time": "2020-06-12T03:40:34",
        "upload_time_iso_8601": "2020-06-12T03:40:34.983919Z",
        "url": "https://files.pythonhosted.org/packages/fa/82/b70d374b09a5fa5948fd6467026a63b36fd269f9cacea871ab66415e596c/dash_devices-0.1.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "87b959f291a0c09d8341d1979daa197ab0a9552b56a5027c7b3cb285a0ab1e77",
          "md5": "93c9d2423f680bc2b413f4ade37e4438",
          "sha256": "a668f7111890aaf8c6e21384344a3b747e15d49006c2b07f427fcf06af166d64"
        },
        "downloads": -1,
        "filename": "dash_devices-0.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "93c9d2423f680bc2b413f4ade37e4438",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 920905,
        "upload_time": "2020-06-12T03:40:37",
        "upload_time_iso_8601": "2020-06-12T03:40:37.588230Z",
        "url": "https://files.pythonhosted.org/packages/87/b9/59f291a0c09d8341d1979daa197ab0a9552b56a5027c7b3cb285a0ab1e77/dash_devices-0.1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2159ecb6b6a1be0bb659bf9fb04092f5c325ccb771540eaf953e99a7f443f55c",
          "md5": "ed217775382c22d0597f04831d0e597c",
          "sha256": "4af25018d854162068edbea72b656266a87b80d2df92a3e6bef9200ae68ef00a"
        },
        "downloads": -1,
        "filename": "dash_devices-0.1.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "ed217775382c22d0597f04831d0e597c",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 934292,
        "upload_time": "2020-06-21T12:15:30",
        "upload_time_iso_8601": "2020-06-21T12:15:30.964451Z",
        "url": "https://files.pythonhosted.org/packages/21/59/ecb6b6a1be0bb659bf9fb04092f5c325ccb771540eaf953e99a7f443f55c/dash_devices-0.1.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "56dfc58c8c46effdc6f2b017f780b4f8ebc5f67b78a313ecc1aa349c800a9701",
          "md5": "f22316b0efe544088026a3bfe100d5e1",
          "sha256": "11bb9016bb23938d55c2a2a4c51a6408fe2ec4035af28e39ce6f68ae11f89cb4"
        },
        "downloads": -1,
        "filename": "dash_devices-0.1.3.tar.gz",
        "has_sig": false,
        "md5_digest": "f22316b0efe544088026a3bfe100d5e1",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 921676,
        "upload_time": "2020-06-21T12:15:32",
        "upload_time_iso_8601": "2020-06-21T12:15:32.798180Z",
        "url": "https://files.pythonhosted.org/packages/56/df/c58c8c46effdc6f2b017f780b4f8ebc5f67b78a313ecc1aa349c800a9701/dash_devices-0.1.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "2159ecb6b6a1be0bb659bf9fb04092f5c325ccb771540eaf953e99a7f443f55c",
        "md5": "ed217775382c22d0597f04831d0e597c",
        "sha256": "4af25018d854162068edbea72b656266a87b80d2df92a3e6bef9200ae68ef00a"
      },
      "downloads": -1,
      "filename": "dash_devices-0.1.3-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "ed217775382c22d0597f04831d0e597c",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.7",
      "size": 934292,
      "upload_time": "2020-06-21T12:15:30",
      "upload_time_iso_8601": "2020-06-21T12:15:30.964451Z",
      "url": "https://files.pythonhosted.org/packages/21/59/ecb6b6a1be0bb659bf9fb04092f5c325ccb771540eaf953e99a7f443f55c/dash_devices-0.1.3-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "56dfc58c8c46effdc6f2b017f780b4f8ebc5f67b78a313ecc1aa349c800a9701",
        "md5": "f22316b0efe544088026a3bfe100d5e1",
        "sha256": "11bb9016bb23938d55c2a2a4c51a6408fe2ec4035af28e39ce6f68ae11f89cb4"
      },
      "downloads": -1,
      "filename": "dash_devices-0.1.3.tar.gz",
      "has_sig": false,
      "md5_digest": "f22316b0efe544088026a3bfe100d5e1",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7",
      "size": 921676,
      "upload_time": "2020-06-21T12:15:32",
      "upload_time_iso_8601": "2020-06-21T12:15:32.798180Z",
      "url": "https://files.pythonhosted.org/packages/56/df/c58c8c46effdc6f2b017f780b4f8ebc5f67b78a313ecc1aa349c800a9701/dash_devices-0.1.3.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}