{
  "info": {
    "author": "Parmida93",
    "author_email": "ghahremani.parmida@gmail.com",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "\r\n<!-- PROJECT LOGO -->\r\n<br />\r\n<p align=\"center\">\r\n    <img src=\"./images/DeepLIIF_logo.png\" width=\"50%\">\r\n    <h3 align=\"center\"><strong>Deep-Learning Inferred Multiplex Immunofluorescence for Immunohistochemical Image Quantification</strong></h3>\r\n    <p align=\"center\">\r\n    <a href=\"https://doi.org/10.1101/2021.05.01.442219\">Journal Preprint</a>\r\n    |\r\n    <a href=\"https://rdcu.be/cKSBz\">Journal Link</a>\r\n    |\r\n    <a href=\"https://openaccess.thecvf.com/content/CVPR2022/html/Ghahremani_DeepLIIF_An_Online_Platform_for_Quantification_of_Clinical_Pathology_Slides_CVPR_2022_paper.html\">CVPR Link</a>\r\n    |\r\n    <a href=\"https://deepliif.org/\">Cloud Deployment</a>\r\n    |\r\n    <a href=\"https://nadeemlab.github.io/DeepLIIF/\">Documentation</a>\r\n    |\r\n    <a href=\"#docker\">Docker</a>\r\n    |\r\n    <a href=\"https://github.com/nadeemlab/DeepLIIF/tree/main/ImageJ_Plugin\">ImageJ Plugin</a>\r\n    |\r\n    <a href=\"#support\">Support</a>\r\n  </p>\r\n</p>\r\n\r\n*Reporting biomarkers assessed by routine immunohistochemical (IHC) staining of tissue is broadly used in diagnostic \r\npathology laboratories for patient care. To date, clinical reporting is predominantly qualitative or semi-quantitative. \r\nBy creating a multitask deep learning framework referred to as DeepLIIF, we present a single-step solution to stain \r\ndeconvolution/separation, cell segmentation, and quantitative single-cell IHC scoring. Leveraging a unique de novo \r\ndataset of co-registered IHC and multiplex immunofluorescence (mpIF) staining of the same slides, we segment and \r\ntranslate low-cost and prevalent IHC slides to more expensive-yet-informative mpIF images, while simultaneously \r\nproviding the essential ground truth for the superimposed brightfield IHC channels. Moreover, a new nuclear-envelop \r\nstain, LAP2beta, with high (>95%) cell coverage is introduced to improve cell delineation/segmentation and protein \r\nexpression quantification on IHC slides. By simultaneously translating input IHC images to clean/separated mpIF channels \r\nand performing cell segmentation/classification, we show that our model trained on clean IHC Ki67 data can generalize to \r\nmore noisy and artifact-ridden images as well as other nuclear and non-nuclear markers such as CD3, CD8, BCL2, BCL6, \r\nMYC, MUM1, CD10, and TP53. We thoroughly evaluate our method on publicly available benchmark datasets as well as against \r\npathologists' semi-quantitative scoring. Trained on IHC, DeepLIIF generalizes well to H&E images for out-of-the-box nuclear \r\nsegmentation.*\r\n\r\n**DeepLIIF** is deployed as a free publicly available cloud-native platform (https://deepliif.org) with Bioformats (more than 150 input formats supported) and MLOps pipeline. We also release **DeepLIIF** implementations for single/multi-GPU training, Torchserve/Dask+Torchscript deployment, and auto-scaling via Pulumi (1000s of concurrent connections supported); details can be found in our [documentation](https://nadeemlab.github.io/DeepLIIF/). **DeepLIIF** can be run locally (GPU required) by [pip installing the package](https://github.com/nadeemlab/DeepLIIF/edit/main/README.md#installing-deepliif) and using the deepliif CLI command. **DeepLIIF** can be used remotely (no GPU required) through the https://deepliif.org website, calling the [cloud API via Python](https://github.com/nadeemlab/DeepLIIF/edit/main/README.md#cloud-deployment), or via the [ImageJ/Fiji plugin](https://github.com/nadeemlab/DeepLIIF/edit/main/README.md#imagej-plugin); details for the free cloud-native platform can be found in our [CVPR'22 paper](https://arxiv.org/pdf/2204.04494.pdf).\r\n\r\n© This code is made available for non-commercial academic purposes.\r\n\r\n![overview_image](./images/overview.png)*Overview of DeepLIIF pipeline and sample input IHCs (different \r\nbrown/DAB markers -- BCL2, BCL6, CD10, CD3/CD8, Ki67) with corresponding DeepLIIF-generated hematoxylin/mpIF modalities \r\nand classified (positive (red) and negative (blue) cell) segmentation masks. (a) Overview of DeepLIIF. Given an IHC \r\ninput, our multitask deep learning framework simultaneously infers corresponding Hematoxylin channel, mpIF DAPI, mpIF \r\nprotein expression (Ki67, CD3, CD8, etc.), and the positive/negative protein cell segmentation, baking explainability \r\nand interpretability into the model itself rather than relying on coarse activation/attention maps. In the segmentation \r\nmask, the red cells denote cells with positive protein expression (brown/DAB cells in the input IHC), whereas blue cells \r\nrepresent negative cells (blue cells in the input IHC). (b) Example DeepLIIF-generated hematoxylin/mpIF modalities and \r\nsegmentation masks for different IHC markers. DeepLIIF, trained on clean IHC Ki67 nuclear marker images, can generalize \r\nto noisier as well as other IHC nuclear/cytoplasmic marker images.*\r\n\r\n## Prerequisites\r\n1. Python 3.8\r\n2. Docker\r\n\r\n## Installing `deepliif`\r\n\r\nDeepLIIF can be `pip` installed:\r\n```shell\r\n$ conda create --name deepliif_env python=3.8\r\n$ conda activate deepliif_env\r\n(deepliif_env) $ conda install -c conda-forge openjdk\r\n(deepliif_env) $ pip install deepliif\r\n```\r\n\r\nThe package is composed of two parts:\r\n1. A library that implements the core functions used to train and test DeepLIIF models. \r\n2. A CLI to run common batch operations including training, batch testing and Torchscipt models serialization.\r\n\r\nYou can list all available commands:\r\n\r\n```\r\n(venv) $ deepliif --help\r\nUsage: deepliif [OPTIONS] COMMAND [ARGS]...\r\n\r\nOptions:\r\n  --help  Show this message and exit.\r\n\r\nCommands:\r\n  prepare-testing-data   Preparing data for testing\r\n  serialize              Serialize DeepLIIF models using Torchscript\r\n  test                   Test trained models\r\n  train                  General-purpose training script for multi-task...\r\n```\r\n\r\n## Training Dataset\r\nFor training, all image sets must be 512x512 and combined together in 3072x512 images (six images of size 512x512 stitched\r\ntogether horizontally).\r\nThe data need to be arranged in the following order:\r\n```\r\nXXX_Dataset \r\n    ├── train\r\n    └── val\r\n```\r\nWe have provided a simple function in the CLI for preparing data for training.\r\n\r\n* **To prepare data for training**, you need to have the image dataset for each image (including IHC, Hematoxylin Channel, mpIF DAPI, mpIF Lap2, mpIF marker, and segmentation mask) in the input directory.\r\nEach of the six images for a single image set must have the same naming format, with only the name of the label for the type of image differing between them.  The label names must be, respectively: IHC, Hematoxylin, DAPI, Lap2, Marker, Seg.\r\nThe command takes the address of the directory containing image set data and the address of the output dataset directory.\r\nIt first creates the train and validation directories inside the given output dataset directory.\r\nIt then reads all of the images in the input directory and saves the combined image in the train or validation directory, based on the given `validation_ratio`.\r\n```\r\ndeepliif prepare-training-data --input-dir /path/to/input/images\r\n                               --output-dir /path/to/output/images\r\n                               --validation-ratio 0.2\r\n```\r\n\r\n## Training\r\nTo train a model:\r\n```\r\ndeepliif train --dataroot /path/to/input/images \r\n                --name Model_Name \r\n```\r\nor\r\n```\r\npython train.py --dataroot /path/to/input/images \r\n                --name Model_Name \r\n```\r\n\r\n* To view training losses and results, open the URL http://localhost:8097. For cloud servers replace localhost with your IP.\r\n* Epoch-wise intermediate training results are in `DeepLIIF/checkpoints/Model_Name/web/index.html`.\r\n* Trained models will be by default be saved in `DeepLIIF/checkpoints/Model_Name`.\r\n* Training datasets can be downloaded [here](https://zenodo.org/record/4751737#.YKRTS0NKhH4).\r\n\r\n**DP**: To train a model you can use DP. DP is single-process. It means that **all the GPUs you want to use must be on the same machine** so that they can be included in the same process - you cannot distribute the training across multiple GPU machines, unless you write your own code to handle inter-node (node = machine) communication.\r\nTo split and manage the workload for multiple GPUs within the same process, DP uses multi-threading. \r\nYou can find more information on DP [here](https://github.com/nadeemlab/DeepLIIF/blob/main/Multi-GPU%20Training.md).\r\n\r\nTo train a model with DP (Example with 2 GPUs (on 1 machine)):\r\n```\r\ndeepliif train --dataroot <data_dir> --batch-size 6 --gpu-ids 0 --gpu-ids 1\r\n```\r\nNote that `batch-size` is defined per process. Since DP is a single-process method, the `batch-size` you set is the **effective** batch size.\r\n\r\n**DDP**: To train a model you can use DDP. DDP usually spawns multiple processes. \r\n**DeepLIIF's code follows the PyTorch recommendation to spawn 1 process per GPU** ([doc](https://github.com/pytorch/examples/blob/master/distributed/ddp/README.md#application-process-topologies)). If you want to assign multiple GPUs to each process, you will need to make modifications to DeepLIIF's code (see [doc](https://pytorch.org/tutorials/intermediate/ddp_tutorial.html#combine-ddp-with-model-parallelism)).\r\nDespite all the benefits of DDP, one drawback is the extra GPU memory needed for dedicated CUDA buffer for communication. See a short discussion [here](https://discuss.pytorch.org/t/do-dataparallel-and-distributeddataparallel-affect-the-batch-size-and-gpu-memory-consumption/97194/2). In the context of DeepLIIF, this means that there might be situations where you could use a *bigger batch size with DP* as compared to DDP, which may actually train faster than using DDP with a smaller batch size.\r\nYou can find more information on DDP [here](https://github.com/nadeemlab/DeepLIIF/blob/main/Multi-GPU%20Training.md).\r\n\r\nTo launch training using DDP on a local machine, use `deepliif trainlaunch`. Example with 2 GPUs (on 1 machine):\r\n```\r\ndeepliif trainlaunch --dataroot <data_dir> --batch-size 3 --gpu-ids 0 --gpu-ids 1 --use-torchrun \"--nproc_per_node 2\"\r\n```\r\nNote that\r\n1. `batch-size` is defined per process. Since DDP is a single-process method, the `batch-size` you set is the batch size for each process, and the **effective** batch size will be `batch-size` multiplied by the number of processes you started. In the above example, it will be 3 * 2 = 6.\r\n2. You still need to provide **all GPU ids to use** to the training command. Internally, in each process DeepLIIF picks the device using `gpu_ids[local_rank]`. If you provide `--gpu-ids 2 --gpu-ids 3`, the process with local rank 0 will use gpu id 2 and that with local rank 1 will use gpu id 3. \r\n3. `-t 3 --log_dir <log_dir>` is not required, but is a useful setting in `torchrun` that saves the log from each process to your target log directory. For example:\r\n```\r\ndeepliif trainlaunch --dataroot <data_dir> --batch-size 3 --gpu-ids 0 --gpu-ids 1 --use-torchrun \"-t 3 --log_dir <log_dir> --nproc_per_node 2\"\r\n```\r\n4. If your PyTorch is older than 1.10, DeepLIIF calls `torch.distributed.launch` in the backend. Otherwise, DeepLIIF calls `torchrun`.\r\n\r\n## Serialize Model\r\nThe installed `deepliif` uses Dask to perform inference on the input IHC images.\r\nBefore running the `test` command, the model files must be serialized using Torchscript.\r\nTo serialize the model files:\r\n```\r\ndeepliif serialize --models-dir /path/to/input/model/files\r\n                   --output-dir /path/to/output/model/files\r\n```\r\n* By default, the model files are expected to be located in `DeepLIIF/model-server/DeepLIIF_Latest_Model`.\r\n* By default, the serialized files will be saved to the same directory as the input model files.\r\n\r\n## Testing\r\nTo test the model:\r\n```\r\ndeepliif test --input-dir /path/to/input/images \r\n              --output-dir /path/to/output/images \r\n              --model-dir path/to/the/serialized/model\r\n              --tile-size 512\r\n```\r\nor\r\n```\r\npython test.py --dataroot /path/to/input/images \r\n               --name Model_Name  \r\n```\r\n* The latest version of the pretrained models can be downloaded [here](https://zenodo.org/record/4751737#.YKRTS0NKhH4).\r\n* Before running test on images, the model files must be serialized as described above.\r\n* The serialized model files are expected to be located in `DeepLIIF/model-server/DeepLIIF_Latest_Model`.\r\n* The test results will be saved to the specified output directory, which defaults to the input directory.\r\n* The default tile size is 512.\r\n* Testing datasets can be downloaded [here](https://zenodo.org/record/4751737#.YKRTS0NKhH4).\r\n\r\n**Whole Slide Image (WSI) Inference:**  \r\nFor translation and segmentation of whole slide images, \r\nyou can simply use the same test command \r\ngiving path to the directory containing your whole slide images as the input-dir.\r\nDeepLIIF automatically reads the WSI region by region, \r\nand translate and segment each region separately and stitches the regions \r\nto create the translation and segmentation for whole slide image, \r\nthen saves all masks in the format of ome.tiff in the given output-dir. \r\nBased on the available GPU resources, the region-size can be changed.\r\n```\r\ndeepliif test --input-dir /path/to/input/images \r\n              --output-dir /path/to/output/images \r\n              --model-dir path/to/the/serialized/model\r\n              --tile-size 512\r\n              --region-size 20000\r\n```\r\n\r\nIf you prefer, it is possible to run the models using Torchserve.\r\nPlease see [the documentation](https://nadeemlab.github.io/DeepLIIF/deployment/#deploying-deepliif-with-torchserve)\r\non how to deploy the model with Torchserve and for an example of how to run the inference.\r\n\r\n## Docker\r\nWe provide a Dockerfile that can be used to run the DeepLIIF models inside a container.\r\nFirst, you need to install the [Docker Engine](https://docs.docker.com/engine/install/ubuntu/).\r\nAfter installing the Docker, you need to follow these steps:\r\n* Download the pretrained model and place them in DeepLIIF/checkpoints/DeepLIIF_Latest_Model.\r\n* Change XXX of the **WORKDIR** line in the **DockerFile** to the directory containing the DeepLIIF project. \r\n* To create a docker image from the docker file:\r\n```\r\ndocker build -t cuda/deepliif .\r\n```\r\nThe image is then used as a base. You can copy and use it to run an application. The application needs an isolated \r\nenvironment in which to run, referred to as a container.\r\n* To create and run a container:\r\n```\r\n docker run -it -v `pwd`:`pwd` -w `pwd` cuda/deepliif deepliif test --input-dir Sample_Large_Tissues\r\n```\r\nWhen you run a container from the image, the `deepliif` CLI will be available.\r\nYou can easily run any CLI command in the activated environment and copy the results from the docker container to the host.\r\n\r\n## ImageJ Plugin\r\nIf you don't have access to GPU or appropriate hardware and just want to use ImageJ to run inference, we have also created an [ImageJ plugin](https://github.com/nadeemlab/DeepLIIF/tree/main/ImageJ_Plugin) for your convenience.\r\n\r\n![DeepLIIF ImageJ Demo](images/deepliif-imagej-demo.gif)\r\n\r\nThe plugin also supports submitting multiple ROIs at once:\r\n\r\n![DeepLIIF ImageJ ROI Demo](images/deepliif-imagej-roi-demo.gif)\r\n\r\n## Cloud Deployment\r\nIf you don't have access to GPU or appropriate hardware and don't want to install ImageJ, we have also created a [cloud-native DeepLIIF deployment](https://deepliif.org) with a user-friendly interface to upload images, visualize, interact, and download the final results.\r\n\r\n![DeepLIIF Website Demo](images/deepliif-website-demo-03.gif)\r\n\r\nDeepLIIF can also be accessed programmatically through an endpoint by posting a multipart-encoded request\r\ncontaining the original image file:\r\n\r\n```\r\nPOST /api/infer\r\n\r\nParameters\r\n\r\nimg (required)\r\nfile: image to run the models on\r\n\r\nresolution\r\nstring: resolution used to scan the slide (10x, 20x, 40x), defaults to 20x \r\n\r\npil\r\nboolean: if true, use PIL.Image.open() to load the image, instead of python-bioformats\r\n\r\nslim\r\nboolean: if true, return only the segmentation result image\r\n```\r\n\r\nFor example, in Python:\r\n\r\n```python\r\nimport os\r\nimport json\r\nimport base64\r\nfrom io import BytesIO\r\n\r\nimport requests\r\nfrom PIL import Image\r\n\r\n# Use the sample images from the main DeepLIIF repo\r\nimages_dir = './Sample_Large_Tissues'\r\nfilename = 'ROI_1.png'\r\n\r\nres = requests.post(\r\n    url='https://deepliif.org/api/infer',\r\n    files={\r\n        'img': open(f'{images_dir}/{filename}', 'rb')\r\n    },\r\n    # optional param that can be 10x, 20x (default) or 40x\r\n    params={\r\n        'resolution': '20x'\r\n    }\r\n)\r\n\r\ndata = res.json()\r\n\r\ndef b64_to_pil(b):\r\n    return Image.open(BytesIO(base64.b64decode(b.encode())))\r\n\r\nfor name, img in data['images'].items():\r\n    output_filepath = f'{images_dir}/{os.path.splitext(filename)[0]}_{name}.png'\r\n    with open(output_filepath, 'wb') as f:\r\n        b64_to_pil(img).save(f, format='PNG')\r\n\r\nprint(json.dumps(data['scoring'], indent=2))\r\n```\r\n\r\n## Synthetic Data Generation\r\nThe first version of DeepLIIF model suffered from its inability to separate IHC positive cells in some large clusters,\r\nresulting from the absence of clustered positive cells in our training data. To infuse more information about the\r\nclustered positive cells into our model, we present a novel approach for the synthetic generation of IHC images using\r\nco-registered data. \r\nWe design a GAN-based model that receives the Hematoxylin channel, the mpIF DAPI image, and the segmentation mask and\r\ngenerates the corresponding IHC image. The model converts the Hematoxylin channel to gray-scale to infer more helpful\r\ninformation such as the texture and discard unnecessary information such as color. The Hematoxylin image guides the\r\nnetwork to synthesize the background of the IHC image by preserving the shape and texture of the cells and artifacts in\r\nthe background. The DAPI image assists the network in identifying the location, shape, and texture of the cells to\r\nbetter isolate the cells from the background. The segmentation mask helps the network specify the color of cells based \r\non the type of the cell (positive cell: a brown hue, negative: a blue hue).\r\n\r\nIn the next step, we generate synthetic IHC images with more clustered positive cells. To do so, we change the \r\nsegmentation mask by choosing a percentage of random negative cells in the segmentation mask (called as Neg-to-Pos) and \r\nconverting them into positive cells. Some samples of the synthesized IHC images along with the original IHC image are \r\nshown below.\r\n\r\n![IHC_Gen_image](docs/training/images/IHC_Gen.jpg)*Overview of synthetic IHC image generation. (a) A training sample \r\nof the IHC-generator model. (b) Some samples of synthesized IHC images using the trained IHC-Generator model. The \r\nNeg-to-Pos shows the percentage of the negative cells in the segmentation mask converted to positive cells.*\r\n\r\nWe created a new dataset using the original IHC images and synthetic IHC images. We synthesize each image in the dataset \r\ntwo times by setting the Neg-to-Pos parameter to %50 and %70. We re-trained our network with the new dataset. You can \r\nfind the new trained model [here](https://zenodo.org/record/4751737/files/DeepLIIF_Latest_Model.zip?download=1).\r\n\r\n## Registration\r\nTo register the de novo stained mpIF and IHC images, you can use the registration framework in the 'Registration' \r\ndirectory. Please refer to the README file provided in the same directory for more details.\r\n\r\n## Contributing Training Data\r\nTo train DeepLIIF, we used a dataset of lung and bladder tissues containing IHC, hematoxylin, mpIF DAPI, mpIF Lap2, and \r\nmpIF Ki67 of the same tissue scanned using ZEISS Axioscan. These images were scaled and co-registered with the fixed IHC \r\nimages using affine transformations, resulting in 1264 co-registered sets of IHC and corresponding multiplex images of \r\nsize 512x512. We randomly selected 575 sets for training, 91 sets for validation, and 598 sets for testing the model. \r\nWe also randomly selected and manually segmented 41 images of size 640x640 from recently released [BCDataset](https://sites.google.com/view/bcdataset) \r\nwhich contains Ki67 stained sections of breast carcinoma with Ki67+ and Ki67- cell centroid annotations (for cell \r\ndetection rather than cell instance segmentation task). We split these tiles into 164 images of size 512x512; the test \r\nset varies widely in the density of tumor cells and the Ki67 index. You can find this dataset [here](https://zenodo.org/record/4751737#.YKRTS0NKhH4).\r\n\r\nWe are also creating a self-configurable version of DeepLIIF which will take as input any co-registered H&E/IHC and \r\nmultiplex images and produce the optimal output. If you are generating or have generated H&E/IHC and multiplex staining \r\nfor the same slide (de novo staining) and would like to contribute that data for DeepLIIF, we can perform \r\nco-registration, whole-cell multiplex segmentation via [ImPartial](https://github.com/nadeemlab/ImPartial), train the \r\nDeepLIIF model and release back to the community with full credit to the contributors.\r\n\r\n## Support\r\nPlease use the [Image.sc Forum](https://forum.image.sc/tag/deepliif) for discussion and questions related to DeepLIIF.\r\n\r\nBugs can be reported in the [GitHub Issues](https://github.com/nadeemlab/DeepLIIF/issues) tab.\r\n\r\n## License\r\n© [Nadeem Lab](https://nadeemlab.org/) - DeepLIIF code is distributed under **Apache 2.0 with Commons Clause** license, \r\nand is available for non-commercial academic purposes. \r\n\r\n## Acknowledgments\r\n* This code is inspired by [CycleGAN and pix2pix in PyTorch](https://github.com/junyanz/pytorch-CycleGAN-and-pix2pix).\r\n\r\n## Reference\r\nIf you find our work useful in your research or if you use parts of this code, please cite our paper:\r\n```\r\n@article{ghahremani2022deep,\r\n  title={Deep learning-inferred multiplex immunofluorescence for immunohistochemical image quantification},\r\n  author={Ghahremani, Parmida and Li, Yanyun and Kaufman, Arie and Vanguri, Rami and Greenwald, Noah and Angelo, Michael and Hollmann, Travis J and Nadeem, Saad},\r\n  journal={Nature Machine Intelligence},\r\n  volume={4},\r\n  number={4},\r\n  pages={401--412},\r\n  year={2022},\r\n  publisher={Nature Publishing Group}\r\n}\r\n\r\n@article{ghahremani2022deepliifui,\r\n  title={DeepLIIF: An Online Platform for Quantification of Clinical Pathology Slides},\r\n  author={Ghahremani, Parmida and Marino, Joseph and Dodds, Ricardo and Nadeem, Saad},\r\n  journal={Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR)},\r\n  pages={21399--21405},\r\n  year={2022}\r\n}\r\n\r\n```\r\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/nadeemlab/DeepLIIF",
    "keywords": "DeepLIIF,IHC,Segmentation,Classification",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "deepliif",
    "package_url": "https://pypi.org/project/deepliif/",
    "platform": null,
    "project_url": "https://pypi.org/project/deepliif/",
    "project_urls": {
      "Homepage": "https://github.com/nadeemlab/DeepLIIF"
    },
    "release_url": "https://pypi.org/project/deepliif/1.1.6/",
    "requires_dist": [
      "opencv-python (==4.5.3.56)",
      "torchvision (==0.10.0)",
      "scikit-image (==0.18.3)",
      "dominate (==2.6.0)",
      "numba (==0.53.1)",
      "Click (==8.0.3)",
      "requests (==2.26.0)",
      "dask (==2021.11.2)",
      "visdom (>=0.1.8.3)",
      "python-bioformats (>=4.0.6)"
    ],
    "requires_python": "",
    "summary": "DeepLIIF: Deep-Learning Inferred Multiplex Immunofluorescence for Immunohistochemical Image Quantification",
    "version": "1.1.6",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17369162,
  "releases": {
    "1.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "46dc8b6e4d7f5fc9d2872ce2acd4c8beea6bc9f5e7231c77cb2ff54a93247409",
          "md5": "f30c9aa7ee68ebee5e6bb04e534bc5eb",
          "sha256": "f1c5ac9768de9b1e8adae394749b9f5a08ff3b5585cb6eee1ad21041ffdb9e71"
        },
        "downloads": -1,
        "filename": "deepliif-1.1.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "f30c9aa7ee68ebee5e6bb04e534bc5eb",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 72979,
        "upload_time": "2022-04-26T19:38:42",
        "upload_time_iso_8601": "2022-04-26T19:38:42.957249Z",
        "url": "https://files.pythonhosted.org/packages/46/dc/8b6e4d7f5fc9d2872ce2acd4c8beea6bc9f5e7231c77cb2ff54a93247409/deepliif-1.1.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b4b633f97cc32344df9f6f0d43ff6cc447a2a6ecc05a749be88d95c205f7f4c0",
          "md5": "223d733209a059675226c9c359008c1b",
          "sha256": "8d7b70bc12bd8bae0dfcc40f9a820a9cf4c75ccb76a67cff798e823cd5a95b9d"
        },
        "downloads": -1,
        "filename": "deepliif-1.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "223d733209a059675226c9c359008c1b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 69210,
        "upload_time": "2022-04-26T19:38:44",
        "upload_time_iso_8601": "2022-04-26T19:38:44.779720Z",
        "url": "https://files.pythonhosted.org/packages/b4/b6/33f97cc32344df9f6f0d43ff6cc447a2a6ecc05a749be88d95c205f7f4c0/deepliif-1.1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0c2060b70f3c63f6faeac48d265a77bea684a7bc557ace6cc09f83966cfc2db5",
          "md5": "f8f36bdfa1241eb61bfa71c9b24e52e1",
          "sha256": "b06e8cc31b4d64377bb6d05b5f9fe559329fc17a01822b953a50cecb715e5ec3"
        },
        "downloads": -1,
        "filename": "deepliif-1.1.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "f8f36bdfa1241eb61bfa71c9b24e52e1",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 77540,
        "upload_time": "2022-06-08T16:06:19",
        "upload_time_iso_8601": "2022-06-08T16:06:19.383163Z",
        "url": "https://files.pythonhosted.org/packages/0c/20/60b70f3c63f6faeac48d265a77bea684a7bc557ace6cc09f83966cfc2db5/deepliif-1.1.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0f5858b3ec473d10c46d9ea6871f26741e90c12e168667290fac96c6fc3f72b3",
          "md5": "bc3048b482fd5a067f068f180b3c6124",
          "sha256": "bda86ff80cb8d6c45367d72a3ec5ae08e46e5fdadd7898870f097d65226dec65"
        },
        "downloads": -1,
        "filename": "deepliif-1.1.3.tar.gz",
        "has_sig": false,
        "md5_digest": "bc3048b482fd5a067f068f180b3c6124",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 69880,
        "upload_time": "2022-06-08T16:06:21",
        "upload_time_iso_8601": "2022-06-08T16:06:21.568409Z",
        "url": "https://files.pythonhosted.org/packages/0f/58/58b3ec473d10c46d9ea6871f26741e90c12e168667290fac96c6fc3f72b3/deepliif-1.1.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8ffea5500d8de893bf9931a40106187bf41f79fc6f42609346a3ccfc2905f086",
          "md5": "e121a59d7e0729b848f76aa5b8056c0f",
          "sha256": "7ccb07f07ecec2f18019a84d3b59898467eabdefca5edd39431ef60f17a79388"
        },
        "downloads": -1,
        "filename": "deepliif-1.1.5-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "e121a59d7e0729b848f76aa5b8056c0f",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 78201,
        "upload_time": "2022-08-12T23:48:47",
        "upload_time_iso_8601": "2022-08-12T23:48:47.416902Z",
        "url": "https://files.pythonhosted.org/packages/8f/fe/a5500d8de893bf9931a40106187bf41f79fc6f42609346a3ccfc2905f086/deepliif-1.1.5-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7445f9fa1ea31ecba982c2296f24170c2027b6330e41045ef1a6e1f5ddab8c14",
          "md5": "f5bca60805ad4d65f89876a093010061",
          "sha256": "ec72f72dcfd24af2785b294748c57e157e26edc2edff5a6aae7a7d1306bb3e72"
        },
        "downloads": -1,
        "filename": "deepliif-1.1.5.tar.gz",
        "has_sig": false,
        "md5_digest": "f5bca60805ad4d65f89876a093010061",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 73931,
        "upload_time": "2022-08-12T23:48:49",
        "upload_time_iso_8601": "2022-08-12T23:48:49.386722Z",
        "url": "https://files.pythonhosted.org/packages/74/45/f9fa1ea31ecba982c2296f24170c2027b6330e41045ef1a6e1f5ddab8c14/deepliif-1.1.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "71727b57822458b7595bca0a6d8036ecfef1645f509c2aa5a3dd4f403e67486b",
          "md5": "c9e67fec223e98c171fc1e2ad93cc04e",
          "sha256": "9fdd3ad82c7568191e90b89e25499d6dbfcc98ba646ee6a539a412aedf0930f8"
        },
        "downloads": -1,
        "filename": "deepliif-1.1.6-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "c9e67fec223e98c171fc1e2ad93cc04e",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 80223,
        "upload_time": "2023-03-20T20:14:40",
        "upload_time_iso_8601": "2023-03-20T20:14:40.631795Z",
        "url": "https://files.pythonhosted.org/packages/71/72/7b57822458b7595bca0a6d8036ecfef1645f509c2aa5a3dd4f403e67486b/deepliif-1.1.6-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4c80925dd193aec83236d6997e9887307db532f2957e5966b8848ca0a64d597a",
          "md5": "96ade1bee40886519de1346afa39f299",
          "sha256": "34512652787b339fe848a62d679541c7e4f1e5fed5b5a484bc9221a6f9139290"
        },
        "downloads": -1,
        "filename": "deepliif-1.1.6.tar.gz",
        "has_sig": false,
        "md5_digest": "96ade1bee40886519de1346afa39f299",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 76009,
        "upload_time": "2023-03-20T20:14:43",
        "upload_time_iso_8601": "2023-03-20T20:14:43.030594Z",
        "url": "https://files.pythonhosted.org/packages/4c/80/925dd193aec83236d6997e9887307db532f2957e5966b8848ca0a64d597a/deepliif-1.1.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "71727b57822458b7595bca0a6d8036ecfef1645f509c2aa5a3dd4f403e67486b",
        "md5": "c9e67fec223e98c171fc1e2ad93cc04e",
        "sha256": "9fdd3ad82c7568191e90b89e25499d6dbfcc98ba646ee6a539a412aedf0930f8"
      },
      "downloads": -1,
      "filename": "deepliif-1.1.6-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "c9e67fec223e98c171fc1e2ad93cc04e",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 80223,
      "upload_time": "2023-03-20T20:14:40",
      "upload_time_iso_8601": "2023-03-20T20:14:40.631795Z",
      "url": "https://files.pythonhosted.org/packages/71/72/7b57822458b7595bca0a6d8036ecfef1645f509c2aa5a3dd4f403e67486b/deepliif-1.1.6-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "4c80925dd193aec83236d6997e9887307db532f2957e5966b8848ca0a64d597a",
        "md5": "96ade1bee40886519de1346afa39f299",
        "sha256": "34512652787b339fe848a62d679541c7e4f1e5fed5b5a484bc9221a6f9139290"
      },
      "downloads": -1,
      "filename": "deepliif-1.1.6.tar.gz",
      "has_sig": false,
      "md5_digest": "96ade1bee40886519de1346afa39f299",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 76009,
      "upload_time": "2023-03-20T20:14:43",
      "upload_time_iso_8601": "2023-03-20T20:14:43.030594Z",
      "url": "https://files.pythonhosted.org/packages/4c/80/925dd193aec83236d6997e9887307db532f2957e5966b8848ca0a64d597a/deepliif-1.1.6.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}