{
  "info": {
    "author": "Randy Heydon",
    "author_email": "randy.heydon@clockworklab.net",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "=======\ndistPND \n=======\n    Build PNDs with Distutils\n\nThis project provides Distutils commands that can be used to create `PND files`_ for the `Pandora handheld`_.\n\nTwo commands are provided: gen_pxml and bdist_pnd.  gen_pxml will generate a PXML file based on information contained in the setup script and provided as options.  bdist_pnd will assemble a PND file by taking advantage of the install command.  Therefore, any options given to install (or its subcommands) in the setup.cfg will be reflected in the PND.\n\n\nInstallation\n============\n\nPython, version 2.4 to 2.7\n--------------------------\nFirst off, to use this you obviously need Python installed.  distPND has been used in Python versions 2.6 and 2.7, but should work in versions as old as 2.4 (but definitely not older than that).  No support for 3.x will be added in the forseeable future, as the Pandora doesn't yet even have it available.\n\npython setup.py install\n-----------------------\nInstall this package through the standard Python installation mechanism.  Since this is so standard, you can read more about it in the `Python package installation`_ documentation. \n\nmksquashfs/mkisofs\n------------------\nWithout these commands, distPND can still make PND directories - folders filled with files that are read by the PND system.  However, the standard way to distribute a PND is as a single file; to do that, you'll need one or both of these installed.  Most distros have mksquashfs available in a package called \"squashfs-tools\" (make sure it's version 4.0 or later); this is the preferred package format.  If you would rather use an iso-format PND, mkisofs is available in \"cdrkit\" or \"cdrtools\".\n\n\nUsing in your project\n=====================\n\nCreate the setup.py script\n--------------------------\nAgain, this is just part of the standard Python installation mechanism.  You can read about how to make a setup script in the `Python package distribution`_ documentation.  If you find you need more control over the behaviour of your setup script, you can instead use setuptools_.\n\nSpecify command-packages\n------------------------\nYour setup script must be made aware that these commands are available.  The easiest way to this is in the setup.cfg file: under the heading [global], include the line \"command-packages=distpnd\".  Alternatively, this can be specified on the command line as an option to the setup script in the form \"python setup.py --command-packages distpnd *command*\".\n\nSpecify PND-specific options\n----------------------------\nAll options can be specified in setup.cfg file under the appropriate heading.\n\nUnder the [gen_pxml] heading, you will want to specify a `standard category and subcategory`_ in the form of \"categories=Category:Subcategory\".  If a category is unspecified or non-standard, a warning will be printed.  Note that, though multiple categories and subcategories are supported, it will cause your PND to appear in multiple places in the Pandora's menu, which is weird.\n\nUnder the [bdist_pnd] heading, you will likely want to specify icon and info files (\"icon=icon.png\" and \"info=info.html\", respectively).  Both can instead be specified under the [gen_pxml] heading, but putting them here ensures they are copied into the PND.  Also, if you find gen_pxml's autogeneration too limiting, you can write your own PXML file and tell bdist_pnd to use it with \"pxml=PXML.xml\"; otherwise, bdist_pnd will call gen_pxml to create a PXML file for it to use.\n\nMany more options are available for both commands.  As with any Distutils command, all options can be viewed using \"python setup.py --help *command*\".\n\nExamples\n--------\ndistPND has been used in at least two projects so far: `The Lonely Tower`_, by the author, and Sparks_, by haltux.  Both should give you an idea of how to use distPND in your own projects.\n\n\nLimitations\n===========\ndistPND is still early and not-very-well-tested software, so it's not perfect.  Here are some of the notable limitations:\n\n* Does not respect dry-run or no-clobber.\n    No avoidance of file writing and overwriting has been coded in to bdist_pnd yet.  Fortunately, this can be worked around: by default, bdist_pnd only writes to the directories \"build\", \"build_pnd\", and \"dist\".  As long as you have nothing important stored in those folders, you need not worry about accidental overwrites.\n\n* Cross compiling is untested.\n    Though pure Python is cross-platform, extension modules written in C or Cython need to be compiled to run on the Pandora.  I think that this can be done by setting the \"compiler\" option to the build command to a cross compiler, but this is untested and inelegant.  The easiest workaround is to just compile on the Pandora itself.\n\n* No way to include external packages.\n    The Pandora, by default, includes only a few non-standard Python libraries: Pygame, PyGTK, Numeric, Cairo, DBus, and Fuse.  If your project requires any other external libraries, they have to be distributed in your PND, but it's currently not possible to make bdist_pnd pull them in.  This is a feature of setuptools_, and I hope to make distPND take advantage of it soon.\n\n* Packages cannot import each other.\n    If your project contains multiple separate packages, they will currently not be able to import each other.  If installed normally, all packages would be on the path, and therefore accessible to each other.  Many projects contain only one top-level package, and for them this issue would not appear; however, once external package installation is added, this will be a real problem.  I hope to fix this soon-ish.\n\n* data_files behaves strangely; use package_data where possible.\n    I don't fully understand the workings of the data_files option to the setup function; therefore, I don't know where in the PND those files will end up.  Files specified in package_data behave a lot more predictably, so I recommend you use those instead.\n\n\n.. _PND files: http://pandorawiki.org/PND\n.. _Pandora handheld: http://openpandora.org\n.. _Python package installation: http://docs.python.org/install\n.. _Python package distribution: http://docs.python.org/distutils\n.. _setuptools: http://packages.python.org/distribute\n.. _standard category and subcategory: http://standards.freedesktop.org/menu-spec/latest/apa.html\n.. _The Lonely Tower: http://randy.heydon.selfip.net/Programs/The%20Lonely%20Tower/V2\n.. _Sparks: http://github.com/haltux/Sparks",
    "description_content_type": null,
    "docs_url": null,
    "download_url": "UNKNOWN",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "UNKNOWN",
    "keywords": null,
    "license": "MIT",
    "maintainer": null,
    "maintainer_email": null,
    "name": "distPND",
    "package_url": "https://pypi.org/project/distPND/",
    "platform": "UNKNOWN",
    "project_url": "https://pypi.org/project/distPND/",
    "project_urls": {
      "Download": "UNKNOWN",
      "Homepage": "UNKNOWN"
    },
    "release_url": "https://pypi.org/project/distPND/0.1/",
    "requires_dist": null,
    "requires_python": null,
    "summary": "Extensions to Python's Distutils to build PND files",
    "version": "0.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 753967,
  "releases": {
    "0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e1f776afbdc8603802c1387917a9de88815ecd8b7a10866599a58eff00ffd275",
          "md5": "368bfe6063de0f506c00b86f186b8527",
          "sha256": "605a25737e739a25716f8ef0b1c28f38c6655b3d4436835856de263dd3992e22"
        },
        "downloads": -1,
        "filename": "distPND-0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "368bfe6063de0f506c00b86f186b8527",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 13184,
        "upload_time": "2010-12-06T23:46:47",
        "upload_time_iso_8601": "2010-12-06T23:46:47.902679Z",
        "url": "https://files.pythonhosted.org/packages/e1/f7/76afbdc8603802c1387917a9de88815ecd8b7a10866599a58eff00ffd275/distPND-0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "e1f776afbdc8603802c1387917a9de88815ecd8b7a10866599a58eff00ffd275",
        "md5": "368bfe6063de0f506c00b86f186b8527",
        "sha256": "605a25737e739a25716f8ef0b1c28f38c6655b3d4436835856de263dd3992e22"
      },
      "downloads": -1,
      "filename": "distPND-0.1.tar.gz",
      "has_sig": false,
      "md5_digest": "368bfe6063de0f506c00b86f186b8527",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 13184,
      "upload_time": "2010-12-06T23:46:47",
      "upload_time_iso_8601": "2010-12-06T23:46:47.902679Z",
      "url": "https://files.pythonhosted.org/packages/e1/f7/76afbdc8603802c1387917a9de88815ecd8b7a10866599a58eff00ffd275/distPND-0.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}