{
  "info": {
    "author": "",
    "author_email": "",
    "bugtrack_url": null,
    "classifiers": [
      "Framework :: Django",
      "Programming Language :: Python :: 3"
    ],
    "description": "# Django WorkOS\n\nDjango WorkOS builds on top of Django contrib auth to support a variety of login methods.\nDjango WorKOS adds support for the following login methods:\n\n1. Username/Password authentication provided by `django.contrib.auth`\n2. SSO authentication provided by [WorkOS](https://workos.com)\n3. MFA authentication provided by `django.contrib.auth` (first factor) and [WorkOS](https://workos.com) (second factor)\n4. Passwordless login (magic emails) provided by [WorkOS](https://workos.com)\n\nYou can enable one or more of the above methods.\nConfiguration is done using Login Rules. \n\n## Installing\n\n```\npip install django-workos\n```\n\n## Sample Project\nView a [sample project](sample_project/README.md) or view [demo videos](sample_project/README.md#demo-videos) here\n\n## Login Rules\n\nA login rule applies to a set of users to control their login method.\nThere is no limit to the number of login rules but only one will apply to any given user.\nLogin rules are checked in priority order - the lowest priority that applies to a given user is the login rule they will use.\nBy default, a single rule will be installed which is Username/Password which applies to all users.\n\n### Creating a login rule\n\nHere are the available settings for login rules when creating in the admin\n\n| Property Name            | Description                                                                                                                                                                                                                                                                                                                                             |\n|--------------------------|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Name                     | A human readable identifier (this can be changed at any time)                                                                                                                                                                                                                                                                                           |\n| Method                   | The login method for this rule - all rules only have a single login method.                                                                                                                                                                                                                                                                             |\n| Priority                 | If a user has multiple rules that apply the lowest priority wins                                                                                                                                                                                                                                                                                        |\n| Email Regular Expression | A regex to match on email address of user. Example to match two domains `^.+@(domain)\\.com$`                                                                                                                                                                                                                                                            |\n| Lookup Attributes        | A JSON structure to lookup a user based on attributes. Example to apply a rule for user in group ID 1 `{\"groups__in\": [1]}`. Example to apply a login rule for superusers `{\"is_superuser\": true}`. There are two special attributes `{\"has_mfa\": true}` and `{\"has_sso\": true}` which can be used to include users that have mfa or sso already setup. |\n| Connection ID            | The WorkOS connection id for SAML SSO (only used for SAML SSO)                                                                                                                                                                                                                                                                                          |\n| Organization ID          | The WorkOS organization id for SAML SSO (only used for SAML SSO). Only need either connection or org ID                                                                                                                                                                                                                                                 |                                                                                                                                  \n| Just in time creation    | Should users be able to login if they don't already have an account. If set to Matching Attributes, then any user where email regex that matches will be created. Otherwise you can include all IdP logins regardless if they have matching email/attributes.                                                                                           |\n| JIT Groups               | What groups should be assigned to a user account that is created with this rule                                                                                                                                                                                                                                                                         |\n| Saved Attributes         | What attributes should be assigned to users created with this rule. This is only used for SSO method. Example `{\"is_superuser\": true}`                                                                                                                                                                                                                  |\n| TOTP Organization Name   | The organization name used for authenticator apps. Only used for MFA. This name will appear in the authenticator app.                                                                                                                                                                                                                                   |\n\n\n## Quick start\n\n1. Add \"workos_login\" to your INSTALLED_APPS setting and make sure it is before `admin`:\n```\n    INSTALLED_APPS = [\n        'workos_login',\n        'workos_login.admin_site.AdminLoginConfig',\n        ...\n    ]\n```\n\n2. Update admin if you have `'django.contrib.admin'` in your INSTALLED_APPS replace it with `'workos_login.admin_site.AdminLoginConfig'`.\nIf you are already using a custom site admin, you should have it inherit from `workos_login.admin_site.AdminSharedLogin` which will fix the admin backdoor.\n\n3. Change your login urls from `path('accounts/', include('django.contrib.auth.urls'))`  to `path('accounts/', include('workos_login.urls'))`\n\n4. Run `python manage.py migrate` to create the needed models.\n\n5. Update your logo by creating a file called registration/logo.html and add an `img` tag.\n6. Optionally set your bootstrap location by overriding `registration/bootstrap.html` and have a single `link` tag to your bootstrap stylesheet (javascript bootstrap file is not required)\n7. If you use django-stronghold or any other framework to require logins make sure allow all `/accounts` URLs.\n\n\n## Configuration\n\nYou can customize this package with some settings that can be added to your `settings.py` file\n\n| Setting Name                  | Default                                | Description                                                                                                                                                                                                                                                              | \n|-------------------------------|----------------------------------------|--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| `WORKOS_CLIENT_ID`            | `None`                                 | Must set your WorkOS client ID either with this setting or as an env variable with the same name                                                                                                                                                                         |\n| `WORKOS_API_KEY`              | `None`                                 | Must set your WorkOS API eith with this setting or as an env variable with the same name                                                                                                                                                                                 |\n| `WORKOS_EMAIL_LOOKUP`         | `False`                                | Whether or not to allow for login by email address. It is up to the application to enforce unique lower case email addresses if this is setting is enabled                                                                                                               |\n| `WORKOS_USERNAME_LOOKUP`      | `True`                                 | Whether or not to allow for login by username. Either this or `WORKOS_EMAIL_LOOKUP` must be set (or both can be set and it will check email first)                                                                                                                       |\n| `WORKOS_SMS_MFA_TEMPLATE`     | `Your authentication code is {{code}}` | The MFA template that should be used for sending an SMS message. It must contain `{{code}}` where you want the 6 digit code to go                                                                                                                                        |\n| `WORKOS_SEND_CUSTOM_EMAIL`    | `False`                                | Controls whether or not you would like your application to send magic emails or WorkOS platform to send. If set to `False` you need to listen to `workos_send_magic_link` signal. Example can be seen in the [sample project](sample_project/custom_user/models.py#L21). |\n| `WORKOS_AUTO_UPDATE`          | `True`                                 | If using SSO should attributes (such as first name, email, custom attributes) be updated on every login? If this is `False` you will need to make sure to change attributes like email in both IdP and Django separately.                                                |\n| `WORKOS_JIT_USERNAME`         | `email`                                | What should the username be set to? Options are `email`, `idp_id` or `id` (which is the WorkOS unique ID). For more control see Template Attributes section.                                                                                                             |\n| `WORKOS_ACTIVE_USER_FILTER`   | `{'is_active': True}`                  | What is the filter to get active users? You should only need to change this if you have your own user model.                                                                                                                                                             |\n| `LOGIN_REDIRECT_URL`          | `/accounts/profile/`                   | This [standard Django setting](https://docs.djangoproject.com/en/dev/ref/settings/#login-redirect-url) is respected to control where the user will end up after login                                                                                                    |\n\n### Updating Templates\n\nIf you want to update the login page you can override `registration/login.html` to extend `registration/base_login.html` and override some blocks.\n\nExample for adding some messages before/after the form:\n\n```html\n{% extends 'registration/base_login.html' %}\n{% block before_form %}\nWelcome back! Please add your username below.\n{% endblock %}\n\n{% block after_form %}\nDon't have a login? <a href=\"{% url 'your_signup_view_name'%}\">Signup Here</a>\n{% endblock %}\n```\n\n## Logging In\ndjango-workos supports both direct login (SP login) and if using SSO - IdP login.\n\n### Using the login page\nWhen logging in directly to your Django app you will be presented with a login screen that looks like this:\n\nFor all forms of login, if a `next` query parameter is provided the user will be redirected to that URL after authenticating.\nIf `next` is not provided `LOGIN_REDIRECT_URL` setting will be used to determine where to redirect the user.\n\nOnce a username is entered django-workos will determine which rule applies for this username.\nThe next step depends on the rule that applies:\n#### Username / Password\nIf the login rule dictates username and password a password input will be presented.\nThere will also be a forgot your password link presented to allow users to reset password via email.\n\n#### Magic Email\nThe user will be redirected to `magic_link_complete.html` template and an email will be sent.\nUpon the user clicking the link in the email they will be authenticated.\n\n#### MFA\nIf MFA applies to user will be prompted for a password and must complete that flow first.\nAfter the user has provided a correct password they will be prompted to enter the second factor authentication code.\n\n#### SSO / OAuth\nIf using SSO (or MS or Google OAuth) the user will be automatically redirected to the correct login page to follow the\nstandard SP login flow. \n\n\n### SSO IdP Login\nIf using SSO the user may also login using IdP login.\nMake sure you have configured and [read about IdP login from WorkOS](https://workos.com/docs/sso/login-flows/idp-initiated-sso).\n\n#### User lookup\nIf a user has ever successfully logged in using SSO (whether IdP or SP login), django-workos will save the ID that was used to be able to assist in future lookups.\nHowever, the very first time django-workos will need to either find or create the user inside Django.\nFor IdP logins this is done by checking email address which is the most widely available way to try and find a user account.\nIf there is a single user with a case-insensitive email address match it will associate the login with the matched user.\n\n## JIT User Creation\nJust In Time (JIT) user creation happens when an SSO login rule matches a username/email but the user has not yet been created.\nThis can happen either with SP or IdP login methods.\ndjango-workos will create the user and always set the first name, last name, email and username fields.\nThe username will be formatted based on the setting `WORKOS_JIT_USERNAME`.\nYou can have more control over the username by using template attributes outlined below.\n\nAdditionally, you can set groups or other attributes to be set on the user account using JIT Groups or JIT Attributes fields in the login rule.\nJIT Attributes will follow nested related structures.\nFor instance, it is a common Django pattern to have a user profile 1-to-1 relationship with a user account.\nYou can see an example of this in the [Sample Project Profile Class](/sample_project/custom_user/models.py).\n\nIn the sample project you could have saved attributes that look like:\n```json\n{\n  \"is_staff\": true, \n  \"profile\": {\n    \"organization_name\": \"Acme Inc.\"\n  }\n}\n```\nThis would set the user as both a staff user and update the profile organization name.\n\n\n### Template attributes\nIf you want to use extended attributes that are provided by SAML you can do so using template language.\nFor instance, if organization name was sent as SAML attribute from your IdP you could replace the above example with:\n```json\n{\n  \"is_staff\": true,\n  \"profile\": {\n    \"organization_name\": \"{{profile.raw_attributes.organization_name}}\"\n  }\n}\n```\nThe only context provided is `profile` which is a dictionary of items coming from [WorkOS Profile](https://workos.com/docs/reference/sso/profile).\n#### Auto Update\nIf `WORKOS_AUTO_UPDATE` is set to `True` all template attributes will be re-evaluated at each login and will be updated.\nSo in the above example if the SAML organization name changes the user profile would get automatically updated.\nIf `WORKOS_AUTO_UPDATE` is set to `False` then only on JIT creation will the saved attributes be used.\n\n### Linking to existing objects\ndjango-workos provides the ability to link to existing objects during JIT creation.\nFor instance, if we have a foreign key from a user object to a location model we can link the two with `saved_attributes` like this:\n```json\n{\n  \"~location\": {\n    \"locationId\": \"{{profile.raw_attributes.locationUuid}}\"\n  },\n  \"location\": {\n    \"address\": \"{{profile.raw_attributes.locationAddress}}\" \n  }\n}\n```\nAny field that starts with a `~` signifies to try and do a lookup before a creation of a related object.\nThis roughly translates to:\n```python\ntry:\n    location = Location.objects.get(locationId=profile.raw_attributes.locationUuid)\n    location.address = profile.raw_attributes.locationAddress\n    user.location = location\nexcept ObjectDoesNotExist:\n    Location.object.create(\n        locationId=profile.raw_attributes.locationUuid,\n        address=profile.raw_attributes.locationAddress\n    )\n```\n\nIf you want to not create the user unless the object already exists use `!` instead of `~`.\n```json\n{\n  \"!location\": {\n    \"locationId\": \"{{profile.raw_attributes.locationUuid}}\"\n  },\n  \"location\": {\n    \"address\": \"{{profile.raw_attributes.locationAddress}}\"\n  }\n}\n```\nIn the above cause the JIT user will not be created if the `locationId` does not exist.\n\n#### Username formatting\nYou can use template attributes to set the username, for example:\n```json\n{\n  \"username\": \"{{profile.first_name}}{{profile.last_name}}\",\n  \"is_staff\": true,\n  \"profile\": {\n    \"organization_name\": \"{{profile.raw_attributes.organization_name}}\"\n  }\n}\n```\nJust make sure that whatever username you set will be unique across all your users.\n\n## Signals\ndjango-workos provides two signals your application can listen to:\n\n### workos_user_created\nListening to this signal is completely optional but may be useful if you want to do something when a new user logs in.\nThis signal is sent when a new user has been created due to a JIT user creation.\nIf you are not planning on enabling JIT you will not need to listen to this signal.\nExample:\n\n```python\nfrom workos_login.signals import workos_user_created\nfrom django.dispatch import receiver\nfrom django.core.mail import send_mail\nfrom django.conf import settings\n\n@receiver(workos_user_created)\ndef jit_user_created_handler(sender, **kwargs):\n    \"\"\"\n    Handle a magic email custom send\n    \"\"\"\n    new_user = kwargs[\"user\"]\n    workos_profile = kwargs[\"profile\"]\n    login_rule = kwargs[\"rule\"]\n    body = \"{first_name} {last_name} has just signed up.\".format(first_name=new_user.first_name, last_name=new_user.last_name)\n    send_mail(\"New user created\", body, settings.DEFAULT_FROM_EMAIL, [workos_profile[\"email\"]])\n```\n\n### workos_send_magic_link\nIf `WORKOS_SEND_CUSTOM_EMAIL` is set to `True` you must listen to this signal in order to send the email.\nExample:\n\n```python\nfrom workos_login.signals import workos_send_magic_link\nfrom django.dispatch import receiver\nfrom django.core.mail import send_mail\nfrom django.conf import settings\n\n@receiver(workos_send_magic_link)\ndef jit_user_created_handler(sender, **kwargs):\n    \"\"\"\n    Handle a magic email custom send\n    \"\"\"\n    new_user = kwargs[\"user\"]\n    magic_link = kwargs[\"link\"]\n    login_rule = kwargs[\"rule\"]\n    email = new_user.email\n    \n    body = \"Your magic link: {}\".format(magic_link)\n    send_mail(\"Your passwordless login link is ready\", body, settings.DEFAULT_FROM_EMAIL, [email])\n```\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "django,sso,workos,mfa",
    "license": "BSD 3-Clause License",
    "maintainer": "",
    "maintainer_email": "",
    "name": "django-workos",
    "package_url": "https://pypi.org/project/django-workos/",
    "platform": null,
    "project_url": "https://pypi.org/project/django-workos/",
    "project_urls": {
      "Homepage": "https://github.com/surefyresystems/django-workos"
    },
    "release_url": "https://pypi.org/project/django-workos/0.4.8/",
    "requires_dist": [
      "workos (==1.21)"
    ],
    "requires_python": ">=3.7",
    "summary": "Enabling SSO, MFA and passwordless login for Django projects by using WorkOS.",
    "version": "0.4.8",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17057231,
  "releases": {
    "0.4.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7d459b0d0bc11fee66b8ec441aa29d952a65bcc798900a7f6863390891076e51",
          "md5": "633adc5b42505b92531deaf2976f7865",
          "sha256": "93b1c26623d3cbdc59ee738db989dc9184a718f60b0482a80073f82e89214ed4"
        },
        "downloads": -1,
        "filename": "django_workos-0.4.6-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "633adc5b42505b92531deaf2976f7865",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 49126,
        "upload_time": "2023-02-22T23:07:47",
        "upload_time_iso_8601": "2023-02-22T23:07:47.278682Z",
        "url": "https://files.pythonhosted.org/packages/7d/45/9b0d0bc11fee66b8ec441aa29d952a65bcc798900a7f6863390891076e51/django_workos-0.4.6-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "24c562e12eb894b9ea1aa32b7c01294281372fa7dd76efa16f5656a09042d427",
          "md5": "ef82a55415b3a4daddd992ecfb5da8e9",
          "sha256": "62cb8dfa6495c02418511789659bc5d1b8efa4f8618ccd0ffcd87d5da3611ecb"
        },
        "downloads": -1,
        "filename": "django-workos-0.4.6.tar.gz",
        "has_sig": false,
        "md5_digest": "ef82a55415b3a4daddd992ecfb5da8e9",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 34344,
        "upload_time": "2023-02-22T23:07:48",
        "upload_time_iso_8601": "2023-02-22T23:07:48.776279Z",
        "url": "https://files.pythonhosted.org/packages/24/c5/62e12eb894b9ea1aa32b7c01294281372fa7dd76efa16f5656a09042d427/django-workos-0.4.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.4.7": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1359c1f66a16c861917fdacaeab17d54015fa86f3b614022b765453cc7faf471",
          "md5": "961f3a6c6f5812d23af613e3064dea99",
          "sha256": "43e0e729cb41a4803040b288a609a9a62a0bae1fc38f6450680c781620858040"
        },
        "downloads": -1,
        "filename": "django_workos-0.4.7-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "961f3a6c6f5812d23af613e3064dea99",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 49546,
        "upload_time": "2023-02-23T07:28:29",
        "upload_time_iso_8601": "2023-02-23T07:28:29.515530Z",
        "url": "https://files.pythonhosted.org/packages/13/59/c1f66a16c861917fdacaeab17d54015fa86f3b614022b765453cc7faf471/django_workos-0.4.7-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f0c882e534069fb8b7ae0ac259e2f91798833bf571fa7e799965ced9204131bd",
          "md5": "782b96f6c5c8d93a8f98a9fa3068f6d1",
          "sha256": "e83dee8706f31c03270dcd3d62f28848b450d960ee06a80a099a92188bdcd602"
        },
        "downloads": -1,
        "filename": "django-workos-0.4.7.tar.gz",
        "has_sig": false,
        "md5_digest": "782b96f6c5c8d93a8f98a9fa3068f6d1",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 34888,
        "upload_time": "2023-02-23T07:28:31",
        "upload_time_iso_8601": "2023-02-23T07:28:31.124891Z",
        "url": "https://files.pythonhosted.org/packages/f0/c8/82e534069fb8b7ae0ac259e2f91798833bf571fa7e799965ced9204131bd/django-workos-0.4.7.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.4.8": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "91e7a8f199910fc2fb56fe86398d078fdf1dd0b647ba431e2bd82d4f5812c40e",
          "md5": "f9037f53a4e25647d9b351dd887c14e6",
          "sha256": "420aece17b839c3ec11a4a284ec568a21a656f15a206184dc29ab884c32c3267"
        },
        "downloads": -1,
        "filename": "django_workos-0.4.8-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "f9037f53a4e25647d9b351dd887c14e6",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 53986,
        "upload_time": "2023-02-27T00:56:05",
        "upload_time_iso_8601": "2023-02-27T00:56:05.655520Z",
        "url": "https://files.pythonhosted.org/packages/91/e7/a8f199910fc2fb56fe86398d078fdf1dd0b647ba431e2bd82d4f5812c40e/django_workos-0.4.8-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f7b0794edb35c0f406bfdbbdf17fd45e365c7d8aeb48bc1b95bee2fed98d7903",
          "md5": "3a259573d1207a411fc7a23b8aa1e18e",
          "sha256": "adc853bc77a798cf7f5d129e9a6622738d85c2904e2abba3cb12f811a70847a4"
        },
        "downloads": -1,
        "filename": "django-workos-0.4.8.tar.gz",
        "has_sig": false,
        "md5_digest": "3a259573d1207a411fc7a23b8aa1e18e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 36213,
        "upload_time": "2023-02-27T00:56:07",
        "upload_time_iso_8601": "2023-02-27T00:56:07.585026Z",
        "url": "https://files.pythonhosted.org/packages/f7/b0/794edb35c0f406bfdbbdf17fd45e365c7d8aeb48bc1b95bee2fed98d7903/django-workos-0.4.8.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "91e7a8f199910fc2fb56fe86398d078fdf1dd0b647ba431e2bd82d4f5812c40e",
        "md5": "f9037f53a4e25647d9b351dd887c14e6",
        "sha256": "420aece17b839c3ec11a4a284ec568a21a656f15a206184dc29ab884c32c3267"
      },
      "downloads": -1,
      "filename": "django_workos-0.4.8-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "f9037f53a4e25647d9b351dd887c14e6",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.7",
      "size": 53986,
      "upload_time": "2023-02-27T00:56:05",
      "upload_time_iso_8601": "2023-02-27T00:56:05.655520Z",
      "url": "https://files.pythonhosted.org/packages/91/e7/a8f199910fc2fb56fe86398d078fdf1dd0b647ba431e2bd82d4f5812c40e/django_workos-0.4.8-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "f7b0794edb35c0f406bfdbbdf17fd45e365c7d8aeb48bc1b95bee2fed98d7903",
        "md5": "3a259573d1207a411fc7a23b8aa1e18e",
        "sha256": "adc853bc77a798cf7f5d129e9a6622738d85c2904e2abba3cb12f811a70847a4"
      },
      "downloads": -1,
      "filename": "django-workos-0.4.8.tar.gz",
      "has_sig": false,
      "md5_digest": "3a259573d1207a411fc7a23b8aa1e18e",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7",
      "size": 36213,
      "upload_time": "2023-02-27T00:56:07",
      "upload_time_iso_8601": "2023-02-27T00:56:07.585026Z",
      "url": "https://files.pythonhosted.org/packages/f7/b0/794edb35c0f406bfdbbdf17fd45e365c7d8aeb48bc1b95bee2fed98d7903/django-workos-0.4.8.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}