{
  "info": {
    "author": "",
    "author_email": "dnadiffusion <dnadiffusion@pinellolab.org>",
    "bugtrack_url": null,
    "classifiers": [
      "Programming Language :: Python :: 3 :: Only"
    ],
    "description": "# DNA Diffusion\n\n<img src='https://raw.githubusercontent.com/pinellolab/DNA-Diffusion/main/docs/images/diff_first_lossy.gif?inline=true'> </img>\n\n<p align=\"center\">\n    <em>Generative modeling of regulatory DNA sequences with diffusion probabilistic models.</em>\n</p>\n\n[![build](https://github.com/pinellolab/DNA-Diffusion/workflows/Build/badge.svg)](https://github.com/pinellolab/DNA-Diffusion/actions)\n[![codecov](https://codecov.io/gh/pinellolab/DNA-Diffusion/branch/main/graph/badge.svg)](https://codecov.io/gh/pinellolab/DNA-Diffusion)\n[![PyPI version](https://badge.fury.io/py/dnadiffusion.svg?kill_cache=1)](https://badge.fury.io/py/dnadiffusion)\n\n---\n\n**Documentation**: <a href=\"https://pinellolab.github.io/DNA-Diffusion\" target=\"_blank\">https://pinellolab.github.io/DNA-Diffusion</a>\n\n**Source Code**: <a href=\"https://github.com/pinellolab/DNA-Diffusion\" target=\"_blank\">https://github.com/pinellolab/DNA-Diffusion</a>\n\n---\n\n\n\n## Abstract\n\nThe Human Genome Project has laid bare the DNA sequence of the entire human genome, revealing the blueprint for tens of thousands of genes involved in a plethora of biological process and pathways.\nIn addition to this (coding) part of the human genome, DNA contains millions of non-coding elements involved in the regulation of said genes.\n\nSuch regulatory elements control the expression levels of genes, in a way that is, at least in part, encoded in their primary genomic sequence.\nMany human diseases and disorders are the result of genes being misregulated.\nAs such, being able to control the behavior of such elements, and thus their effect on gene expression, offers the tantalizing opportunity of correcting disease-related misregulation.\n\nAlthough such cellular programming should in principle be possible through changing the sequence of regulatory elements, the rules for doing so are largely unknown.\nA number of experimental efforts have been guided by preconceived notions and assumptions about what constitutes a regulatory element, essentialy resulting in a \"trial and error\" approach.\n\nHere, we instead propose to use a large-scale data-driven approach to learn and apply the rules underlying regulatory element sequences, applying the latest generative modelling techniques.\n\n## Introduction and Prior Work\n\nThe goal of this project is to investigate the application and adaptation of recent diffusion models (see https://lilianweng.github.io/posts/2021-07-11-diffusion-models/ for a nice intro and references) to genomics data. Diffusion models are powerful models that have been used for image generation (e.g. stable diffusion, DALL-E), music generation (recent version of the magenta project) with outstanding results.\nA particular model formulation called \"guided\" diffusion allows to bias the generative process toward a particular direction if during training a text or continuous/discrete labels are provided. This allows the creation of \"AI artists\" that, based on a text prompt, can create beautiful and complex images (a lot of examples here: https://www.reddit.com/r/StableDiffusion/).\n\nSome groups have reported the possibility of generating synthetic DNA regulatory elements in a context-dependent system, for example, cell-specific enhancers.\n(https://elifesciences.org/articles/41279 ,\nhttps://www.biorxiv.org/content/10.1101/2022.07.26.501466v1)\n\n### Step 1: generative model\n\nWe propose to develop models that can generate cell type specific or context specific DNA-sequences with certain regulatory properties based on an input text prompt.\nFor example:\n\n-   \"A sequence that will correspond to open (or closed) chromatin in cell type X\"\n\n-   \"A sequence that will activate a gene to its maximum expression level in cell type X\"\n\n-   \"A sequence active in cell type X that contains binding site(s) for the transcription factor Y\"\n\n-   \"A sequence that activates a gene in liver and heart, but not in brain\"\n\n### Step 2: extensions and improvements\n\nBeyond individual regulatory elements, so called \"Locus Control Regions\" are known to harbour multiple regulatory elements in specific configurations, working in concert to result in more complex regulatory rulesets. Having parallels with \"collaging\" approaches, in which multiple stable diffusion steps are combined into one final (graphical) output, we want to apply this notion to DNA sequences with the goal of designing larger regulatory loci. This is a particularly exciting and, to our knowledge, hitherto unexplored direction.\n\nBesides synthetic DNA creations, a diffusion model can help understand and interpret regulatory sequence element components and for instance be a valuable tool for studying single nucleotide variations (https://www.biorxiv.org/content/10.1101/2022.08.22.504706v1) and evolution.\n(https://genomebiology.biomedcentral.com/articles/10.1186/s13059-018-1502-5)\n\nTaken together, we believe our work can accelerate our understanding of the intrinsic properties of DNA-regulatory sequence in normal development and different diseases.\n\n## Proposed framework\n\nFor this work we propose to build a Bit Diffusion model based on the formulation proposed by Chen, Zhang and Hinton https://arxiv.org/abs/2208.04202. This model is a generic approach for generating discrete data with continuous diffusion models. An implementation of this approach already exists, and this is a potential code base to build upon:\n\nhttps://github.com/lucidrains/bit-diffusion\n\n## Tasks and potential roadmap:\n\n-   Collecting genomic datasets\n-   Implementing the guided diffusion based on the code base\n-   Thinking about the best encoding of biological information for the guided diffusion (e.g. cell type: K562, very strong activating sequence for chromatin, or cell type: GM12878, very open chromatin)\n-   Plans for validation based on existing datasets or how to perform new biological experiments (we need to think about potential active learning strategies).\n\n## Deliverables\n\n-   **Dataset:** compile and provide a complete database of cell-specific regulatory regions (DNAse assay) to allow scientists to train and generate different diffusion models based on the regulatory sequences.\n\n-   **Models:** Provide a model that can generate regulatory sequences given a specific cell type and genomic context.\n\n-   **API:** Provide an API to make it possible to manipulate DNA regulatory models and a visual playground to generate synthetic contextual sequences.\n\n## Datasets\n\n### DHS Index:\n\nChromatin (DNA + associated proteins) that is actively used for the regulation of genes (i.e. \"regulatory elements\") is typically accessible to DNA-binding proteins such as transcription factors ([review](https://www.nature.com/articles/s41576-018-0089-8), [relevant paper](https://www.nature.com/articles/nature11232)).\nThrough the use of a technique called [DNase-seq](https://en.wikipedia.org/wiki/DNase-Seq), we've measured which parts of the genome are accessible across 733 human biosamples encompassing 438 cell and tissue types and states, resulting in more than 3.5 million DNase Hypersensitive Sites (DHSs).\nUsing Non-Negative Matrix Factorization, we've summarized these data into 16 _components_, each corresponding to a different cellular context (e.g. 'cardiac', 'neural', 'lymphoid').\n\nFor the efforts described in this proposal, and as part of an earlier [ongoing project](https://www.meuleman.org/research/synthseqs/) in the research group of Wouter Meuleman,\nwe've put together smaller subsets of these data that can be used to train models to generate synthetic sequences for each NMF component.\n\nPlease find these data, along with a data dictionary, [here](https://www.meuleman.org/research/synthseqs/#material).\n\n### Other potential datasets:\n\n-   DNA-sequences data corresponding to annotated regulatory sequences such as gene promoters or distal regulatory sequences such as enhancers annotated (based on chromatin marks or accessibility) for hundreds of cells by the NHGRI funded projects like ENCODE or Roadmap Epigenomics.\n\n-   Data from MPRA assays that test the regulatory potential of hundred of DNA sequences in parallel (https://elifesciences.org/articles/69479.pdf , https://www.nature.com/articles/s41588-021-01009-4 , ... )\n\n-   MIAA assays that test the ability of open chromatin within a given cell type.\n\n## Models\n\n## Input modality:\n\n    A) Cell type + regulatory element ex: Brain tumor cell weak Enhancer\n    B) Cell type + regulatory elements + TF combination (presence or absence) Ex: Prostate cell, enhancer , AR(present), TAFP2a (present) and ER (absent),\n    C) Cell type + TF combination + TF positions Ex: Blood Stem cell GATA2(presence) and ER(absent) + GATA1 (100-108)\n    D) Sequencing having a GENETIC VARIANT -> low number diffusion steps = nucleotide importance prediction\n\n### Output:\n\n    \tDNA-sequence\n\n**Model size:**\nThe number of enhancers and biological sequences isn’t bigger than the number of available images on the Lion dataset. The dimensionality of our generated DNA outputs should not be longer than 4 bases [A,C,T,G] X ~1kb. The final models should be bigger than ~2 GB.\n\n**Models:**\nDifferent models can be created based on the total sequence length.\n\n## APIs\n\nTBD depending on interest\n\n## Paper\n\n**Can the project be turned into a paper? What does the evaluation process for such a paper look like? What conferences are we targeting? Can we release a blog post as well as the paper?**\n\nYes, We intend to have a mix of our in silico generations and experimental validations to study our models' performance on classic regulatory systems ( ex: Sickle cell and Cancer).\nOur group and collaborators present a substantial reputation in the academic community and different publications in high-impact journals, such as Nature and Cell.\n\n## Resources Requirements\n\n**What kinds of resources (e.g. GPU hours, RAM, storage) are needed to complete the project?**\n\nOur initial model can be trained with small datasets (~1k sequences) in about 3 hours ( ~500 epochs) on a colab PRO (24GB ram ) single GPU Tesla K80. Based on this we expect that to train this or similar models on the large dataset mentioned above ( ~3 million sequences (4x200) we will need several high-performant GPUs for about 3 months. ( Optimization suggestions are welcome!)\n\n## Timeline\n\n**What is a (rough) timeline for this project?**\n\n6 months to 1 year.\n\n## Broader Impact\n\n**How is the project expected to positively impact biological research at large?**\n\nWe believe this project will help to better understand genomic regulatory sequences: their composition and the potential regulators acting on them in different biological contexts and with the potential to create therapeutics based on this knowledge.\n\n## Reproducibility\n\nWe will use best practices to make sure our code is reproducible and with versioning. We will release data processing scripts and conda environments/docker to make sure other researchers can easily run it.\n\nWe have several assays and technologies to test the synthetic sequences generated by these models at scale based on CRISPR genome editing or massively parallel reporter assays (MPRA).\n\n## Failure Case\n\nRegardless of the performance of the final models, we believe it is important to test diffusion models on novel domains and other groups can build on top of our investigations.\n\n## Preliminary Findings\n\nUsing the Bit Diffusion model we were able to reconstruct 200 bp sequences that presented very similar motif composition to those trained sequences. The plan is to add the cell conditional variables to the model to check how different regulatory regions depend on the cell-specific context.\n\n## Next Steps\n\nExpand the model length to generate complete regulatory regions (enhancers + Gene promoter pairs)\nUse our synthetic enhancers on in-vivo models and check how they can regulate the transcriptional dynamics in biological scenarios (Besides the MPRA arrays).\n\n## How to contribute\n\nIf this project sounds exciting to you, **please join us**!\nJoin the OpenBioML discord: https://discord.gg/Y9CN2dUzQJ, we are discussing this project in the **dna-diffusion** channel and we will provide instructions on how to get involved.\n\n## Known contributors\n\nYou can access the contributor list [here](https://docs.google.com/spreadsheets/d/1_nxDI6DIoWbyUDpIDX-tJIILejrJ0kEYrcXXdWlzPvU/edit#gid=1871728801).\n\n## Development\n\n### Setup environment\n\nWe use [hatch](https://hatch.pypa.io/latest/install/) to manage the development environment and production build. It is often convenient to install hatch with [pipx](https://pypa.github.io/pipx/installation/).\n\n### Run unit tests\n\nYou can run all the tests with:\n\n```bash\nhatch run test\n```\n\n### Format the code\n\nExecute the following command to apply linting and check typing:\n\n```bash\nhatch run lint\n```\n\n### Publish a new version\n\nYou can check the current version with:\n\n```bash\nhatch version\n```\n\nYou can bump the version with commands such as `hatch version dev` or `patch`, `minor` or `major`. Or edit the `src/dnadiffusion/__about__.py` file. After changing the version, when you push to github, the Test Release workflow will automatically publish it on Test-PyPI and a github release will be created as a draft.\n\n## Serve the documentation\n\nYou can serve the mkdocs documentation with:\n\n```bash\nhatch run docs-serve\n```\n\nThis will automatically watch for changes in your code.",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "dnadiffusion",
    "package_url": "https://pypi.org/project/dnadiffusion/",
    "platform": null,
    "project_url": "https://pypi.org/project/dnadiffusion/",
    "project_urls": {
      "Documentation": "https://pinellolab.github.io/DNA-Diffusion",
      "Source": "https://github.com/pinellolab/DNA-Diffusion"
    },
    "release_url": "https://pypi.org/project/dnadiffusion/0.0.0.dev0/",
    "requires_dist": [
      "accelerate",
      "click",
      "einops",
      "genomepy",
      "gimmemotifs",
      "hydra-core",
      "matplotlib",
      "memory-efficient-attention-pytorch",
      "pandas",
      "pytorch-lightning",
      "seaborn",
      "sourmash",
      "torch==2.0.0",
      "torchvision",
      "wandb"
    ],
    "requires_python": ">=3.10",
    "summary": "Library for probabilistic analysis of protein-protein interaction sequencing data.",
    "version": "0.0.0.dev0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17426549,
  "releases": {
    "0.0.0.dev0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "202f82f3f130c50056883036e17dcca67a012c06b7d39f59a4f9733b742badf8",
          "md5": "495c2dfe9a5dbf994a4023132f20d63f",
          "sha256": "d97becfde9c1cc2fcae3a5bd7584da2224d072ebf15194fdb25b85840d7f484c"
        },
        "downloads": -1,
        "filename": "dnadiffusion-0.0.0.dev0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "495c2dfe9a5dbf994a4023132f20d63f",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.10",
        "size": 19077418,
        "upload_time": "2023-03-24T04:44:58",
        "upload_time_iso_8601": "2023-03-24T04:44:58.544335Z",
        "url": "https://files.pythonhosted.org/packages/20/2f/82f3f130c50056883036e17dcca67a012c06b7d39f59a4f9733b742badf8/dnadiffusion-0.0.0.dev0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "043c28e2e57380f51306234947e8c2c909eaf215ba2417b6cc40226c81e6ebf6",
          "md5": "640c8d40c6860cd9d6d768828caf9cac",
          "sha256": "db4b6e17d9efbc77d5091fe697343043be132582e6ef69f659af6d97ac65a580"
        },
        "downloads": -1,
        "filename": "dnadiffusion-0.0.0.dev0.tar.gz",
        "has_sig": false,
        "md5_digest": "640c8d40c6860cd9d6d768828caf9cac",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.10",
        "size": 45639451,
        "upload_time": "2023-03-24T04:45:03",
        "upload_time_iso_8601": "2023-03-24T04:45:03.822885Z",
        "url": "https://files.pythonhosted.org/packages/04/3c/28e2e57380f51306234947e8c2c909eaf215ba2417b6cc40226c81e6ebf6/dnadiffusion-0.0.0.dev0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "202f82f3f130c50056883036e17dcca67a012c06b7d39f59a4f9733b742badf8",
        "md5": "495c2dfe9a5dbf994a4023132f20d63f",
        "sha256": "d97becfde9c1cc2fcae3a5bd7584da2224d072ebf15194fdb25b85840d7f484c"
      },
      "downloads": -1,
      "filename": "dnadiffusion-0.0.0.dev0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "495c2dfe9a5dbf994a4023132f20d63f",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.10",
      "size": 19077418,
      "upload_time": "2023-03-24T04:44:58",
      "upload_time_iso_8601": "2023-03-24T04:44:58.544335Z",
      "url": "https://files.pythonhosted.org/packages/20/2f/82f3f130c50056883036e17dcca67a012c06b7d39f59a4f9733b742badf8/dnadiffusion-0.0.0.dev0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "043c28e2e57380f51306234947e8c2c909eaf215ba2417b6cc40226c81e6ebf6",
        "md5": "640c8d40c6860cd9d6d768828caf9cac",
        "sha256": "db4b6e17d9efbc77d5091fe697343043be132582e6ef69f659af6d97ac65a580"
      },
      "downloads": -1,
      "filename": "dnadiffusion-0.0.0.dev0.tar.gz",
      "has_sig": false,
      "md5_digest": "640c8d40c6860cd9d6d768828caf9cac",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.10",
      "size": 45639451,
      "upload_time": "2023-03-24T04:45:03",
      "upload_time_iso_8601": "2023-03-24T04:45:03.822885Z",
      "url": "https://files.pythonhosted.org/packages/04/3c/28e2e57380f51306234947e8c2c909eaf215ba2417b6cc40226c81e6ebf6/dnadiffusion-0.0.0.dev0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}