{
  "info": {
    "author": "Derek S. Prijatelj",
    "author_email": "dprijate@nd.edu",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "## Docstr : Python Docstring Parsing for Writing Once\n\nGiven properly written docstrings that would be used to create auto-docs through Sphinx, `docstr` can use those docstrings at runtime to expedite certain programming practices, such as the creation of argument and config parsers, the modular configuration of piplines of both OOP and funcitonal python components, and reduce code duplication.\n\n| :warning: WARNING! |\n|:----------------|\n| Any project that is dependent upon the resulting parsed tokens from docstr's parsing of some python object's `__doc__`s will be dependent on the content within the comments of that parsed code! The same applies to any python program that is parsed using the `docstr` CLI. This is by design, as the point is to use the doc strings to write once and reduce redundancy. Future versions may allow work arounds in certain conditions. Future versions will implement more concise and complete error messages similar to that of a compiler for debugging purposes. Support for a 3rd party linter (pylint) will be explored. |\n\n### Design Principles\n\n1. Write once\n    - reduce redundant code and make it so common and similar code does not need to be rewritten for the same functionality.\n2. Keep it simple\n    - and functional.\n3. Modularity\n    - Keep as modular as possible such that each unit may be removed, replaced, or taken and plugged into a different system.\n4. Efficiency\n    - efficient code creation and execution.\n\n#### Docstr Pipeline Use\n\n1. **Load Input** Give objects whose docstrings are to be parsed\n    - pass those objects as args to a function\n    - Decorate those objects with a docstr decorator\n    - point to those objects via namespace in a configuration file\n2. **Parse** the object's docstrings, possibly in a hierarchical fashion if multiple.\n    - dependent on docutils and sphinx for conversion of styles to rst\n    - uses regex for parsing and tokenizing the docstrings\n    - **Tokenize**: The resulting tokens of parsing\n        - [-TODO-] Syntax check the docstrings to ensure properly written\n            - may be done live during the parsing process, or afterwards.\n        - [-TODO-] Optionally syntax check the docstrings to the objects to ensure they match expectations, e.g., the args in doc are as they are expected by a function.\n        - tokenized docstrings enable colorized docstrings in editors.\n        - The tokenized objects need to be in a useful enough and general enough format that enables ease of integration into down-stream \"compile\" software, such as ([-TODO-]) pydantic for type checking, or ConfigArgParse for CLI and config parsers (done).\n        - [-TODO-] Allow for \"pre-parsed\" docstrings in the case where a docstring is from a 3rd party and is not supported by existing docstr parsing standards.\n            In config files, this can be specified in its own section.\n3. \"**Compile and Run**\": Using the tokens, setup and perform operations\n    - Command Line Interface: argparse auto creation\n    - Configuration file parser: ConfigArgParse auto creation\n        - Enables Pipeline running of code if docstr is used on a class that has a run() or main().\n            - [-TODO-] may hook into or rely upon: Dagster, ray, asyncio\n        - [-TODO-] Decorators may be applied to functions/classes in the config file\n            - this may allow for applying Ray to functions/classes.\n        - [-TODO-] Allow for configuration files to link to other config files, if so desired.\n    - [-TODO-] Meta-programming (Reflection)\n        - enabling type checking versions of the parsed code. (pydantic?)\n        - splat extension for \"write once\".\n            If docstr parsed, may automatically generate the boiler plate code based on the parsed docstring, thus reducing writing redundancy.\n                - May require linters (pylint, flake8) to acknowledge this.\n        - docstr.meta.dataclass : make any class a dataclass given correct docstring\n\n#### Prototype\n\nThe prototype provides the following features, albeit within constrained use cases as it is a prototype.\nFirst is the pipeline followed by the prototype:\n\n1. **Load Input**:\n    - When `docstr` is installed, a console script is included.\n        Exectuting `docstr path/to/a_python_program_config.yaml [arguments for the python program]`\n        will run the python program based on docstr's parsing of the docstrings and configuration file.\n        The prototype will read in the config, adjust docstr's parser settings to that under the `docstr:` options sections.\n        Parse the docstrings starting with entry object (the first python object in configuration).\n        The parsed docstring tokens will be used to make the ConfigArgParse.ArgumentParser for the python program, and then update the values using the given args and config file.\n        The program will then run with those values.\n        Look at `docstr/cli/cli.py:docstr_cap()` for the function that the `docstr` command runs.\n2. **Parse and Tokenize**\n    - Uses sphinx auto doc parsing (relying on docutils too) with napoleaon extention to support Numpy and Google docstring styles.\n    - Creates a tree of configurable objects that consists of python classes and functions. Only includes whitelisted objects to be parsed, which is currently inferred from the python namespace imports under the `docstr` section of the yaml config.\n    Note that the namespace imports expect these objects to be accessible within the current python environment.\n    - supports subclasses of dataclass and NestedTuple, albeit without unit test coverage.\n3. **Compile: ConfigArgParse Generation**\n    - Generates the ConfigArgParse (CAP) for CLI and configuration creation based on the given python program's yaml file.\n    - This is then usable to configure and run the python program through the `docstr` CLI.\n    -. **Initialize and Run**\n        - initialize the objects from the generated CAP starting from leaves going up to the root of the python program based on the given configuraiton yaml file.\n        - Once initialized, the python program will run using the entry object and the given `main` string indicator of what function/method is the main method.\n\n##### Included Specific Features\n\nThese are the specific features already included by the prototype, albeit in a limited form.\nFor all of these specific features, basic unit tests exist.\n\n- Auto-generation of a ConfigArgParser supporting CLI, config files, and env variabels (untested in prototype). The CAP provides a basic nested namespace and carries the configurable object to be instantiated.\n    - functions and class methods\n    - classes\n    - Basic linking of docstrings:\n        - recursive linking of the object as an argument of the current one being parsed will be parsed if it is included in the namespace/whitelist of the `docstr.parsing.DocstringParser`.\n        - This enables hierarchical pipelines as specified by the given config yaml file.\n    - supports reStructuredText, Google and Numpy styled docstrings\n        - Support is through Sphinx auto docs w/ napoleaon extenstion.\n- (Scuffed but it works for a single program) Hierarchical pipeline support as specified by a yaml config file\n    - This allows programmers to focus on OOP design and create their pipelines as modules to be easily sequentially chained or parallelized, and allows the programmer to avoid having to write the boiler plate commonly used in pipelines.\n    - This is nearing extra, and programmers would still be able to write the main scripts or call these functions in their own existing programs.\n    - End result would be: given a yaml config of a pipeline consisting of python objects in the active namespace who all have parsable docstrings, generate the pipeline running main script with its CLI/configuraiton parser.\n\n#### Desired Features Under Development for Version 1.0.0\n\nThe following are more desired features for a complete docstr version 1.0.0.\nThis adds more detail to what is specified in the docstr pipeline section, all of which is expected in version 1.0.0:\n\n0. **General**: [-TODO-]\n    - Comprehensive unit tests to ensure everything functions as expected.\n        - Along with basic CI/CD on github to check build status.\n    - Parallelization and Async support:\n        -  Many processes in `docstr` could be parallelized and possibly benefit from async support.\n            This is a speed-up option.\n1. **Load Input**:\n2. **Parse and Tokenize** [-TODO-]\n    - further support of parsing the docstrings of dataclasses __post_init__.\n        This is crucial.\n        - unit tests are required\n    - Need to further test and support the use of the namespace of the module an object is within, including the aliases, so `import pandas as pd` to enable `pd.DataFrame` in that module's docs and same with `import torch; nn = torch.nn`.\n    - Some cases where a docstring is either unnecessary or only partially required.\n        - by default, complete docs are desired, but in the case where the docs are out of the user's control, support for handling partial docs to run the python program should be supported and be an option able to be specified by the user.\n            - docstr configs specific to a set of modules/packages may be beneficial to support.\n        - NestedTuple inherting classes don't need to have docstrings beyond adding descriptions to the arguments/attributes, as the rest of the format is exactly the same as if it were to be parsed.\n            - (done) NestTuple is explicitly supported through duck typing.\n            - Are there other such python classes/factories that have typing w/o abc?\n    -  far more informative exception/error messages from docstr during the parsing process to inform the user exactly what file, line of code, object being parsed, and why it is an error, such as expectations of given context in parsing, and the unexpected thing found.\n        - we want the error messages to be informative enough in themselves such that the user does not have to enter a debugger to observe such things a normal compiler, even JIT python, would inform the user of.\n3. **Compile and Run** [-TODO-]\n    - Auto-generation of CAP\n        -  Support Iterable(type|MultiType), so that a type can be\n          written as `list(str|int)` for a list of strs or ints.\n            - This absolutely needs unit tested once implemented\n        - Traverse and build CAPs for the configurable objects w/in MultiTypes.\n        - Allow CAP to be generated and informed more by the config\n          when a docstring specifies a parent class, and the config gives a\n          child class that inherits from that parent and is still configurable.\n          This is a common and important use case to support.\n            - This absolutely needs unit tested once implemented\n        -  Option to ignore the docs (especially when there are none in\n          a 3rd party) and to instead be informed by the type hinting and\n          defaults used in the python declaration of the function/method.\n            - the point is to write once with docstrings, but if 3rd party's do\n              not support complete docs because they rely on the python type\n              hinting, then we should support it to for completion. All that\n              really matters is it is written once somewhere, and when we don't\n              have control over the code, we either support common trends in\n              others or allow the user wrap such objects w/ their own written\n              docstring, where the latter is a currently supported workaround\n              at the expense of the user's time.\n            - This absolutely needs unit tested once implemented\n        - doc linking, e.g., `see module.sub_module.class.method`\n            - further doc linking support is necessary with more tests.\n        - support of custom Sphinx napoleon\n            - support of custom docstring parsers through Sphinx extentions.\n        - Given an object whose doc string is fully parsed by docstr, output the template of the YAML config file to be editted.\n        - The initialized program needs to have the option (possibly defaulting to) lazy initializing, such that  when the python interpretter gets to an object it then may be instantiated from the docstr CAP and values. Especially good for code that is massive in memory post init or takes a long time and you want to only execute it once necessary.\n    - Code redundancy reduction using the docstrings:\n        - Decorator for specifying the args and kwargs of a function with format as:\n            `def func(*args, **kwargs):` to avoid redundant writing of args, defaults, etc.\n        - Notably, \"protected\" attributes may be marked as such in the docs and so the user doesn't have to write @property variable name reutrn protected \\_variable.\n    - Type Checking based on Docstrings:\n        - Decorator for optional runtime type-checking of variables values at runtime to the docstring's preset values.\n    - [-TODO-] Extra features: features that are unnecessary, but beneficial\n        - Parameter iteration and searching (possibly using `pyrameter` or `SHADHO`) to run multiple versions of the same pipeline using different parameters, either\n            - This is specifically useful to Machine Learning (ML) researchers, but may be nice for those who either want to exhaustively run variations of their pipeline or have some objective function they want to optimize over different variations of their pipeline.\n            - in ML, the pipeline and its parameter search would be entirely contained all in one yaml file, or multiple through optoinal config linking.\n                This would result in a straightforward overview of the ML experiment pipeline, easily swapped with existing modules written in code as classes.\n        - Possibly rely upon Apache AirFlow DAG for the pipelining.\n            - `dag-factory` : AirFlow extension to make dynamic\n            - alternative to AirFlow is `dagster`\n\n### Verisoning\n\nDocstr uses [Semantic Versioning 2.0.0](https://semver.org/spec/v2.0.0.html).\nDocstr's version will remain < 1.0.0 until adequate unit test coverage exists.\n\n### License\n\nThe docstr project is licensed under the MIT license, which is provided in LICENSE.txt\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/prijatelj/docstr",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "docstr",
    "package_url": "https://pypi.org/project/docstr/",
    "platform": null,
    "project_url": "https://pypi.org/project/docstr/",
    "project_urls": {
      "Homepage": "https://github.com/prijatelj/docstr"
    },
    "release_url": "https://pypi.org/project/docstr/0.0.2/",
    "requires_dist": [
      "PyYAML",
      "docutils",
      "Sphinx",
      "ConfigArgParse"
    ],
    "requires_python": ">=3.7",
    "summary": "Docstring parsing for generating argument and config parsers and expediting the common coding processes.",
    "version": "0.0.2",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 15306983,
  "releases": {
    "0.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1559f7674611afe4534200cbeeed317e5975f4ac47da83b1e6665da6ce35c69e",
          "md5": "8500afafa6141b9027e260c35a565119",
          "sha256": "f7737d528d2a4254c06803b8468b213a120381aee23f67c517eaf4b09ef7b9c2"
        },
        "downloads": -1,
        "filename": "docstr-0.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "8500afafa6141b9027e260c35a565119",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 2622,
        "upload_time": "2021-03-24T19:43:58",
        "upload_time_iso_8601": "2021-03-24T19:43:58.301613Z",
        "url": "https://files.pythonhosted.org/packages/15/59/f7674611afe4534200cbeeed317e5975f4ac47da83b1e6665da6ce35c69e/docstr-0.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5396171759179d77741e3f939100a50720d5561e0c7f01d08585a0b53c483ded",
          "md5": "6216a8c063aba818e39b3fe6e898d51f",
          "sha256": "77bd766d3deb2c593c47d08f74d2dbc0dc46995611c3bb18d10365d5876f91c1"
        },
        "downloads": -1,
        "filename": "docstr-0.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "6216a8c063aba818e39b3fe6e898d51f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 1786,
        "upload_time": "2021-03-24T19:43:59",
        "upload_time_iso_8601": "2021-03-24T19:43:59.645213Z",
        "url": "https://files.pythonhosted.org/packages/53/96/171759179d77741e3f939100a50720d5561e0c7f01d08585a0b53c483ded/docstr-0.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "90937dfb8194ba020e5f8967d12192abe641ca398b50132afcaef7c6c1ec2e83",
          "md5": "426b764fe941c9029d090743fe41cc69",
          "sha256": "7471d39ceffc74ce323fa2effae3d99a614212cb2ddf1764c33215c07c20e16b"
        },
        "downloads": -1,
        "filename": "docstr-0.0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "426b764fe941c9029d090743fe41cc69",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 40652,
        "upload_time": "2022-04-25T18:41:26",
        "upload_time_iso_8601": "2022-04-25T18:41:26.341441Z",
        "url": "https://files.pythonhosted.org/packages/90/93/7dfb8194ba020e5f8967d12192abe641ca398b50132afcaef7c6c1ec2e83/docstr-0.0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "650ebadf146dc49b9ffedb2b0da946b7d85f4f0379163ef57a7f14e913ed8874",
          "md5": "11363b22e5c2ecf933fcd82d6daf864a",
          "sha256": "130b768c95579e8fe5f6e7f85146ab30265f0474d0a56f329edacc33078c9804"
        },
        "downloads": -1,
        "filename": "docstr-0.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "11363b22e5c2ecf933fcd82d6daf864a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 54474,
        "upload_time": "2022-04-25T18:41:28",
        "upload_time_iso_8601": "2022-04-25T18:41:28.201888Z",
        "url": "https://files.pythonhosted.org/packages/65/0e/badf146dc49b9ffedb2b0da946b7d85f4f0379163ef57a7f14e913ed8874/docstr-0.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.2rc0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9c18e06cb3ede9a03c92a77f21a3437bde4e5402235c4bd347e8f1b7696fae59",
          "md5": "bf31035358ad24478393d66e36dfff54",
          "sha256": "c69c42d4d7945f984976bafb3a57b163611ea2d807eb8853c78056b8c74fa8a3"
        },
        "downloads": -1,
        "filename": "docstr-0.0.2rc0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "bf31035358ad24478393d66e36dfff54",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 14118,
        "upload_time": "2022-04-25T17:11:35",
        "upload_time_iso_8601": "2022-04-25T17:11:35.293374Z",
        "url": "https://files.pythonhosted.org/packages/9c/18/e06cb3ede9a03c92a77f21a3437bde4e5402235c4bd347e8f1b7696fae59/docstr-0.0.2rc0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a377e0fdeb432d827e4fd6d561e3ee11348e29f4285dc9ce94fb41ea20a31bb6",
          "md5": "ef8b24040c8435bb13d46241218b8f46",
          "sha256": "64682be8798c9718745a91158c8d82135a45080d961e22c5ef5b7d36064199f5"
        },
        "downloads": -1,
        "filename": "docstr-0.0.2rc0.tar.gz",
        "has_sig": false,
        "md5_digest": "ef8b24040c8435bb13d46241218b8f46",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 53963,
        "upload_time": "2022-04-25T17:11:37",
        "upload_time_iso_8601": "2022-04-25T17:11:37.289706Z",
        "url": "https://files.pythonhosted.org/packages/a3/77/e0fdeb432d827e4fd6d561e3ee11348e29f4285dc9ce94fb41ea20a31bb6/docstr-0.0.2rc0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.2rc1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "eacb477df7182d4bcb8b86d979a70bb6c94ef3ed4bb87cca5b56126bf9117e78",
          "md5": "a3f3477cc0544125417496e732d315df",
          "sha256": "ee0d49925bf15af484d6cad418f5b93bb1548c52ae9fee6fd68596316ce6c3c0"
        },
        "downloads": -1,
        "filename": "docstr-0.0.2rc1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "a3f3477cc0544125417496e732d315df",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 14263,
        "upload_time": "2022-04-25T17:47:57",
        "upload_time_iso_8601": "2022-04-25T17:47:57.871611Z",
        "url": "https://files.pythonhosted.org/packages/ea/cb/477df7182d4bcb8b86d979a70bb6c94ef3ed4bb87cca5b56126bf9117e78/docstr-0.0.2rc1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "163d971a6ced32f575f410c23a7fc9a3573f351fc042da3f784d7ccce3820a54",
          "md5": "fda0efe1eda01e80cb80f894ab8cff68",
          "sha256": "fb11c0f02dab2ec681b9e5b1ba49757a9a0a34a40af2c2a7dfb571da3d1458fe"
        },
        "downloads": -1,
        "filename": "docstr-0.0.2rc1.tar.gz",
        "has_sig": false,
        "md5_digest": "fda0efe1eda01e80cb80f894ab8cff68",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 53993,
        "upload_time": "2022-04-25T17:47:59",
        "upload_time_iso_8601": "2022-04-25T17:47:59.855965Z",
        "url": "https://files.pythonhosted.org/packages/16/3d/971a6ced32f575f410c23a7fc9a3573f351fc042da3f784d7ccce3820a54/docstr-0.0.2rc1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.2rc2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f0ad2f361804c2706788840fd7a467581af403ec7410649146f27926d16e3636",
          "md5": "70ee77107947944964f1535375bc6f5b",
          "sha256": "d7fc438e6e4a2420d95f572f9bab88376bc7e5d2d5ddfbbe8455181b96d9f3b0"
        },
        "downloads": -1,
        "filename": "docstr-0.0.2rc2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "70ee77107947944964f1535375bc6f5b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 40471,
        "upload_time": "2022-04-25T18:00:24",
        "upload_time_iso_8601": "2022-04-25T18:00:24.706252Z",
        "url": "https://files.pythonhosted.org/packages/f0/ad/2f361804c2706788840fd7a467581af403ec7410649146f27926d16e3636/docstr-0.0.2rc2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "67939b7a3198b3fa0abe7f07a34c11d5a69fb12f768266eae79fe16f9b3d3389",
          "md5": "0b2a1ba8b069e1b4413e3ffabd4e4364",
          "sha256": "bd70ec7e08410b7dc5715502059496f95fbe2dbfc7f1a0285c0bce82ee2d7d3a"
        },
        "downloads": -1,
        "filename": "docstr-0.0.2rc2.tar.gz",
        "has_sig": false,
        "md5_digest": "0b2a1ba8b069e1b4413e3ffabd4e4364",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 53997,
        "upload_time": "2022-04-25T18:00:26",
        "upload_time_iso_8601": "2022-04-25T18:00:26.343315Z",
        "url": "https://files.pythonhosted.org/packages/67/93/9b7a3198b3fa0abe7f07a34c11d5a69fb12f768266eae79fe16f9b3d3389/docstr-0.0.2rc2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.3rc0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6e8a3a1d2dc1bd5ef6f6d2bad548794dfef3cda1f1f6aaf213b076d3bd02d4a6",
          "md5": "1e800053383efcb3d517fe009aa223d0",
          "sha256": "ebbea8ea0620d618fb94d3b7181d3528496abdf6d10199f164064b6d7910a495"
        },
        "downloads": -1,
        "filename": "docstr-0.0.3rc0.tar.gz",
        "has_sig": false,
        "md5_digest": "1e800053383efcb3d517fe009aa223d0",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 59173,
        "upload_time": "2022-06-02T18:15:43",
        "upload_time_iso_8601": "2022-06-02T18:15:43.974174Z",
        "url": "https://files.pythonhosted.org/packages/6e/8a/3a1d2dc1bd5ef6f6d2bad548794dfef3cda1f1f6aaf213b076d3bd02d4a6/docstr-0.0.3rc0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.3rc1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5c1f09e8ec919606a0648e589e227537ad64f53dbe99a9d80824b12d817b9818",
          "md5": "fc69d726a4ed9bcfc0c71c73a37fe429",
          "sha256": "c0d00867ecaab16ea0c9bc184701505b9b2fad993f152e3e76600bedef5df59f"
        },
        "downloads": -1,
        "filename": "docstr-0.0.3rc1.tar.gz",
        "has_sig": false,
        "md5_digest": "fc69d726a4ed9bcfc0c71c73a37fe429",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 59831,
        "upload_time": "2022-07-06T19:19:46",
        "upload_time_iso_8601": "2022-07-06T19:19:46.245648Z",
        "url": "https://files.pythonhosted.org/packages/5c/1f/09e8ec919606a0648e589e227537ad64f53dbe99a9d80824b12d817b9818/docstr-0.0.3rc1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.3rc2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "207655bd10cc0f8275b924da86acd396504be8e803fc0a258a293b5fc546addb",
          "md5": "00f3c59f8b69a7837e987a4718c84376",
          "sha256": "ddcef8066cff976f392fd3f3311a14622001201235827dfa77772951bff1d3e3"
        },
        "downloads": -1,
        "filename": "docstr-0.0.3rc2.tar.gz",
        "has_sig": false,
        "md5_digest": "00f3c59f8b69a7837e987a4718c84376",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 60254,
        "upload_time": "2022-10-04T22:18:47",
        "upload_time_iso_8601": "2022-10-04T22:18:47.259992Z",
        "url": "https://files.pythonhosted.org/packages/20/76/55bd10cc0f8275b924da86acd396504be8e803fc0a258a293b5fc546addb/docstr-0.0.3rc2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "90937dfb8194ba020e5f8967d12192abe641ca398b50132afcaef7c6c1ec2e83",
        "md5": "426b764fe941c9029d090743fe41cc69",
        "sha256": "7471d39ceffc74ce323fa2effae3d99a614212cb2ddf1764c33215c07c20e16b"
      },
      "downloads": -1,
      "filename": "docstr-0.0.2-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "426b764fe941c9029d090743fe41cc69",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.7",
      "size": 40652,
      "upload_time": "2022-04-25T18:41:26",
      "upload_time_iso_8601": "2022-04-25T18:41:26.341441Z",
      "url": "https://files.pythonhosted.org/packages/90/93/7dfb8194ba020e5f8967d12192abe641ca398b50132afcaef7c6c1ec2e83/docstr-0.0.2-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "650ebadf146dc49b9ffedb2b0da946b7d85f4f0379163ef57a7f14e913ed8874",
        "md5": "11363b22e5c2ecf933fcd82d6daf864a",
        "sha256": "130b768c95579e8fe5f6e7f85146ab30265f0474d0a56f329edacc33078c9804"
      },
      "downloads": -1,
      "filename": "docstr-0.0.2.tar.gz",
      "has_sig": false,
      "md5_digest": "11363b22e5c2ecf933fcd82d6daf864a",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7",
      "size": 54474,
      "upload_time": "2022-04-25T18:41:28",
      "upload_time_iso_8601": "2022-04-25T18:41:28.201888Z",
      "url": "https://files.pythonhosted.org/packages/65/0e/badf146dc49b9ffedb2b0da946b7d85f4f0379163ef57a7f14e913ed8874/docstr-0.0.2.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}