{
  "info": {
    "author": "joeyp722",
    "author_email": "",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "# Grover SAT solver\nThe aim of this project is to build a quantum algorithm that can solve SAT problems. SAT refers to satisfiability of a Boolean formula, meaning that there exists a input where the output of the formula is TRUE.\n\nGrover refers to Grover's algorithm from quantum computing [1]. This algorithm uses an oracle to find the states it is looking for, hence the oracle must be representative of the Boolean formula to find a matching input.\n\n## Boolean formulas\n\nThere are three types of Boolean operators:\n* conjunctions denoted by ^, think of AND gates.\n* disjunctions denoted by v, think of OR gates.\n* negations denoted by -, think of NOT gates.\n\nA formula might look like:\n\n> f = (-x0 v x1)^(x0 v -x1)\n\nThis is the formula for an XOR gate. The x variables here are the literals, these are the inputs of the Boolean formula and can be TRUE of FALSE. Here f is the output that can be TRUE or FALSE as well.\n\nNote that here the disjunctions are within the brackets, where the conjunctions are outside of the brackets. When the formula is in this form it is called the conjunctive normal form (cnf), here the expressions within the brackets are called clauses. Often the Tseytin transformation is used to convert a arbitrary Boolean formula to such a form.\n\nIn order to satisfy the formula one must find a input that where the output is TRUE as a result.\n\n## NP-Complete problems\n\nNP-Complete is a complexity class in which the problem P must obey two criteria:\n\n* Must be in NP.\n* Every problem in NP must be reducible to P within polynomial time.\n\nFor a problem to be in the NP complexity class the solution to the problem must must verifiable in polynomial time.\n\nPolynomial time refers to polynomial time complexity, where time complexity refers to the number of steps a algorithm has to take to get to the answer. When there are n literals the time complexity might scale as O(n), O(n^2), O(n^3), ... . But not as O(2^n), since this is exponential time complexity.\n\nCook [2] showed that SAT problems are NP-Complete. Thus, according to the first criterion it is possible to see if a given input gives TRUE as the output, within polynomial time.\n\nKarp [3] Showed that many combinatorial problems can also be reduced to SAT problems, again within polynomial time. Thus, if one can solve SAT problems one can also solve other NP-Complete problems.\n\n## Oracle\n\nIn order for the oracle to work all the states of interest must receive a phase-flip, meaning that the coefficient in the state vector is multiplied with -1.\n\nThe oracle is always succeeded by a diffuser. This part of the algorithm can be repeated multiple times depending on the number of iterations.\n\nIn order to construct an oracle for a cnf. All the clauses have their own ancilla qubit on which a bit-flip is performed if the clause is TRUE. If a clauses are true then a phase-flip is performed via a quantum AND gate, again via a new ancillary qubit that provides a phase kickback.\n\nNote that the bit-flips on the ancilla qubits have to be undone, thus the gates responsible for this are performed once more.\n\nTo gain a better understanding i would suggest looking at:\n\n> cnf_oracle.py\n\nOr it's subroutine counterpart:\n\n> libraries.quantum_gates.cnf_oracle\n\n\n## Multiple solutions\n\nThe required number of iterations for Grover's algorithm is pi/4 sqrt(N/k), where N is the number of entries given by the number of literals n, via N = 2^n. And where k is the number of solutions.\n\nHowever, the number of solutions might be unknown. Fortunately this can be mitigated by running the algorithm pi/4 sqrt(N/2^i) number of times, where i is a integer and bounded by 0 <= i <= n. Note that it is possible that the algorithm should be repeated for multiple values of i.\n\nThe idea is to \"approximate\"  pi/4 sqrt(N/k) with pi/4 sqrt(N/2^i), there is always a i for which the ratio of the two lies between 1/sqrt(2) and sqrt(2).\n\nIn the Grover algorithm the number of iterations is proportional to rotational angle. This angle determines the coefficients of the \"Good\" and \"Bad\" states.\n\n> |Psi> = sin(t) |Good> + Cos(t) |Bad>\n\nHere the \"Good\" states are the states that correspond to solution that satisfies the cnf in question, while the \"Bad\" states correspond to non-solutions.\n\nThe state vector of the algorithm starts out in a Hadamard state if solutions are very rare compared to non-solutions then the angle t will be very small. Here it is assumed that t approaches zero.\n\nIn order to only measure \"Good\" states t has to be 90 degrees. Then the probability of measuring \"Good\" states will be 100%, since sin^2(90 deg) = 1.\n\nHowever, the angle is proportional to the number of iterations. But the number of iterations might deviate by a factor between 1/sqrt(2) and sqrt(2), this gives angles of 63.64 degrees and 127.28 degrees respectively. These angles give two lower bounds of measuring a \"Good\" state. The first angle gives a probability of sin^2(63.64 deg) = 80.29%, while the second gives a probability of sin^2(127.28 deg) = 63.11%. Thus, by executing a sufficient number of measurements these \"Good\" states should be detected.\n\nThe number of iterations can be determined by summing up pi/4 sqrt(N/2^i) for all i's.\n\n> pi/4 sqrt(N) (1/sqrt(2^0) + 1/sqrt(2^1) + ... + 1/sqrt(2^n))\n\nHowever, the algorithm automatically stops when it has found a \"Good\" state,  this happens for a i where 2^i \"approximates\" k because of reasons stated above. Let's give this i the name j. Now the number of iterations is:\n\n> pi/4 sqrt(N) (1/sqrt(2^j) + ...  + 1/sqrt(2^n))\n\nThe reason the front terms are missing is because it is favorable to start with the least number of iterations, which is given by to last term, and then the second to last terms, etcetera. Since N = 2^n the expression can be rewritten as:\n\n> pi/4 (sqrt(2)^0 + sqrt(2)^1 + ... + sqrt(2)^(n-j))\n\nnote that here the order of terms is reversed. The below provides a upper bound for the expression above.\n\n> pi/4 (1+sqrt(2)) (2^0 + 2^1 + ... 2^ceil((n-j)/2) )\n\nwhere ceil is the ceiling function that rounds up. Here yet another upper bound is introduced:\n\n> pi/4 (1+sqrt(2)) 2^(ceil((n-j)/2)+1)\n\nTo see how the bound between the two expressions above works think of binary counting:\n\n> 2^0 + 2^1 + 2^2 + ... + 2^q < 2^(q+1)\n\nNow back to this expression:\n\n> pi/4 (1+sqrt(2)) 2^(ceil((n-j)/2)+1)\n\nHere the time Complexity scales as:\n\n> O(2^(ceil((n-j)/2) )\n\nHere the ceiling function is hardly relevant, thus:\n\n> O( 2^(n-j)/2 ) = O( sqrt(2^n/n^j) )\n\nPlugging in N=2^n and remembering that 2^j \"approximates\" k the expression becomes approximately:\n\n> O( sqrt(N/k) )\n\nwhich is the same time complexity as if the number of solutions k was known. Although here the number of required iterations might defer by some constant factor.\n\nThis part of the algorithm is inspired by although not exactly the same as the algorithm described in the paper [4].\n\n## Further remarks\n\nI hope the idea became clear even though the documentation is perhaps rather primitive. The two main take away points are:\n\n* The oracle works via phase kickback from ancilla qubits.\n* Not knowing how many solutions there are doesn't matter for the time complexity. It is still O( sqrt(N/k) )\n\nThe heart of the algorithm lies in the functions:\n\n* libraries.quantum_gates.\n* libraries.quantum_algorithms.grover_sat_solver\n\n## Future plans\n\nShort term plans:\n\n* Research how to organize the code better.\n* Organize the code better.\n* Research how jupyter notebooks work.\n* Research the [4] paper for optimizing how the code choses it's number of iterations.\n\nIntermediate term plans:\n\n* Make jupyter notebooks, that function as documentation.\n* Implementing optimization for how the code choses it's number of iterations.\n\nMore long term plans:\n\n* Investigate the quantum adders, from the paper [5].\n* Research if quantum adders can be used as counters. To see how many clauses are activated, this way the number of required ancilla qubits scales logarithmically instead of linearly. Here phase kickback is provided if the right number of clauses are activated.\n* Research if it is useful to ignore some qubits from the counter, perhaps a phase kickback can also be provided if the number of activated clauses is greater or equal to some value. For example consider the counter literals x2 x1 x0. If x2 = True then the value of the counter is greater than or equal to 4. And also how this works for values other than powers of 2.\n* Investigate if this can be used to solve MAX-SAT and weighted MAX-SAT problems.\n* And if it all works out documenting everything to make it more comprehensive. \n\n\n\n\n\n\n\n\n\n## References\n\n[1]: Grover, L. K. (1996, July). A fast quantum mechanical algorithm for database search. In Proceedings of the twenty-eighth annual ACM symposium on Theory of computing (pp. 212-219).\n\n[2]: Cook, S. A. (1971, May). The complexity of theorem-proving procedures. In Proceedings of the third annual ACM symposium on Theory of computing (pp. 151-158).\n\n[3]: Karp, R. M. (1972). Reducibility among combinatorial problems. In Complexity of computer computations (pp. 85-103). Springer, Boston, MA.\n\n[4]: Boyer, M., Brassard, G., Høyer, P., & Tapp, A. (1998). Tight bounds on quantum searching. Fortschritte der Physik: Progress of Physics, 46(4‐5), 493-505.\n\n[5]: Draper, T. G. (2000). Addition on a quantum computer. arXiv preprint quant-ph/0008033.\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/joeyp722/grover_sat_solver",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "enigma-quantum",
    "package_url": "https://pypi.org/project/enigma-quantum/",
    "platform": "",
    "project_url": "https://pypi.org/project/enigma-quantum/",
    "project_urls": {
      "Homepage": "https://github.com/joeyp722/grover_sat_solver"
    },
    "release_url": "https://pypi.org/project/enigma-quantum/0.2/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "Grover SAT solver.",
    "version": "0.2",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 10065434,
  "releases": {
    "0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "dec97a8abd94a9d1d4b11cb709e70fff3f0960ffc9250410bb6e136af50dc3ab",
          "md5": "9383bab9afdb800cbec8f19c81e5d0de",
          "sha256": "28b543cc1dae55329a890d6bf1173c05ff53309556dfaa4b8eae84044a9f3838"
        },
        "downloads": -1,
        "filename": "enigma_quantum-0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "9383bab9afdb800cbec8f19c81e5d0de",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 4760,
        "upload_time": "2021-04-14T18:49:35",
        "upload_time_iso_8601": "2021-04-14T18:49:35.361989Z",
        "url": "https://files.pythonhosted.org/packages/de/c9/7a8abd94a9d1d4b11cb709e70fff3f0960ffc9250410bb6e136af50dc3ab/enigma_quantum-0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "27f4dd279680991e2b904e8da6ece8c8b72b8211f61c7e190ab7c42fea2cfa70",
          "md5": "2360b25d19c7bfe0786ae96f9ff340f8",
          "sha256": "816ee9f8c105f187930d8c78f16cc4d708e07559d6bf3e5760b5312bdbd91107"
        },
        "downloads": -1,
        "filename": "enigma-quantum-0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "2360b25d19c7bfe0786ae96f9ff340f8",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 5329,
        "upload_time": "2021-04-14T18:49:37",
        "upload_time_iso_8601": "2021-04-14T18:49:37.121745Z",
        "url": "https://files.pythonhosted.org/packages/27/f4/dd279680991e2b904e8da6ece8c8b72b8211f61c7e190ab7c42fea2cfa70/enigma-quantum-0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "dec97a8abd94a9d1d4b11cb709e70fff3f0960ffc9250410bb6e136af50dc3ab",
        "md5": "9383bab9afdb800cbec8f19c81e5d0de",
        "sha256": "28b543cc1dae55329a890d6bf1173c05ff53309556dfaa4b8eae84044a9f3838"
      },
      "downloads": -1,
      "filename": "enigma_quantum-0.2-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "9383bab9afdb800cbec8f19c81e5d0de",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 4760,
      "upload_time": "2021-04-14T18:49:35",
      "upload_time_iso_8601": "2021-04-14T18:49:35.361989Z",
      "url": "https://files.pythonhosted.org/packages/de/c9/7a8abd94a9d1d4b11cb709e70fff3f0960ffc9250410bb6e136af50dc3ab/enigma_quantum-0.2-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "27f4dd279680991e2b904e8da6ece8c8b72b8211f61c7e190ab7c42fea2cfa70",
        "md5": "2360b25d19c7bfe0786ae96f9ff340f8",
        "sha256": "816ee9f8c105f187930d8c78f16cc4d708e07559d6bf3e5760b5312bdbd91107"
      },
      "downloads": -1,
      "filename": "enigma-quantum-0.2.tar.gz",
      "has_sig": false,
      "md5_digest": "2360b25d19c7bfe0786ae96f9ff340f8",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 5329,
      "upload_time": "2021-04-14T18:49:37",
      "upload_time_iso_8601": "2021-04-14T18:49:37.121745Z",
      "url": "https://files.pythonhosted.org/packages/27/f4/dd279680991e2b904e8da6ece8c8b72b8211f61c7e190ab7c42fea2cfa70/enigma-quantum-0.2.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}