{
  "info": {
    "author": "Package author: Sebastian Schmittner Code authors: https://github.com/RalphTro/epcis-event-hash-generator/graphs/contributors",
    "author_email": "sebastian.schmittner@eecc.de",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.8"
    ],
    "description": "# EPCIS Event Hash Generator\n\n[![Build Status](https://github.com/RalphTro/epcis-event-hash-generator/workflows/Unit%20Tests/badge.svg?v=42)](https://github.com/RalphTro/epcis-event-hash-generator/actions?query=workflow%3A%22Unit+Tests%22)\n[![Linter Status](https://github.com/RalphTro/epcis-event-hash-generator/workflows/Code%20Style/badge.svg)](https://github.com/RalphTro/epcis-event-hash-generator/actions?query=workflow%3A%22Code+Style%22)\n![Docker Release Build](https://github.com/RalphTro/epcis-event-hash-generator/workflows/Docker%20Release%20Build/badge.svg)\n\nThis is a proposal/reference implementation for a method to uniquely identify an EPCIS event or validate the integrity thereof. To this end, a syntax-/representation-agnostic approach based on hashing is developed.\nThe <b>PROTOTYPICAL DEMO SOFTWARE</b> takes an EPCIS Document (either formatted in XML or JSON-LD) and returns the hash value(s) of the contained EPCIS events representing a unique fingerprint thereof. \n\n![EPCIS event hash generator algorithm illustration](docs/epcisEventHashGenerator.png)\n\n\n## Status of the reference implementation\n\nThe current (v1.6.0 at the time of writing) set of examples and implementation of the json parser is based on an old version of the EPCIS 2.0 JSON schema, see https://github.com/RalphTro/epcis-event-hash-generator/issues/37 . Currently, only the XML hashing should be used. See\nhttps://github.com/gs1/EPCIS/blob/master/JSON/\nfor the current (still draft) version of the JSON schema and for examples.\n\n\n\n## TL;DR\n\nThe implementation provided here is a prototypical reference implementation meant for testing against other implementations, but **not meant for production**. If you discover that this implementation does not conform perfectly to the algorithm description or contains any other bugs, please file an issue at https://github.com/RalphTro/epcis-event-hash-generator/issues .\n\n### Command Line\n\nThe Hashing Algorithm described below is implemented as a python script, including a command line utility which can be run directly.\n\nThe package is release on PyPI at https://pypi.org/project/epcis-event-hash-generator/ hence it can be installed via\n```\npython3 -m pip install epcis_event_hash_generator\n```\n\nFor usage information run\n\n```\npython3 -m epcis_event_hash_generator -h\n```\n\n\n### Web Service\n\nThe script also comes wrapped as a web service in a docker image for ease of integration into a testing environment.\nYou may use \n\n- [the latest release version of the web service container](https://github.com/RalphTro/epcis-event-hash-generator/packages/484860 ). See here for usage.\n\n\n## Introduction  \nThere are situations in which organisations require to uniquely refer to a specific EPCIS event. For instance, companies may only want to store the <b>hash value of a given EPCIS event on a distributed shared ledger ('blockchain')</b> instead of any actual payload. Digitally signed and in conjunction with a unique timestamp, this is a powerful and effective way to prove the integrity of the underlying event data. Another use case consists to use such an approach to <b>populate the eventID field with values that are intrinsic to the EPCIS event</b> - if an organisation captures an event without an eventID (which is not required as of the standard) and sends that event to a business partner who needs to assign a unique ID, they can agree that the business partner populates the eventID field applying this methodology before storing the event on the server. If the organisation later wants to query for that specific event, it knows how the eventID was created, thus is able to query for it through the eventID value.\nEPCIS events have a couple of differences to other electronic documents:\n+ They are embedded in an EPCIS document that can contain multiple events \n+ As of EPCIS 2.0, it is permitted to capture and share EPCIS data through two different syntaxes (XML and JSON/JSON-LD)\n+ EPCIS events provides ample flexibility to include user-specific extensions \n+ When expressed in JSON/JSON-LD, the sequence of elements may vary\n\nThis is why industry needs to have a consistent, reliable approach to create a hash value that is viable to uniquely identify a specific EPCIS event. \n\nNotice that the algorithm described here provides a way of *hashing* an event. A *signature* scheme can be build using this hash, but the hash by itself does not yield a proof of authenticity/authorship. For example, a man in the middle attack can re-compute the hash after tampering.\n\n## Requirements\n\nFor any algorithm that is to be considered a faithful hash of an EPCIS event, we require the following properties:\n\n+ Different (valid) serialisations of the **same event** need to yield the **same hash**.\n+ In particular, if serialised in XML, the hash must be independend of irrelevant whitespace, ordering of elements in an unordered list, the name used for namespaces, etc. (see e.g. https://en.wikipedia.org/wiki/XML_Signature#XML_canonicalization for more details on the matter).\n+ The same event serialised in JSON/JSON-LD or XML must yield the same hash.\n+ Any relevant **change of an event** must lead to a **change of the hash**. In particular, the hash must change if\n  - any value of any field present in the event is changed.\n  - a field is added or removed.\n\n\n## Algorithm\n\nFor hashing strings, well-established algorithms such as SHA-256 are available. The focus of this specification is the canonicalization of a *pre-hash string* representation of an EPCIS event, which can be passed to any standard hashing algorithm. \n\nTo calculate this pre-hash string, the algorithm requires to extract and concatenate EPCIS event key-value pairs to one string exactly according to the following set of rules:\n1. For all EPCIS event types, data elements SHALL be extracted according to the *canonical property order* specified below.\n2. All elements SHALL be concatenated without separators between successive elements.\n3. If a field contains a value (i.e. is not a parent element), each value SHALL be assigned its key through an equal sign ('=').\n4. Data elements SHALL NOT be added if they are omitted in a given EPCIS event or do not apply.\n5. Whitespace characters at the beginning or end of values SHALL be truncated.\n6. Quantitative values SHALL NOT have trailing zeros. (For example, a quantity of one SHALL be expressed as '1', and SHALL NOT be expressed as '1.0'; 0.3434 SHALL be expressed as 0.3434, with any trailing zeros truncated.)\n7. Numeric values SHALL be expressed without single quotes.\n8. All timestamps SHALL be expressed in UTC; the zero UTC offset SHALL be expressed with the capital letter 'Z'. \n9. All timestamps SHALL be expressed with millisecond precision. If an EPCIS event lacks the latter, the millisecond field SHALL be zero-filled (e.g., YYYY-MM-DDTHH:MM:SS.000Z).\n10. Strings SHALL be sorted according to their case-sensitive lexical ordering, considering UTF-8/ASCII code values of each successive character.\n11. All child elements as part of a list (e.g. epc in epcList, bizTransaction in bizTransactionList, etc.) SHALL be sequenced according to their case-sensitive lexical ordering, considering UTF-8/ASCII code values of each successive character.\n12. If a child element of a list itself comprises one or more key-value pairs itself (e.g. quantityElement in quantityList, sensorReport in sensorElement), the latter SHALL be concatenated to a string (similar to the procedure specified above) and, if they belong to the same level, sequenced according to their case-sensitive lexical ordering, considering UTF-8/ASCII code values of each successive character..\n13. If an EPCIS field comprises a type attribute (e.g. Business Transaction Type in bizTransaction or Source/Destination Type in source), the type key-value pair (where the key is 'type' and the value the respective type attribute) SHALL follow the actual key-value before the alphabetical ordering takes place. \n14. If present, any URN-based standard vocabulary value (starting with ‘urn:epcglobal:cbv’) SHALL be expressed in its corresponding GS1 Web Vocabulary URI equivalent (starting with ‘https://ref.gs1.org’).\nExample:\n‘urn:epcglobal:cbv:bizstep:receiving’ --> ‘https://ref.gs1.org/cbv/BizStep-receiving’\n\n15. If an EPCIS event is represented in JSON/JSON-LD, standard vocabulary elements are not expressed as URIs, but in bare string notation (i.e. ‘in_transit’ instead of ‘https://ref.gs1.org/cbv/Disp-in_transit’). All standard vocabulary elements expressed in bare string notation SHALL be expanded to their corresponding GS1 Web URI (starting with ‘https://ref.gs1.org/cbv’).\n16. If present, EPC URIs (starting with ‘urn:epc:id’), EPC Class URIs (starting with ‘urn:epc:class’) or EPC Pattern URIs (starting with ‘urn:epc:idpat’) SHALL be converted into the corresponding canonical GS1 Digital Link URI (starting with ‘https://id.gs1.org’). Canonical GS1 Digital Link URIs are specified in [GS1 Digital Link: URI Syntax, release 1.2], section 4.11.\n17. If a GS1 Digital Link URI is present, it SHALL take the form of a constrained canonical GS1 Digital Link URI. Specifically: (I) A custom domain SHALL be replaced by ‘https://id.gs1.org’. (II) The query string SHALL be stripped off. (III) It SHALL only contain the most fine-granular level of identification, i.e. contain the following GS1 keys/key qualifiers only: `00 / 01 / 01 21 / 01 10 / 01 235 / 253 / 255 / 401 / 402 / 414 / 414 254 / 417 / 8003 / 8004 / 8006 / 8006 21 / 8006 10 / 8010 / 8010 8011 / 8017 / 8018`\n18. If an EPCIS event comprises ILMD elements, the latter SHALL comprise their key names (full namespace embraced by curly brackets ('{' and '}') and the respective local name), as well as, if present, the contained value, prefixed by an equal sign ('='). The resulting substrings SHALL be sorted according to their case-sensitive lexical ordering, considering UTF-8/ASCII code values of each successive character when they are appended to the pre-hash string.\n19. If an EPCIS event comprises user extension elements at event level – irrespective whether they appear at top level or are nested – the latter SHALL comprise their key names (full namespace embraced by curly brackets ('{' and '}') and the respective local name), as well as, if present, the contained value, prefixed by an equal sign ('=').\nThe resulting substrings SHALL be sorted according to their case-sensitive lexical ordering, considering UTF-8/ASCII code values of each successive character when they are appended to the pre-hash string.\n20. If an EPCIS event comprises user extension elements as part of an EPCIS standard field with an extension point (namely `errorDeclaration`, `readPoint`, `bizLocation`, `sensorElement`, `sensorMetadata`, and `sensorReport`), the top-level user extension element(s) SHALL be prefixed with the corresponding EPCIS standard field name. Apart from that, the SHALL be added to the pre-hash string similarly as specified in the previous step.\n21. The resulting pre-hash string SHALL be embedded in a 'ni' URI scheme as specified in RFC 6920, as follows:\nni:///{digest algorithm};{digest value}?ver={CBV version}\ni.e. characters 'n', 'i', followed by one colon (':'), three slash characters ('/'), the digest algorithm, one semicolon (';'), the digest value, one question mark ('?'), the characters 'v', 'e', 'r', one equal sign ('='), and the version of the EPCIS Event Hash ID algorithm that was used to generate the pre-hash string, indicated by the CBV version.\n22. The digest algorithm SHALL contain one of the hash name string values as listed in the Named Information Hash Algorithm Registry (see https://www.iana.org/assignments/named-information/named-information.xhtml)\n23. The CBV version SHALL be indicated as follows: the three characters 'C', 'B', 'V', followed by one or several digits indicating the major release version, one dot character ('.') and one or more digits indicating the minor release version. In addition, it MAY be appended with one dot character ('.') and one or more digits indicating a revision of a given CBV standard release, if applicable (i.e. if a revision of the CBV standard specifies an updated version of the EPCIS Event Hash ID algorithm).\n\n### Canonical property order \n\nApplicable for all EPCIS Event Types, i.e. `ObjectEvent`, `AggregationEvent`, `TransactionEvent`, `TransformationEvent` and `AssociationEvent`.\n\n| Sequence | Data Element |\n| -------- | ------------ |\n| 1 | `eventType` |\n| 2 | `eventTime` |\n| 3 | `eventTimeZoneOffset` |\n| 4 | `errorDeclaration` (`declarationTime`, `reason`, `correctiveEventIDs` – `correctiveEventID`) |\n| 5 | `epcList` – `epc` |\n| 6 | `parentID` |\n| 7 | `inputEPCList` – `epc` |\n| 8 | `childEPCs` – `epc` |\n| 9 | `quantityList` – `quantityElement` (`epcClass`, `quantity`, `uom`) |\n| 10 | `childQuantityList` – `quantityElement` (`epcClass`, `quantity`, `uom`) |\n| 11 | `inputQuantityList` – `quantityElement` (`epcClass`, `quantity`, `uom`) |\n| 12 | `outputEPCList` – `epc` |\n| 13 | `outputQuantityList` – `quantityElement` (`epcClass`, `quantity`, `uom`) |\n| 14 | `action` |\n| 15 | `transformationID` |\n| 16 | `bizStep` |\n| 17 | `disposition` |\n| 18 | `persistentDisposition` - (`set`, `unset`) |\n| 19 | `readPoint` – `id` |\n| 20 | `bizLocation` – `id` |\n| 21 | `bizTransactionList` – `bizTransaction` (`business transaction identifier`, `business transaction type`) |\n| 22 | `sourceList` – `source` (`source ID`, `source type`) |\n| 23 | `destinationList` – `destination` (`destination ID`, `destination type`) |\n| 24 | `sensorElement` ( |\n|    | `sensorMetadata` (`time`, `startTime`, `endTime`, `deviceID`, `deviceMetadata`, `rawData`, `dataProcessingMethod`, `bizRules`), |\n|    | `sensorReport` (`type`, `deviceID`, `deviceMetadata`, `rawData`, `dataProcessingMethod`, `time`, `microorganism`, `chemicalSubstance`, `value`, `component`, `stringValue`, `booleanValue`, `hexBinaryValue`, `uriValue`, `minValue`, `maxValue`, `meanValue`, `sDev`, `percRank`, `percValue`, `uom`)|\n|    | ) |\n| 25 | `ilmd` – `{ILMD elements}` |\n| 26 | `{User extension elements}`|\n\nFor better understanding, the following illustrations include the data content of EPCIS events (including a couple of user extensions - all defined under 'https://ns.example.com/epcis'), show the corresponding pre-hash string as well as the canonical hash value of that event.\n\nExample 1:\n\n![Example 1 for EPCIS event pre-hash computation](docs/hashingAlgorithmLogicIllustration_example1.png)\n\nRun `epcis_event_hash_generator/main.py tests/examples/ReferenceEventHashAlgorithm.xml -pj \"\\n\"` to get a similar output of the pre-hash string and `epcis_event_hash_generator/main.py tests/examples/ReferenceEventHashAlgorithm.xml` to verify the hash.\n\nExample 2:\n\n![Example 2 for EPCIS event pre-hash computation ](docs/hashingAlgorithmLogicIllustration_example2.png)\n\nRun `epcis_event_hash_generator/main.py tests/examples/ReferenceEventHashAlgorithm2.xml -pj \"\\n\"` to get a similar output of the pre-hash string and `epcis_event_hash_generator/main.py tests/examples/ReferenceEventHashAlgorithm2.xml` to verify the hash.\n\nExample 3:\n\n![Example 3 for EPCIS event pre-hash computation ](docs/hashingAlgorithmLogicIllustration_example3.png)\n\nThe line breaks in the pre-hash string are displayed for readability reasons. The actual pre-hash string does not contain any whitespace (unless specifically used in a value) and the lines displayed in the above picture have to be concatenated (by empty string) in order to get the actual pre-hash string.\n\n## Use Cases and Limitations\nThis algorithm has *various potential areas of application*:\n* Primary Key for EPCIS Events\n  - populating the eventID field in situations where this is required\n  - enabling to independently recalculate the eventID value on the basis of an EPCIS event's intrinsic data\n  - indexing EPCIS events in databases\n* Identifying duplicate EPCIS events\n* Matching an error declaration to an original event (see EPCIS Standard, section 7.4.1.4)\n* Notarisation of EPCIS events (i.e. leveraging digital signatures)  \n\nThat said, the algorithm has limited applicability when EPCIS events are redacted (meaning that, e.g. for privacy reasons, EPCIS events are not shared entirely, but deliberately omit specific fields or including readPoint IDs with a lesser granularity - see EPCIS and CBV Implementation Guide, section 6.7). In such a case, the content of a redacted EPCIS event will in no case yield to the hash value of the original one.\n\n## References\n* EPCIS Standard, v. 1.2: https://www.gs1.org/standards/epcis\n* Core Business Vocabulary (CBV) Standard, v. 1.2.2: https://www.gs1.org/standards/epcis\n* RFC 6920, Naming Things with Hashes, https://tools.ietf.org/html/rfc6920\n* Named Information Hash Algorithm Registry, https://www.iana.org/assignments/named-information/named-information.xhtml\n\n\n## License\n\n<img alt=\"MIT\" style=\"border-width:0\" src=\"https://opensource.org/files/OSIApproved_1.png\" width=\"150px;\"/><br />\n\nCopyright 2020, 2021 | Ralph Tröger <ralph.troeger@gs1.de> and Sebastian Schmittner <schmittner@eecc.info>\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/RalphTro/epcis-event-hash-generator",
    "keywords": "epcis GS1 hashing traceability",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "epcis-event-hash-generator",
    "package_url": "https://pypi.org/project/epcis-event-hash-generator/",
    "platform": null,
    "project_url": "https://pypi.org/project/epcis-event-hash-generator/",
    "project_urls": {
      "Homepage": "https://github.com/RalphTro/epcis-event-hash-generator"
    },
    "release_url": "https://pypi.org/project/epcis-event-hash-generator/1.7.0/",
    "requires_dist": [
      "python-dateutil (>=2.8)",
      "Flask (>=1.1)",
      "gtin (>=0.1.13)"
    ],
    "requires_python": ">=3.6",
    "summary": "Exemplary implementation of the EPCIS event hash generator algorithm described in the README",
    "version": "1.7.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16787860,
  "releases": {
    "1.5.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1baaebf28c1444971de09977fb177c172383675daa99c61e07da950be6c06e69",
          "md5": "74277a4bc7b3c6d6e0de66427716ea74",
          "sha256": "598ebbc84ff1c29dd35f2b42275abb533be17cf501a9237bc9d33d110eed3ee5"
        },
        "downloads": -1,
        "filename": "epcis_event_hash_generator-1.5.0-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "74277a4bc7b3c6d6e0de66427716ea74",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": ">=3.6",
        "size": 25567,
        "upload_time": "2021-03-08T09:20:50",
        "upload_time_iso_8601": "2021-03-08T09:20:50.286665Z",
        "url": "https://files.pythonhosted.org/packages/1b/aa/ebf28c1444971de09977fb177c172383675daa99c61e07da950be6c06e69/epcis_event_hash_generator-1.5.0-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "564d31c0a3f7b635edd05e16b4363e86adcfa1c61b4d4c978af29607e916cbf3",
          "md5": "0c844bd30717c3ca17b0714ec49d20fb",
          "sha256": "a3f83fbf1406d345f571897abfccba15141abef7a0c55e1065b22cdf26e76e8d"
        },
        "downloads": -1,
        "filename": "epcis-event-hash-generator-1.5.0.tar.gz",
        "has_sig": false,
        "md5_digest": "0c844bd30717c3ca17b0714ec49d20fb",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 27182,
        "upload_time": "2021-03-08T09:20:52",
        "upload_time_iso_8601": "2021-03-08T09:20:52.145176Z",
        "url": "https://files.pythonhosted.org/packages/56/4d/31c0a3f7b635edd05e16b4363e86adcfa1c61b4d4c978af29607e916cbf3/epcis-event-hash-generator-1.5.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.6.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "bd3cf7c861e74c029babf4aa96d119d74ede37e36cc7d35216adf99bc8304ea9",
          "md5": "70fa2848fc96a09ce26d362aa773f288",
          "sha256": "6fa9c65194778b2cc5be715ddc74f49a40aa6223ace9fc086b13ac567e7bec6b"
        },
        "downloads": -1,
        "filename": "epcis_event_hash_generator-1.6.0-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "70fa2848fc96a09ce26d362aa773f288",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": ">=3.6",
        "size": 26630,
        "upload_time": "2021-03-08T12:27:23",
        "upload_time_iso_8601": "2021-03-08T12:27:23.839193Z",
        "url": "https://files.pythonhosted.org/packages/bd/3c/f7c861e74c029babf4aa96d119d74ede37e36cc7d35216adf99bc8304ea9/epcis_event_hash_generator-1.6.0-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "60bbbd4019d88fc9c41b7a32a3691561832d5c87a3002225365c5b1de7e67b34",
          "md5": "548ad15498f0c5eda21b31e89e078e12",
          "sha256": "4890902809a32224d97d24b23cb540308c4b498d98b612d427a0d9e9dc64d4be"
        },
        "downloads": -1,
        "filename": "epcis-event-hash-generator-1.6.0.tar.gz",
        "has_sig": false,
        "md5_digest": "548ad15498f0c5eda21b31e89e078e12",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 27554,
        "upload_time": "2021-03-08T12:27:25",
        "upload_time_iso_8601": "2021-03-08T12:27:25.187224Z",
        "url": "https://files.pythonhosted.org/packages/60/bb/bd4019d88fc9c41b7a32a3691561832d5c87a3002225365c5b1de7e67b34/epcis-event-hash-generator-1.6.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.6.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c3b09ec2915fdbb104019bdc160b8b43a7059f976591fd4afc4d31a100f56762",
          "md5": "8dcd2b8d615b1daaae198dea9e213b36",
          "sha256": "e9f3153c41d9abecc46886d97c1e78781cd4d8bc09dda0a9c57fdeb5ae31f575"
        },
        "downloads": -1,
        "filename": "epcis_event_hash_generator-1.6.1-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "8dcd2b8d615b1daaae198dea9e213b36",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": ">=3.6",
        "size": 26634,
        "upload_time": "2021-03-17T08:34:45",
        "upload_time_iso_8601": "2021-03-17T08:34:45.787022Z",
        "url": "https://files.pythonhosted.org/packages/c3/b0/9ec2915fdbb104019bdc160b8b43a7059f976591fd4afc4d31a100f56762/epcis_event_hash_generator-1.6.1-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "815bc72ec25ed83af4155bb309e2a89f3239e70c2159dc977601e3518e404934",
          "md5": "9d1ca33229e73769cfd64ab1299cde03",
          "sha256": "b11447fade697d4eab1f36b73e2967cee496d76404ec4be95d39963a87c9c658"
        },
        "downloads": -1,
        "filename": "epcis-event-hash-generator-1.6.1.tar.gz",
        "has_sig": false,
        "md5_digest": "9d1ca33229e73769cfd64ab1299cde03",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 27535,
        "upload_time": "2021-03-17T08:34:47",
        "upload_time_iso_8601": "2021-03-17T08:34:47.905459Z",
        "url": "https://files.pythonhosted.org/packages/81/5b/c72ec25ed83af4155bb309e2a89f3239e70c2159dc977601e3518e404934/epcis-event-hash-generator-1.6.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.6.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "908994c31fe923947dced47d1a011e667f02b31401e3c362a8d960e7e83ef2c1",
          "md5": "5f86e0d98cdc3f458133ab32f81ba277",
          "sha256": "eb7727910d533b2f7726350ce2a826481545ad7fd732cae3b9769033af4fe7ca"
        },
        "downloads": -1,
        "filename": "epcis_event_hash_generator-1.6.2-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "5f86e0d98cdc3f458133ab32f81ba277",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": ">=3.6",
        "size": 26702,
        "upload_time": "2021-05-04T21:46:43",
        "upload_time_iso_8601": "2021-05-04T21:46:43.911030Z",
        "url": "https://files.pythonhosted.org/packages/90/89/94c31fe923947dced47d1a011e667f02b31401e3c362a8d960e7e83ef2c1/epcis_event_hash_generator-1.6.2-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8bcbed096e1f16eac423959880ea23e4e73eba18ecfd3b640215e1f9e40c4274",
          "md5": "471b8fcf7350494b417b002272c78d9a",
          "sha256": "f37165cf83536a5cb423c448b70e62f71897172e97ef19b19342815799f73755"
        },
        "downloads": -1,
        "filename": "epcis-event-hash-generator-1.6.2.tar.gz",
        "has_sig": false,
        "md5_digest": "471b8fcf7350494b417b002272c78d9a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 27802,
        "upload_time": "2021-05-04T21:46:46",
        "upload_time_iso_8601": "2021-05-04T21:46:46.855068Z",
        "url": "https://files.pythonhosted.org/packages/8b/cb/ed096e1f16eac423959880ea23e4e73eba18ecfd3b640215e1f9e40c4274/epcis-event-hash-generator-1.6.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.7.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b9d98b0159e3a60caf091866d29cb861755e7d9da2db531755ccf7f56a2c4dad",
          "md5": "e2f154622040d8919b40938c9b1c7285",
          "sha256": "d1b339193fc5d58244feae648591ae6e48e2c1c69c287a02112f586f9d1a3b20"
        },
        "downloads": -1,
        "filename": "epcis_event_hash_generator-1.7.0-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "e2f154622040d8919b40938c9b1c7285",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": ">=3.6",
        "size": 29767,
        "upload_time": "2023-02-10T11:07:44",
        "upload_time_iso_8601": "2023-02-10T11:07:44.616890Z",
        "url": "https://files.pythonhosted.org/packages/b9/d9/8b0159e3a60caf091866d29cb861755e7d9da2db531755ccf7f56a2c4dad/epcis_event_hash_generator-1.7.0-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "78bda9c510dfb5163f1b18738fec688396099bd2cb353058ec06212a73f15e27",
          "md5": "995f9e57eb00baf54fe4ffd4e6953859",
          "sha256": "cfc8b3f5f67b5737d4c88a91034a64d0a9d83024c9298f47333d7958973dcd6b"
        },
        "downloads": -1,
        "filename": "epcis-event-hash-generator-1.7.0.tar.gz",
        "has_sig": false,
        "md5_digest": "995f9e57eb00baf54fe4ffd4e6953859",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 32197,
        "upload_time": "2023-02-10T11:07:46",
        "upload_time_iso_8601": "2023-02-10T11:07:46.974450Z",
        "url": "https://files.pythonhosted.org/packages/78/bd/a9c510dfb5163f1b18738fec688396099bd2cb353058ec06212a73f15e27/epcis-event-hash-generator-1.7.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "b9d98b0159e3a60caf091866d29cb861755e7d9da2db531755ccf7f56a2c4dad",
        "md5": "e2f154622040d8919b40938c9b1c7285",
        "sha256": "d1b339193fc5d58244feae648591ae6e48e2c1c69c287a02112f586f9d1a3b20"
      },
      "downloads": -1,
      "filename": "epcis_event_hash_generator-1.7.0-py2.py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "e2f154622040d8919b40938c9b1c7285",
      "packagetype": "bdist_wheel",
      "python_version": "py2.py3",
      "requires_python": ">=3.6",
      "size": 29767,
      "upload_time": "2023-02-10T11:07:44",
      "upload_time_iso_8601": "2023-02-10T11:07:44.616890Z",
      "url": "https://files.pythonhosted.org/packages/b9/d9/8b0159e3a60caf091866d29cb861755e7d9da2db531755ccf7f56a2c4dad/epcis_event_hash_generator-1.7.0-py2.py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "78bda9c510dfb5163f1b18738fec688396099bd2cb353058ec06212a73f15e27",
        "md5": "995f9e57eb00baf54fe4ffd4e6953859",
        "sha256": "cfc8b3f5f67b5737d4c88a91034a64d0a9d83024c9298f47333d7958973dcd6b"
      },
      "downloads": -1,
      "filename": "epcis-event-hash-generator-1.7.0.tar.gz",
      "has_sig": false,
      "md5_digest": "995f9e57eb00baf54fe4ffd4e6953859",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 32197,
      "upload_time": "2023-02-10T11:07:46",
      "upload_time_iso_8601": "2023-02-10T11:07:46.974450Z",
      "url": "https://files.pythonhosted.org/packages/78/bd/a9c510dfb5163f1b18738fec688396099bd2cb353058ec06212a73f15e27/epcis-event-hash-generator-1.7.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}