{
  "info": {
    "author": "Karl Knechtel",
    "author_email": "karl.a.knechtel@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.6",
      "Programming Language :: Python :: 3.7",
      "Programming Language :: Python :: 3.8"
    ],
    "description": "# `epmanager` - quick and easy entry points for Python packages\n\n## Purpose and contents\n\nThis package provides tools to help you create entry points for your Python code. Unlike other tools, the focus is on packages prepared and distributed in the modern way, rather than on replacing the `if __name__=='__main__':` block in one-off scripts. To this end, `epmanager` provides:\n\n* A function decorator that creates a wrapper suitable for use as an entry point to your program, and attaches it as an attribute to the function. The intent is that your original API is untouched, while still producing an effective way to start using your code right from the command line.\n\n* A command-line tool for scanning your project for such entry point wrappers and updating your `pyproject.toml` accordingly.\n\n* A command-line tool to create shortcut scripts for the entry point executables created during installation. This makes it easier to run your code, for example, from the desktop in a graphical environment, by providing something double-clickable that runs with the desktop as working directory.\n\n* A full suite of examples. In particular, the code examples in the documentation are made available as command-line entry points, as if you had set them up yourself. For example, the function `epmanager_example_1` below is available to use on the command line as `epmanager-example-1`. The `examples` module contains these examples and more; the corresponding command-line names for other functions (aside from the ones explicitly discussed here) are prefixed with `epmanager-`.\n\n## The `@entrypoint` decorator - Basic Usage\n\nTo create an entry point to your code, simply import the decorator (`from epmanager import entrypoint`), and then decorate the function that should serve as the entry point to your code. A simple example:\n\n```python\n@entrypoint(arg='an argument')\ndef epmanager_example_1(arg:int):\n    return f'arg={arg} of type {type(arg)}'\n```\n\nThe decorator creates a wrapper that will parse the command line expecting a single, integer argument aside from the program name, like: `epmanager-example-1 3`. It knows that the parameter should be an integer because it inspects the signature of `doc_example_1` and uses the type annotation. When invalid input is received, `doc_example_1` will not be called, and an error message will be displayed.\n\nBy default, the decorator makes use of `argparse` default settings, so you also can use `epmanager-example-1 -h` to see a help message. The text `'an argument'` will be used to describe the `arg` command-line argument in error and help messages.\n\nWhen valid input is received, the function will be called; the returned string will be printed; and the process will exit successfully. If the function were to raise an exception somehow, the exception (not a traceback) would be displayed on stderr, and the process would exit with a non-zero status code.\n\n### Decorator arguments\n\nThe decorator requires parentheses and accepts only keyword arguments. In the basic usage, each keyword argument corresponds to one of the parameters of the function. We'll call these arguments *parameter specifications*. Such an argument can be either a string or a dict; a given string `s` is treated equivalently to a dict `{'help': s}`.\n\nWith the default settings, an `argparse.ArgumentParser` is created to parse the command-line arguments, and each parameter specification is used for an `.add_argument` call. This allows you to specify arguments explicitly, but the `@entrypoint` decorator will also make some inferences for you:\n\n* As described above, type annotations can be used to determine parameter type. Specifically, if an annotation exists and is callable, it is used as a `type` parameter for the `.add_argument` call.\n\n* If the specification corresponds to a parameter with a default value, that gets used as a `default` parameter for the `.add_argument` call - i.e., a default value for the command-line argument - and the command-line argument will be treated as optional (sets `nargs='?'` for non-flag arguments).\n\n* If the name of the parameter specification starts with an underscore, a command-line option (or \"flags\" argument) is created, with names based off the provided name. Underscores are converted to hyphens; so for example, a specification like `_arg_test='an argument'` results in a command-line option with short name `-a` and long name `-arg-test`. This also happens if the specification doesn't correspond to any parameter, or corresponds to a \\*\\*kwargs parameter, of the decorated function.\n\n* Otherwise, the name is just used as the name for that command-line argument in the syntax shown in the command help.\n\nAnything specified explicitly will override the inferred values.\n\nHere is an example showing the use of a dict as a parameter specification, and a leading underscore on the name:\n\n```python\n@entrypoint(_fancy={'help': 'fancy help', 'type': int})\ndef epmanager_example_2(fancy):\n    return f'This is a fancy way to end up with {fancy} (of type {type(fancy)})'\n```\n\nThe `'help'` key specifies the description of the `fancy` command-line argument that will appear in the usage message.  Since the parameter specification name starts with an underscore, the command has a `-f` or `--fancy` option. Since the underlying parameter has no default value and none was explicitly specified, the option is mandatory on the command line: `epmanager-example-2 -f 1`. Although there is no type annotation on the `fancy` parameter, the explicitly provided `'type'` setting will mandate an integer value.\n\n### Effect of the decorator\n\nThe decorator assigns three attributes to the function:\n\n* `.invoke` - the wrapper described above.\n\n* `.entrypoint_name` - normally a copy of the `.__name__` of the function, but it can be overridden.\n\n* `.entrypoint_desc` - documentation for the entry point. By default, this is taken from the first line of the function's `.__doc__`, if any; but it can also be overridden. It will be set to an empty string when no documentation is available; it will *not* be `None`.\n\n### Using the parsed values in the function\n\nThe default configuration will do some sanity checks when the decorator is applied, and then create a wrapper that parses the command line (delegating to the `ArgumentParser`, maps the resulting parsed command-line arguments into function-call arguments, calls the function, and captures the output. If an exception is raised, the exception (not the stack trace) is printed to stderr and the process exits with nonzero status. If the call executes normally, the return value is printed to stdout and the process exits with zero status.\n\nEach command-line argument that doesn't match a non-`**kwargs` function parameter will be passed in the \\*\\*kwargs, if available (otherwise, the potential for this occurring is detected in the above sanity checks and an exception is raised).\n\nFor example:\n\n```python\n@entrypoint(arg='a normal argument', kwargs='a tricky argument')\ndef epmanager_example_3(**kwargs):\n    return f\"kwargs['arg']={kwargs['arg']}, kwargs['kwargs']={kwargs['kwargs']}\"\n```\n\nThe format string here should be fairly self-explanatory - but to be explicit: the parameter specification for `arg` doesn't match a function parameter, and the one for `kwargs` only matches the `**kwargs` parameter itself. As a result, the function will be called with both values passed in the `**kwargs`.\n\nA command-line argument having the same name as a `*args` function parameter will be splatted out (an exception occurs if it isn't iterable). For example:\n\n```python\n@entrypoint(args={'nargs': '*', 'type': int, 'help': 'values'})\ndef epmanager_example_4(*args):\n    return f'Finally, a test of variable positional arguments: {args}'\n```\n\nThe `args` command-line argument will read zero or more integer values and store them in a list, which is then splatted out to the `*args` function parameter. We might for example run `epmanager-example-4 1 2 3` and see a result `Finally, a test of variable positional arguments: (1, 2, 3)`. A call like `epmanager_example_4(**{'args': [1, 2, 3]})` would fail with a TypeError, so the implementation has to do some more processing to make this work - and in the process, it adds several sanity checks.\n\n## Advanced usage\n\n### Hooks for customization\n\nWhile the decorator generally treats keyword arguments as parameter specifications, the following names are treated specially:\n\n* `parser_class` - specifies a class that will be instantiated to create a *parser* responsible for parsing the command line. An abstract base class `Parser` is provided, along with the default implementation `DefaultParser` which delegates to `argparse.ArgumentParser` (as described above).\n\n* `dispatch_class` - specifies a class that will be instantiated (really, any callable to be called) to create a *dispatcher* used to call the function given the parsed command-line arguments. An abstract base class `Dispatcher` is provided, along with the default implementation `DefaultDispatcher`\n\n* `specs` - a dict used for disambiguation; key-value pairs here will be treated as parameter specifications, regardless of their names. This allows you to, for example, pass arguments properly to a decorated function with a parameter called `name`.\n\n* `parser_args` - a dict used for disambiguation; key-value pairs here will be treated as configuration arguments for the parser class, regardless of their names. This allows you to, for example, have a custom parser class that expects a configuration argument called `specs` (although it's unclear why you'd want to do this).\n\n* `name` - a template used to determine the command's name. By default, the function's name is used, except that underscores are replaced with hyphens. The template is a string suitable for use with the built-in `.format` method of strings. Two keyword arguments (and no positional arguments) are passed when making the `.format` call:\n\n    * `name`: the function's name, with underscores replaced with hyphens.\n\n    * `_name`: the function's name, without such replacement.\n\n* `description` - a replacement description for the command (overriding the default, which is to use the first line of the function's doc, or an empty string).\n\nAny other keywords are treated as configuration arguments if they appear in a whitelist provided by the parser class, and parameter specifications otherwise.\n\nYou can use a helper function to wrap the decorator call and provide default arguments to be used for several entry points. The `examples` module demonstrates this technique:\n\n```python\ndef my_entrypoint(**kwargs):\n    kwargs.setdefault('name', 'epmanager-{name}')\n    return entrypoint(**kwargs)\n```\n\nNow functions decorated using `@my_entrypoint` will be entry points as before, but with the name template overridden. The `epmanager` packages uses this to prefix the names of commands corresponding to the other examples listed in the module. (These are also used internally for testing.) For example, `entrypoint-empty`at the command line runs the `empty` function (which, of course, does nothing).\n\n\n### The Parser API\n\nSometimes you may wish to customize how arguments are parsed from the command line. To do this, you should subclass the `Parser` abstract base class.\n\n**You will need to implement:**\n\n```python\n@abstractmethod\ndef setup(self, config:dict):\n```\n\nThis is a hook for any setup work needed when constructing the instance. You should **not** override `__init__`, because the base class `__init__` needs to do things in a specific order, both before and after it calls the `setup` hook.\n\nThe `config` dict will contain at least `'name'` and `'description'` keys, as well as any others you specify, as described in the previous section.\n\n```python\n@abstractmethod\ndef add_option(self, name:str, deco_spec:dict, param_spec:dict) -> str:\n\n@abstractmethod\ndef add_argument(self, name:str, deco_spec:dict, param_spec:dict) -> str:\n```\n\nAfter `setup`, these will be called repeatedly with each of the parameter specifications (passed as `deco_spec`; the corresponding keyword used in the decorator call is passed as `name`). `add_option` is called for command-line options (flags), and `add_argument` is called for normal command-line arguments.\n\nThe `param_spec` may contain `'type'` and/or `'default'` values that were inferred from the signature of the decorated function; they are kept separate in case you need to treat them differently from explicitly specified configuration.\n\nThese methods must return a string that gives the corresponding key that will appear in the dict returned by `.parse`. This will normally just be `name`; but for example the default implementation can override this if a `'dest'` is provided in `deco_spec`.\n\n```python\n@abstractmethod\ndef parse(self, command_line) -> dict:\n```\n\nThis should parse the provided command line (provided as a list of tokens, such as from `sys.argv[1:]`) and return a dict mapping from parameter names to values.\n\n**You may also wish to implement:**\n\n```python\n@classmethod\ndef config_keys(cls) -> set\n```\n\nIf you override this, it provides keyword names that the `@entrypoint` decorator will use for configuration options, rather than for parameter specifications. By default, it returns an empty set; but note that `name` and `description` are hard-coded to appear in the configuration options anyway.\n\n```python\ndef call_with(self, parsed_args:dict):\n```\n\nThis is a hook method for calling the underlying decorated function, allowing you to add setup and tear-down behaviour that can be shared between entry points and which shouldn't be part of the function's logic (remember, a design goal here is that you can still use the function as part of your package's API).\n\nThe `parsed_args` will be the `dict` produced by your `parse` method. Use `self.raw_call(parsed_args)` to call the underlying function; this will ensure that the Dispatcher is used correctly to map the parsed arguments into function-call arguments.\n\nThe Parser API works this way - rather than, say, providing \"setup\" and \"teardown\" hooks and hard-coding the underlying call - because it's more flexible; for example, it lets you specify custom error handling in a natural way.\n\n### The Dispatcher API\n\nYou will probably not need to implement your own Dispatcher class, but an API is provided just in case you want to customize the logic that maps from the Parser's `.parse` output into the actual function call.\n\nThe Dispatcher instance is passed to the Parser constructor, and the Parser will do all the communication with the Dispatcher.\n\n**You will need to implement:**\n\n```python\n@abstractmethod\ndef __init__(self, param_specs:dict):\n```\n\nThe constructor will accept a dict that maps from names of the decorated function's parameters, to `inspect.Parameter` instances characterizing them. You can use this to determine parameter kinds and annotations.\n\n```python\n@abstractmethod\ndef guarantee(self, signature_name:str):\n```\n\nThe Parser will call this to indicate that it will parse a `signature_name` parameter and include it in the `args_dict` passed to `.invoke` (see below).\n\n```python\n@abstractmethod\ndef validate(self):\n```\n\nThe parser will call this after it has finished `guarantee`ing all its parameters during construction. Use this to ensure that the parameters described are appropriate for calling the function; raise an exception otherwise.\n\n```python\n@abstractmethod\ndef invoke(self, func, args_dict:dict):\n```\n\nThis should call the original decorated function (passed as `func`) using arguments provided by the Parser in the `args_dict`. This is where you implement the logic to map those values onto the function parameters.\n\n## Command-line utilities\n\nAs described at the top, there are several command-line entry points provided by this package. In addition to the runnable examples, there is a discovery tool and a shortcut maker.\n\n### Discovery tool for entry points\n\nIn your main project directory, run `epmanager-update-metadata` (no arguments). It discovers uses of the `@entrypoint` decorator by recursively searching for `.py` files, dynamically importing each of them separately, and then seeing what ens up in the private registry of decorated functions. For each entry point, an appropriate line is written in the `tool.poetry.scripts` section of your `pyproject.toml` (TODO: support build systems other than Poetry).\n\nThe tool is, of course, used to maintain this package's own `pyproject.toml`.\n\n### Wrapper creation\n\nAfter installing your package (probably in editable mode), run `epmanager-wrapper <name of entry point>` to create a wrapper .bat file or shell script (NOTE: while the platform is detected using `os.name`, this has not been tested on a non-Windows system) in the current directory. This is useful because it:\n\n* provides a double-clickable shortcut;\n* which opens a terminal window when double-clicked and keeps it open after the program has finished running (waiting for one more keypress);\n* and which runs in the current directory rather than the Scripts directory (like a shortcut or symlink normally would).\n\nYou can use this for your own convenience with any package's entry points, not just ones created using this library. You could also run this as part of a post-install script to give your clients a desktop shortcut for your programs.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/zahlman/epmanager",
    "keywords": "",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "epmanager",
    "package_url": "https://pypi.org/project/epmanager/",
    "platform": "",
    "project_url": "https://pypi.org/project/epmanager/",
    "project_urls": {
      "Documentation": "https://github.com/zahlman/epmanager",
      "Homepage": "https://github.com/zahlman/epmanager",
      "Repository": "https://github.com/zahlman/epmanager"
    },
    "release_url": "https://pypi.org/project/epmanager/0.7.5/",
    "requires_dist": [
      "toml (>=0.10.1,<0.11.0)"
    ],
    "requires_python": ">=3.6,<4.0",
    "summary": "An entry-point management system for projects using Poetry",
    "version": "0.7.5",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 8048370,
  "releases": {
    "0.7.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ded022d056ef05c18e03d3d189e58d923efe56a81863f0295337eec0d3a71b25",
          "md5": "4725323adae889d61042be50b9271c86",
          "sha256": "15c9bc79b5d683fc1b4e2ce6dc12324322c214dc901cae697b2f86dd8ecbdc9e"
        },
        "downloads": -1,
        "filename": "epmanager-0.7.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "4725323adae889d61042be50b9271c86",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8,<4.0",
        "size": 16310,
        "upload_time": "2020-08-15T16:39:00",
        "upload_time_iso_8601": "2020-08-15T16:39:00.562439Z",
        "url": "https://files.pythonhosted.org/packages/de/d0/22d056ef05c18e03d3d189e58d923efe56a81863f0295337eec0d3a71b25/epmanager-0.7.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2a991c4ea69fbaea24d779c8ff64dda9f397dcc32195699c1781f4a389634626",
          "md5": "15cf08cbfa127c962690969c871412a7",
          "sha256": "9cf8a38e260be6ccecc721a761a0a0ea8d837ed038ccfb8d49f08dc26ed2d6e0"
        },
        "downloads": -1,
        "filename": "epmanager-0.7.2.tar.gz",
        "has_sig": false,
        "md5_digest": "15cf08cbfa127c962690969c871412a7",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8,<4.0",
        "size": 15845,
        "upload_time": "2020-08-15T16:39:01",
        "upload_time_iso_8601": "2020-08-15T16:39:01.812722Z",
        "url": "https://files.pythonhosted.org/packages/2a/99/1c4ea69fbaea24d779c8ff64dda9f397dcc32195699c1781f4a389634626/epmanager-0.7.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.7.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "255d9c1f66e42fe8258872a41bff12aa959beda6de9571cc1410c227022578ca",
          "md5": "1e3e0e172ba2ba627dadde0054bc40df",
          "sha256": "e3d5214e50ee0b42ab41d68ee943d1201f9baa1ce520fb0dbceac84f8a005d33"
        },
        "downloads": -1,
        "filename": "epmanager-0.7.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "1e3e0e172ba2ba627dadde0054bc40df",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8,<4.0",
        "size": 16317,
        "upload_time": "2020-08-16T23:15:42",
        "upload_time_iso_8601": "2020-08-16T23:15:42.126639Z",
        "url": "https://files.pythonhosted.org/packages/25/5d/9c1f66e42fe8258872a41bff12aa959beda6de9571cc1410c227022578ca/epmanager-0.7.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4842f65db27fb203addc8886403cbc659e9dbecd7159ac6e9fb6c3c1f6980933",
          "md5": "c9500a9a03184ed61997c26c81140b43",
          "sha256": "238950e949bc5e476e63c455d5ddcba9c805c10e700e174fd7a65de6a689f365"
        },
        "downloads": -1,
        "filename": "epmanager-0.7.3.tar.gz",
        "has_sig": false,
        "md5_digest": "c9500a9a03184ed61997c26c81140b43",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8,<4.0",
        "size": 15810,
        "upload_time": "2020-08-16T23:15:43",
        "upload_time_iso_8601": "2020-08-16T23:15:43.255166Z",
        "url": "https://files.pythonhosted.org/packages/48/42/f65db27fb203addc8886403cbc659e9dbecd7159ac6e9fb6c3c1f6980933/epmanager-0.7.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.7.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1391e95eadf12d88b4edcb393507e1f1bb5993526a5a5bd0e6c3137e2cd97a68",
          "md5": "9ba35233839cce98b03134d684b7a99d",
          "sha256": "b8623411e4d12f03f29a0b6753567c17761f4d19fff528de45875c345bebc476"
        },
        "downloads": -1,
        "filename": "epmanager-0.7.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "9ba35233839cce98b03134d684b7a99d",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6,<4.0",
        "size": 16325,
        "upload_time": "2020-08-25T20:26:50",
        "upload_time_iso_8601": "2020-08-25T20:26:50.182776Z",
        "url": "https://files.pythonhosted.org/packages/13/91/e95eadf12d88b4edcb393507e1f1bb5993526a5a5bd0e6c3137e2cd97a68/epmanager-0.7.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5ba84fdd3c5f912060ce7840a5bdc73831603db0d0279dfca0b97da0087df991",
          "md5": "3a1d4550a104982880e14734e56cd57a",
          "sha256": "f6b748d89dd61c62f0ac9354b3e76a3f2d9e8f18a9ede605c3516b7a284e4999"
        },
        "downloads": -1,
        "filename": "epmanager-0.7.4.tar.gz",
        "has_sig": false,
        "md5_digest": "3a1d4550a104982880e14734e56cd57a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6,<4.0",
        "size": 15844,
        "upload_time": "2020-08-25T20:26:52",
        "upload_time_iso_8601": "2020-08-25T20:26:52.103159Z",
        "url": "https://files.pythonhosted.org/packages/5b/a8/4fdd3c5f912060ce7840a5bdc73831603db0d0279dfca0b97da0087df991/epmanager-0.7.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.7.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "01c3daeca2a44ab1bec54924024ed5fc04a3e89f5a959dd030b063e8955b2b19",
          "md5": "abe6d26689d3e416ba08f0e48c21dfde",
          "sha256": "6b442394e0d3e85841ff1e63efc712dd54608eb2cab00ed8ca548c9a3e905aef"
        },
        "downloads": -1,
        "filename": "epmanager-0.7.5-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "abe6d26689d3e416ba08f0e48c21dfde",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6,<4.0",
        "size": 16365,
        "upload_time": "2020-08-27T01:08:29",
        "upload_time_iso_8601": "2020-08-27T01:08:29.650802Z",
        "url": "https://files.pythonhosted.org/packages/01/c3/daeca2a44ab1bec54924024ed5fc04a3e89f5a959dd030b063e8955b2b19/epmanager-0.7.5-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "63cabbe14d2ba63589aed48071345de0070a069b5654ccfbeeafa81772c693af",
          "md5": "468c7f53c868782bfc728a02c8fd88af",
          "sha256": "3a539aa24963be28c83fd57645598bbe071b8c6d695d00f6419f8659dd48371b"
        },
        "downloads": -1,
        "filename": "epmanager-0.7.5.tar.gz",
        "has_sig": false,
        "md5_digest": "468c7f53c868782bfc728a02c8fd88af",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6,<4.0",
        "size": 15856,
        "upload_time": "2020-08-27T01:08:30",
        "upload_time_iso_8601": "2020-08-27T01:08:30.570367Z",
        "url": "https://files.pythonhosted.org/packages/63/ca/bbe14d2ba63589aed48071345de0070a069b5654ccfbeeafa81772c693af/epmanager-0.7.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "01c3daeca2a44ab1bec54924024ed5fc04a3e89f5a959dd030b063e8955b2b19",
        "md5": "abe6d26689d3e416ba08f0e48c21dfde",
        "sha256": "6b442394e0d3e85841ff1e63efc712dd54608eb2cab00ed8ca548c9a3e905aef"
      },
      "downloads": -1,
      "filename": "epmanager-0.7.5-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "abe6d26689d3e416ba08f0e48c21dfde",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6,<4.0",
      "size": 16365,
      "upload_time": "2020-08-27T01:08:29",
      "upload_time_iso_8601": "2020-08-27T01:08:29.650802Z",
      "url": "https://files.pythonhosted.org/packages/01/c3/daeca2a44ab1bec54924024ed5fc04a3e89f5a959dd030b063e8955b2b19/epmanager-0.7.5-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "63cabbe14d2ba63589aed48071345de0070a069b5654ccfbeeafa81772c693af",
        "md5": "468c7f53c868782bfc728a02c8fd88af",
        "sha256": "3a539aa24963be28c83fd57645598bbe071b8c6d695d00f6419f8659dd48371b"
      },
      "downloads": -1,
      "filename": "epmanager-0.7.5.tar.gz",
      "has_sig": false,
      "md5_digest": "468c7f53c868782bfc728a02c8fd88af",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6,<4.0",
      "size": 15856,
      "upload_time": "2020-08-27T01:08:30",
      "upload_time_iso_8601": "2020-08-27T01:08:30.570367Z",
      "url": "https://files.pythonhosted.org/packages/63/ca/bbe14d2ba63589aed48071345de0070a069b5654ccfbeeafa81772c693af/epmanager-0.7.5.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}