{
  "info": {
    "author": "Yang Wang",
    "author_email": "ywangd@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "Intended Audience :: Developers",
      "License :: OSI Approved :: MIT License",
      "Natural Language :: English",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.10",
      "Programming Language :: Python :: 3.8",
      "Programming Language :: Python :: 3.9"
    ],
    "description": "====\nPeek\n====\n\n.. image:: https://github.com/ywangd/peek/workflows/Peek/badge.svg\n        :target: https://github.com/ywangd/peek\n\nPeek is an interactive CLI tool for working with Elasticsearch clusters.\nIt is like `Kibana Console <https://www.elastic.co/guide/en/kibana/current/console-kibana.html>`_\nrunning in terminal with additional features for tinkers.\n\n\nInstallation\n------------\n\nPlease note the project requires Python 3.6+. It is recommended to install from PyPI with:\n\n.. code-block:: bash\n\n  pip install es-peek\n\nThe tool is now available as the ``peek`` command. Peek will ask permission to access system keyring\nfor storing credentials.\nThis can be disabled  temporarily by invoking the command as ``peek -e use_keyring=False``\nor permanently by setting ``use_keyring = False`` in `peekrc <peek/peekrc>`_ file\n\nBesides HTTP calls to Elasticsearch clusters, type ``help`` to see a list of builtin functions.\nTo **enable auto-completions** for APIs, run the ``_download_api_specs`` builtin function\n(note the leading underscore) to download API spec file from the\n`Elasticsearch Specification project <https://github.com/elastic/elasticsearch-specification>`_.\n\nAlternatively, peek can also be installed from source with:\n\n.. code-block:: bash\n\n    python setup.py install\n\nFeatures\n--------\n\nPeek supports most editing features offered by\n`Kibana Console <https://www.elastic.co/guide/en/kibana/current/console-kibana.html>`_,\ne.g. auto-completion, syntax highlighting, auto-formatting, auto-indent,\npar-editing, triple-quotes, etc. It also offers following additional features:\n\n* Lightweight CLI tool\n* Multiplex a single terminal session to multiple Elasticsearch clusters or multiple connections to a single cluster\n* Flexible usages of quotes, comma, comments for the JSON payload, case-insensitive http method names\n* Multiple authentication schemes, including UserPass, API key, Token, SAML, OIDC, Kerberos, PKI\n* Support run-as, x-opaque-id and arbitrary request headers\n* Load JSON payload from external files\n* Run file input in batch mode\n* Readline editing features, e.g. ``Ctrl-_`` for undo, ``Ctrl-r`` for reverse search, etc.\n* History management\n* Capture terminal input and output into file\n* Connect to `Elastic Cloud <https://cloud.elastic.co/>`_ with Cloud ID\n* Shell out for system commands\n* Minimal scripting support\n* Extensible via external scripts\n\nSample Usages\n-------------\n\nAssuming a locally running Elasticsearch cluster, start a Peek session with:\n\n.. code-block:: bash\n\n  peek --hosts localhost:9200 --username elastic\n\nThe following sample is a quick guide on Peek usages:\n\n.. code-block:: javascript\n\n  // NOTE a blank line is needed to trigger API execution, or type \"ESC + Enter\" to execute regardlessly\n  // Exit the interactive session any time by pressing Ctrl-d or type exit\n  GET /_cluster/health  // comment is allowed almost anywhere\n\n  // Index a single document\n  POST /my-index/_doc\n  {'foo': \"bar\"}  // both single and double quotes are acceptable\n\n  // Bulk indexing\n  // Press <F3> to switch between pretty and compact formatting for the JSON payload\n  PUT _bulk\n  {\"index\":{\"_index\":\"test\",\"_id\":\"1\"}}\n  {\"value\":\"1\",\"category\":\"click\"}\n  {\"index\":{\"_index\":\"test\",\"_id\":\"2\"}}\n  {\"value\":\"2\",\"category\":\"click\"}\n\n  // Auto encoding for date math expression\n  // The following is encoded automatically into \"PUT /%3Cmy-index-%7Bnow%2Fd%7D%3E\" on the background\n  PUT /<my-index-{now/d}>\n\n  // Shell out to download the EQL threat hunting demo file\n  !curl -o normalized-T1117-AtomicRed-regsvr32.json https://raw.githubusercontent.com/elastic/elasticsearch/master/docs/src/test/resources/normalized-T1117-AtomicRed-regsvr32.json\n\n  // Bulk indexing the above downloaded file\n  POST my-index-000001/_bulk\n  @normalized-T1117-AtomicRed-regsvr32.json\n\n  // Execute an EQL query (triple quotes can be either ''' or \"\"\")\n  GET /my-index-000001/_eql/search?filter_path=-hits.events\n  {\n    \"query\": \"\"\"\n      any where process.name == \"regsvr32.exe\"\n    \"\"\",\n    \"size\": 200\n  }\n\n  // Create an API key\n  PUT _security/api_key\n  {\n    \"name\": \"key-1\",  // extra comma is OK, and this comment is ok as well\n  }\n\n  // Connect using the above generated API key\n  // The dot notation is used to index into JSON object and array\n  connect api_key=_.'id' + \":\" + _.'api_key' hosts='localhost:9200'  // Quotes are necessary for strings\n\n  // Connect to Elastic Cloud with Cloud ID\n  connect cloud_id='YOUR_CLOUD_ID' username='elastic'\n\n  // Issue a call to the cloud cluster\n  get /  // HTTP method is case-insensitive\n  get / conn=0  // send the request to the first connection (zero-based index) with the conn option\n\n  // Check configuration location and values\n  config\n\n  // List available connections\n  connection\n  connection @info  // check details\n  connection rename='my-cloud-cluster'  // give a friendly name to the current connection\n  connection 0  // switch to the first connection\n  connection remove=0  // remove the first connection\n  connection 'my-cloud-cluster'  // switch to the cloud cluster connection\n\n  // Save the connections we have so far. Session is also auto-saved on exit.\n  session @save  // it can be loaded later with \"session @load\"\n\n  // Session auto-load on start up can be enabled by set \"auto_load_session = True\" in peekrc file.\n  // This helps preserving connections across restart.\n\n  // Builtin help\n  help  // list available functions\n  help session  // a bit more detailed info about the \"session\" builtin function\n\n  // Capture the terminal I/O\n  capture @start\n  capture  // show capture status\n\n  // Run-AS and other headers\n  GET _security/_authenticate runas='foo' xoid='my-x-opaque-id' headers={'some-other-header': 'blah'}\n\n  // Show only the first role from previous response\n  echo _.\"roles\".0\n\n  // If the cluster has SAML integration configured, authenticate with saml\n  // Note this opens a web browser to perform the front-channel flow\n  saml_authenticate\n\n  // Load and run an external script\n  run 'my-setup.es'\n\n  // Stop the capture\n  capture @stop\n\n  // Minimal scripting for populating an index\n  let tags = range(0, 100)\n  for i in tags {\n    PUT (\"my-index/_doc/\" + i)\n    { 'tag': i, \"value\": i * i }\n  }\n\n  // Or with bulk index\n  for i in range(1, 100) {  // first prepare the payload file\n    echo {\"index\":{\"_index\":\"test\",\"_id\":\"\" + i}} file='payload.json'\n    echo {\"value\":i,\"category\":\"click\"} file='payload.json'\n  }\n  // Now bulk indexing with the above generated file\n  PUT _bulk\n  @payload.json\n\nThe tool can also run in batch mode. Assuming above commands are saved in a file called ``script.es``,\nit can be executed as:\n\n.. code-block:: bash\n\n  # Positional argument\n  peek script.es\n\n  # Pipe\n  cat script.es | peek\n\n  # Or with heredoc\n  peek << EOF\n  GET /_cluster/health\n  // etc\n  EOF\n\nExternal scripts can used to provide extra functions. They are simple Python scripts that define\nand expose callabes under a variable named ``EXPORTS``. Please refer `natives.py <peek/natives.py>`_\nfor examples.\n\nPlease also read `Usages <docs/usage.rst>`_ for more details.\n\nCredits\n-------\n`Pgcli <https://github.com/dbcli/pgcli>`_ has been a great reference of learning how to use\n`prompt-toolkit <https://github.com/prompt-toolkit/python-prompt-toolkit>`_, which is a critical\ndependency of this project.\n\n\n=======\nHistory\n=======\n\n0.2.2 (2021-02-28)\n------------------\n\n* Allow start with no connection (also allow to remove the last connection)\n* Display warning headers from server\n* Support the HEAD http method\n* Smart date math expression handling\n* Support post-event callback for both session and connection\n* Display now takes formatted text for style and color\n\n0.2.1 (2020-09-22)\n------------------\n\n* Fix distribution packaging\n\n0.2.0 (2020-09-20)\n------------------\n\n* Auto-completion is fully functional\n* Various improvements\n\n\n0.1.1 (2020-08-29)\n------------------\n\n* Support persisting session across restart of the CLI\n\n\n0.1.0 (2020-07-22)\n------------------\n\n* First commit\n",
    "description_content_type": "",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/ywangd/peek",
    "keywords": "peek,elasticsearch,cli",
    "license": "MIT license",
    "maintainer": "",
    "maintainer_email": "",
    "name": "es-peek",
    "package_url": "https://pypi.org/project/es-peek/",
    "platform": null,
    "project_url": "https://pypi.org/project/es-peek/",
    "project_urls": {
      "Homepage": "https://github.com/ywangd/peek"
    },
    "release_url": "https://pypi.org/project/es-peek/0.3.1/",
    "requires_dist": null,
    "requires_python": ">=3.8",
    "summary": "Peek into elasticsearch clusters",
    "version": "0.3.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16527034,
  "releases": {
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "fe3942bbe3b6e5b1e5f827e959e52f9fc5903453745973bcda0af437a6365252",
          "md5": "cb6195aa664ebcb67d38ed24d1863542",
          "sha256": "22423089da10b9696da53341cd12c0157ae3022f06ba8d209a762d0e9e0b389a"
        },
        "downloads": -1,
        "filename": "es-peek-0.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "cb6195aa664ebcb67d38ed24d1863542",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 52715,
        "upload_time": "2020-08-27T13:09:33",
        "upload_time_iso_8601": "2020-08-27T13:09:33.845650Z",
        "url": "https://files.pythonhosted.org/packages/fe/39/42bbe3b6e5b1e5f827e959e52f9fc5903453745973bcda0af437a6365252/es-peek-0.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d4d3898044af9d620cd43f4e742ea5a2bb7132e1e36ee7ce8018805738fc93db",
          "md5": "bd6569af28d28adbc9a089fc41b56e6e",
          "sha256": "78b146aadadd0ce1b005e124c145893c934886be3a70909efa3e264b44ac4fe8"
        },
        "downloads": -1,
        "filename": "es-peek-0.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "bd6569af28d28adbc9a089fc41b56e6e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 57735,
        "upload_time": "2020-08-29T07:42:19",
        "upload_time_iso_8601": "2020-08-29T07:42:19.186861Z",
        "url": "https://files.pythonhosted.org/packages/d4/d3/898044af9d620cd43f4e742ea5a2bb7132e1e36ee7ce8018805738fc93db/es-peek-0.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b6f43671b90cad13c5a67c34b2e9cc186ca65389939316ba0a212dc1a3ed27a5",
          "md5": "32d36ea218fe1175d06f41c728228509",
          "sha256": "4ec80af8296693b2aab1732e031d2207f2ac75e868238bf36cb57416223574f0"
        },
        "downloads": -1,
        "filename": "es-peek-0.2.0.tar.gz",
        "has_sig": false,
        "md5_digest": "32d36ea218fe1175d06f41c728228509",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 86911,
        "upload_time": "2020-09-20T13:12:05",
        "upload_time_iso_8601": "2020-09-20T13:12:05.874570Z",
        "url": "https://files.pythonhosted.org/packages/b6/f4/3671b90cad13c5a67c34b2e9cc186ca65389939316ba0a212dc1a3ed27a5/es-peek-0.2.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "89ad71862c400e225b0b33819140744fd0b420328e7b1e3e9c5979cbfca1d74e",
          "md5": "4d1ef204c2fac5468f0a69082e59fe5d",
          "sha256": "a929a9c17da606d8b194e6a40b70730d6674bcab93ac62a844a6271e822fde42"
        },
        "downloads": -1,
        "filename": "es-peek-0.2.1.tar.gz",
        "has_sig": false,
        "md5_digest": "4d1ef204c2fac5468f0a69082e59fe5d",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 91371,
        "upload_time": "2020-09-22T09:55:52",
        "upload_time_iso_8601": "2020-09-22T09:55:52.727771Z",
        "url": "https://files.pythonhosted.org/packages/89/ad/71862c400e225b0b33819140744fd0b420328e7b1e3e9c5979cbfca1d74e/es-peek-0.2.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a0485f2ed9dce03b2fe65b62306456a4803524646fdb8f70972381219737b51e",
          "md5": "292f4c36d0a22ade1597ec71505a4e10",
          "sha256": "929852eafc27279247932a689a41a711a0d676969a4d1e756d48ad63c3680913"
        },
        "downloads": -1,
        "filename": "es-peek-0.2.2.tar.gz",
        "has_sig": false,
        "md5_digest": "292f4c36d0a22ade1597ec71505a4e10",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 95784,
        "upload_time": "2021-02-28T00:30:49",
        "upload_time_iso_8601": "2021-02-28T00:30:49.762531Z",
        "url": "https://files.pythonhosted.org/packages/a0/48/5f2ed9dce03b2fe65b62306456a4803524646fdb8f70972381219737b51e/es-peek-0.2.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "231d845eff3ffc1681b1eea9405642d9e22cce8a512c193a4a63f1b3f512dbfd",
          "md5": "1bd52683edf69b6859efb98c1c575fd0",
          "sha256": "85102c030adadfce1a7ad628ac3818ea58d0d46c41842861b8e35559b5b51149"
        },
        "downloads": -1,
        "filename": "es-peek-0.3.0.tar.gz",
        "has_sig": false,
        "md5_digest": "1bd52683edf69b6859efb98c1c575fd0",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 95620,
        "upload_time": "2022-04-10T12:55:56",
        "upload_time_iso_8601": "2022-04-10T12:55:56.012215Z",
        "url": "https://files.pythonhosted.org/packages/23/1d/845eff3ffc1681b1eea9405642d9e22cce8a512c193a4a63f1b3f512dbfd/es-peek-0.3.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3656d26cd64a6143c21d4859b973cd20f12325461ae0f0180abe248855181d11",
          "md5": "64768f346b5a1541d701bfa5dc4e50d5",
          "sha256": "6994af40166b4ffdb48b5a06e21ef1c4e9b072d48f3b5964504fd8f4639e8031"
        },
        "downloads": -1,
        "filename": "es-peek-0.3.1.tar.gz",
        "has_sig": false,
        "md5_digest": "64768f346b5a1541d701bfa5dc4e50d5",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 94920,
        "upload_time": "2023-01-23T01:08:30",
        "upload_time_iso_8601": "2023-01-23T01:08:30.914909Z",
        "url": "https://files.pythonhosted.org/packages/36/56/d26cd64a6143c21d4859b973cd20f12325461ae0f0180abe248855181d11/es-peek-0.3.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "3656d26cd64a6143c21d4859b973cd20f12325461ae0f0180abe248855181d11",
        "md5": "64768f346b5a1541d701bfa5dc4e50d5",
        "sha256": "6994af40166b4ffdb48b5a06e21ef1c4e9b072d48f3b5964504fd8f4639e8031"
      },
      "downloads": -1,
      "filename": "es-peek-0.3.1.tar.gz",
      "has_sig": false,
      "md5_digest": "64768f346b5a1541d701bfa5dc4e50d5",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.8",
      "size": 94920,
      "upload_time": "2023-01-23T01:08:30",
      "upload_time_iso_8601": "2023-01-23T01:08:30.914909Z",
      "url": "https://files.pythonhosted.org/packages/36/56/d26cd64a6143c21d4859b973cd20f12325461ae0f0180abe248855181d11/es-peek-0.3.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}