{
  "info": {
    "author": "Legal Machinery",
    "author_email": "kilodeltalima@mail.ru",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 3 - Alpha",
      "Environment :: X11 Applications :: GTK",
      "Intended Audience :: End Users/Desktop",
      "License :: Other/Proprietary License",
      "Natural Language :: English",
      "Operating System :: POSIX :: Linux",
      "Programming Language :: Python :: 3.7",
      "Topic :: Other/Nonlisted Topic",
      "Topic :: Utilities"
    ],
    "description": "[comment]: <> (.. image:: ./src/zamestnani/logo.png)\n[comment]: <> (.. image:: https://raw.githubusercontent.com/greyli/flask-share/master/images/demo.png)\n[comment]: <> (a reference style link.)\n\n[//]: <> (This is also a comment.)\n\n[//]: # (This may be the most platform independent comment)\n\n[//]: # \"Comment\"\n[//]: # (Comment)\n\n[comment]: # (empty line)\n[comment]: # (This actually is the most platform independent comment)\n[comment]: # (Photo by Andrew Neel from Pexels)\n\n<!---\nyour comment goes here\nand here\n-->\n\n\n\n\n\n\n\nFast Forward Job Hunting\n========================\n\nby Legal Machinery\n------------------\n\n\nEach jobseeker costs the society on average £770 per month in Universal Credit payments, which roughly totals to £1.3 billion monthly with current 1.7 million jobseekers. Every single day someone can get into employment sooner can therefore ease the burden we all bear these unprecedented days. This can be achieved by connecting jobseekers with prospective employers more efficiently and that is what we at Legal Machinery aim for.\n\nWe have just released the newest version of Fast Forward Job Hunting - a revolutionary application that greatly speeds up the process. It automatically searches for specified vacancies, evaluates which ones to apply to, tailors one's CV according to the job description and sends it to the employer. It reports the search activities to the Jobcentre as well. All that within seconds. Moreover, it can run on an affordable laptop and no one else offers such features in any case.\n\nFast Forward Job Hunting speeds up your job seeking efforts. It saves your time and helps you into employment significantly faster.\n\n* Tailor your CV with a few clicks.\n\n* Automatically search for jobs on the \"Find a Job\" website.\n\n* Automatically tailor your CV to a selected job and send and an application.\n\n* Report your job search activities to the \"Universal Credit\" website with one click.\n\n![](https://gitlab.com/psmlondon/nahledy/-/raw/master/fast_forward_job_hunting_main_window.png)\n\n(Photo by engin akyurt on Unsplash)\n\nStructured CV database for limitless combinations:\n\n![Structured CV database for any combinations:](https://gitlab.com/psmlondon/nahledy/-/raw/master/fast_forward_job_hunting_edit_cv_database.png)\n\nPrepare any number of cover letters to choose from:\n\n![Prepare any number of cover letters to choose from:](https://gitlab.com/psmlondon/nahledy/-/raw/master/fast_forward_job_hunting_edit_cover_letter.png)\n\nTailor your CV with a few clicks:\n\n![Tailor your CV with a few clicks.](https://gitlab.com/psmlondon/nahledy/-/raw/master/fast_forward_job_hunting_tailor_cv.png)\n\nYour CV tailored in seconds:\n\n![Your CV tailored in seconds:](https://gitlab.com/psmlondon/nahledy/-/raw/master/fast_forward_job_hunting_tailored_cv.png)\n\n## How to purchase\n\nGet professional support for only 10 pounds per month. This includes a user manual and update notifications by email, you can pay for as many months as you wish. To purchase your registration for one month, send 10 GBP (or a multiple if you wish to prepay for more months) to account number 43201923, sort code 074456 at Nationwide, account holder Zdenek Masek. Use your email address as a payment reference. Contact us at kilodeltalima@mail.ru for enquiries. Terms and conditions apply.\n\n## Installation\n\nSwitch to command line and type \"pip install fast-forward-job-hunting\" without the quotation marks and press enter.\n\nYour system needs to be connected to the Internet in order to download and install the application. Upon installation, Fast Forward Job Hunting will appear in your system's start menu under the Office group.\n\nThe below named packages are required for installation. Please purchase registration for installation and setup support.\n\n## System Requirements\n\nFast Forward Job Hunting has been tested on GNU/Linux Debian 10 but it should run on any system with Python 3.7 or higher and the pip installation framework. The testing system has 4GB operating memory, a dual core Intel Celeron processor at about 2.4GHz and a 60GB solid state drive storage. \n\nWith that hardware and a standard 3G unlimited mobile broadband, it checks an individual job page within approximately 12 seconds. If it decides to send an application, it takes another about 7 seconds to tailor your CV to the job description. Overall, a batch of 50 job pages usually takes roughly 10 minutes to evaluate and apply to interesting positions. Reporting sent applications to the Universal Credit account takes usually less than about a minute.\n\nFast Forward Job Hunting mostly consumes up to 2GB operating memory so there is a good chance it could run on an adequate Raspberry Pi model. It requires the following applications, packages and libraries:\n\nThese should be installed on your system:\n\n* Latex, e. g. Texmaker \n* Mozilla Firefox 60 or higher\n* Python 3.7 or a higher version\n* geckodriver\n* kwallet\n* mpv\n* pdfreader or similar\n* pip installer\n* sqlitebrowser\n\nThe installer will attempt to install the following automatically if it will not find them on your system:\n\n* PyGObject\n* keyring\n* nltk\n* pyperclip\n* selenium\n* shutil\n* sklearn\n\nThese should be already part of your Python installation:\n\n* datetime\n* glob\n* os\n* pathlib\n* pprint\n* queue\n* sqlite3\n* stat\n* subprocess\n* sys\n* threading\n* time\n* webbrowser\n\nInstallation and setup support is available upon registration purchase.\n\n## 1      End User License Agreement\n\nLast updated September 17, 2021\n\nPlease read this End User License Agreement (\"Agreement\") carefully before downloading or\ninstalling or using Legal Machinery Fast Forward Job Hunting or any of its parts or functionalities\n(\"Application\").\n\nBy downloading or installing or using the Application, you are agreeing to be bound by the\nterms and conditions of this Agreement.\n\nIf you do not agree to the terms of this Agreement, do not download or install or use the\nApplication.\n\n\n## 2      Parties\n\n### 2.1     The Licensor\n\nZdenek Masek LLB (Hons) t/a Legal Machinery (\"Licensor\" or \"we\" or \"us\" or \"our\") owns the\nApplication and reserves all rights to it.\n\nIf you have any questions about this Agreement, please contact us at kilodeltalima@mail.ru\nor at 155a Kings Road, London SW3 5TX.\n\n### 2.2     The Licensee\n\nYou (\"Licensee\" or \"you\" or \"your\") to the extent that you lawfully use the Application.\n\n\n## 3      The Grant of the Software Licence\n\nWe grant you a revocable, non-exclusive, non-transferable, limited license to download, install\nand use the Application solely for your personal, non-commercial purposes strictly in accordance\nwith the terms of this Agreement. The Application is licensed to you, not sold.\n\n\n## 4      Limitations to the Grant to Use\n\nYou agree not to, and you will not permit others to license, sell, rent, lease, assign, distribute,\ntransmit, host, outsource, disclose or otherwise commercially exploit the Application or make the\nApplication available to any third party.\n\nYou must not copy or use the Application for any other purposes except for personal, non-\ncommercial purposes.\n\nYou may use the Application on one particular physical or virtual device or machine.\n\nYou may use the Application for 30 days without registration. Afterwards you must register for further use of the Application or uninstall the Application. To purchase your registration for one month, send 10 GBP (or a multiple if you wish to prepay for more months) to account number 43201923, sort code 074456 at Nationwide, account holder Zdenek Masek. Use your email address as a payment reference. This includes a user manual and update notifications by email, you can pay for as many months as you wish.\n\nYou may use the Application only to create and tailor your curriculum vitae, search for jobs on\nthe \"Find a Job\" website, send job applications via that website and report your search activities\nto the \"Universal Credit\" website.\n\nYou must not take any actions that would cause the Application to become subject to any\nopen source licence agreement if it is not already subject to such an agreement;\n\n\n## 5      Conditions of the Licence Grant\n\nWe reserve rights to measure statistics or otherwise audit your use of the Application.\n\n\n## 6      Mandatory Licences\n\nYou must not adapt, modify, decrypt, reverse compile or reverse engineer the Application. If you\nrequire further information on the functioning of the Application please contact us at the above\nnamed email address.\n\n\n## 7      Non-exclusive Licence\n\nThe Application, its contents and our trademarks are our exclusive intellectual property.\n\n\n## 8      Modifications to Application\n\nWe reserve the right to modify, suspend or discontinue, temporarily or permanently, the Applica-\ntion or any service to which it connects, with or without notice and without liability to you.\n\nWe may update the application with new features, bug fixes etc. as we think fit without any\nor any prior notice.\n\nIf you receive an update or an upgrade to, or a new version of the Application (\"Update\"),\nyou must possess a valid licence to the previous version of the Application in order to use\nthe Update. All Updates provided to you shall be subject to the terms and conditions of this\nAgreement. If you receive an Update, you may continue to use the previous version(s) of the\nApplication in your possession, custody or control. We shall have no obligation to support the\nprevious versions of the Application upon availability of an Update. We have no obligation to\nprovide support, maintenance, Updates or modifications under this Agreement.\n\nIf you provide us with feedback and suggestions for the Application, we may implement or\notherwise use them without compensation or credits given.\n\n\n## 9      New Material Created During Licence\n\nYou may create content and data by using the Application.\n\nAny data which may be produced in the course of the Agreement shall be your property\nunless agreed otherwise.\n\n\n## 10       Amendments to this Agreement\n\nWe reserve the right, at our sole discretion, to modify or replace this Agreement at any time. If a\nrevision is material we will provide at least 10 days’ notice prior to any new terms taking effect.\nWhat constitutes a material change will be determined at our sole discretion.\n\n\n## 11       Severability\n\nIf any provision of this Agreement is held to be unenforceable or invalid, such provision will be\nchanged and interpreted to accomplish the objectives of such provision to the greatest extent\npossible under applicable law and the remaining provisions will continue in full force and effect.\n\n\n## 12       Entire Agreement\n\nThis Agreement constitutes the entire agreement between us and you and supersedes all prior\nagreements, understandings, negotiations and discussions, whether oral or written. There are\nno warranties, covenants, conditions or other agreements, express or implied, collateral, statu-\ntory or otherwise, between us and you in connection with the subject matter of this Agreement\nexcept as specifically set out herein.\n\n\n## 13       Governing Law and Jurisdiction\n\nThis agreement shall be interpreted in accordance with the laws of England.\n\nThe parties irrevocably submit to the courts of England and Wales to resolve disputes arising\nunder this agreement, including non-contractual claims.\n\n\n## 14       Term and Termination\n\nThis Agreement shall remain in effect until terminated by you or us.\n\nWe may, in our sole discretion, at any time and for any or no reason, suspend or terminate\nthis Agreement with or without prior notice.\n\nThis Agreement will terminate immediately, without prior notice from us, in the event that you\nfail to comply with any provision of this Agreement. You may also terminate this Agreement by\ndeleting the Application and all copies thereof from your device or machine.\n\nUpon termination of this Agreement, you shall cease all use of the Application and delete all\ncopies of the Application from your device or machine.\n\nThe following provisions shall continue in force after termination - \"Modifications to Applica-\ntion\", \"New Material Created During Licence\", and any other clause required to give effect to the\nintention of the parties shall continue in effect and be binding upon the parties.\n\n\n## 15      Exclusion of Liability\n\nEach party acknowledges that in entering into this Agreement it does not rely on and shall have\nno remedies in respect of any representation or warranty not set out in this Agreement.\n\nEach party agrees that it shall have no claim for innocent or negligent misrepresentation or\nnegligent misstatement based on any statement in this Agreement.\n\nNothing in this Agreement shall affect the parties’ liability for fraudulent misrepresentation.\n\n    \n## 16      No Waiver\n\nAny delay, omission, indulgence or forbearance by either party to exercise any of the rights nor\nany non-compliance by a party under this Agreement shall not be construed as a waiver of that\nright, not shall it impair such right on future occasions.\n\n\n## 17      NO WARRANTY\n\nTHE APPLICATION IS OFFERED ON AN “AS-IS” BASIS AND NO WARRANTY, EITHER EX-\nPRESS OR IMPLIED, IS GIVEN. WE EXPRESSLY DISCLAIM AND EXCLUDE, TO THE MAX-\nIMUM EXTENT PERMITTED BY APPLICABLE LAW, ALL WARRANTIES, CONDITIONS UN-\nDERTAKINGS OR REPRESENTATIONS OF ANY KIND, WHETHER STATUTORY, EXPRESS\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABIL-\nITY, SATISFACTORY QUALITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT.\n\nWE DO NOT PROVIDE ANY THIRD-PARTY SERVICES AND MAKE NO WARRANTIES WITH\nRESPECT TO ANY THIRD-PARTY SERVICES. THE USE OF ANY THIRD PARTY SERVICES\nIS AT YOUR RISK.\n\n\n## 18      Indemnification\n\nBy accepting this Agreement, you agree to indemnify and otherwise hold harmless us, our of-\nficers, employees, agents, subsidiaries, affiliates, and other partners from any direct, indirect,\nincidental, special, consequential or exemplary damages arising out of, relating to, or resulting\nfrom your use of the Application or any other matter relating to the Application including, without\nlimitation, use of any third party products or services.\n\n\n## 19      Confidentiality\n\nYou undertake to us that you shall not disclose any information of a confidential nature which you\nmay have or acquire (whether oral, written or in any other form) as a result of or pursuant to this\nAgreement save that this clause shall not apply to the disclosure of information required to be\ndisclosed by law, binding judgment, order or requirement of any court of competent jurisdiction or\nother competent authority, disclosure in confidence to your professional advisers for a purpose reasonably incidental to this Agreement or information which comes into the public domain (other\nthan as a result of breach of this clause).\n\n\n## 20     Privacy Policy\n\nWe may collect certain personal information from you, such as email address.\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "job,jobseeker,cv,resume,curriculum,vitae,employment,employee",
    "license": "Proprietary",
    "maintainer": "",
    "maintainer_email": "",
    "name": "fast-forward-job-hunting",
    "package_url": "https://pypi.org/project/fast-forward-job-hunting/",
    "platform": "",
    "project_url": "https://pypi.org/project/fast-forward-job-hunting/",
    "project_urls": null,
    "release_url": "https://pypi.org/project/fast-forward-job-hunting/0.0.4/",
    "requires_dist": [
      "PyGObject",
      "keyring",
      "nltk",
      "pyperclip",
      "selenium",
      "scikit-learn"
    ],
    "requires_python": ">=3.7",
    "summary": "Fast Forward Job Hunting speeds up your job seeking efforts. It saves your time and helps you into employment significantly faster.",
    "version": "0.0.4",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 11486082,
  "releases": {
    "0.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "beb89aeeb3a3c63333fe1e0b37387b15d88f501ec84eafd8cfb0dbcac2ef089a",
          "md5": "77c2babc3dc3b8841bcd961175ae0fa6",
          "sha256": "c94d549cdabadb19f9e1eae6be3ac88935b6883d78a53363513806a9b8645ffa"
        },
        "downloads": -1,
        "filename": "fast_forward_job_hunting-0.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "77c2babc3dc3b8841bcd961175ae0fa6",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 320029,
        "upload_time": "2021-05-18T11:17:09",
        "upload_time_iso_8601": "2021-05-18T11:17:09.668089Z",
        "url": "https://files.pythonhosted.org/packages/be/b8/9aeeb3a3c63333fe1e0b37387b15d88f501ec84eafd8cfb0dbcac2ef089a/fast_forward_job_hunting-0.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5d2abe8a508c6566cc372d4afd0fd6e62769334a07b694f6883c0f969439a277",
          "md5": "15f21090f2eabeb02bb93282cd18915e",
          "sha256": "fe167751f0e65b3b6417bb9b29ff53ae00faefcfd0c8bae0e5b81548c4ac374f"
        },
        "downloads": -1,
        "filename": "fast-forward-job-hunting-0.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "15f21090f2eabeb02bb93282cd18915e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 314798,
        "upload_time": "2021-05-18T11:17:13",
        "upload_time_iso_8601": "2021-05-18T11:17:13.013255Z",
        "url": "https://files.pythonhosted.org/packages/5d/2a/be8a508c6566cc372d4afd0fd6e62769334a07b694f6883c0f969439a277/fast-forward-job-hunting-0.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3061e926224b226a9d2d4554ac0a9d0dc95c250435d7ef729c3834da0d7a8ceb",
          "md5": "0171566b27b455d4c36069611055d84e",
          "sha256": "84c7e0b671f2ebe05c0187d2b673168dbd421abb1df9d6ed9e7d9fcc0f8e0d6e"
        },
        "downloads": -1,
        "filename": "fast_forward_job_hunting-0.0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "0171566b27b455d4c36069611055d84e",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 321091,
        "upload_time": "2021-05-22T12:02:58",
        "upload_time_iso_8601": "2021-05-22T12:02:58.528811Z",
        "url": "https://files.pythonhosted.org/packages/30/61/e926224b226a9d2d4554ac0a9d0dc95c250435d7ef729c3834da0d7a8ceb/fast_forward_job_hunting-0.0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1091c71acaee3fafe4575520843f453a576adbf19080b68f9dc3dc9507064082",
          "md5": "469d96658e9765eea2911c9c429a641a",
          "sha256": "ed4166e0643d6818eb98233ec78aa1b31faeb7bc693d248eaafb067b28fb96f1"
        },
        "downloads": -1,
        "filename": "fast-forward-job-hunting-0.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "469d96658e9765eea2911c9c429a641a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 316095,
        "upload_time": "2021-05-22T12:03:02",
        "upload_time_iso_8601": "2021-05-22T12:03:02.413398Z",
        "url": "https://files.pythonhosted.org/packages/10/91/c71acaee3fafe4575520843f453a576adbf19080b68f9dc3dc9507064082/fast-forward-job-hunting-0.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2f06220ef152362d0d59dcd792138b09e02224b012647a08ab96943a061f3a1e",
          "md5": "8e42f2b4fdd589b23e05e6cee4a554cb",
          "sha256": "88e8506257e9778a0e31437b0418288eaa4dd0cbc6d17735ba7339c8db4cb00a"
        },
        "downloads": -1,
        "filename": "fast_forward_job_hunting-0.0.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "8e42f2b4fdd589b23e05e6cee4a554cb",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 237747,
        "upload_time": "2021-09-18T09:19:32",
        "upload_time_iso_8601": "2021-09-18T09:19:32.433221Z",
        "url": "https://files.pythonhosted.org/packages/2f/06/220ef152362d0d59dcd792138b09e02224b012647a08ab96943a061f3a1e/fast_forward_job_hunting-0.0.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "615b56d2328e7a240f2eb46a81507d5eec662fa7ce48ab0db71259760748ac24",
          "md5": "5ba57c777757fbf049f517371ec4d85f",
          "sha256": "3cbbc664810751cb541c54a17de3fbd3194aa5b966fb4a7b87055da2b8bf55c1"
        },
        "downloads": -1,
        "filename": "fast-forward-job-hunting-0.0.3.tar.gz",
        "has_sig": false,
        "md5_digest": "5ba57c777757fbf049f517371ec4d85f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 230446,
        "upload_time": "2021-09-18T09:19:35",
        "upload_time_iso_8601": "2021-09-18T09:19:35.239269Z",
        "url": "https://files.pythonhosted.org/packages/61/5b/56d2328e7a240f2eb46a81507d5eec662fa7ce48ab0db71259760748ac24/fast-forward-job-hunting-0.0.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8380879c3bd60925574aab2a8909799d48023d8a199b2936d8e246bdf0152d0d",
          "md5": "33b6d7279d5466a5dba2b75c11610b25",
          "sha256": "5ac86c36d40baad3cbf1423be96441f4732f673f429fbafff64a4ef9eab0201e"
        },
        "downloads": -1,
        "filename": "fast_forward_job_hunting-0.0.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "33b6d7279d5466a5dba2b75c11610b25",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 252145,
        "upload_time": "2021-09-18T11:28:46",
        "upload_time_iso_8601": "2021-09-18T11:28:46.385025Z",
        "url": "https://files.pythonhosted.org/packages/83/80/879c3bd60925574aab2a8909799d48023d8a199b2936d8e246bdf0152d0d/fast_forward_job_hunting-0.0.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "05982c1a143cffb7c0a60b59633a738b58f24282e2d762e540a194c64690f7fc",
          "md5": "ddc51d0939c7e08cf2f7553d737d1d28",
          "sha256": "8489bfa65297e73cc51be9826dada2220791ed5ed920b8763a6a58bb0e73e4a9"
        },
        "downloads": -1,
        "filename": "fast-forward-job-hunting-0.0.4.tar.gz",
        "has_sig": false,
        "md5_digest": "ddc51d0939c7e08cf2f7553d737d1d28",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 244710,
        "upload_time": "2021-09-18T11:28:49",
        "upload_time_iso_8601": "2021-09-18T11:28:49.876750Z",
        "url": "https://files.pythonhosted.org/packages/05/98/2c1a143cffb7c0a60b59633a738b58f24282e2d762e540a194c64690f7fc/fast-forward-job-hunting-0.0.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "8380879c3bd60925574aab2a8909799d48023d8a199b2936d8e246bdf0152d0d",
        "md5": "33b6d7279d5466a5dba2b75c11610b25",
        "sha256": "5ac86c36d40baad3cbf1423be96441f4732f673f429fbafff64a4ef9eab0201e"
      },
      "downloads": -1,
      "filename": "fast_forward_job_hunting-0.0.4-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "33b6d7279d5466a5dba2b75c11610b25",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.7",
      "size": 252145,
      "upload_time": "2021-09-18T11:28:46",
      "upload_time_iso_8601": "2021-09-18T11:28:46.385025Z",
      "url": "https://files.pythonhosted.org/packages/83/80/879c3bd60925574aab2a8909799d48023d8a199b2936d8e246bdf0152d0d/fast_forward_job_hunting-0.0.4-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "05982c1a143cffb7c0a60b59633a738b58f24282e2d762e540a194c64690f7fc",
        "md5": "ddc51d0939c7e08cf2f7553d737d1d28",
        "sha256": "8489bfa65297e73cc51be9826dada2220791ed5ed920b8763a6a58bb0e73e4a9"
      },
      "downloads": -1,
      "filename": "fast-forward-job-hunting-0.0.4.tar.gz",
      "has_sig": false,
      "md5_digest": "ddc51d0939c7e08cf2f7553d737d1d28",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7",
      "size": 244710,
      "upload_time": "2021-09-18T11:28:49",
      "upload_time_iso_8601": "2021-09-18T11:28:49.876750Z",
      "url": "https://files.pythonhosted.org/packages/05/98/2c1a143cffb7c0a60b59633a738b58f24282e2d762e540a194c64690f7fc/fast-forward-job-hunting-0.0.4.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}