{
  "info": {
    "author": "Stewart Slocum",
    "author_email": "slocumstewy@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.5",
      "Programming Language :: Python :: 3.6",
      "Programming Language :: Python :: 3.7"
    ],
    "description": "![FLEXS Logo](LOGO.png)\n\n[![build status](https://github.com/samsinai/FLEXS/workflows/build/badge.svg)](https://github.com/samsinai/FLEXS/actions) [![Documentation Status](https://readthedocs.org/projects/flexs/badge/?version=latest)](https://flexs.readthedocs.io/en/latest/?badge=latest) [![PyPI package](https://img.shields.io/pypi/v/flexs)](https://pypi.org/project/flexs/)\n\nðŸ’ª FLEXS is an open-source simulation environment that enables you to develop and compare model-guided biological sequence design algorithms. This project was developed with support from [Dyno Therapeutics](https://www.dynotx.com).\n\n- [Installation](#installation)\n- [Overview](#overview)\n- [Tutorial](examples/Tutorial.ipynb)\n- [Contribution and credits](#contributions-and-credits) \n- [Components](#components)\n  - [Ground truth landscapes](#ground-truth-landscapes)\n  - [Noisy oracles](#noisy-oracles)\n  - [Exploration algorithms](#exploration-algorithms)\n     - [Bring your own explorer](#bring-your-own-explorer) \n\n\n\n## Installation\n\nFLEXS is available on [PyPI](https://pypi.org/project/flexs/) ðŸ and can be installed with `pip install flexs`.\n\nThere are two optional, but very useful dependencies, [ViennaRNA](https://www.tbi.univie.ac.at/RNA/) (for RNA binding landscapes) and [PyRosetta](http://www.pyrosetta.org) (for protein design landscapes). These can both be installed with conda:\n```bash\n$ conda install -c bioconda viennarna\n$ conda install pyrosetta  # Set up RosettaCommons conda channel first (http://www.pyrosetta.org/dow)\n```\nNote that PyRosetta requires a commercial license if not being used for academic purposes. \n\nIMPORTANT: ViennaRNA seems to have issues with Python 3.8, so try to run in a Python 3.5>=, <=3.7 environment.\n\nIf contributing or running paper code/experiments, we recommend that you install the dependencies for the sandbox in a conda virtual environment. You can initialize a new Python 3.7 environement with `conda env create --name {env_name} python=3.7`. Then install the local version of `flexs` with `pip install -e .` in the root directory.\n\n\n## Overview\n\nBiological sequence design through machine-guided directed evolution has been of increasing interest. This process often involves two closely connected steps:\n  * Models `f` that attempt to learn the ground truth sequence to function relationship `g(x) = y`. \n  * Algorithms that explore the sequence space with the help of the trained model `f`. \n\n\n While in some cases, these two steps are learned simultaneously, it is fairly common to have access to a well-trained model `f` which is *not* invertible. Namely, given a sequence `x`, the model can estimate `y'` (with variable accuracy), but it cannot generate a sequence `x'` associated with a specific function `y`. Therefore it is valuable to develop exploration algorithms `E(f)` that make use of the model `f` to propose sequences `x'`. \n\n We implement a simulation environment that allows you to develop or port landscape exploration algorithms for a variety of challenging tasks. Our environment allows you to abstract away the model `f = Noisy_abstract_model(g)` or employ empirical models (like Keras/Pytorch or Sklearn models). You can see how these work in the **[tutorial](examples/Tutorial.ipynb)**. \n\nOur abstraction is comprised of four levels:\n#### 1.  Fitness Landscapes ðŸ”ï¸\nThese oracles `g` are simulators that are assumed as ground truth, i.e. when queried, they return the true value `y_i` associated with a sequence `x_i`. Currently we have four classes of ground truth oracles implemented. \n- *[Transcription factor binding data](#transcription-factor-binding)*. This is comprised of 158 (experimentally) fully characterized landscapes. \n- *[RNA landscapes](#rna-landscapes)*. A set of curated and increasingly challenging RNA binding landscapes as simulated with ViennaRNA. \n- *[AAV Additive Tropism](#additive-aav-tropism)*. A hypothesized noisy additive protein landscape based on tissue tropism of single mutant AAV2 capsid protein.   \n- *[GFP fluorescence](#gfp-fluorescence)*. Fluorescence of GFP protein as predicted by TAPE transformer model. \n- *[Rosetta-based design](#rosetta-based-design)*. Rosetta-based design task for 3MSI anti-freeze protein. \n\nFor all landscapes we also provide a fixed set of initial points with different degrees of previous optimization, so that the relative strength of algorithms when starting from locations near or far away from peaks can be evaluated. \n\n#### 2. Noisy oracles\n\nNoisy oracles are (approximate) models `f` of the original ground truth landscape `g`. These allow for the exploration algorithm to screen sequences virtually, before committing to making expensive queries to `g`.  We implement two flavors of these\n- Noisy abstract models: Noise corrupted version of `g` (this allows for independent study of exploration algorithms). \n- Empirical models: `f` is learned directly from the data that was collected so far. \n\n#### 3. Exploration algorithms ðŸ•µï¸\n\n Exploration algorithms have access to `f` with some limit on the number of queries to this oracle `virtual_screen`. Once they have queried that many samples, they would commit to measuring `batch_size` from the ground truth, which incurrs a real cost. The class `base_explorer` implements the housekeeping tasks, and new exploration algorithms can be implemented by inheriting from it.  \n\n#### 4. Evaluators ðŸ“Š\n\nWe also implement a suite of [evaluation modules](flexs/evaluate.py) that automatically collect data that is necessary for evaluating algorithms on different performance criteria.\n\n- *robustness*: Produces data for analyzing how explorer performance changes given different quality of models.\n- *efficiency*: Produces data for analyzing how explorer performance changes when more computational evaluations are allowed.\n- *adaptivity*: Produces data for analyzing how the explorer is sensitive to the number of batches it is allowed to sample, given a fixed total budget.\n\nSee the [tutorial](examples/Tutorial.ipynb) for an example of how these can be run. \n\n## Contributions and credits ðŸ¤©\nYour PR and contributions to this sandbox are most welcome. If you make use of data or algorithms in this sandbox, please ensure that you cite the relevant original articles upon which this work was made possible (we provide links in this readme). To cite the sandbox itself:\n```\n@article{sinai2020adalead,\n  title={AdaLead: A simple and robust adaptive greedy search algorithm for sequence design},\n  author={Sinai, Sam and Wang, Richard and Whatley, Alexander and Slocum, Stewart and Locane, Elina and Kelsic, Eric},\n  journal={arXiv preprint},\n  year={2020}\n}\n```\n\nFLEXS 0.2.1 was developed by Sam Sinai, Richard Wang, Alexander Whatley, Elina Locane, and Stewart Slocum.  \n\n## Components\n\n### Ground Truth Landscapes\n\n#### Transcription Factor Binding\n\nBarrera et al. (2016) surveyed the binding affinity of more than one hundred and fifty transcription factors (TF) to all possible DNA sequences of length 8. Since the ground truth is entirely characterized, and biological, it is a relevant benchmark for our purpose. These generate the full picture for landscapes of size `4^8`. We shift the function distribution such that `y` is within `[0,1]`, and therefore `optimal(y)=1`. We also provide 15 initiation sequences with different degrees of optimization across landscapes. The sequence `TTAATTAA` for instance is a famous binding site that is a global peak in 20 of these landscapes, and a local peak (above all its single mutant neighbors) in 96 landscapes overall. `GCTCGAGC` is a local peak in 106 landscapes, whereas `AAAGAGAG` is not a peak in any of the 158 landscapes. It is notable that while complete, these landscapes are generally easy to optimize on due to their size. So we recommend that they are tested in very low-budget setting or additional classes of landscapes are used for benchmarking. \n\n```\n@article{barrera2016survey,\n  title={Survey of variation in human transcription factors reveals prevalent DNA binding changes},\n  author={Barrera, Luis A and Vedenko, Anastasia and Kurland, Jesse V and Rogers, Julia M and Gisselbrecht, Stephen S and Rossin, Elizabeth J and Woodard, Jaie and Mariani, Luca and Kock, Kian Hong and Inukai, Sachi and others},\n  journal={Science},\n  volume={351},\n  number={6280},\n  pages={1450--1454},\n  year={2016},\n  publisher={American Association for the Advancement of Science}\n}\n```\n\n#### RNA Landscapes\nPredicting RNA secondary structures is a well-studied problem. There are efficient and accurate dynamic programming approaches to calculates secondary structure of short RNA sequences. These landscapes give us a good proxy for a consistent oracle over entire domain of large landscapes.  We use the [ViennaRNA](https://www.tbi.univie.ac.at/RNA/) package to simulate binding landscapes of RNA sequences as a ground truth oracle.\n\nOur sandbox allows for constructing arbitrarily complex landscapes (although we discourage large RNA sequences as the accuracy of the simulator deteriorates above 200 nucleotides). As benchmark, we provide a series of 36 increasingly complex RNA binding landscapes. These landscapes each come with at least 5 suggested starting sequences, with various initial optimization. \n\nThe simplest landscapes are binding landscapes with a single hidden target (often larger than the design sequence resulting in multiple peaks). The designed sequences is meant to be optimized to bind the target with the minimum binding energy (we use duplex energy as our objective). We estimate `optimal(y)` by computing the binding energy of the perfect complement of the target and normalize the fitnesses using that measure (hence this is only an approximation and often a slight underestimate). RNA landscapes show many local peaks, and often multiple global peaks due to symmetry. \n\nAdditionally, we construct more complex landscapes by increasing the number of hidden targets, enforcing specific conservation patterns, and composing the scores of each landscapes multiplicatively. See [multi-dimensional models](flexs/ensemble.py) for the generic class that allows composing landscapes.  \n\n\n```\n@article{lorenz2011viennarna,\n  title={{ViennaRNA} Package 2.0},\n  author={Lorenz, Ronny and Bernhart, Stephan H and Zu Siederdissen, Christian H{\\\"o}ner and Tafer, Hakim and Flamm, Christoph and Stadler, Peter F and Hofacker, Ivo L},\n  journal={Algorithms for molecular biology},\n  volume={6},\n  number={1},\n  pages={26},\n  year={2011},\n  publisher={Springer}\n}\n```\n\n#### Additive AAV landscapes\n\n Ogden et al. (2019) perform a comprehensive single mutation scan of AAV2 capsid protein, assaying tropism for five different target tissues. The authors show that an additive model is informative about the local structure of the landscape. Here we use the data from the single mutations to generate a toy additive model. Here `y' := sum(s_i)+ e`, where `i` indicates the position across the sequences, and `s_i` indicates a sequence with mutation `s` at position `i` and `e` indicates iid Gaussian noise. This construct is also known as \"Rough Mt. Fuji\" (RMF) and many empirical fitness landscapes are consistent with an RMF local structure around viable natural sequences with unpredictable regions in between. In the noise-free setting, the RMF landscape is convex with a single peak. We allow the construction of multiple target tissues, and different design lengths (tasks ranging from desiging short region of the protein to tasks that encompass designing the full protein). The scores are normalized between `[0,1]`. \n\n```\n@article{ogden2019comprehensive,\n  title={Comprehensive AAV capsid fitness landscape reveals a viral gene and enables machine-guided design},\n  author={Ogden, Pierce J and Kelsic, Eric D and Sinai, Sam and Church, George M},\n  journal={Science},\n  volume={366},\n  number={6469},\n  pages={1139--1143},\n  year={2019},\n  publisher={American Association for the Advancement of Science}\n}\n```\n\n#### GFP \n In [TAPE](https://github.com/songlab-cal/tape), the authors benchmark multiple machine learning methods on a set of tasks including GFP fluorescence prediction. The GFP task is comprised of training and predicting fluorescence values on approximately 52,000 protein sequences of length 238 which are derived from the naturally occurring GFP in *Aequorea victoria* (See [this paper](https://www.nature.com/articles/nature17995)). Downloading and doing inference with this model is memory and time intensive. These landscapes are not normalized and therefore scores higher than 1 are possible (we do not know the maximum activation for the model). \n\n```\n@inproceedings{tape2019,\n    author = {Rao, Roshan and Bhattacharya, Nicholas and Thomas, Neil and Duan, Yan and Chen, Xi and Canny, John and Abbeel, Pieter and Song, Yun S},\n    title = {Evaluating Protein Transfer Learning with TAPE},\n    booktitle = {Advances in Neural Information Processing Systems}\n    year = {2019}\n}\n\n@article{sarkisyan2016local,\n  title={Local fitness landscape of the green fluorescent protein},\n  author={Sarkisyan, Karen S and Bolotin, Dmitry A and Meer, Margarita V and Usmanova, Dinara R and Mishin, Alexander S and Sharonov, George V and Ivankov, Dmitry N and Bozhanova, Nina G and Baranov, Mikhail S and Soylemez, Onuralp and others},\n  journal={Nature},\n  volume={533},\n  number={7603},\n  pages={397--401},\n  year={2016},\n  publisher={Nature Publishing Group}\n}\n```\n#### Rosetta-based Design \n\n[Rosetta](https://www.rosettacommons.org/software) is a protein modeling software suite used for *de novo* design and structure prediction. Based on the principle that structure determines function, the Rosetta design process begins with a desired 3-D protein conformation and tries to find amino acid sequences that are likely to fold to that structure. While the dynamics of protein folding are still poorly understood, this approach has proven remarkably effective in practice, and so we find it an acceptable analogue to the true fitness landscape. To keep our experiments computationally feasible, we omit the expensive step of side-chain packing and use the simplified centroid scoring frounction as our objective. We use the [PyRosetta](http://www.pyrosetta.org) Python interface to Rosetta. The Rosetta design objective function is a scaled estimate of the folding energy, which has been found to be an indicator of the probability that a sequence will fold to the desired structure. As an example, we provide an optimization challenge for the structure of 3MSI, a 66 amino acid antifreeze protein found in the ocean pout starting from 5 sequences with 3-27 mutations from the wildtype. Here, we normalize energy scores by scaling and shifting their distribution and then applying the sigmoid function.\n\n\n```\n@article{chaudhury2010pyrosetta,\n  title={PyRosetta: a script-based interface for implementing molecular modeling algorithms using Rosetta},\n  author={Chaudhury, Sidhartha and Lyskov, Sergey and Gray, Jeffrey J},\n  journal={Bioinformatics},\n  volume={26},\n  number={5},\n  pages={689--691},\n  year={2010},\n  publisher={Oxford University Press}\n}\n```\n\n\n### Noisy Oracles\n\n#### Noisy Abstract Models\nThese models get access to the ground truth `g`, but do not allow the explorer to access `g` directly. They corrupt the signal from `g` but adding noise to it, proportional to the distance of the query from the (nearest) observed data. The parameter `signal_strength` which is between 0 (no signal) and 1 (perfect model) determines the rate of decay.  \n\n\n#### Empirical Models\nThese models train a standard algorithm on the observed data. Some baseline models can be found in [flexs/baselines/models](flexs/baselines/models). All landscapes and models can also be ensembled using the [ensemble class](flexs/ensemble.py). Ensembles also have the ability to be *adaptive* i.e. the models within an ensemble will be reweighted based on their accuracy on the last measured set.\n\n\n### Exploration Algorithms\n\n#### Bring your own explorer\nExploration algorithms are search methods that use noisy oracles to select the next batch of samples from the landscape. This is the main service of this sandbox, you can implement your own explorer by simply inheriting from the [Base Explorer](flexs/explorer.py), and implementing a single method:\n\n\n```python\nclass MyExplorer(flexs.Explorer):\n    \"\"\"Your explorer here\"\"\"\n    def __init__(self,\n                 model,\n                 rounds,\n                 starting_sequence,\n                 sequences_batch_size,\n                 model_queries_per_batch,\n                 **kwargs):\n\n        name = f\"MyExplorer_{**kwargs}\"\n        super().__init__(\n            model,\n            name,\n            rounds,\n            sequences_batch_size,\n            model_queries_per_batch,\n            starting_sequence,\n        )\n        \"Your custom attributes here\"\n\n    def propose_sequences(self, measured_sequences_data):\n        \"\"\"\n        Your method implementation overriding the main explorer.\n        It is allowed to make *model_queries_per_batch* queries to the model\n        and make *sequences_batch_size* proposals in return.\n        \"\"\"\n\n        return sequences, scores\n```\n\n#### Baseline Explorers\n\n- [Random Explorer](flexs/baselines/explorers/random.py): A baseline random explorer.\n\n#### Evolutionary Algorithms\n- [Naive Genetic Algorithm, Wright-Fisher](flexs/baselines/explorers/genetic_algorithm.py): A standard Wright-Fisher process that has access to an oracle for pre-screening. \n\n- [CMA-ES](flexs/baselines/explorers/cmaes.py): The CMA-ES algorithm that optimizes a continuous relaxation of one-hot vectors encoding sequences (another evolutionary baseline). \n\n- [ADALEAD](flexs/baselines/explorers/adalead.py) â­ï¸: ADALEAD is our recommended \"benchmark\" algorithm as it is robust to hyperparameters, and is relatively fast in execution. It also compares strongly to other state of the art algorithms.\n\n```\n@article{sinai2020adalead,\n  title={AdaLead: A simple and robust adaptive greedy search algorithm for sequence design},\n  author={Sinai, Sam and Wang, Richard and Whatley, Alexander and Slocum, Stewart and Locane, Elina and Kelsic, Eric},\n  journal={arXiv preprint},\n  year={2020}\n}\n```\n\n#### DbAS and CbAS\n- [CbAS and DbAS](flexs/baselines/explorers/explorers/cbas_dbas.py)\n```\n@article{brookes2019conditioning,\n  title={Conditioning by adaptive sampling for robust design},\n  author={Brookes, David H and Park, Hahnbeom and Listgarten, Jennifer},\n  journal={arXiv preprint arXiv:1901.10060},\n  year={2019}\n}\n@article{brookes2018design,\n  title={Design by adaptive sampling},\n  author={Brookes, David H and Listgarten, Jennifer},\n  journal={arXiv preprint arXiv:1810.03714},\n  year={2018}\n}\n```\n\n#### Reinforcement Learning Algorithms\nAdaptations of the following RL algorithms.\n\n- [DQN](flexs/baselines/explorers/dqn_explorer.py)\n\n- [PPO](flexs/baselines/explorers/ppo.py)\n\n- [DyNAPPO](flexs/baselines/explorers/dyna_ppo.py): See the following citation.\n```\n@inproceedings{angermueller2019model,\n  title={Model-based reinforcement learning for biological sequence design},\n  author={Angermueller, Christof and Dohan, David and Belanger, David and Deshpande, Ramya and Murphy, Kevin and Colwell, Lucy},\n  booktitle={International Conference on Learning Representations},\n  year={2019}\n}\n```\t\n#### Bayesian Optimization \n\n- [Evolutionary/Enumerative BO](flexs/baselines/explorers/bo.py): Bayesian optimization with sparse sampling of the mutation space. A fully enumerated (when possible) is also implemented mutation space.\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/samsinai/FLEXS",
    "keywords": "",
    "license": "Apache 2.0",
    "maintainer": "",
    "maintainer_email": "",
    "name": "flexs",
    "package_url": "https://pypi.org/project/flexs/",
    "platform": "",
    "project_url": "https://pypi.org/project/flexs/",
    "project_urls": {
      "Homepage": "https://github.com/samsinai/FLEXS"
    },
    "release_url": "https://pypi.org/project/flexs/0.2.8/",
    "requires_dist": [
      "cma",
      "editdistance",
      "numpy (>=1.16)",
      "pandas (>=0.23)",
      "torch (>=0.4)",
      "scikit-learn (>=0.20)",
      "tape-proteins",
      "tensorflow (>=2)",
      "tf-agents (>=0.7.1)"
    ],
    "requires_python": ">=3.5",
    "summary": "FLEXS: an open simulation environment for developing and comparing model-guided biological sequence design algorithms.",
    "version": "0.2.8",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 9192470,
  "releases": {
    "0.2.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d978cbc5c08f25878a34a79dfad63dc8b94e5b633ff009e094071fd41b220ad9",
          "md5": "ab09a189e9e0a735a8d42269b8570f05",
          "sha256": "ca5db9feaceaf92fa9b550b2bdfb50afebed7b11d5a18271231eed69ca8485db"
        },
        "downloads": -1,
        "filename": "flexs-0.2.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "ab09a189e9e0a735a8d42269b8570f05",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.5",
        "size": 59649,
        "upload_time": "2020-10-03T19:52:16",
        "upload_time_iso_8601": "2020-10-03T19:52:16.471719Z",
        "url": "https://files.pythonhosted.org/packages/d9/78/cbc5c08f25878a34a79dfad63dc8b94e5b633ff009e094071fd41b220ad9/flexs-0.2.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1da39b4e0760b3fc9b3d5df20f376873377c0df2dd3b5c2832e8551e6c964da0",
          "md5": "28adbccc1f15328e54cef6cdad743e4a",
          "sha256": "6af824ebf654643284da0159b6bfe99ff1a37721de219a8a6e3d7f494e9d0d7f"
        },
        "downloads": -1,
        "filename": "flexs-0.2.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "28adbccc1f15328e54cef6cdad743e4a",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.5",
        "size": 72666,
        "upload_time": "2021-01-06T00:12:02",
        "upload_time_iso_8601": "2021-01-06T00:12:02.831216Z",
        "url": "https://files.pythonhosted.org/packages/1d/a3/9b4e0760b3fc9b3d5df20f376873377c0df2dd3b5c2832e8551e6c964da0/flexs-0.2.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "45549dba9f0b4cd99a06606f716b8f8a7eb9db728761ac8a2d96d91d79e363bc",
          "md5": "874fbf2dea7e23ac17c19d2009b452c6",
          "sha256": "a4ecba060300da5a55a8d4d8cc66494397aa1dea2eccb11e4ef6e89f9f5bc1bb"
        },
        "downloads": -1,
        "filename": "flexs-0.2.1.tar.gz",
        "has_sig": false,
        "md5_digest": "874fbf2dea7e23ac17c19d2009b452c6",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.5",
        "size": 57589,
        "upload_time": "2021-01-06T00:12:04",
        "upload_time_iso_8601": "2021-01-06T00:12:04.114439Z",
        "url": "https://files.pythonhosted.org/packages/45/54/9dba9f0b4cd99a06606f716b8f8a7eb9db728761ac8a2d96d91d79e363bc/flexs-0.2.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "46e4a4865152aa3e6b853bbd4bd81305f8a5abe82ab90015db917e7ff484eb74",
          "md5": "7006aab3d19987562b5c16eca3338f89",
          "sha256": "8f865be8a20494c4cad02e60ea7de466ef5245df65d133e1052cfed9e22918e3"
        },
        "downloads": -1,
        "filename": "flexs-0.2.2-py3.7.egg",
        "has_sig": false,
        "md5_digest": "7006aab3d19987562b5c16eca3338f89",
        "packagetype": "bdist_egg",
        "python_version": "3.7",
        "requires_python": ">=3.5",
        "size": 152249,
        "upload_time": "2021-01-07T05:32:37",
        "upload_time_iso_8601": "2021-01-07T05:32:37.078818Z",
        "url": "https://files.pythonhosted.org/packages/46/e4/a4865152aa3e6b853bbd4bd81305f8a5abe82ab90015db917e7ff484eb74/flexs-0.2.2-py3.7.egg",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "367b380a63cdd64d303558998f6750d201825f20edffcb326af5b3d76cb48bbc",
          "md5": "1b5b5b287e657a60b92fc056e9814aef",
          "sha256": "ccdcdae2fadeab9b80a95a484dc4a94a163cc771fbfd71dd2fc531a4c8907bdd"
        },
        "downloads": -1,
        "filename": "flexs-0.2.3-py3.7.egg",
        "has_sig": false,
        "md5_digest": "1b5b5b287e657a60b92fc056e9814aef",
        "packagetype": "bdist_egg",
        "python_version": "3.7",
        "requires_python": ">=3.5",
        "size": 103288587,
        "upload_time": "2021-01-07T19:12:28",
        "upload_time_iso_8601": "2021-01-07T19:12:28.284304Z",
        "url": "https://files.pythonhosted.org/packages/36/7b/380a63cdd64d303558998f6750d201825f20edffcb326af5b3d76cb48bbc/flexs-0.2.3-py3.7.egg",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "fd4d484253982792404c0696afac0bacaba2bfbfe20891dd96f0a98caa6527d8",
          "md5": "6211940db9c906e21a390ae7e12a5844",
          "sha256": "549d5b232b3c51f1915a0fcd8999321b4168400d16b0d84062d21a9633d504ee"
        },
        "downloads": -1,
        "filename": "flexs-0.2.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "6211940db9c906e21a390ae7e12a5844",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.5",
        "size": 103218408,
        "upload_time": "2021-01-07T19:24:13",
        "upload_time_iso_8601": "2021-01-07T19:24:13.952739Z",
        "url": "https://files.pythonhosted.org/packages/fd/4d/484253982792404c0696afac0bacaba2bfbfe20891dd96f0a98caa6527d8/flexs-0.2.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e6c71ec3ec4cd93a4c9445f0d663c891af5f69adac3cc8f17f195dffd8f90110",
          "md5": "91be3bf72372d0a4d211429e0369612d",
          "sha256": "ef264d8e7bfdd99db9ee803cee0ddbc18484c40c9de6ffcff09131f9c8e32400"
        },
        "downloads": -1,
        "filename": "flexs-0.2.4.tar.gz",
        "has_sig": false,
        "md5_digest": "91be3bf72372d0a4d211429e0369612d",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.5",
        "size": 57692,
        "upload_time": "2021-01-07T19:24:17",
        "upload_time_iso_8601": "2021-01-07T19:24:17.493240Z",
        "url": "https://files.pythonhosted.org/packages/e6/c7/1ec3ec4cd93a4c9445f0d663c891af5f69adac3cc8f17f195dffd8f90110/flexs-0.2.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "46236520716205e3de7df6ad93eb384c628fee82bbc6f8b18b0ddad9d8716cc7",
          "md5": "aa9faaf9355df604be987583bfb82327",
          "sha256": "d3f9a2bb7feb49a011baef521dd2ff45fc75d697fa0866b36726b32504933699"
        },
        "downloads": -1,
        "filename": "flexs-0.2.5-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "aa9faaf9355df604be987583bfb82327",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.5",
        "size": 102796551,
        "upload_time": "2021-01-08T02:10:08",
        "upload_time_iso_8601": "2021-01-08T02:10:08.026142Z",
        "url": "https://files.pythonhosted.org/packages/46/23/6520716205e3de7df6ad93eb384c628fee82bbc6f8b18b0ddad9d8716cc7/flexs-0.2.5-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "826458160aff5a54b234152f929c8435aa50efe95996dcca3bf9b6c3c6d51719",
          "md5": "b99ee059554a393c03afb5d71d31dd8b",
          "sha256": "894e7e48b0c53e9f9ca2b63f674c26dbb7b00e6ee2b99ec6da500d8803182f52"
        },
        "downloads": -1,
        "filename": "flexs-0.2.5.tar.gz",
        "has_sig": false,
        "md5_digest": "b99ee059554a393c03afb5d71d31dd8b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.5",
        "size": 58340,
        "upload_time": "2021-01-08T02:10:13",
        "upload_time_iso_8601": "2021-01-08T02:10:13.019395Z",
        "url": "https://files.pythonhosted.org/packages/82/64/58160aff5a54b234152f929c8435aa50efe95996dcca3bf9b6c3c6d51719/flexs-0.2.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8f6500fc6762a52378942edf89af7a96fe6652c9644b73b42a7abb524f86c7e9",
          "md5": "eb5f6a9545156e63014ca8e979bcd854",
          "sha256": "039ee38e353e9b4821f794883e1b68cff737d032604efa65851fdf1c3ef550d9"
        },
        "downloads": -1,
        "filename": "flexs-0.2.6-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "eb5f6a9545156e63014ca8e979bcd854",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.5",
        "size": 103218959,
        "upload_time": "2021-01-08T04:18:30",
        "upload_time_iso_8601": "2021-01-08T04:18:30.076226Z",
        "url": "https://files.pythonhosted.org/packages/8f/65/00fc6762a52378942edf89af7a96fe6652c9644b73b42a7abb524f86c7e9/flexs-0.2.6-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c40fffd1b59042724d3cb45078f89734da238c8e739365017a5be11ebedf27f3",
          "md5": "41f432db90baa92b6d602caf1f7d63d7",
          "sha256": "7d5930d832e81f08f1cf0e339e924a4fe356d4752d468ba313c8f8e811632a2f"
        },
        "downloads": -1,
        "filename": "flexs-0.2.6.tar.gz",
        "has_sig": false,
        "md5_digest": "41f432db90baa92b6d602caf1f7d63d7",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.5",
        "size": 58345,
        "upload_time": "2021-01-08T04:18:33",
        "upload_time_iso_8601": "2021-01-08T04:18:33.411942Z",
        "url": "https://files.pythonhosted.org/packages/c4/0f/ffd1b59042724d3cb45078f89734da238c8e739365017a5be11ebedf27f3/flexs-0.2.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.7": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e5861451d2cedbd1ba0130ae75a8d70a61f8d5fc93ffbcbe0114fc8d7678a8ea",
          "md5": "7c20f9c386efbab07fe939d259222d2f",
          "sha256": "d3537a4745ee1438b0b457bf39b023e80d47d8240378c71ab3e5cbf63da29da5"
        },
        "downloads": -1,
        "filename": "flexs-0.2.7-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "7c20f9c386efbab07fe939d259222d2f",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.5",
        "size": 103219095,
        "upload_time": "2021-01-08T06:01:04",
        "upload_time_iso_8601": "2021-01-08T06:01:04.766487Z",
        "url": "https://files.pythonhosted.org/packages/e5/86/1451d2cedbd1ba0130ae75a8d70a61f8d5fc93ffbcbe0114fc8d7678a8ea/flexs-0.2.7-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b962cf341e5a3f37da0e4aa9b3f275875136aa49262ee353dbb29c7e193f6426",
          "md5": "ed51de9aaa5157e2d6a5cd19d3cfcf15",
          "sha256": "aa83d7f9582b27dd2f4b7d5db5bdddc52de68b255a38c12c4ac791092b35dc69"
        },
        "downloads": -1,
        "filename": "flexs-0.2.7.tar.gz",
        "has_sig": false,
        "md5_digest": "ed51de9aaa5157e2d6a5cd19d3cfcf15",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.5",
        "size": 58477,
        "upload_time": "2021-01-08T06:01:07",
        "upload_time_iso_8601": "2021-01-08T06:01:07.831148Z",
        "url": "https://files.pythonhosted.org/packages/b9/62/cf341e5a3f37da0e4aa9b3f275875136aa49262ee353dbb29c7e193f6426/flexs-0.2.7.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.8": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e07a9e07aa7e18990198b74cb9aac95cbf3f2cd1b3aef5c0b2741f8fb1a4b6ae",
          "md5": "0e0afd2270b765e324c4c8fecb0d19ba",
          "sha256": "d43c8b24569c1a83736f517a94fc2dc3faeb8d7d5b5b46ca0701d7fe9a886a6c"
        },
        "downloads": -1,
        "filename": "flexs-0.2.8-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "0e0afd2270b765e324c4c8fecb0d19ba",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.5",
        "size": 103219195,
        "upload_time": "2021-01-21T12:47:21",
        "upload_time_iso_8601": "2021-01-21T12:47:21.978190Z",
        "url": "https://files.pythonhosted.org/packages/e0/7a/9e07aa7e18990198b74cb9aac95cbf3f2cd1b3aef5c0b2741f8fb1a4b6ae/flexs-0.2.8-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6aa02f830ccfb43104d4e9836de62693989b06ccc6fb13d165e379ff32b57d6f",
          "md5": "8a5b9698cd3d0bef47be193c7141bedb",
          "sha256": "76bceccd34f475e76b9a25f40542553015f5a1f5460f3358817904c9d42d333a"
        },
        "downloads": -1,
        "filename": "flexs-0.2.8.tar.gz",
        "has_sig": false,
        "md5_digest": "8a5b9698cd3d0bef47be193c7141bedb",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.5",
        "size": 58530,
        "upload_time": "2021-01-21T12:47:25",
        "upload_time_iso_8601": "2021-01-21T12:47:25.840085Z",
        "url": "https://files.pythonhosted.org/packages/6a/a0/2f830ccfb43104d4e9836de62693989b06ccc6fb13d165e379ff32b57d6f/flexs-0.2.8.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "e07a9e07aa7e18990198b74cb9aac95cbf3f2cd1b3aef5c0b2741f8fb1a4b6ae",
        "md5": "0e0afd2270b765e324c4c8fecb0d19ba",
        "sha256": "d43c8b24569c1a83736f517a94fc2dc3faeb8d7d5b5b46ca0701d7fe9a886a6c"
      },
      "downloads": -1,
      "filename": "flexs-0.2.8-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "0e0afd2270b765e324c4c8fecb0d19ba",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.5",
      "size": 103219195,
      "upload_time": "2021-01-21T12:47:21",
      "upload_time_iso_8601": "2021-01-21T12:47:21.978190Z",
      "url": "https://files.pythonhosted.org/packages/e0/7a/9e07aa7e18990198b74cb9aac95cbf3f2cd1b3aef5c0b2741f8fb1a4b6ae/flexs-0.2.8-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "6aa02f830ccfb43104d4e9836de62693989b06ccc6fb13d165e379ff32b57d6f",
        "md5": "8a5b9698cd3d0bef47be193c7141bedb",
        "sha256": "76bceccd34f475e76b9a25f40542553015f5a1f5460f3358817904c9d42d333a"
      },
      "downloads": -1,
      "filename": "flexs-0.2.8.tar.gz",
      "has_sig": false,
      "md5_digest": "8a5b9698cd3d0bef47be193c7141bedb",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.5",
      "size": 58530,
      "upload_time": "2021-01-21T12:47:25",
      "upload_time_iso_8601": "2021-01-21T12:47:25.840085Z",
      "url": "https://files.pythonhosted.org/packages/6a/a0/2f830ccfb43104d4e9836de62693989b06ccc6fb13d165e379ff32b57d6f/flexs-0.2.8.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}