{
  "info": {
    "author": "Santeri Paajanen, Shreyas Kaptan",
    "author_email": "santeri.e.paajanen@helsinki.fi",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Cython",
      "Programming Language :: Python :: 3"
    ],
    "description": "# Functional Sampling Tool\n\n## Requirements\n\n\nThe tool has only been tested on linux (ubuntu based distribution). In general there is nothing stopping it from working on other platforms, but do keep this in mind.\n\nAs prequisite knowledge you will need to know how to get around using the command line and how to run basic simulations in GROMACS.\n\n### Basic requirements\n\nThese you will need to have preinstalled before installing the package.\n\n1. Python 3.7 or higher (3.10 recommended)\n1. [GROMACS](https://www.gromacs.org)\n1. C++ compiler\n1. Optional: `rsync`\n\nGROMACS is only needed for grompping. This means that a [quick and dirty](https://manual.gromacs.org/current/install-guide/index.html#quick-and-dirty-installation) installation is enough. Do make sure it is the same major version that you plan on using for the simulation runs.\n\nThe C++ compiler is needed to compile a few of the trajectory transformation modules, which allow making broken molecules whole over the PBC. The package build process has been tested with the open source GCC-compiler, but in theory any compiler should work.\n\n`rsync` is needed to move the data between your local computer and the remote. It should be preinstalled at least on most linux distributions. If you run the tool on the machine you plan on running the simulations, it is not needed. Also you can work around it by manually moving the files with your chosen method. in that case simply do not use the push and pull methods of the tool.\n\n### Python modules\n\nThese you can either preinstall, or let either pip or conda install for you in the installation procedure\n\n1. NumPy\n1. matplotlib\n1. importlib_resources (only with with python<3.10) \n1. [MDAnalysis](https://docs.mdanalysis.org/stable/index.html)\n1. [scikit-learn](https://scikit-learn.org/stable/)\n1. Optional: [NetworkX](https://networkx.org/)\n\nNetworkX is only needed for ancestry graph building and is not installed by default. You can run the tool just fine, until you use the `fst analysis ancestry` command, which will throw an error. You can then just install the package any time and ancestry graphing will start working.\n\n\n## Installation\n\n\n### Quick and easy\n\nJust run\n```sh\npip install functional_sampling_tool\n```\n\nIf you run into any problem, please try the recommended way of installation before opening an issue.\n\n### Recommended way\n\nIn the recommended way we will use conda to make a new envirnonment. This way works independent of which Python version you use by default. If you do not already have it, [install conda](https://docs.conda.io/projects/conda/en/latest/user-guide/install/index.html).\n\n\nFirst, we will make a new conda environment dedicated just for the tool and activate it (if you have [mamba](https://mamba.readthedocs.io/en/latest/) installed, use it for the first command to speed up the process):\n\n```sh\nconda create -c conda-forge -n fst_env python=3.10 numpy matplotlib mdanalysis scikit-learn networkx\nconda activate fst_env\n```\n\nThis will also install the needed dependencies, so that they are handled by conda rather than pip.\n\nSecond, we run the command to install the package.\n\n```sh\npip install functional_sampling_tool\n```\n\nWhen the command finishes, it should be all done and the tool usable as `fst`.\n\n**Remember** that in this way you need to run `conda activate fst_env` once in every new terminal before using the tool. If you want to use this environment by default, add `conda activate fst_env` at the end of your `.bashrc`\n\n\n## Uninstalling\n\nIf you ever want to uninstall the tool just run (with the `fst_env` environment activated if you did the recommended installation).\n\n```sh\npip uninstall functional_sampling_tool\n```\n\n\n\n## How it works\n\n### Vocabulary\n\n 1. **Epoch**: the set of N runs that are run at the same time.\n 1. **Repetition** (rep): The individual runs within each epoch. i.e. there are N reps in each epoch.\n\n### Epoch choosing\n\nAfter each epoch, the user defined function is calculated for each frame, and a histogram is calculated, to get the distribution. The tool then smooths the distribution and finds the local minima within the boundaries defined by user. The starting points for each rep in the new epoch will chosen from these minima.\n\n### Clustering\n\nAfter a set amount of epochs, the tool will start to use a clustering method on the trajectories. This way it will try to identify different states of the structure, that have the same function value. A part of the repetitions will be started from the clusters with the lowest amount of data. The clustering is done by first making a histogram with much larger bins than before, and clustering the data in each bin separately.\n\n\n## Setup\n\nAt minimum you will need to copy the templates for `config.py` and  `sbatch_launch.sh` to your project folder. This can be done with\n```sh\nfst make-templates\n```\nafter which you should make sure the sbatch launch script matches your workflow and simulation methods. The parts `{epoch_number}` will be populated with the epoch number, in the example to rename each job.\n\nYou will also need to have a starting structure, which should be in `start.gro`, as well as a topology in `topol.top`, mdrun options in `mdrun.mdp` and an index file for grompping in `index_grompp.ndx` (for now this is required, in future version might only be needed if special groups are used in the `mdp`-file). Here is a tree view of how you project folder should look like to begin:\n\n```\n├── config.py *\n├── index_grompp.ndx\n├── start.gro\n├── mdrun.mdp\n├── topol.top\n└── sbatch_launch.sh *\n```\n\nThe files marked with an asterisk can be copied and modified from templates with `fst make-templates`, while the rest you should provide yourself. All the file names can differ from these and are defined in the config (except the config name, of course), these are just the defaults. The config name can be given as a command line argument **before the command** (e.g. `fst -c myconfig.py choose`).\n\n## Usage\n\nRun `fst -h` for help or `fst <cmd> -h` for help on specific command.\n\nAlmost all configuration should be done in the `config.py` file. The tool does have a few command line tools, but in principle these should only affect *what* is being done, not *how* it is being done (e.g. whether data should be pulled from the remote is a command line argument, but the remote name, excludes and such are in config).\n\nIf you have the configuration file in the same directory, named as `config.py`, just run as below. Otherwise add `fst -c <path/to/config>.py <cmd>`.\n\n### Basic commands\n\nTo initialize the first epoch and rsync it to the remote\n\n```sh\nfst init --push\n```\n\nAfter an epoch has finished, sync down from remote and make the choices for next epoch\n\n```sh\nfst choose --pull\n```\n\nCheck the figure and if everything is fine, sync up to remote\n\n```sh\nfst push\n```\n\nThen go to the remote machine and run the sbatch script under the epoch folder. Repeat the last two commands and run simulations until satisfied with the results.\n\n### Configuration\n\nAt the top of the config file (well, really anywhere in the file, but at the top in the examples) you can setup the remote options, eg. the directory on the remote machine to be synced, and the remote name. The syncing will be done using `rsync`, to `<remote_name>:<remote_path>/`, so remote name should either be the full url (with `<username>@` prepended if username is not the same as on local machine), or just the hostname if you've defined it in `~/.ssh/config`.\n\n\nThe next most important settings to change are the selections, where you should define the selections to be used firstly to calculate the function, and secondly to calculate the clustering. Both can be either an MDAnalysis selection string, or if the `index_file` variable points to a gromacs index file, optionally an index group in the file. Note though, when using atom names in the selection, that in order to get the chain information properly, the initial gro file will be made into a PDB file, which will be used as the structure file when reading trajectory info, and this process sometimes may change the atom naming scheme. The example case README has a bit more info on this.\n\nLastly you should define the function itself in `function_val`. The only parameter it will get the positions of one repetition at a time as a `ndarray(n,m,3)`, for n frames and a selection of m atoms. It will also be used to calculate the intial function value, so it should work when `n=1` (But the shape will still be (1,m,3), so in most cases any code that works for the general case works for the initial value). As per MDAnalysis default units, the positions will be in ångströms.\n\n\n### Configuration options\n\nHere is a listing of all the variables you should need in normal usage. The default values are defined in `src/default_config.py`. If there is no default value, this means that it must be defined in the config file. For now there is no check that everything is defined, and the program will simply crash at some point.\n\n#### Remote options\n\n| Variable | Description | Default value |\n| --- | - | - |\n| `remote_dir` | Remote dir to sync the project to |  - |\n| `remote_name` | Hostname of the remote machine | - |\n| `rsync_excludes` | A list of patterns to exclude from the syncing process. | *See below* |\n\nBy default the rsync excludes are\n\n```python\nrsync_excludes = [\"fval_data.npz\", \".mdrun.xtc_offsets.lock\", \".mdrun.xtc_offsets.npz\"]\n```\n\n\n#### Sampling variables\n\n\n| Variable | Description | Default value |\n| --- | - | - |\n| `N` | The number of repetitions per epoch. Changing it after a few epochs, will only affect new epochs being run. | - |\n\n\n\n#### Simulations grompping\n\n\n| Variable | Description | Default value |\n| --- | - | - |\n| `gmx` | The name (including the path if it is not in your `PATH`) of the gromacs binary. | `\"gmx\"` |\n| `mdp` | The name of the `.mdp` file. | `\"mdrun.mdp\"` |\n| `topol` | The name of the topology file. | `\"topol.top\"` |\n| `ndx` | The name of the index file used for grompping. | `\"index_grompp.ndx\"` |\n| `restraint_file` | The file to give to the `-r` option of grompp, to use for restraints. `\"start\"` will use the starting structure of the repetitions, `\"initial\"` will use the initial structure. Any other (nonempty) string will be interpreted as a path to the file. If it evaluates to False, the option will not be passed to gromacs. | `False` |\n| `maxwarn` | How many warnings to ignore. Can be useful, e.g. when generating velocities while using Nosé-Hoover thermostat. | 0 |\n\n\n\n#### Function calculations\n\n\n| Variable | Description | Default value |\n| --- | - | - |\n| `select_str` | The selection string (or index group) used for the function calculation. | - |\n| `select_str_clust` | The selection string (or index group) used for the clustering. | - |\n| `initial_struct` | The initial structure file, either as a single string or list of strings. The first file has to be one that MDAnalysis can read as a structure file without needing a trajectory. E.g. TPR files are (currently, as of MDAnalysis v2.2.0) not enough. GRO and PDB are guaranteed to work. The rest can be any trajectory files read by MDAnalysis, with matching number of atoms. | `\"start.gro\"` |\n| `index_file` | `None` or the name of the index file, where the index groups of the selections are. | `None` |\n| `minval`/`maxval` | The boundaries for the functional sampling. One of them can be the string \"start\", to use the initial value, and either can be `None` to use no boundary (only useful at the beginning). | - |\n| `function_val` | The function to be sampled. | - |\n\n\n#### Trajectory transformations\n\n\n##### General\n\nThese options change the on-the-fly transformations that are done to the trajectory as it is being read.\n\n| Variable | Description | Default value |\n| --- | - | - |\n| `unwrap_mols` | Whether to unwrap molecules (make them whole if broken over the PBC). | `False` |\n| `unwrap_sel` | The selection string (or index group) used for unwrapping. Only atoms within this selection will be considered, so if parts of a chain are missing, only those parts that have unbroken bonded graphs will be made whole, each of them separately. In general you should make a selection with at least the backbone connecting whichever parts you want whole. This should be fast enough even with large proteins, but including the water can effect performance badly. The default selection of \"protein\" should work in most cases.| `\"protein\"` |\n| `unwrap_starters` | `None` or the selection string (or index group) used as \"starters\". These atoms will be the starting points of making the molecules whole. In effect, they are guaranteed to be inside the box after the process. If `None`, or if a molecule does not have any atoms in the group, the atom with the smallest index will be used. | `None` |\n| `mols_in_box` | Whether to put centre of mass of molecules back in box after unwrapping. Only the coordinates in `unwrap_sel` are moved and considered for the centre of mass, **however**, unlike for unwrapping, molecules are moved as a whole, even if they are missing parts in between. This option is ignored if `unwrap_mols=False`.| `False` |\n\n##### Clustering\n\nThese options only affect the coordinates used for clustering. The transformations are added after the fval coordinates have been read, but before the clustering coordinates.\n\n| Variable | Description | Default value |\n| --- | - | - |\n| `clust_centre` | Whether to move the centre of mass of the clustering coordinates to match the inital structure. Ignored if `clust_superpos=True` | `True` |\n| `clust_superpos` | Whether to move the centre of mass of the clustering coordinates to match the inital structure **and** rotate for optimal fit (minimum mass weighted RMSD). | `False` |\n\n#### Advanced options\n\nIn most cases you should not need these, but may be helpful in others.\n\n| Variable | Description | Default value |\n| --- | - | - |\n| `rng_seed` | Random number generator seed. Can be anything that `numpy.random.default_rng()` takes as a seed, usually an int or sequence of ints. `None` means to pull genearte the state randomly, i.e. the run will be unreproducible. If the seed is not `None`, you can rerun the tool (as long as the data or etting havenot changed) with the same seed to reproduce the exact same choices. | `None` |\n| `ignore_reps` | List of repetitions (as tuples of epoch number and repetiton number, as ints) to ignore. E.g. `[(1,3),(4,5)]` to ignore repetition 3 of epoch 1 and repetition 5 of epoch 4. | `[]` |\n| `ignore_epcs` | List of epoch numbers (as ints) to ignore. E.g. `[1,3]` to ignore epochs 1 and 3. | `[]` |\n| `ignore_from_start` | Number of frames to ignore from the start. | 0 |\n| `stride` | Only consider every N'th frame | 1 |\n| `data_per_bin` | On average, at least this much data should be in the histogram bins within the boundaries. | 100 |\n| `maxbins` | Maximum number of histogram bins within the boundaries. | 100 |\n| `smooth_window` | The rolling average window for smoothing the distribution. | 10 |\n| `minchoice` | Minimum number of frames, from which a choice will be made. If the chosen bin has less frames, this many of the closest frames in function value are used as the pool of frames to choose from. | 100 |\n| `peak_options` | A dictionary of keyword arguments for [scipy.signal.find_peaks](https://docs.scipy.org/doc/scipy/reference/generated/scipy.signal.find_peaks.html), which will be used for dfinding the local minima and maxima from the distributions. | `{\"width\":5, \"distance\":10}` |\n| `choice_crit` | Maximum height to choose from, as fraction from minimum found height to maximum. The final maximum height to allow choosing from will be `(maxh-minh)*choice_crit+minh`, where maxh and minh are the highest and lowest histogram bin heights. Default is halfway between. | 0.5 |\n| `allow_choice_duplicates` | Whether to allow choosing the same frame during the same epoch more than once. If this is False, minchoice **must** be greater than, or equal to N. This only affects duplicates from a single choice, so edge cases of multiple choices within a region of low sampling, the minchoice values might overlap and still produce duplicates. | `False` |\n| `cumulative_histogram` | If True, the hstogram will be made as a cumulative one. Otherwise each epoch is plotted only including its own data | `True` |\n| `histogram_max_epochs` | Maximum number of (latest) epochs to plot into histogram. For the cumulative case all epoch are plotted, but older ones with single color and no key in legend. | 15 |\n| `clust_data_per_bin` | Same as `data_per_bin`, but for the histogram when clustering. | 1000 |\n| `clust_maxbins` | Same as `maxbins`, but for the histogram when clustering. | 10 |\n| `epochs_pre_clust` | Run this many epochs without clustering. | 3 |\n| `maxclust` | Maximum number of clusters in bin. | 15 |\n| `clust_choice_frac` | Fraction of the choices to be made from clustering. | 0.5 |\n| `clust_tol` | Tolerance to choose the number of clusters. | 0.1 |\n\n\n\n### Specific use cases and tips\n\n#### Multiple starting structure\n\nIf you want to have multiple different starting points, you can specify `initial_struct` in the config as a list of filenames. The first one will be used only as a topology and a reference structure, while the rest will only be used as starting points for the initial epoch. The repetitions will be started in the order the files are listed, iterating over all frames in each one. If more frames than repetitons are found, a warning will be raised. If there are less frames than repetitions, the iteration is simply started from beginning as many times as needed.\n\nThe `init` command makes a similar `origin.txt` file as the `choose` command, so you can check where the initial frame for each rep came from. The epoch will always be zero, the \"rep\" will be the index of the file in `initial_struct`. The function value is not yet calculated in the initialisation, so it will only be nan.\n\n#### Using the MDAnalysis selection objects in the calculation of the function\n\nTo use the selection object, use the variable `sel` in the function (make sure that you do not overwrite it making it local, or use `global sel` at the beginning of the function). Similarily you can access the universe with `struct`.\n\nAs an example consider the external comand `command` that reads in a single frame from \"tmp_analysis.pdb\" and outputs the result to stdout. The function could then be\n\n\n```python\nimport subprocess as subp\n\ndef function_val(positions):\n    results = []\n    # Iterate over the first axis (time)\n    for p in positions:\n        # Set the selection positions\n        sel.positions = p\n        # Write the selection\n        sel.write(\"tmp_analysis.pdb\")\n        # Run external command\n        compProc = subp.run(\"command\", capture_output=True, text=True)\n        # get output\n        results.append(float(compProc.stdout))\n    \n    return results\n```\n\nFor now the program only makes a  single selection. However, do remember that the config file is a python script, so you can write any arbitrary code. This means you can make your own selection objects by adding the following lines anywhere in the config:\n\n```python\nimport MDAnalysis as mda\n_univ  = mda.Universe(\"initial/start.pdb\")\n_mysel = univ.select_atoms(\"protein and resid 200-300 and backbone\")\n```\n\nHere we used a leading underscore, so that we do not accidentally overwrite any variables the program adds to the module, like `sel` and `struct`. We cannot yet use those variables, since they are of course not added yet when the config is imported, unlike the code within the function, which does not get called until later in the program.\n\nIn the future multiple selections might be supprted and this will become easier to deal with.\n\n\n#### Running custom script for function calculation\n\nThis is very \"work-around\"-ish solution and might get a better way to resolve in the future. Like with the selections, you can use the variable `current_dir`, which will be a `pathlib.Path` to the folder from which the positions were gotten from.\n\nFor now there is no nice way to get the initial value and at that point the `current_dir` variable will not be yet set. You can return it manually as in the example below. The actual value is only used for plotting purposes and does not affect choosing, so you can use a random value if you wish.\n\nIn this example we assume there is a bash script `fval.sh` in the project root, which is run in the repetition folder, producing a `fval.txt` file with just a single float per line:\n\n```python\nimport os\nimport subprocess as subp\n\ndef function_val(positions):\n    try:\n        # If this is just the first frame this will throw NameError\n        current_dir\n    except NameError:\n        # Return the initial value manually\n        return np.array([1.23456])\n\n    # run command in the 'current_dir'\n    subp.run([\"bash\", \"../../run.sh\"], cwd=current_dir)\n    # Read the output\n    return np.loadtxt(current_dir / \"fval.txt\")\n```\n\nIn this case the positions are ignored and you might want to set the `select_str` to something that only selects one or two atoms.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/molecularmachinist/functional_sampling_tool",
    "keywords": "",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "functional-sampling-tool",
    "package_url": "https://pypi.org/project/functional-sampling-tool/",
    "platform": null,
    "project_url": "https://pypi.org/project/functional-sampling-tool/",
    "project_urls": {
      "Bug Tracker": "https://github.com/molecularmachinist/functional_sampling_tool/issues",
      "Homepage": "https://github.com/molecularmachinist/functional_sampling_tool"
    },
    "release_url": "https://pypi.org/project/functional-sampling-tool/0.0.4/",
    "requires_dist": null,
    "requires_python": ">=3.7",
    "summary": "A tool for enhancing sampling in MD-simulations",
    "version": "0.0.4",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16633798,
  "releases": {
    "0.0.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d3055c5cec6b2c2ebb45ee42db2506e6317cf3e79027539943d0c6ee1479d9d2",
          "md5": "6bb773db425eb4db677e7a156c177b06",
          "sha256": "ef37a25587d1b964f5abc32f7ec1149557f9081653fd3902a027bd943fb592b6"
        },
        "downloads": -1,
        "filename": "functional_sampling_tool-0.0.4.tar.gz",
        "has_sig": false,
        "md5_digest": "6bb773db425eb4db677e7a156c177b06",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 193249,
        "upload_time": "2023-01-31T12:16:01",
        "upload_time_iso_8601": "2023-01-31T12:16:01.743706Z",
        "url": "https://files.pythonhosted.org/packages/d3/05/5c5cec6b2c2ebb45ee42db2506e6317cf3e79027539943d0c6ee1479d9d2/functional_sampling_tool-0.0.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "d3055c5cec6b2c2ebb45ee42db2506e6317cf3e79027539943d0c6ee1479d9d2",
        "md5": "6bb773db425eb4db677e7a156c177b06",
        "sha256": "ef37a25587d1b964f5abc32f7ec1149557f9081653fd3902a027bd943fb592b6"
      },
      "downloads": -1,
      "filename": "functional_sampling_tool-0.0.4.tar.gz",
      "has_sig": false,
      "md5_digest": "6bb773db425eb4db677e7a156c177b06",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7",
      "size": 193249,
      "upload_time": "2023-01-31T12:16:01",
      "upload_time_iso_8601": "2023-01-31T12:16:01.743706Z",
      "url": "https://files.pythonhosted.org/packages/d3/05/5c5cec6b2c2ebb45ee42db2506e6317cf3e79027539943d0c6ee1479d9d2/functional_sampling_tool-0.0.4.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}