{
  "info": {
    "author": "Agence Data Services PE Nantes",
    "author_email": "",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "[![pypi badge](https://img.shields.io/pypi/v/gabarit.svg)](https://pypi.python.org/pypi/gabarit)\n![NLP tests](https://github.com/OSS-Pole-Emploi/gabarit/actions/workflows/nlp_build_tests.yaml/badge.svg)\n![NUM tests](https://github.com/OSS-Pole-Emploi/gabarit/actions/workflows/num_build_tests.yaml/badge.svg)\n![VISION tests](https://github.com/OSS-Pole-Emploi/gabarit/actions/workflows/vision_build_tests.yaml/badge.svg)\n![NLP wheel](https://github.com/OSS-Pole-Emploi/gabarit/actions/workflows/nlp_wheel.yaml/badge.svg)\n![NUM wheel](https://github.com/OSS-Pole-Emploi/gabarit/actions/workflows/num_wheel.yaml/badge.svg)\n![VISION wheel](https://github.com/OSS-Pole-Emploi/gabarit/actions/workflows/vision_wheel.yaml/badge.svg)\n[![License: AGPL v3](https://img.shields.io/badge/License-AGPL%20v3-blue.svg)](https://www.gnu.org/licenses/agpl-3.0)\n[![Generic badge](https://img.shields.io/badge/python-3.7|3.8-blue.svg)](https://shields.io/)\n\n\n# Gabarit - Templates Data Science\n\nGabarit provides you with a set of python templates (a.k.a. frameworks) for your Data Science projects. It allows you to generate a code base that includes many features to speed up the production and testing of your AI models. You just have to focus on the core of Data Science.\n\n---\n\n# Licence\n\nThis project is distributed under the GNU AFFERO GENERAL PUBLIC LICENSE V3.0. Please check the LICENSE file.\n\n---\n\n# Table of Contents\n- [1. Philosophy](#philosophy)\n\t- [1.1 Frameworks](#frameworks)\n\t- [1.2 Guidelines](#guidelines)\n\t- [1.3 Prerequisites](#prerequisites)\n- [2. Usage](#usage)\n\t- [2.1 Installation](#installation)\n\t- [2.2 Kickstart a new project](#newproject)\n\t- [2.3 Setup the new project](#setup)\n\t- [2.4 General principles](#principles)\n\t- [2.5 Main steps of a given project](#steps)\n\t- [2.6 Data formats](#format)\n- [3. Features](#features)\n\t- [3.1 Model saving and reloading](#save)\n\t- [3.2 Third party AI modules](#modules)\n\t- [3.3 DVC](#dvc)\n\t- [3.4 MLFlow](#mlflow)\n\t- [3.5 Streamlit demonstrator](#streamlit)\n\t- [3.6 Exploratory Data Analysis (EDA)](#eda)\n\t- [3.7 Misc.](#misc)\n- [4. Industrialization](#indus)\n\t- [4.1 Principe](#principles2)\n\t- [4.2 Update your model](#upd)\n\t- [4.3 Unit tests](#ut)\n- [5. Differences between the frameworks](#differences)\n\t- [5.1 NLP Framework](#nlp)\n\t- [5.2 Numeric framework](#numeric)\n\t- [5.3 Computer Vision framework](#vision)\n- [6. Misc.](#misc2)\n- [7. Security warning](#security)\n- [8. Ethics](#ethics)\n- [9. Contacts](#contacts)\n\n\n## 1. Philosophy <a name=\"philosophy\"></a>\n\nAs a team, we strive to help Data Scientists across the board (and ourselves!) build awesome IA projects by speeding up the development process. This repository contains several frameworks allowing any data scientist, IA enthousiast (or developper of any kind, really) to kickstart an IA project from scratch.  \n\nWe hate it when a project is left in the infamous POC shadow valley where nice ideas and clever models are forgotten, thus we tried to pack as much production-ready features as we could in these frameworks.  \n\nAs Hadley Wickhman would say: \"you can't do data science in a GUI\". We are strong believers that during a data science or IA project, you need to be able to fine tune every nooks and crannies to make the best out of your data.  \n\nTherefore, these frameworks act as project templates that you can use to generate a code base from nothing (except for a project name). Doing so would allow your fresh and exciting new project to begin with loads of features on which you wouldn't want to focus this early :\n- Built-in models: from the ever useful TF/IDF + SVM to the more recent transformers\n- Model-agnostic save/load/reload : perfect to embed your model behind a web service\n- Generic training/predict scripts to work with your data as soon as possible\n- DVC & MLFlow integration (you have to configure it to point to your own infrastructures)\n- Streamlit demo tool\n- ... and so much more !\n\n\n### 1.1 Frameworks <a name=\"frameworks\"></a>\n\nThree IA Frameworks are available:\n\n- **NLP**, to tackle classification use cases on textual data\n\n\t-\tRelies on the Words'n fun module for the preprocessing requirements\n\n\t-   Supports :\n\n\t\t- Mono Class / Mono Label classification\n\n\t\t- Multi Classes / Mono Label classification\n\n\t\t- Mono Class / Multi Labels classification\n\n\n- **Numeric** to tackle classification and regression use cases on numerical data\n\n\t- Supports :\n\n\t\t- Regression\n\t\t- Multi Classes / Mono Label classification\n\t\t- Mono Class / Multi Labels classification\n\n\n- **Computer Vision** to tackle classification use cases on images\n\n\t- Supports\n\n\t\t- Mono Class / Mono Label classification\n\t\t- Multi Classes / Mono Label classification\n\t\t- Area of interest detection\n\n\nThese frameworks have been developped to manage different subjects but share a common structure and a common philosophy. Once a project made using a framework is in production, any other project can be sent into production following the same process.\nAlong with these frameworks, an API template has been developped and should soon be open sourced as well. With it, you can expose framework made models in no time !\n\n\n\n### 1.2 Guidelines  <a name=\"guidelines\"></a>\n\nAny project generated through one of the framework consists mainly of code: obviously feel free to adapt it to your needs. However we do encourage users to try to keep the overall structure as is so that it would stay consistent with any project created afterwards thus making the whole production steps easier.\n\nSome usual additions to a newly created project:\n\n- Script to download data\n\n- Data transformation script. Here we do not encapsulate preprocessing steps that might be model related but high level data transformation (json to csv, dealing with data duplicates, etc...). Beware that preprocessing steps should be kept as close to the model as possible to ensure that the preprocessing pipeline can be serialized along with the model (thus enabling its reuse in a production environement).\n\n- etc...\n\n- Feel free to contribute and add (through a MR) any additionnal feature that you deem necessary and that could be useful to others in the future\n\n\n### 1.3 Prerequisites  <a name=\"prerequisites\"></a>\n\nTo use these frameworks, you should already have python >= 3.7 installed. Note that this project started in python 3.7 but is now tested with python 3.8.\nObviously any prior knowledge of the holy trinity of python ML modules (pandas, sklearn, numpy) alongside Deep Learning frameworks (torch & tensorflow/keras) would be incredibly useful.\n\n## 2. Usage  <a name=\"usage\"></a>\n\n\n### 2.1 Installation  <a name=\"installation\"></a>\n\nWe packaged this project such that it can be directly installed from PyPI : `pip install gabarit` .  \nHowever, it is not really necessary as this just intalls Jinja2==3.0.3 and adds some entry points. Basically you can manually install Jinja2 `pip install Jinja2==3.0.3` and you'll be able to generate new projects by calling the `generate_XXX_project.py` files individually.  \n\nIn the following we consider that you installed the project through pip, which enables entry points. Each entry point refers to a corresponding package generation file.\n\n\n### 2.2 Kickstart a new project  <a name=\"newproject\"></a>\n\nEach individual framework has a `generate_XXX_project` entry point that creates a new project code base.\nThey take several parameters as input :\n\n- **'-n'** or **'--name'** : Name of the package/project (lowercase, no whitespace)\n- **'-p'** or **'--path'** : Path (Absolute or relative) where to create the main directory of the project\n- **'-c'** or **'--config'** : Path (Absolute or relative) to a .ini configuration file.  \n\tAn default configuration file is given alongside each project. (`default_config.ini`).\n\tIt usually contains stuff like default encoding, default separator for .csv files, pip proxy settings, etc.\n- **'--upload'** or **'--upload_intructions'** : Path (Absolute or relative) to a file that contains a list of instructions to upload a trained model to your favorite storage solution.\n- **'--dvc'** or **'--dvc_config'** : Path (Absolute or relative) to a DVC configuration file. If not provided, DVC won't be used.\n\n\nExample : `generate_nlp_project -n my_awesome_package -p my_new_project_path -c my_configuration.ini --upload my_instructions.md --dvc dvc_config`\n\n\n### 2.3 Setup the new project  <a name=\"setup\"></a>\n\n- (Optionnal) We strongly advise to create a python virtual env\n\n\t- `pip install virtualenv`\n\n\t- `python -m venv my_awesome_venv`\n\n\t- `cd my_awesome_venv/Scripts/ && activate` (windows) or `source my_awesome_venv/bin/activate` (linux)\n\n- Requirements : `pip install --no-cache-dir -r requirements.txt`\n\n- Setup the project (in develop mode) : `python setup.py develop`\n\n\nIf the `make` tool is available, you can use the features provided in `Makefile`:\n\n- `create-virtualenv`\nand\n- `init-local-env`\n\n\n### 2.4 General principles  <a name=\"principles\"></a>\n\n\n- Data must be kept in a directory named `project_name-data/` located at the root folder of the project (i.e. where `setup.py` is).\n\n- Any data mapping or lookup can be kept under `project_name-data/sources/`. Warning : we're talking small files (< 1 Mo). Larger files should be managed through DVC (or git lfs for that matter).\n\n- Embedding files or equivalent should also be kept under `project_name-data/`.\n\n- Transformers models (e.g. Flaubert) should be kept under `project_name-transformers/` at the root directory of the project.\n\n- Trained models that you built and trained are automatically saved under `project_name-models/`.\n\n- Sklearn preprocessing pipelines (mainly from the numerical framework) are automatically stored within `project_name-pipelines/`.\n\n- The Computer Vision template has some more subdirectories in the `project_name-data/` folder:\n\n\t- `cache_keras`: subfolder that replaces the default keras' cache folder. Used with transfer learning classifiers.\n\n\t- `transfer_learning_weights`: subfolder that holds networks weights to be used with custom Faster RCNN implementation.\n\n\t- `detectron2_conf_files`: subfolder that holds all necessary configuration files to be used with the detectron2 models.\n\n\n- The `tests/` directory contains numerous unit tests allowing to automatically validate the intended behaviour of the different features. It is of utter importance to keep them up to date depending on your own developments to ensure that everything is working fine. Feel free to check already existing test files if you need some directions. Note that to launch a specific test case you just have to run : `python test_file.py`; for instance: `python tests/test_model_tfidf_dense.py`.\n\n- Numbered files contained in `project_name-scripts/` (e.g. `2_training.py`) hint the main steps of the project. They are indicative but we strongly advise to use them as it can speed up the development steps. It orchestrates the main features of this project: utils functions, preprocessing pipelines and model classes.\n\n- The `preprocess.py` file contains the different preprocessing pipeline available by default by the package/project. More specifically, it contains a dictionnary of the pipelines. It will be used to create working datasets (for instance training set, valid test and test set).\n\n-\tBeware that the first row of each generated csv file after running a preprocessing will contain the name of the preprocessing pipeline applied such that it can be reused in the future. Hence, this row (e.g. `#preprocess_P1`) is a metadata and **it has to be skipped** while parsing the csv file. Our templates provide a function (`utils.read_csv`) that does it automatically (it also returns the metadata).\n\n- The modelling part is built as follow :\n\n    - ModelClass : main class that manages how data / models are saved and how performance metrics are computed\n\n    - ModelPipeline : inherits from ModelClass, manages sklearn pipeline models\n\n    - ModelKeras : inherits from ModelClass, manages Keras/Tensorflow models\n\n    - ModelPyTorch : inherits from ModelClass, manages PyTorch models\n\n    - ModelXXX : built-in implementation of standard models used in the industry, inherits from one of the above classes when appropriate\n\n\n\n### 2.5 Main steps of a given project  <a name=\"steps\"></a>\n\nThe intended flow of a project driven by one of these framework is the following:\n\n- 0 – Utility files\n\n    - Split train/valid/test, sampling, embedding download, etc...\n\n\n- 1 – Preprocessing\n\n- 2 – Model training\n\n    - You can tune the parameters within the script or update the model class depending on your needs\n\n- 3 – Predictions on a dataset\n\n- 4 – Play with a streamlit demonstrator to showcase your models\n\n\n### 2.6 Data formats  <a name=\"format\"></a>\n\nInput data are supposed to be `.csv` files and the separator and encoding are to be provided during the generation of the project. It is obviously possible to use another datatype but a transformation step to `.csv` will be required to use the scripts provided by default.\n\nConcerning the prediction target, please refer to `2_training.py`. Usually we expect One Hot Encoded format for multi-labels use cases. For single-label use cases, a single column (string for classification, float for regression) is expected.\n\n\n## 3. Features  <a name=\"features\"></a>\n\nProjects generated through the frameworks provide several main features:\n\n\n\n### 3.1 Model saving and reloading  <a name=\"save\"></a>\n\nWhen a new model is instanciated, a directory is created within `project_name-models/`. It is named after the model type and its date of creation. Each model class exposes a `save` function that allow to save everything necessary to load it back:\n\n- Configuration file\n\n- Serialized object (.pkl)\n\n- \"standalone\" model\n\n- If Deep Learning : the network weights\n\n- etc.\n\nThus any model can be loaded through the `utils_models.load_model` function. The \"standalone\" mode ensures that the model can be loaded even after its code has been modified. Indeed, the .pkl file could be out of sync with the model class (it it was modified after the model had been saved). In this specific case, you can use `0_reload_model.py`.\n\n\n### 3.2 Third party AI modules  <a name=\"modules\"></a>\n\nTo this day, 3 main AI modules are used:\n\n- Scikit Learn\n\n- TensorFlow (Keras)\n\n- PyTorch (PyTorch Lightning)\n\nDo no hesitate to extend this list as is the case for LighGBM for instance.\n\n\n### 3.3 DVC  <a name=\"dvc\"></a>\n\nA new project can automatically be set up to run in sync with [DVC](https://dvc.org) if you supply the necessary configuration during project generation. We strongly advise to use DVC or similar (git lfs could do the trick) to keep both your code and your datasets synchronized to be able to re-train a model in the same conditions sometime down the line. Please refrain to upload large datasets (>1mo) directly on your version control system. Once setup, dvc configuration is available within `.dvc/`\n\n\n### 3.4 MLFlow  <a name=\"mlflow\"></a>\n\nA new project can automatically be set up to work alongside a [MLFlow](https://mlflow.org) instance. If you supply a MLFlow host url during project generation, training metrics will be automatically be send to your MLFlow server. Refer to `2_training.py` and `monitoring/model_logger.py` for further informations about this mechanism.\n\n\n### 3.5 Streamlit demonstrator  <a name=\"streamlit\"></a>\n\nA generic demonstrator is automatically created when you generate a new project with the frameworks. It relies on [Streamlit](https://streamlit.io) to expose a handy front-end to showcase your work. The demonstrator script can be easily modified to fit your specific needs.\n\n\n<img src=\"images/streamlit.PNG\" height=350px />\n\n\n### 3.6 Exploratory Data Analysis (EDA)  <a name=\"eda\"></a>\n\nSome frameworks provide a generic exploratory data analysis notebook to quickly grasp your datasets (`project_name-exploration/EDA/`). Feel free to have a go with it before starting heavy modelling work; EDA is an extraordinary opportunity to get to know your data which will greatly help you further down the line.\n\n### 3.7 Misc.  <a name=\"misc\"></a>\n\nSome additionnal features :\n\n\n- Basic hyper-parameter search is provided within `2_training.py`\n\n- You can use Tensorflow checkpoints to restart the training of a model without having to start from scratch\n\n- A custom made Learning Rate Scheduler for Tensorflow is also provided\n\n- Etc... feel free to explore the generated classes to learn more about what you can do !\n\n\n## 4. Industrialization  <a name=\"indus\"></a>\n\n\n### 4.1 Principles  <a name=\"principles2\"></a>\n\nIndustrialization of a project generated from one of the framework roughly follows the same pattern.\nOnce you have trained a model which is a release candidate :\n\n- Push the actual serialized model to your artifact repository (for instance artifactory or nexus)\n\n  - Instructions about how to technically push the model are usually specified within the model directory\n\n- Push the python module (the project you generated with a framework) to your artifact repository (it could be pypi or any system able to host a python repository)\n\n  - First you have to build a wheel of the project `.whl` : `python setup.py sdist bdist_wheel`\n\n  - Then you have to push it to your repository, for instance by using [twine](https://pypi.org/project/twine/) : `twine upload --username {USER} --password {PWD} --repository-url https://{repository_url} dist/*.whl`\n\n  - Note that we strongly advise to embed these steps within a Continuous Integration Pipeline and ensuring that all your unit tests are OK (you can use nose to run your test suite : `pip install nose nose-cov && nosetests tests/`)\n\n  - Beware, function `utils_models.predict` has to be adapted to your project needs (e.g. if some specific computations are required before or after the actual inference).\n\n    - This is the function that has to be called by the web service that will serve your model. Using `utils_models.predict` instead of the actual predict method of the model class ensure that your service can stay model agnostic: if one day you decide to change your design, to use another model; the service won't be impacted.\n\n  - Warning: some libraries (such as torch, detectron2, etc.) may not be hosted on PyPI. You'll need to add an extra `--find-links` option to your pip installation.\n\n\t- If you don't have access to the internet, you'll need to setup a proxy which will host all the needed libraries. You can then use `--trusted-host` and `--index-url` options.\n\n- You can use our API Framework to expose your model:\n\n  - **COMING SOON**\n\n\n### 4.2 Update your model <a name=\"upd\"></a>\n\nIf you want to update the model exposed by the API, you just have to push a new version of the serialized model to your repository and update your service (typically only the model version). If the actual code base of the model (for instance in the predict method) was updated, you would also have to publish a new version of the python module.  \n\n### 4.3 Unit tests  <a name=\"ut\"></a>\n\nNumerous unit tests are provided by the framework. Don't forget to adapt them when you modify the code. If you wish to add features, it is obviously advised to add new unit tests.\n\n## 5. Differences between the frameworks  <a name=\"differences\"></a>\n\nProjets generated by the different frameworks have some differences in how they actually work.\n\n\n### 5.1 NLP Framework  <a name=\"nlp\"></a>\n\n- Learning ressources have been produced to help you getting started : **COMING SOON**\n- When saving your model, preprocessing specifications are only saved through the preprocessing pipeline name. If you modify the code of any of the preprocessing steps, it might negatively impact the performances of your trained model without you realizing.\n\n### 5.2 Numeric framework  <a name=\"numeric\"></a>\n\n\n- Preprocessing has to be computed in a two step fashion to avoid bias:\n\n  - Fit your transformations on the training data (`1_preprocess_data.py`)\n\n  - Transform your validation/test sets (`2_apply_existing_pipeline.py`)\n\n- Preprocessing pipelines are stored in the `project_name-pipelines` folder\n\n  - They are then stored as a .pkl object in the model folders (so that these can be used during inference)\n\n### 5.3 Computer Vision framework  <a name=\"vision\"></a>\n\n- The expected input data format is different than in the other frameworks.\n\n  - For image classification, 3 differents formats can be used :\n\n    1. A root folder with a subfolder per class (containing all the images associated with this class)\n    2. A unique folder containing every image where each image name is prefixed with its class\n    3. A folder containing all the images and a .csv metadata file containing the image/class matching\n\n  - For object detection, you must provide a .csv metadata file containing the bounding boxes for each image\n\n## 6. Misc.  <a name=\"misc2\"></a>\n- To this day, each framework is tested and integrated on our own continuous integration pipeline.\n- If a GPU is available, some models will automatically try to use it during training and inference\n\n## 7. Security warning  <a name=\"security\"></a> \nGabarit relies on a number of open source packages and therefore may carry on their potential security vulnerabilities. Our philosophy is to be as transparent as possible, which is why we are actively monitoring the dependabot analysis. In order to limit these vulnerabilities, we are in the regular process of upgrading these packages as soon as we can.\nNotice that some packages (namely torch and tensorflow) might lag a few versions behind the actual up to date version due to compatibility issues with CUDA and our own infrastructure. \n\nHowever, we remind you to be vigilant about the security vulnerabilities of the code and model that you will produce with these frameworks. It is your responsibility to ensure that the final product matches the security standards of your organization.\n\n## 8. Ethics  <a name=\"ethics\"></a>\nPôle emploi intends to include the development and use of artificial intelligence algorithms and solutions in a sustainable and ethical approach. As such, Pôle emploi has adopted an ethical charter, resulting from collaborative and consultative work. The objective is to guarantee a framework of trust, respectful of the values of Pôle emploi, and to minimize the risks associated with the deployment of these technologies.\n\nThe pdf file is located in [pole-emploi.org](https://www.pole-emploi.org/accueil/communiques/pole-emploi-se-dote-dune-charte-pour-une-utilisation-ethique-de-lintelligence-artificielle.html?type=article) :\n\n[PDF - Ethics charter - Pôle emploi](https://www.pole-emploi.org/files/live/sites/peorg/files/images/Communiqu%c3%a9%20de%20presse/Charte%20de%20p%c3%b4le%20emploi%20pour%20une%20Intelligence%20Artificielle%20%c3%a9....pdf)\n\n## 9. Contacts  <a name=\"contacts\"></a>\n\nIf you have any question/enquiry feel free to drop us a mail : contactadsaiframeworks.00619@pole-emploi.fr\n\n- Alexandre GAREL - Data Scientist\n- Nicolas GREFFARD - Data Scientist\n- Gautier SOLARD : Data Scientist\n- Nicolas TOUZOT - Product Owner\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/OSS-Pole-Emploi/gabarit",
    "keywords": "",
    "license": "AGPL-3.0",
    "maintainer": "",
    "maintainer_email": "",
    "name": "gabarit",
    "package_url": "https://pypi.org/project/gabarit/",
    "platform": "windows",
    "project_url": "https://pypi.org/project/gabarit/",
    "project_urls": {
      "Homepage": "https://github.com/OSS-Pole-Emploi/gabarit"
    },
    "release_url": "https://pypi.org/project/gabarit/1.2.4/",
    "requires_dist": [
      "Jinja2 (==3.0.3)",
      "mypy (==0.910)"
    ],
    "requires_python": "",
    "summary": "Kickstart your AI project as code",
    "version": "1.2.4",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 14935397,
  "releases": {
    "1.2.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6c4e8b046ac6575bfeb30a6820c8d29eef092a83a3b59d130c396d7de8f7deb1",
          "md5": "95ba3e7f70f176000e177fdbc93c1b20",
          "sha256": "bf128eab543144bda959968c688e3dcd7b4cb432b508335bf11d39e0cf3078df"
        },
        "downloads": -1,
        "filename": "gabarit-1.2.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "95ba3e7f70f176000e177fdbc93c1b20",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 5187123,
        "upload_time": "2022-06-13T09:09:15",
        "upload_time_iso_8601": "2022-06-13T09:09:15.773510Z",
        "url": "https://files.pythonhosted.org/packages/6c/4e/8b046ac6575bfeb30a6820c8d29eef092a83a3b59d130c396d7de8f7deb1/gabarit-1.2.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "089159002f5bf3305ef620f201051a12d5d6e6a04a6014780cf80a2cd0112004",
          "md5": "ed8978541b1498d14159a79785a1350a",
          "sha256": "a7110195ee40709c34eeee5e98e815c87a5f69504d648f4892292ce4183132b9"
        },
        "downloads": -1,
        "filename": "gabarit-1.2.1.tar.gz",
        "has_sig": false,
        "md5_digest": "ed8978541b1498d14159a79785a1350a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 4828028,
        "upload_time": "2022-06-13T09:09:17",
        "upload_time_iso_8601": "2022-06-13T09:09:17.832538Z",
        "url": "https://files.pythonhosted.org/packages/08/91/59002f5bf3305ef620f201051a12d5d6e6a04a6014780cf80a2cd0112004/gabarit-1.2.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.2.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "16a7bb685f9bb0d72f63e0512abdbaad3169da4a08b8c6fb4d89f5be741f2c57",
          "md5": "1b13578d65ce9d8d00b335be24c84a73",
          "sha256": "c0e251a8d82658bb0ae1084aeb500e32436f37fe7f75be503ec2e15101bb40ca"
        },
        "downloads": -1,
        "filename": "gabarit-1.2.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "1b13578d65ce9d8d00b335be24c84a73",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 6848719,
        "upload_time": "2022-07-06T12:14:13",
        "upload_time_iso_8601": "2022-07-06T12:14:13.200001Z",
        "url": "https://files.pythonhosted.org/packages/16/a7/bb685f9bb0d72f63e0512abdbaad3169da4a08b8c6fb4d89f5be741f2c57/gabarit-1.2.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "66b48e18c42c8e99b5bef5e04f53d6dac81b618d8be3e42b828e0adccef78d52",
          "md5": "78c46a1852dd17faa0c6bdcad234cbb2",
          "sha256": "f5619dfc817c1b599a71271bdb8bffcaab15d0722a452ead19252ecac3b6655f"
        },
        "downloads": -1,
        "filename": "gabarit-1.2.2.tar.gz",
        "has_sig": false,
        "md5_digest": "78c46a1852dd17faa0c6bdcad234cbb2",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 6492874,
        "upload_time": "2022-07-06T12:14:15",
        "upload_time_iso_8601": "2022-07-06T12:14:15.068888Z",
        "url": "https://files.pythonhosted.org/packages/66/b4/8e18c42c8e99b5bef5e04f53d6dac81b618d8be3e42b828e0adccef78d52/gabarit-1.2.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.2.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2d52c776a1295f1ee4fea4777e41e8bd5f13931f945ecba67ae054666315c36c",
          "md5": "79eaadf1aceac360fcd7183e3c6ed481",
          "sha256": "e8ec50e3607625a5f86d1876ec03361d51fb4aec2e2b518de30d80f183a1e782"
        },
        "downloads": -1,
        "filename": "gabarit-1.2.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "79eaadf1aceac360fcd7183e3c6ed481",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 6849433,
        "upload_time": "2022-08-02T12:15:36",
        "upload_time_iso_8601": "2022-08-02T12:15:36.072192Z",
        "url": "https://files.pythonhosted.org/packages/2d/52/c776a1295f1ee4fea4777e41e8bd5f13931f945ecba67ae054666315c36c/gabarit-1.2.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9399f389b1e2d5b507e1c9047f9f4013bae1fabe787740ec2eaa1ae1088d943f",
          "md5": "70685256a5a13828d01a5b962ad8e497",
          "sha256": "4cb94b45c902a4e9cf57e01c583373df4c567e586eb68a9faaed5aaed9d4695a"
        },
        "downloads": -1,
        "filename": "gabarit-1.2.3.tar.gz",
        "has_sig": false,
        "md5_digest": "70685256a5a13828d01a5b962ad8e497",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 6494408,
        "upload_time": "2022-08-02T12:15:38",
        "upload_time_iso_8601": "2022-08-02T12:15:38.361425Z",
        "url": "https://files.pythonhosted.org/packages/93/99/f389b1e2d5b507e1c9047f9f4013bae1fabe787740ec2eaa1ae1088d943f/gabarit-1.2.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.2.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8891ca7cf460448e6edaa79a502107a755e8f1d117cc1df78e7635af423c7bd2",
          "md5": "8e428dde14243e60fc401807e1c3f140",
          "sha256": "e614cbb098fc5e25066f0e9d8cdc5ce30cbb574f4d4dc376f1a06b6127f27915"
        },
        "downloads": -1,
        "filename": "gabarit-1.2.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "8e428dde14243e60fc401807e1c3f140",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 6849407,
        "upload_time": "2022-08-30T13:10:20",
        "upload_time_iso_8601": "2022-08-30T13:10:20.532102Z",
        "url": "https://files.pythonhosted.org/packages/88/91/ca7cf460448e6edaa79a502107a755e8f1d117cc1df78e7635af423c7bd2/gabarit-1.2.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "06a474b63bc6373d72ea44b079fe2a99251b509c337df814ea9dec240c4dfa04",
          "md5": "13b51d5ffd683d44de0ba3ed168d8b0d",
          "sha256": "724b53c019e36910245ad4aeb52757d97d1b202f3983a0c86378eb51de59ef12"
        },
        "downloads": -1,
        "filename": "gabarit-1.2.4.tar.gz",
        "has_sig": false,
        "md5_digest": "13b51d5ffd683d44de0ba3ed168d8b0d",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 6494460,
        "upload_time": "2022-08-30T13:10:22",
        "upload_time_iso_8601": "2022-08-30T13:10:22.456054Z",
        "url": "https://files.pythonhosted.org/packages/06/a4/74b63bc6373d72ea44b079fe2a99251b509c337df814ea9dec240c4dfa04/gabarit-1.2.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "8891ca7cf460448e6edaa79a502107a755e8f1d117cc1df78e7635af423c7bd2",
        "md5": "8e428dde14243e60fc401807e1c3f140",
        "sha256": "e614cbb098fc5e25066f0e9d8cdc5ce30cbb574f4d4dc376f1a06b6127f27915"
      },
      "downloads": -1,
      "filename": "gabarit-1.2.4-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "8e428dde14243e60fc401807e1c3f140",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 6849407,
      "upload_time": "2022-08-30T13:10:20",
      "upload_time_iso_8601": "2022-08-30T13:10:20.532102Z",
      "url": "https://files.pythonhosted.org/packages/88/91/ca7cf460448e6edaa79a502107a755e8f1d117cc1df78e7635af423c7bd2/gabarit-1.2.4-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "06a474b63bc6373d72ea44b079fe2a99251b509c337df814ea9dec240c4dfa04",
        "md5": "13b51d5ffd683d44de0ba3ed168d8b0d",
        "sha256": "724b53c019e36910245ad4aeb52757d97d1b202f3983a0c86378eb51de59ef12"
      },
      "downloads": -1,
      "filename": "gabarit-1.2.4.tar.gz",
      "has_sig": false,
      "md5_digest": "13b51d5ffd683d44de0ba3ed168d8b0d",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 6494460,
      "upload_time": "2022-08-30T13:10:22",
      "upload_time_iso_8601": "2022-08-30T13:10:22.456054Z",
      "url": "https://files.pythonhosted.org/packages/06/a4/74b63bc6373d72ea44b079fe2a99251b509c337df814ea9dec240c4dfa04/gabarit-1.2.4.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}