{
  "info": {
    "author": "Dhruv Pathak",
    "author_email": "pathakdhruv9786@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: BSD License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# GalDynPsrFreq Package\n\nGalDynPsrFreq is a package for calculating dynamical contributions to the first and the second derivatives of the frequencies, both spin or orbital, of pulsars in the Galactic field. These dynamical terms depend on the proper motion, the acceleration and the jerk of the pulsars. The main source of the acceleration of the pulsar is the gravitational potential of the Galaxy. GalDynPsrFreq uses a galpy based model of this potential and has the option to include or exclude the effect of the central black hole. \n\nDetails on various dynamical effects and formalism to estimate those are available in Pathak and Bagchi (New Astronomy 85 (2021) 101549; arXiv: 1909.13113). Please cite this paper if you use GalDynPsrFreq for your research.\n\nThis package can calculate the fractional contributions or the excess terms, e.g. \\dot{f}/f|_excess and \\ddot{f}/f|_excess (Eqs. (4) and (11) of Pathak and Bagchi (2021)), where f is either the orbital frequency or the spin frequency. It can also calculate different dynamical terms separately. \n\nUsing the measured values of the frequency, the derivative of the frequency, and the second derivative of the frequency, GalDynPsrFreq can even compute the \"intrinsic\" values of the frequency derivative, as well as, the frequency second derivative, provided no other extra contribution exists.\n\nA brief outline of the usage of GalDynPsrFreq is given below.\n\n# 1) Install GalDynPsrFreq as pip3 install GalDynPsrFreq (assuming you have numpy, scipy, and galpy already installed and working)\n\nIf wished, one can change the values of Rs (Galactocentric cylindrical radius of the Sun) and Vs (rotational speed of the Sun around the Galactic centre) in the parameters.in file that can be found inside the GalDynPsrFreq (installed directory).\nBut remember that galpy also has these values defined in the file '$home/.galpyrc'. One can in principle change the values in both of the files. However, the Milky Way potential in galpy was fitted with Rs = 8 kpc and Vs = 220 km/s in galpy.\n\n\n# 2) Import GalDynPsrFreq\n\nimport GalDynPsrFreq\n\n\n# 3)\n\nA) Observable parameters needed to compute \\dot{f}/f|_excess and \\dot{f}/f|_intrinsic: the Galactic longitude in degrees (say ldeg), the Galactic latitude in degrees (say bdeg), the distance of the pulsar from the solar system barycenter in kpc (say dkpc), the proper motion in the Galactic longitude in mas/yr (say mul), the proper motion in the Galactic latitude in mas/yr (say mub), the frequency in Hz (say f), and the observed frequency derivative in s^{-2} (say fdotobs).\n\nB) Observable parameters needed to compute \\ddot{f}/f|_excess and \\ddot{f}/f|_intrinsic: the Galactic longitude in degrees (say ldeg), the Galactic latitude in degrees (say bdeg), the distance of the pulsar from the solar system barycenter in kpc (say dkpc), the proper motion in the Galactic longitude in mas/yr (say mul), the proper motion in the Galactic latitude in mas/yr (say mub), the radial component of the relative velocity of the pulsar with respect to the solar system barycenter in km/s (say vrad), the frequency in Hz (say f), the observed frequency derivative in s^{-2} (say fdotobs), and the observed frequency second derivative in s^{-3} (say fdotdotobs). \n\nThe frequency and its derivatives can either be spin or orbital.\n\n# 4) Remember that the model names are case sensitive, so use them as demonstrated below. Also, for each case, ordering of the parameters must be as shown.\n\n# 5) Calculate the Galactic contribution to the excess terms for the first derivative of the frequency using either the model that does not take into account the central black hole contribution to the Milky Way Potential (Model excGal), or the model that takes into account the central black hole (BH) contribution to the Milky Way Potential (Model excGalBH) \nThe usage of these models is shown below.\n\na) When not incorporating the BH contribution to the Milky Way Potential: Model excGal-\nGalDynPsrFreq.excGal.Expl(ldeg, bdeg, dkpc) and GalDynPsrFreq.excGal.Exz(ldeg, bdeg, dkpc)\n\nb) When incorporating the BH contribution to the Milky Way Potential: Model excGalBH-\nGalDynPsrFreq.excGalBH.Expl(ldeg, bdeg, dkpc) and GalDynPsrFreq.excGalBH.Exz(ldeg, bdeg, dkpc)\n\nThe function Expl() calculates the excess term due to the component of the relative acceleration of the pulsar parallel to the Galactic plane and the function Exz() calculates the excess term due to the component of the relative acceleration of the pulsar perpendicular to the Galactic plane. Total dynamical contribution from Galactic potential will be the sum of above two terms. One needs to assign the values of ldeg, bdeg, and dkpc before calling the above functions.\n\n\n# 6) Calculate the Shklovskii term contribution to the frequency derivative\n\nThe Shklovskii term can be calculated as GalDynPsrFreq.Shk.Exshk(dkpc, mul, mub), \n\nwhere mul is the proper motion in the Galactic longitude direction (mas/yr) and mub is the proper motion in the Galactic latitude direction (mas/yr). dkpc is as usual the distance of the pulsar from the solar system barycenter in kpc. One needs to assign the values of these parameters first. This term is independent of the Galactic potential model.\n\n\n\n# 7) Calculate the total excess terms in the first derivative of the frequency\n\nFor total dynamical contributions in the first derivative of the frequency, we use the following modules from GalDynPsrFreq.\n\na) When not incorporating the BH contribution to the Milky Way Potential: Model fdotexc-\nGalDynPsrFreq.fdotexc.fdotexctot(ldeg, bdeg, dkpc, mul, mub)\nThis uses the modules- excGal.py for the relative acceleration contribution and Shk.py for the Shklovskii effect contribution to the excess terms. \n\nb) When incorporating the BH contribution to the Milky Way Potential: Model fdotexcBH-\nGalDynPsrFreq.fdotexcBH.fdotexctotBH(ldeg, bdeg, dkpc, mul, mub)\nThis uses the modules- excGalBH.py for the relative acceleration contribution and Shk.py for the Shklovskii effect contribution to the excess terms.\n\nOne needs to assign the values of ldeg, bdeg, dkpc, mul, and mub before calling the above functions.\n\n\n\n# 8)Print the basic parameters of the pulsars\n\n\nGalDynPsrFreq.read_parameters.Rskpc returns the Galactocentric cylindrical radius of the Sun (Rs in kpc or Rskpc).\n\nGalDynPsrFreq.read_parameters.Vs returns the rotational speed of the Sun around the Galactic centre (Vs in km/s).\n\nGalDynPsrFreq.read_parameters.Rpkpc(ldeg, bdeg, dkpc) returns the value of Galactocentric cylindrical radius of the pulsar in kpc (Rp in kpc or Rpkpc).\n\nGalDynPsrFreq.read_parameters.z(ldeg, bdeg, dkpc) returns the perpendicular distance of the pulsar from the Galactic plane (z in kpc or zkpc). \n\nThe meaning of the arguments in the above examples are as usual.\n\n\n# 9) Calculate the intrinsic frequency derivative \nFor the frequency derivative calculations we have the fdotint.py module. \n\na) When not incorporating the BH contribution to the Milky Way Potential: Model fdotintcal-\n\nThe total dynamically caused value of the frequency derivative is the addition of the contribution from the parallel component of the relative acceleration of the pulsar, the perpendicular component of the relative acceleration of the pulsar, and the Shklovskii effect. The intrinsic value of the frequency derivative can be calculated by subtracting that sum from the measured value of the frequency derivative. GalDynPsrFreq can perform this task for us by:\n\nGalDynPsrFreq.fdotint.fdotintcal(ldeg, bdeg, dkpc, mul, mub, f, fdotobs)\n\nHere, in addition to assigning the values of ldeg, bdeg, dkpc, mul, and mub, one needs to also assign the values of the frequency 'f' in Hz, and the measured value of the frequency derivative 'fdotobs' in seconds^(-2).\n\nAdditionally, the individual contributions can also be calculated using the fdotint.py module in GalDynPsrFreq as,\n\nGalDynPsrFreq.fdotint.fdotExplcal(ldeg, bdeg, dkpc, f) # due to the parallel component of the relative acceleration of the pulsar\nGalDynPsrFreq.fdotint.fdotExzcal(ldeg, bdeg, dkpc, f) # due to the perpendicular component of the relative acceleration of the pulsar\nGalDynPsrFreq.fdotint.fdotGalcal(ldeg, bdeg, dkpc, f) # due to the sum of the parallel and the perpendicular components of the relative acceleration of the pulsar\n\nFor the above 3 terms, in addition to assigning the values of ldeg, bdeg, dkpc, mul, and mub, one needs to also assign the values of the frequency, 'f', in Hz.\n\n\nb) When incorporating the BH contribution to the Milky Way Potential: Model fdotintcalBH-\n\nAs explained in a) part, The intrinsic value of the frequency derivative can be calculated by:\n\nGalDynPsrFreq.fdotint.fdotintcalBH(ldeg, bdeg, dkpc, mul, mub, f, fdotobs)\n\nHere, in addition to assigning the values of ldeg, bdeg, dkpc, mul, and mub, one needs to also assign the values of the frequency 'f' in Hz, and the measured value of the frequency derivative 'fdotobs' in seconds^(-2).\n\n\nAdditionally, the individual contributions can also be calculated using the fdotint.py module in GalDynPsrFreq as,\n\nGalDynPsrFreq.fdotint.fdotExplcalBH(ldeg, bdeg, dkpc, f) # due to the parallel component of the relative acceleration of the pulsar\nGalDynPsrFreq.fdotint.fdotExzcalBH(ldeg, bdeg, dkpc, f) # due to the perpendicular component of the relative acceleration of the pulsar\nGalDynPsrFreq.fdotint.fdotGalcalBH(ldeg, bdeg, dkpc, f) # due to the sum of the parallel and the perpendicular components of the relative acceleration of the pulsar\n\nFor the above 3 terms, in addition to assigning the values of ldeg, bdeg, dkpc, mul, and mub, one needs to also assign the values of the frequency 'f' in Hz.\n\n\nc) For calculating the contribution of the Shklovskii effect, separately, to the frequency derivative, we can use,\n\nGalDynPsrFreq.fdotint.fdotShk(dkpc, mul, mub, f)\n\nHere, in addition to assigning the values of dkpc, mul, and mub, one needs to also assign the value of the frequency, 'f', in Hz.\n\n\n\n\n# 10) Calculate the excess terms in the second derivative of the frequency \n\nFor dynamical contributions in the second derivative of the frequency, we use the following modules from GalDynPsrFreq.\n\na)When not incorporating the BH contribution to the Milky Way Potential: Model fdotdotexc-\nGalDynPsrFreq.fdotdotexc.fdotdotexccal(ldeg, bdeg, dkpc, mul, mub, f, fdotobs, vrad) \n\nThis module internally calls the modules for calculating the first, the second, the third, and the fourth sqaure bracket terms (which don't incorporate the BH contribution). These modules can also be directly called as-\nGalDynPsrFreq.fdotdotSB1.fdotdotSB1cal(ldeg, bdeg, dkpc, mul, mub, vrad) #for calculating the first square bracket term of Eq. (11) of the paper Pathak and Bagchi (2021)\nGalDynPsrFreq.fdotdotSB2.fdotdotSB2cal(ldeg, bdeg, dkpc, mul, mub) #for calculating the second square bracket term of Eq. (11) of the paper Pathak and Bagchi (2021)\nGalDynPsrFreq.fdotdotSB3.fdotdotSB3cal(ldeg, bdeg, dkpc, mul, mub, vrad) #for calculating the third square bracket term of Eq. (11) of the paper Pathak and Bagchi (2021)\nGalDynPsrFreq.fdotdotSB4.fdotdotSB4cal(ldeg, bdeg, dkpc, mul, mub, f, fdotobs) #for calculating the fourth square bracket term of Eq. (11) of the paper Pathak and Bagchi (2021)\n\nb) When incorporating the BH contribution to the Milky Way Potential: Model fdotdotexcBH-\nGalDynPsrFreq.fdotdotexcBH.fdotdotexccalBH(ldeg, bdeg, dkpc, mul, mub, f, fdotobs, vrad)\n\nThis module internally calls the modules for calculating the first, the second, the third, and the fourth sqaure bracket terms (which incorporate the BH contribution). These modules can also be directly called as-\nGalDynPsrFreq.fdotdotSB1BH.fdotdotSB1calBH(ldeg, bdeg, dkpc, mul, mub, vrad) #for calculating the first square bracket term of Eq. (11) of the paper Pathak and Bagchi (2021)\nGalDynPsrFreq.fdotdotSB2BH.fdotdotSB2calBH(ldeg, bdeg, dkpc, mul, mub) #for calculating the second square bracket term of Eq. (11) of the paper Pathak and Bagchi (2021)\nGalDynPsrFreq.fdotdotSB3BH.fdotdotSB3calBH(ldeg, bdeg, dkpc, mul, mub, vrad) #for calculating the third square bracket term of Eq. (11) of the paper Pathak and Bagchi (2021)\nGalDynPsrFreq.fdotdotSB4BH.fdotdotSB4calBH(ldeg, bdeg, dkpc, mul, mub, f, fdotobs) #for calculating the fourth square bracket term of Eq. (11) of the paper Pathak and Bagchi (2021)\n\n\nHere, for both the cases, in addition to assigning the values of ldeg, bdeg, dkpc, mul, mub, f, and fdotobs, one needs to also assign the measured value of the radial component of the relative velocity of the pulsar, 'vrad', in km/s.\n\n\n# 11) Calculate the intrinsic second derivative of the frequency \n\nFor calculating the intrinsic value of the second derivative of the frequency, we use the following modules from GalDynPsrFreq.\n\na)When not incorporating the BH contribution to the Milky Way Potential: Model fdotdotintcal-\nGalDynPsrFreq.fdotdotint.fdotdotintcal(ldeg,bdeg,dkpc,mul,mub,f,fdotobs,vrad,fdotdotobs) \n\nb) When incorporating the BH contribution to the Milky Way Potential: Model fdotdotintcalBH-\nGalDynPsrFreq.fdotdotint.fdotdotintcalBH(ldeg,bdeg,dkpc,mul,mub,f,fdotobs,vrad,fdotdotobs)\n\nHere, for both the cases, in addition to assigning the values of ldeg, bdeg, dkpc, mul, mub, f, fdotobs, and vrad, one needs to also assign the measured value of the second derivative of the frequency, 'fdotdotobs', in seconds^(-3).\n\n## All the above points will be clearer from the following demonstration \n\n\n### Call GalDynPsrFreq as:\n\n\nimport GalDynPsrFreq\n\n\n##  Provide the following values in your code \n\n### ldeg = Galactic longitude in degrees, bdeg = Galactic latitude in degrees, dkpc = distance to pulsar in kpc\n\n\nldeg = 20.0\n\nbdeg = 20.0\n\ndkpc = 2.0\n\n### #####Extract important parameters, say, values of Rp (in kpc) and z (in kpc)#####\n\nRpkpc = GalDynPsrFreq.read_parameters.Rpkpc(ldeg, bdeg, dkpc)\n\nzkpc = GalDynPsrFreq.read_parameters.z(ldeg, bdeg, dkpc)\n\n\n### #####Compute the excess Shklovskii term for the first derivative of the frequency using Exshk()#####\n\n### We need to provide the values of the proper motion in the Galactic longitude direction and the proper motion in the Galactic latitude direction\n\n### mul = proper motion in the Galactic longitude direction (in mas/yr), mub = proper motion in the Galactic latitude direction (in mas/yr)\n\nmul = 20.0\nmub = 20.0\n\nExcessSh = GalDynPsrFreq.Shk.Exshk(dkpc, mul, mub)\n\n\n\n### #####Compute the excess terms for the first derivative of the frequency due to the Galactic potential#####\n\n### =====Model excGal (not incorporating the BH contribution to the Milky Way Potential)=====\n\nfex_pl = GalDynPsr.excGal.Expl(ldeg, bdeg, dkpc) #calculates the contribution to the excess term due to the parallel component of the relative acceleration of the pulsar\n\nfex_z = GalDynPsr.excGal.Exz(ldeg, bdeg, dkpc) #calculates the contribution to the excess term due to the perpendicular component of the relative acceleration of the pulsar\n\ntotalfexGal = fex_pl+fex_z\n\n-------------------------------------OR------------------------------------------\n\n### =====Model excGalBH (incorporating the BH contribution to the Milky Way Potential)=====\n\nfex_pl = GalDynPsrFreq.excGalBH.Expl(ldeg, bdeg, dkpc) #calculates the contribution to the excess term due to the parallel component of the relative acceleration of the pulsar\n\nfex_z = GalDynPsrFreq.excGalBH.Exz(ldeg, bdeg, dkpc) #calculates the contribution to the excess term due to the perpendicular component of the relative acceleration of the pulsar\n\ntotalfexGal = fex_pl+fex_z\n\n\n\n### #####Compute the total excess term for the first derivative of the frequency#####\n\n### =====Model fdotexc (not incorporating the BH contribution to the Milky Way Potential)=====\nfdotfex = GalDynPsrFreq.fdotexc.fdotexctot(ldeg, bdeg, dkpc, mul, mub)\n\n-------------------------------------OR------------------------------------------\n\n### =====Model fdotexcBH (incorporating the BH contribution to the Milky Way Potential)=====\nfdotfex = GalDynPsrFreq.fdotexcBH.fdotexctotBH(ldeg, bdeg, dkpc, mul, mub)\n\n\n### #####Compute the intrinsic value of the first derivative of the frequency#####\n\n### Additional observable parameters required for the spin (or orbital) frequency derivative calcuations: f = frequency in Hz, fdotobs = measured value of the frequency derivative in s^-2\n\nf = 50.0\n\nfdotobs = -1.43e-15\n\n\n### =====Model fdotintcal (not incorporating the BH contribution to the Milky Way Potential)=====\n\nfdot_int = GalDynPsrFreq.fdotint.fdotintcal(ldeg, bdeg, dkpc, mul, mub, f, fdotobs) #calculates the intrinsic frequency derivative\n\n-------------------------------------OR------------------------------------------\n\n### =====Model fdotintcalBH (incorporating the BH contribution to the Milky Way Potential)=====\n\nfdot_int = GalDynPsrFreq.fdotint.fdotintcalBH(ldeg, bdeg, dkpc, mul, mub, f, fdotobs) #calculates the intrinsic frequency derivative\n\n\n### #####Additional Terms from module fdotint.py#####\n\nfdot_Shk = GalDynPsrFreq.fdotint.fdotShk(dkpc, mul, mub,f) #calculates the Shklovskii contribution to the frequency derivative\n\n### =====When not incorporating the BH contribution to the Milky Way Potential=====\n\nfdot_Expl = GalDynPsrFreq.fdotint.fdotExplcal(ldeg, bdeg, dkpc, f) #calculates the contribution to the frequency derivative due to the parallel component of the relative acceleration of the pulsar\n\nfdot_Exz = GalDynPsrFreq.fdotint.fdotExzcal(ldeg, bdeg, dkpc, f) #calculates the contribution to the frequency derivative due to the perpendicular component of the relative acceleration of the pulsar\n\nfdot_Gal = GalDynPsrFreq.fdotint.fdotGalcal(ldeg, bdeg, dkpc, f) #calculates the sum of parallel and perpendicular contributions to the frequency derivative\n\n-------------------------------------OR------------------------------------------\n\n### =====When incorporating the BH contribution to the Milky Way Potential=====\n\nfdot_Expl = GalDynPsrFreq.fdotint.fdotExplcalBH(ldeg, bdeg, dkpc, f) #calculates the contribution to the frequency derivative due to the parallel component of the relative acceleration of the pulsar \n\nfdot_Exz = GalDynPsrFreq.fdotint.fdotExzcalBH(ldeg, bdeg, dkpc, f) #calculates the contribution to the frequency derivative due to the perpendicular component of the relative acceleration of the pulsar\n\nfdot_Gal = GalDynPsrFreq.fdotint.fdotGalcalBH(ldeg, bdeg, dkpc, f) #calculates the sum of parallel and perpendicular contributions to the frequency derivative\n\n\n\n### #####Compute the excess term for second derivative of the frequency#####\n### Additional observable parameters required: vrad = radial component of the relative velocity of the pulsar in km/s\n\nvrad = 20.0\n\n### =====Model fdotdotexc (not incorporating the BH contribution to the Milky Way Potential)=====\n\nfddotfex = GalDynPsrFreq.fdotdotexc.fdotdotexccal(ldeg, bdeg, dkpc, mul, mub, f, fdotobs, vrad)\n\n-------------------------------------OR------------------------------------------\n\n### =====Model fdotdotexcBH (incorporating the BH contribution to the Milky Way Potential)=====\n\nfddotfex = GalDynPsrFreq.fdotdotexcBH.fdotdotexccalBH(ldeg, bdeg, dkpc, mul, mub, f, fdotobs, vrad)\n\n\n\n### #####Compute the intrinsic value of the second derivative of the frequency#####\n### Additional observable parameters required: fdotdotobs = observed second derivative of the frequency in s^-3\n\nfdotdotobs = 1.2e-28\n\n### =====Model fdotdotintcal (not incorporating the BH contribution to the Milky Way Potential)=====\n\nfddotint = GalDynPsrFreq.fdotdotint.fdotdotintcal(ldeg, bdeg, dkpc, mul, mub, f, fdotobs, vrad, fdotdotobs)\n\n-------------------------------------OR------------------------------------------ \n\n### =====Model fdotdotintcalBH (incorporating the BH contribution to the Milky Way Potential)=====\n\nfddotint = GalDynPsrFreq.fdotdotint.fdotdotintcalBH(ldeg, bdeg, dkpc, mul, mub, f, fdotobs, vrad, fdotdotobs)\n\n\n\n\n\n### #####Example#####\n\n### Using models excGalBH and fdotdotexcBH  \n\nimport GalDynPsrFreq\n\nldeg = 20.0\n\nbdeg= 20.0\n\ndkpc = 2.0\n\nmul = 20.0\n\nmub = 20.0\n\nvrad = 20.0\n\nf = 50.0\n\nfdotobs = -1.43e-15\n\nfdotdotobs = 1.2e-28\n\nRpkpc = GalDynPsrFreq.read_parameters.Rpkpc(ldeg, bdeg, dkpc) <br/>\nOutput: 6.267007084433072\n\nzkpc = GalDynPsrFreq.read_parameters.z(ldeg, bdeg, dkpc) <br/>\nOutput: 0.6840402866513374\n\nfex_pl = GalDynPsrFreq.excGalBH.Expl(ldeg, bdeg, dkpc) <br/>\nOutput: -1.117390734484584e-19\n\nfex_z = GalDynPsrFreq.excGalBH.Exz(ldeg, bdeg, dkpc) <br/>\nOutput: 1.0790292219978148e-19\n\nfex_shk = GalDynPsrFreq.Shk.Exshk(dkpc, mul, mub) <br/>\nOutput: -3.886794901984e-18\n\n\nfdot_Expl =  GalDynPsrFreq.fdotint.fdotExplcalBH(ldeg, bdeg, dkpc, f) <br/>\nOutput: -5.58695367242292e-18\n\nfdot_Exz =  GalDynPsrFreq.fdotint.fdotExzcalBH(ldeg, bdeg, dkpc, f) <br/>\nOutput: 5.395146109989074e-18\n\nfdot_Gal =  GalDynPsrFreq.fdotint.fdotGalcalBH(ldeg, bdeg, dkpc, f) <br/>\nOutput: -1.9180756243384537e-19\n\nfdot_Shk =  GalDynPsrFreq.fdotint.fdotShk(dkpc, mul, mub, f) <br/>\nOutput: -1.9433974509920001e-16\n\nfdot_int = GalDynPsrFreq.fdotint.fdotintcalBH(ldeg, bdeg, dkpc, mul, mub, f, fdotobs) <br/>\nOutput: -1.2354684473383662e-15\n\n\nfddotfex = GalDynPsrFreq.fdotdotexcBH.fdotdotexccalBH(ldeg, bdeg, dkpc, mul, mub, f, fdotobs, vrad) <br/>\nOutput: 1.3893598943987592e-34\n\nfddotint = GalDynPsrFreq.fdotdotint.fdotdotintcalBH(ldeg, bdeg, dkpc, mul, mub, f, fdotobs, vrad, fdotdotobs) <br/>\nOutput: 1.1999305320052803e-28\n\n\n\n\n#========================================================================================\n### #####Contents of the Package#####\n\nFiles:\n\nparameters.in: Input file, that contains values of constants which are subject to change with improvements in measurements. User can change the values of the constants if the need be. These constants are Vs (rotational speed of the Sun around the Galactic centre in km/s) and Rskpc (Galactocentric radius of the Sun, Rs, in kpc). Rs is defined in a cylindrical coordinate system. \n\nREADME.txt: Contents of this README.md file inside package along with code files.\n\nDescription of different codes:\n\nread_parameters.py: Contains various constants used in the package, as well as, functions to calculate Rp(kpc) and z(kpc). \n\nexcGal.py: Calculates the parallel, as well as, the perpendicular components of the Galactic contribution to the excess terms for the first frequency derivative without incorporating the effect of the central black hole in the gravitational potential of the Milky Way. The required arguments for this module are the observables ldeg, bdeg, and dkpc.\n\nexcGalBH.py: Calculates the parallel, as well as, the perpendicular components of the Galactic contribution to the excess terms for the first frequency derivative incorporating the effect of the central black hole in the gravitational potential of the Milky Way. The required arguments for this module are the observables ldeg, bdeg, and dkpc.\n\nShk.py: Calculates the Shklovskii term d(mu_T*mu_T)/c, where d is the distance of the pulsar from the solar system barycentre, mu_T is the total proper motion of the pulsar, and c is the speed of light. The required arguments for this module are the observables dkpc, mul, and mub.\n\ngalpyMWRfo.py: Calculates (parallel component of relative acceleration)/c using `evaluateRforces' function in galpy without incorporating the effect of the central black hole in the gravitational potential of the Milky Way. The required arguments for this module are the observables ldeg, bdeg, and dkpc.\n\ngalpyMWBHRfo.py: Calculates (parallel component of relative acceleration)/c using `evaluateRforces' function in galpy incorporating the effect of the central black hole in the gravitational potential of the Milky Way. The required arguments for this module are the observables ldeg, bdeg, and dkpc.\n\ngalpyMWZfo.py: Calculates (perpendicular component of relative acceleration)/c using `evaluatezforces' function in galpy without incorporating the effect of the central black hole in the gravitational potential of the Milky Way. The required arguments for this module are the observables ldeg, bdeg, and dkpc.\n\ngalpyMWBHZfo.py: Calculates (perpendicular component of relative acceleration)/c using `evaluatezforces' function in galpy incorporating the effect of the central black hole in the gravitational potential of the Milky Way. The required arguments for this module are the observables ldeg, bdeg, and dkpc.\n\nfdotexc.py: Calculates the total excess term in the first derivative of the frequency without incorporating the effect of the central black hole in the gravitational potential of the Milky Way. The required arguments for this module are ldeg, bdeg, dkpc, mul, and mub.\n\nfdotexcBH.py: Calculates the total excess term in the first derivative of the frequency incorporating the effect of the central black hole in the gravitational potential of the Milky Way. The required arguments for this module are ldeg, bdeg, dkpc, mul, and mub.\n\nfdotint.py: Calculates the intrinsic frequency derivative for both cases- when the contribution of the central black hole to the gravitational potential of the Milky Way is not included (Model fdotintcal) and when that contribution is included (Model fdotintcalBH). The required arguments for this module are ldeg, bdeg, dkpc, mul, mub, and f. Also, this module can separately calculate the individual frequency derivative contributions from the parallel and the perpendicular components of relative acceleration, and from the Shklovskii term. \n\nfdotdotSB1.py: Calculates the first square bracket term of Eq. (11) of the paper Pathak and Bagchi (2021) without the contribution of the central black hole. The required arguments for this module are ldeg, bdeg, dkpc, mul, mub, and vrad.\n\nfdotdotSB2.py: Calculates the second square bracket term of Eq. (11) of the paper Pathak and Bagchi (2021) without the contribution of the central black hole. The required arguments for this module are ldeg, bdeg, dkpc, mul, and mub.\n\nfdotdotSB3.py: Calculates the third square bracket term of Eq. (11) of the paper Pathak and Bagchi (2021) without the contribution of the central black hole. The required arguments for this module are ldeg, bdeg, dkpc, mul, mub, and vrad.\n\nfdotdotSB4.py: Calculates the fourth square bracket term of Eq. (11) of the paper Pathak and Bagchi (2021) without the contribution of the central black hole. The required arguments for this module are ldeg, bdeg, dkpc, mul, mub, f, and fdotobs.\n\nfdotdotSB1BH.py: Calculates the first square bracket term of Eq. (11) of the paper Pathak and Bagchi (2021) incorporating the contribution of the central black hole. The required arguments for this module are ldeg, bdeg, dkpc, mul, mub, and vrad.\n\nfdotdotSB2BH.py: Calculates the second square bracket term of Eq. (11) of the paper Pathak and Bagchi (2021) incorporating the contribution of the central black hole. The required arguments for this module are ldeg, bdeg, dkpc, mul, and mub.\n\nfdotdotSB3BH.py: Calculates the third square bracket term of Eq. (11) of the paper Pathak and Bagchi (2021) incorporating the contribution of the central black hole. The required arguments for this module are ldeg, bdeg, dkpc, mul, mub, and vrad.\n\nfdotdotSB4BH.py: Calculates the fourth square bracket term of Eq. (11) of the paper Pathak and Bagchi (2021) incorporating the contribution of the central black hole. The required arguments for this module are ldeg, bdeg, dkpc, mul, mub, f, and fdotobs.\n\nfdotdotexc.py: Model fdotdotexc- Calculates the total excess term for the second derivative of the frequency without incorporating the effect of the central black hole in the gravitational potential of the Milky Way. The required arguments for this module are ldeg, bdeg, dkpc, mul, mub, f, fdotobs, and vrad.\n\nfdotdotexcBH.py: Model fdotdotexcBH- Calculates the total excess term for the second derivative of the frequency incorporating the effect of the central black hole in the gravitational potential of the Milky Way. The required arguments for this module are ldeg, bdeg, dkpc, mul, mub, f, fdotobs, and vrad.\n\nfdotdotint.py: Calculates the intrinsic value of the second derivative of the frequency for both cases, i.e.,  when the contribution of the central black hole to the gravitational potential of the Milky Way is not included (Model fdotdotintcal) and when that contribution is included (Model fdotdotintcalBH). The required arguments for this module are ldeg, bdeg, dkpc, mul, mub, f, fdotobs, vrad, and fdotdotobs. \n\n############################################################\n\n\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/pathakdhruv/GalDynPsrFreq",
    "keywords": "",
    "license": "New BSD",
    "maintainer": "",
    "maintainer_email": "",
    "name": "GalDynPsrFreq",
    "package_url": "https://pypi.org/project/GalDynPsrFreq/",
    "platform": "",
    "project_url": "https://pypi.org/project/GalDynPsrFreq/",
    "project_urls": {
      "Homepage": "https://github.com/pathakdhruv/GalDynPsrFreq"
    },
    "release_url": "https://pypi.org/project/GalDynPsrFreq/1.0.1/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "A package for estimating contribution of dynamical terms in the first and second derivatives of frequencies (both spin and orbital) of pulsars.",
    "version": "1.0.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 11122648,
  "releases": {
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0af5888da665b8c1629b56ae0e464a36c11894d2785cb93da0ba73df8cbf62a7",
          "md5": "f6575947e5ecbe8f44870e934791dca4",
          "sha256": "1065486c54a0778ca899c15f8db34075eed4f90679352f8633b1a70f7e63383c"
        },
        "downloads": -1,
        "filename": "GalDynPsrFreq-1.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "f6575947e5ecbe8f44870e934791dca4",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 25829,
        "upload_time": "2021-03-14T18:32:29",
        "upload_time_iso_8601": "2021-03-14T18:32:29.286403Z",
        "url": "https://files.pythonhosted.org/packages/0a/f5/888da665b8c1629b56ae0e464a36c11894d2785cb93da0ba73df8cbf62a7/GalDynPsrFreq-1.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c8a539de21e6ff8378c55e2b63ba319b39d9725fd689374abb1b026b28b0d48f",
          "md5": "2fb343728cc9aa5c996598b2eebbcd96",
          "sha256": "1af3ab00ca396f4856e9e4fb99f47e316fea99749c2fd2094cf4d72b40931380"
        },
        "downloads": -1,
        "filename": "GalDynPsrFreq-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "2fb343728cc9aa5c996598b2eebbcd96",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 24264,
        "upload_time": "2021-03-14T18:32:31",
        "upload_time_iso_8601": "2021-03-14T18:32:31.222382Z",
        "url": "https://files.pythonhosted.org/packages/c8/a5/39de21e6ff8378c55e2b63ba319b39d9725fd689374abb1b026b28b0d48f/GalDynPsrFreq-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "479e92f9a63ab3060fb85592b7db2066c32ec54423f4061045c851dbf6ce2ab5",
          "md5": "2b993cb3b7c8299de0f7af0a0a28eba4",
          "sha256": "38424ba0e6d3518690325135b55f940f2252678bad777cfd4ecd4388d9398a06"
        },
        "downloads": -1,
        "filename": "GalDynPsrFreq-1.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "2b993cb3b7c8299de0f7af0a0a28eba4",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 25897,
        "upload_time": "2021-08-08T13:26:07",
        "upload_time_iso_8601": "2021-08-08T13:26:07.731825Z",
        "url": "https://files.pythonhosted.org/packages/47/9e/92f9a63ab3060fb85592b7db2066c32ec54423f4061045c851dbf6ce2ab5/GalDynPsrFreq-1.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f7723b859acaf1c376435f200e5569c63d3f3e0b917b1a61a1fd04049dc3dd58",
          "md5": "818750e5e37ca73d29ed18ab1c50d269",
          "sha256": "9e6222292addd7d56bbfcc6635d80686a5fffce533dea819d92925e9d70055a3"
        },
        "downloads": -1,
        "filename": "GalDynPsrFreq-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "818750e5e37ca73d29ed18ab1c50d269",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 24335,
        "upload_time": "2021-08-08T13:26:09",
        "upload_time_iso_8601": "2021-08-08T13:26:09.953558Z",
        "url": "https://files.pythonhosted.org/packages/f7/72/3b859acaf1c376435f200e5569c63d3f3e0b917b1a61a1fd04049dc3dd58/GalDynPsrFreq-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "479e92f9a63ab3060fb85592b7db2066c32ec54423f4061045c851dbf6ce2ab5",
        "md5": "2b993cb3b7c8299de0f7af0a0a28eba4",
        "sha256": "38424ba0e6d3518690325135b55f940f2252678bad777cfd4ecd4388d9398a06"
      },
      "downloads": -1,
      "filename": "GalDynPsrFreq-1.0.1-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "2b993cb3b7c8299de0f7af0a0a28eba4",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 25897,
      "upload_time": "2021-08-08T13:26:07",
      "upload_time_iso_8601": "2021-08-08T13:26:07.731825Z",
      "url": "https://files.pythonhosted.org/packages/47/9e/92f9a63ab3060fb85592b7db2066c32ec54423f4061045c851dbf6ce2ab5/GalDynPsrFreq-1.0.1-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "f7723b859acaf1c376435f200e5569c63d3f3e0b917b1a61a1fd04049dc3dd58",
        "md5": "818750e5e37ca73d29ed18ab1c50d269",
        "sha256": "9e6222292addd7d56bbfcc6635d80686a5fffce533dea819d92925e9d70055a3"
      },
      "downloads": -1,
      "filename": "GalDynPsrFreq-1.0.1.tar.gz",
      "has_sig": false,
      "md5_digest": "818750e5e37ca73d29ed18ab1c50d269",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 24335,
      "upload_time": "2021-08-08T13:26:09",
      "upload_time_iso_8601": "2021-08-08T13:26:09.953558Z",
      "url": "https://files.pythonhosted.org/packages/f7/72/3b859acaf1c376435f200e5569c63d3f3e0b917b1a61a1fd04049dc3dd58/GalDynPsrFreq-1.0.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}