{
  "info": {
    "author": "Philip Hodder",
    "author_email": "philip.hodder@encodis.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Programming Language :: Python :: 3.6",
      "Programming Language :: Python :: 3.7",
      "Programming Language :: Python :: 3.8",
      "Topic :: Games/Entertainment :: Role-Playing"
    ],
    "description": "# Introduction\n\nThere are a number of RPG accessories that allow a GM to build all sorts of things from groups of tables: caverns, catacombs, solar systems, galaxy sectors, names of every description... Now, while it is certainly fun to roll dice it is not always practical and can be time consuming. Hence `gametables`, a Python program that will read in a YAML file containing the specification of group of tables that will then be randomly rolled. The output is printed on the terminal or sent to a file.\n\n## Installation\n\n```\n$ pip install --upgrade gametables\n```\n\n## Usage\n\nThe `gametables` script simply takes one or two arguments: the YAML file containing the data and optionally the output (text) file name:\n\n```\n$ python -m gametables monsters.yaml\n```\n\nOr use the console script:\n\n```\n$ gametables monsters.yaml result.txt\n```\n\n\n## YAML file format\n\nTables and table groups are stored in a [YAML 1.2 file](https://yaml.org/spec/1.2/spec.html). It must contain at least two keys: `name`, which maps to a string and acts as a reference (or ID) for the table and `table` which maps to a sequence of entries. For example, the running the file:\n\n```\n---\nname: Wandering Monsters\ntable:\n-  goblins\n-  orcs\n-  hobgoblins\n```\n\nwill choose a random entry from the `table` section. As there are three entries there is a one in three chance of each one being output. In effect, the program is  rolling \"1d3\" on the table. The weighting of an entry can be adjusted by prefixing it with `N* ` where N is the increased weighting. For example:\n\n```\n---\nname: Wandering Monsters\ntable:\n-  2* goblins\n-  orcs\n-  hobgoblins\n```\n\nis the same as:\n\n```\n---\nname: Wandering Monsters\ntable:\n-  goblins\n-  goblins\n-  orcs\n-  hobgoblins\n```\n\nAn entry can also contain a sequence in \"flow\" style. For example, consider this file:\n\n```\n---\nname: Wandering Monsters\ntable:\n-  [skeletons, zombies]\n-  [goblins, hobgoblins]\n```\n\nThere is a fifty-fifty chance of choosing the \"skeletons, zombies\" line, and then a fifty-fifty chance of choosing either \"skeletons\" or \"zombies\". Flow sequences can also have weights, e.g. `[3* skeletons, zombies]`, but an entry containing a flow sequence cannot.\n\nAn alternative is to use lookup tables, which will be what are printed in most RPGs. Use the `lookup` parameter, with a value or expression to \"roll\" and include the ranges on each line. For example:\n\n```\n---\nname: Wandering Monsters\nlookup: $1d4$\ntable:\n-  1-2 goblins\n-  3 orcs\n-  4 hobgoblins\n```\n\n\nMultiple tables can be specified in the same file:\n\n```\n---\nname: Wandering Monsters\nformat: '^'\ntable:\n-  2* goblins\n-  orcs\n-  hobgoblins\n...\n---\nname: Time of Day\ntable:\n-  morning\n-  afternoon\n-  night\n```\n\nwhich would produce something similar to the following:\n\n```\norcs night\n```\n\n### Table Specification\n\nThe full specification for a table, with all the allowable options, is as follows:\n\n#### name\n\nThe name of the table, as a string. This is used as a heading (if the `header` parameter is set to 'True') and to reference the table via a link (see below). Names should be unique, but this is not enforced which might lead to odd results.\n\n#### table\n\nA sequence of entries that will be selected from. An entry can be:\n\n-  A string, e.g. \"goblins\", with an optional weighting, e.g. \"3* goblins\", or\n-  A YAML flow sequence, e.g. \"['goblins', 'orcs']\". Elements of the flow sequence can have weightings as above, but the flow sequence as a whole cannot.\n-  It is tricky to have a blank line as an entry in a table. The double underscore \"__\" sequence will be removed from any entry to facilitate this.\n\n#### lookup\n\nInstructs the program to treat the table as a lookup table. The ranges must be supplied for each line in `A-B` format, although if this is not supplied then a \"1\" is assumed. The default value is `false`. If `true` then the dice roll used for the lookup will be calculated from the number of entries in the table, i.e. five entries will lead to a \"1d5\". (However, this will ignore any ranges that have been given).\n\nHowever, most of the time `lookup` field will be an expression, e.g. `$2d6$`. Variables can also be included (provided they have been set beforehand), e.g. `$2d6 + terrain_mod$`\n\n#### format\n\nA string used to format the output of the table. This string should contain the `^` character, which will be replaced by the results of the \"roll\" on the table. The default is simply `^\\n` (i.e. the result itself, followed by a newline) and the string ` ^` (i.e. space and caret) will be added to the `format` if is does not contain a caret. For example:\n\n```\n---\nname: Wandering Monsters\nformat: There are some ^ in the room\ntable:\n-  goblins\n-  orcs\n-  hobgoblins\n```\n\nmight produce:\n\n```\nThere are some orcs in the room\n```\n\nFormat strings can contain control characters like tab and newline, but make sure the string is double quoted, e.g. `format: \"\\tNumber: ^ \\n\"`. To prevent the table adding a newline replace the default format with the caret character only, i.e. `\"^\"`.\n\n#### show\n\nA boolean value determining if the output of the table is displayed. The default is 'true'; set to 'false' if the table will only be referred to via a link.\n\n#### order\n\nThe order (an integer) in which the output from the tables should be displayed. The default order is the order in the YAML document. Specifying two tables with the same order may result in undefined results.\n\n#### header\n\nA string that is prepended to the output of the entire table (i.e. after all the `repeat`s). As with the `format` field this will need to be quoted if it contains control characters. For example:\n\n```\n---\nname: Wandering Monsters\nheader: \"You have encountered:\\n\"\nformat: \"    ^\\n\"\nrepeat: 2\ntable:\n-  goblins\n-  orcs\n-  hobgoblins\n```\n\nshould result in something similar to:\n\n```\nYou have encountered:\n    goblins\n    orcs\n```\n\nNote that the trailing colon also means that the string must be quoted (as per the YAML specification). Also note that the header will not be printed if the result of the table is empty (i.e. a zero length string).\n\n#### footer\n\nA string that is appended to the output of the entire table (i.e. after all the `repeat`s). \n\n#### repeat\n\nThe number of times to roll on the table. The default is 1. This can be either an integer or a string. When the table is \"rolled\" this parameter is evaluated for variables (see below), and converted to an integer (defaulting to 1, if it cannot). So the following are all equivalent (see also Variables, below):\n\n```\n---\nname: Wandering Monsters\nrepeat: 2\ntable:\n-  goblins\n-  orcs\n-  hobgoblins\n```\n\n```\n---\nname: Wandering Monsters\nrepeat: $num$\nvars: $num=2$\ntable:\n-  goblins\n-  orcs\n-  hobgoblins\n```\n\n#### variables\n\nA string containing any number of variable assignments (see below). This parameter will be evaluated when the table is read (in fact, when *all* the tables are read) so it can be used to set up variables for use elsewhere. Note that dice rolls are evaluated *before* the variables are set so:\n\n```\nvariables: $num=1d6$\n```\n\nwill set `num` to a value between 1 and 6. \n\nNote that the `variables` field of each table is read and evaluated in the order they are read, so it is quite possible to overwrite variables. This field is useful when using modifiers to lookup rolls, as it can be used to set default values.\n\n### Table Links\n\nTable entries can contain \"links\" to other tables. The \"linked\" table is then rolled and the results replace the \"link\". To link to another table simply enclose the name of the table in caret characters. For example:\n\n```\n---\nname: Wandering Monsters\ntable:\n- ^Goblinoids^\n- ^The Undead^\n...\n---\nname: Goblinoids\nshow: false\ntable:\n-  goblins\n-  orcs\n-  hobgoblins\n...\n---\nname: The Undead\nshow: false\ntable:\n-  skeletons\n-  zombies\n...\n```\n\nhas a equal chance of \"rolling\" on the \"Goblinoids\" or \"The Undead\" tables. Note that linked tables typically have `show: false` to prevent that table being printed out and the output repeated. Table names (and therefore links) are case and space sensitive. Linked tables can themselves contain links, but each table can only be visited or \"rolled\" 20 times (to prevent infinite recursion).\n\nLinks can contain variable references, for example: `^$size$ $type$^` might refer to tables called \"Large Undead\", \"Small Beasts\" etc, depending on the value of `$size$` and `$type$`.\n\n\n### Expressions\n\nTable entries can contain simple arithmetic expressions. Variables that have been set will be used in these expressions (but recall that the order in which the tables are \"rolled\" is important). Any strings of the form `XdY` will be replaced by the appropriate dice roll (with X as the number of dice and Y the number of sides). This makes it possible to construct tables like this:\n\n```\n---\nname: Wandering Monsters\nvariables: $danger=1d4$\ntable:\n-  $1d6+1+danger$ goblins\n-  $1d4-1+danger$ orcs\n-  $1d7+danger$ hobgoblins\n-  $(2d6*2)+danger-1d4$ kobolds\n```\n\nDice rolls can also appear in the `variables` field as part of a variable definition, as well as the `lookup` field.\n\n\n### Variables\n\nVariables can be defined in the `variables` parameter, as described above. They can also be defined as part of a table entry, in which case they are set when that entry is output. \n\nVariables are set using the notation `$name=value$`. They are used simply using the name in an expression.\n\nVariables can evaluate to either strings or integers: if a variable (or, for that matter, the result of an expression) can be converted to an integer it will be. Otherwise it will be a string. This means that if, say, the variable `num` is not defined when the expression `$1d4 + num$` is evaluated the result will be the string `1d4 + num`. Integer variables are also formatted using comma separators.\n\nFor example:\n\n```\n---\nname: Wandering Monsters\ntable:\n-  goblins $num=4$\n-  orcs $num=1d2+1$\n-  hobgoblins $num=3$\n...\n---\nname: Monster Type\nrepeat: $num$\ntable:\n-  Warrior\n-  Soldier\n-  Mage\n...\n```\n\nVariables are set first, removing the expression from the entry. Then all expressions are evaluated with the result replacing the expression in the entry. Note that variables are defined in the order they are encountered when outputting the tables: if a table has `show: false` then any variables it defines will not be set unless some other table runs it via a table link.\n\nAll variables are \"global\" and there is no checking for or protection from overwriting an existing variable.\n\n## Example Files\n\nThe **examples** folder in the repo contain some annotated examples of input YAML file. The first is the \"Adventure Title\" generator from Modiphious' Gamemasters Toolkit (**conan_adv_titles.yaml**). Some sample results are quite good:\n\n```\nShadow in the Pool\nA/an Empress Is/Will Be/Shall Be Cursed\nThe Iron Gem of the Skull\nA/An Storm of Shadow\n```\n\nOthers might need some work:\n\n```\nBone\nThe Lost of Queen\nFallen of Specter\nCircle of Ring\n```\n\nalthough \"Bone\" is not a bad name for a Conan adventure!\n\nAnother example is from \"Catacombs of Hyboria\", Second Edition by Mongoose Publishing (**conan_catacombs.yaml**). This is a much more complex generator with numerous tables (some of them two dimensional) and various modifiers. Some sample output is:\n\n```\nType:   Hollow  \nSize:   Average \nArea:   400 sq. ft.\nDepth:  85 ft.\nTerrain:\n        Man-Made:    Burial Chamber (decrepit, 50% chance of treasure worth 1200 silver pieces)\n```\n\nand \n\n```\nType:   Cavern System  \nSize:   Average \nArea:   1,800,000 sq. ft.\nDepth:  2,550 ft.\nTerrain:\n        Flora:       Common Growth (area 50%)\n        Surface:     Gorge/Cliff (span 60 ft., depth 30 ft.)\n        Surface:     Pitted Stone (area 40%)\n        Vast Depth:  Ancient Art/Symbols (area 40 sq. ft.)\n        Surface:     Stalagmite Field (area 300 sq. ft., average height 18 in.)\n        Fauna:       Crawling (insect, 100, waste is prodigious and slick)\n        Fauna:       Aerial (gliding mammal, pop. 10,000, has perfect sonar and blind sight)\n        Fauna:       Burrowing (mammal, pop. 1,500, naturally venomous and predatory)\n        Fauna:       Burrowing (mammal, pop. 500, possesses dangerous self-defence toxins in its flesh)\n        Fauna:       Large Creature (reptile, pop. 60, advanced intelligence with problem-solving)\n        Surface:     Stalagmite Field (area 450 sq. ft., average height 2 ft.)\n        Fauna:       Aerial (lacewing, pop. 6,000, small sized, fast)\n        Ceiling:     Optical Illusion of Height\n        Vast Depth:  Phosphorescent Growths (area 50%)\n        Ceiling:     Optical Illusion of Height\n        Vast Depth:  Abyssal Crevasse (width 100 ft.)\n        Fauna:       Subterranean (worm, pop. 40, found below 100 ft., has a secondary trait)\n        Surface:     Waterway Access (underground river, depth 30 ft.)\n        Vast Depth:  Abyssal Crevasse (width 160 ft.)\n        Surface:     Stalagmite Field (area 200 sq. ft., average height 1 ft.)\n        Unique:      Lair of the Dead\n\nPlots:\n        Unearthed Graves\n```\n\nNote that the order of the terrain elements is not sorted. It would be nice if this was an option but one could consider this the order in which the elements are encountered. Also note that full descriptions of elements have not been included, so if you want to know what \"Pitted Stone\" and \"Lair of the Dead\" refer to you will need to source the book.\n\nAnother example is from the \"Star Wars Roleplaying Game: Revised, Expanded, Updated\" by Womp Rat Press. This is an expansion of \"Star Wars: The Role Playing Game\" by West End Games. The file **star_wars_planets.yaml** contains the world creator in the REUP version. Sample planets generated are: \n\n```\nStar Wars Planet\n\nFunction:     Military  \nGovernment:   Organized Crime\nPlanet Type:  Terrestrial\nTerrain:      Volcanic  \nTemperature:  Temperate\nGravity:      Heavy \nAtmosphere:   Type I (breathable)\nHydrosphere:  Moist\nDay Length:   15 standard hours\nYear Length:  465 local days\nStarport:     Imperial/Republic class\nPopulation:   5,000\nTech Level:   Hyperspace\n```\n\nand\n\n```\nStar Wars Planet\n\nFunction:     Homeworld\nGovernment:   Dictatorship\nPlanet Type:  Terrestrial\nTerrain:      Special\nTemperature:  Temperate\nGravity:      Standard\nAtmosphere:   Type I (breathable)\nHydrosphere:  Saturated\nDay Length:   25 standard hours\nYear Length:  345 local days\nStarport:     Stellar class\nPopulation:   82,000,000,000\nTech Level:   Hyperspace\n```\n\nNote that the one thing not included here are the \"Incompatible Conditions\", such as not having an Agricultural planet in an Asteroid Belt.\n\n## Development Notes\n\n### Unit testing\n\nA small number of tests are included in the `test_gametables.py` file and can be run using the [pytest](https://pypi.org/project/pytest/) application.\n\n### Packaging a distribution\n\nWhen ready for a release use the [bumpversion](https://pypi.org/project/bumpversion/) application to update the version number, e.g.\n\n```\n$ bumpversion major --tag\n```\n\nThis will update the source file and the setup configuration. Then build the distribution:\n\n```\n$ python setup.py bdist_wheel\n```\n\n## To Do\n\n- Catch more YAML and expression parser exceptions\n- Warn of unknown YAML fields?\n- Test literals, folded newlines and multi-line flow scalars\n- Functionality to set up a library of files, then roll a table by name (not file itself)\n- Option to dump YAML file in Markdown format (--dump)\n- Option to toggle integer formatting (--integer)\n- Options for tables to run without output (like show: false but with variables being set etc)\n- Read a folder of YAML files (would have to define order)\n- Read a zip file of YAML files\n- Overall headers and footers (possible as template files)\n- Warning of overwriting existing variables, with option to allow/deny?\n- For lookup tables, check ranges are consistent\n- More formatting options, ideally for input to something like Pandoc? Or test have HTML header/footer\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/encodis/gametables",
    "keywords": "gametables tables games playing",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "gametables",
    "package_url": "https://pypi.org/project/gametables/",
    "platform": "",
    "project_url": "https://pypi.org/project/gametables/",
    "project_urls": {
      "Homepage": "https://github.com/encodis/gametables"
    },
    "release_url": "https://pypi.org/project/gametables/0.1.0/",
    "requires_dist": [
      "pyyaml (>=5.1)",
      "py-expression-eval"
    ],
    "requires_python": "",
    "summary": "Choose random entries from sequences in a YAML file",
    "version": "0.1.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 9843058,
  "releases": {
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "fe945b1c6f785e73e1ee9d7ea8d9b0ace345203b336baeeea4f4b96c4dacc598",
          "md5": "35f58b77d890242d87bace48167ecc7c",
          "sha256": "acc66ed11fabfaa7e4320ed349afb3e1dc5f82059a37a584db7719acf3c19bfb"
        },
        "downloads": -1,
        "filename": "gametables-0.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "35f58b77d890242d87bace48167ecc7c",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 11672,
        "upload_time": "2021-03-22T11:45:31",
        "upload_time_iso_8601": "2021-03-22T11:45:31.734785Z",
        "url": "https://files.pythonhosted.org/packages/fe/94/5b1c6f785e73e1ee9d7ea8d9b0ace345203b336baeeea4f4b96c4dacc598/gametables-0.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "fe945b1c6f785e73e1ee9d7ea8d9b0ace345203b336baeeea4f4b96c4dacc598",
        "md5": "35f58b77d890242d87bace48167ecc7c",
        "sha256": "acc66ed11fabfaa7e4320ed349afb3e1dc5f82059a37a584db7719acf3c19bfb"
      },
      "downloads": -1,
      "filename": "gametables-0.1.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "35f58b77d890242d87bace48167ecc7c",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 11672,
      "upload_time": "2021-03-22T11:45:31",
      "upload_time_iso_8601": "2021-03-22T11:45:31.734785Z",
      "url": "https://files.pythonhosted.org/packages/fe/94/5b1c6f785e73e1ee9d7ea8d9b0ace345203b336baeeea4f4b96c4dacc598/gametables-0.1.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}