{
  "info": {
    "author": "Sebastian Haan",
    "author_email": "sebastian.haan@sydney.edu.au",
    "bugtrack_url": null,
    "classifiers": [
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.4",
      "Programming Language :: Python :: 3.5",
      "Programming Language :: Python :: 3.6",
      "Programming Language :: Python :: 3.7"
    ],
    "description": "# GeoBO: A Python package for Multi-Objective Bayesian Optimisation and Joint Inversion in Geosciences\n\n``GeoBO`` is build upon a probabilistic framework using Gaussian Process (GP) priors to jointly solve multi-linear forward models. This software generates multi-output 3D cubes of geophysical properties (e.g. density, magnetic susceptibility, mineral concentrations) and their uncertainties from 2D survey data (e.g. magnetics and gravity) and any pre-existing drillcore measurements. The reconstructed 3D model is then used to query the next most promising measurement location given an expensive cost function (e.g. for drillcores). A ranked list of new measurements is proposed based on user-defined objectives as defined in the acquisition function which typically aims to optimize exploration (reducing global model uncertainty) and exploitation (focusing on highly promising regions) while minimizing costs. \n\n![GeoBO Framework](https://github.com/sebhaan/geobo/blob/master/docs/Overview_illustration.png?raw=True)\n\n## Table of Contents\n- [Definitions](#definitions)\n- [Functionality](#functionality)\n- [Installation And Requirements](#installation-and-requirements)\n  - [Requirements](#requirements)\n  - [Installation](#installation)\n  - [Documentation](#documentation)\n- [Usage and Settings](#usage-and-settings) \n- [Examples and Tests](#examples)\n  - [Synthetic Models](#synthetic-models)\n  - [Drillcore Test Example](#drillcore-test-example)\n  - [Results and Output Files](#results-and-output-files)\n- [Options and Customization](#options-and-customization)\n  - [Custom Linear Forward Models](#custom-linear-forward-models)\n  - [Gaussian Process Kernel Functions](#gaussian-process-kernel-functions)\n- [Literature](#literature)\n- [Related Software](#related-software)\n- [Attribution and Acknowledgments](#attribution-and-acknowledgements)\n  - [Project Contributors](#project-contributors)\n- [License](#license)\n\n\n## Definitions\n\nBayesian Optimisation (BO) is a powerful framework for finding the extrema of objective functions that are noisy, expensive\nto evaluate, do not have a closed-form (e.g. black-boxfunctions), or have no accessible derivatives. The model used for approximating the objective function is called surrogate model, which is typically based on a [Gaussian Process models](https://en.wikipedia.org/wiki/Gaussian_process) for tractability. Gaussian Processes define a prior over functions (typically given by a kernel function) and is used to propose points in the search space where sampling is likely to yield an improvement. The specific set of objectives for the improvement are defined in an acquisition function, which guides the search for a user-defined optimum. An example use case scenario is described in a nutshell in [OPTIMIZATION_FOR_ACTIVE_SENSORFUSION_IN_A_NUTSHELL.pdf](https://github.com/sebhaan/geobo/blob/master/docs/OPTIMIZATION_FOR_ACTIVE_SENSORFUSION_IN_A_NUTSHELL.pdf).\n\n### Acquisition function \n\nThe key of BO is the acquisition function, which typically has to balance between: \n\na) exploration, i.e., querying points that maximise the information gain and minimize the uncertainty of a model\nb) exploitation, i.e. querying points that maximise the reward (e.g. concentrating search in the\nvicinity locations with high value such as minerals)\nc) minimize the number of samples given an expensive cost function for any new measurement.\n\n\n### Forward Models and Joint Inversion\nIn geology and geophysics, inversion problems occur whenever the goal is to reconstruct the geological conditions, i.e. the 3D distribution of physical rock properties, that give rise to a set of (2D) geophysical observations. Since the number of possible geological configurations is typically greater than the number of observational constraints, the problem is nearly always under-determined.\nForward models transform the localized measurement of a remote sensor grid into a 3D representation of geophysical properties of a region. The most common geophysical linear forward model are gravity and magnetic forward models, which are computed using Li’s tractable approximation. Joint inversion is  simultaneously interpreting  multiple (distinct) sensor measurements using a single model to provide a better constrained joint solution rather than taking individual solutions that only satisfy their aspect of data on their own. \n\n\n\n## Functionality\n\nGeoBO's probabilistic framework includes all steps from  prior selection, data fusion and inversion, to sensor optimisation and real world model output. The main functionalities of GeoBO are summarised in the following:\n\n - Joint probabilistic inversion tool by solving simultaneously multi-linear forward models (e.g. gravity, magnetics) using cross-variances between geophysical properties (cross-variance terms can be specified by user). \n - Output 1: Generation of cubes and computation of complete posterior distribution for all geophysical properties (described by their mean and variance value at each location (cubecell aka voxel). \n - Output 2: Generation of ranked proposal list for new most promising drillcores based on global optimisation of acquisition function\n - Templates for acquisition function to use in Bayesian Optimisation\n - Flexible parameter settings for exploration-exploitation trade-off and inclusion of local 3D cost function in acquisition function \n\n\nOther features are:\n\n - Generation of simulated geophysical data with a choice of three different models\n - Package includes geological survey/drillcore sample as well as synthetic data and functions for synthetic data generation\n - Generation of 2D/3D visualisation plots of reconstructed cubes and survey data\n - 3D Cube export in VTK format (for subsequent analysis, e.g., in Python or with ParaView)\n - Options to include any pre-existing drillcore data \n - Included linear forward models: density-to-gravity and magnetic susceptibility-to-magnetic field; custom linear forward models can be added (see [Custom Linear Forward Models](#custom-linear-forward-models))\n - Library of Gaussian Process (GP) kernels including sparse GP kernels\n - Flexible settings for any cube geometry and resolution\n - (Optional) Optimization of GP hyperparameters and cross-correlation coefficients via computation of marginal GP likelihood\n\nExample outputs can be found in the directory `examples/results/`.\n\n## Installation And Requirements\n\n\n### Installation\n\nTo install GeoBO locally using setuptools: \n\n```sh\npython setup.py build\npython setup.py install\n```\n\nor using pip:\n\n```sh\npip3 install geobo\n```\n\nThe installation can be tested by running the example with included synthetic data and default settings:\n\n```sh\ncd geobo/\npython main.py tests/settings_example1.yaml\n```\n\n### Requirements\n\n- python >=3.6\n- numpy\n- matplotlib\n- scikit_image\n- scipy\n- rasterio\n- pandas\n- pyvista\n- skimage\n- PyYAML\n\n\n### Documentation \n\nDocumentation conversion is generated using pandoc. The README markdown file can be converted to PDF:\n\n```bash\npandoc -V geometry:margin=1.0in README.md -o README.pdf\n```\n\nA complete API documentation for all modules can be found here:\n\n- [`run_geobo.py`](http://htmlpreview.github.io/?https://github.com/sebhaan/geobo/blob/release/docs/APIdocs/geobo/run_geobo.html)\n- [`inversion.py`](http://htmlpreview.github.io/?https://github.com/sebhaan/geobo/blob/release/docs/APIdocs/geobo/inversion.html)\n- [`kernels.py`](http://htmlpreview.github.io/?https://github.com/sebhaan/geobo/blob/release/docs/APIdocs/geobo/kernels.html)\n- [`cubeshow.py`](http://htmlpreview.github.io/?https://github.com/sebhaan/geobo/blob/release/docs/APIdocs/geobo/cubeshow.html)\n- [`sensormodel.py`](http://htmlpreview.github.io/?https://github.com/sebhaan/geobo/blob/release/docs/APIdocs/geobo/sensormodel.html)\n- [`simcube.py`](http://htmlpreview.github.io/?https://github.com/sebhaan/geobo/blob/release/docs/APIdocs/geobo/simcube.html)\n- [`utils.py`](http://htmlpreview.github.io/?https://github.com/sebhaan/geobo/blob/release/docs/APIdocs/geobo/utils.html)\n\n\n## Usage and Settings\n\n1) Change the main settings such as filenames and parameters in `settings.yaml`. These settings specify:\n\n- directory, filenames, and geophysical drillcore properties\n- the generated cube's geometry, size, and resolution\n- Gaussian Process settings (lengthscale, input data uncertainty, correlation coefficients, kernel function)\n- local Earth's magnetic field vector\n- Bayesian Optimisation Settings (vertical/non-vertical drillcores, the exploration/exploitation and cost weighting)\n- plotting settings\n- optional generation of simulated data \n\n2) Then run geobo\n```sh\ncd geobo/\npython main.py settings.yaml\n```\n\nThe main functions for the acquisition function can be found in [`run_geobo.py`](docs/APIdocs/geobo/run_geobo.html); visualisation functions and VTK export are defined in [`cubeshow.py`](docs/APIdocs/geobo/cubeshow.html); inversion functions are defined in [`inversion.py`](docs/APIdocs/geobo/inversion.html). \n\n\n## Examples and Tests\n\n\n### Synthetic Models\n\nSynthetic geophysical models can be created by setting switching on `gen_simulation` in the settings yaml file. \nThree different models are so far implemented:\n\n- two-cylindric dipping bodies (`modelname: 'cylinders'`) \n- two layer model (`modelname: 'layers2'`)\n- three layer model (`modelname: 'layers3'`)\nFor each model a 3D voxel cube with geological structures is generated with density and magnetic susceptibility properties, plus\nthe corresponding 2D gravity and magnetic remote sensor measurements. Other custom models can be included by adding a new model in function `create_syncube()` in `simcube.py`\n\nResult examples of the synthetic models are stored in the subfolder `examples/testdata/synthetic/`.\nAn example settings file is given in `settings_example1.yaml` and can be run by\n\n```sh\ncd geobo/\npython main.py tests/settings_example1.yaml \n```\n\n\n### Drillcore Test Example\n\nAnother examples includes drillcore and gravity/magnetic survey data (`examples/testdata/sample/`). This example can be run with\n\n```sh\ncd geobo/\npython main.py tests/settings_example2.yaml\n```\nand creates the reconstructed density and magnetic susceptibility cubes, uncertainty cubes\n\n\n### Results and Output Files\n\nThe output results include the generated reconstructed density and magnetic susceptibility cubes and their corresponding uncertainty cubes, visualisations of original survey data and reconstructed properties, and list of new measurement proposals.\n\nList of Joint Inversion Result Outputs: \n\n- 3D Cube files in vtk format (to use, e.g., with PyVista or ParaView): Output of cross-correlated reconstructed properties (density: **cube_density.vtk**, magnetic susceptibility: **cube_magsus.vtk**, property from drill: **cube_drill.vtk**) and their uncertainity cubes in terms of standard deviation (**cube_density_variance.vtk, cube_drill_variance.vtk, cube_drill_variance.vtk**). In case the cross-covariance terms (`gp_coeff` in the settings file) are all set to zero, the solutions for each forward model are independent from each other.\n- Optional (Default optiion: plot=True in function `read_surveydata()`): Images of the input gravitational field (**gravfield.png**) and magnetic field (**magfield.png**) and their corresponding downsampled images (**gravfield_downsampled.png, magfield_downsampled.png**) \n- Optional (if `plot3d`:True in settings): 3D Preview of reconstructed properties: density (**density-mesh3D.png**), magnetic suscpetibility (**magsus-mesh3D.png**), and drill property (**drill-mesh3D.png**). However, it is recommended to use PyVista or Paraview instead. Future updates for 3D visualisations will be based on PyVista. \n- Optional (if `plot_vertical`:True in settings): 2D maps of vertically (along z-axis) mean value of cube properties (**dens_rec2D_loc2.png, magsus_rec2D_loc2.png, drill_rec2D_loc2.png**)\n\nList of Bayesian Optimisation Output:\n\n- List of all new measurement proposals (here for drillcores) ranked from maximum (hightest gain) to minimum of optimisation function. The results are saved as csv file (**newdrill_proposals_non-vertical.csv** or **newdrill_proposals_vertical.csv**) and include for vertical drillcores the position (Easting, Northing) and for non-vertical drillcores position and drill angles (Azimuth, Dip).\n- Points of proposed measurement positions on top of reconstructed drill property image (mean projection along z-axis): The output figure (non-vertical drillcores:**newdrill_proposals.png** or vertical drillcores:**newdrill_vertical_proposals.png**) shows the location of the already existing drills as given by input measurements (black points), the new proposed drill positions (white), and the best (maximum of optimsation function) new drill location (red). \n\n![Example image of new measurement proposals (black_ existing, white: new proposed, red: best proposal) on top of reconstructed property (mean value projection)](https://github.com/sebhaan/geobo/blob/master/docs/newdrill_proposals.png?raw=True).\n\n## Options and Customization\n\n\n### Custom Linear Forward Models\n\nThe relationship between a physical system (or its model parameters) ***P*** and the observed sensor data **y** is described by a linear forward model\n\n**y** = **G** ***P***,  \n\nwhere **G** is the transformation operator or matrix. The gravitational and magnetic forward model can be determined analytically by using Li's tractable approximation (see Li and Oldenburg 1998) for a 3D field of prisms of constant susceptibility and density, and GeoBO applies this prism shape model to compute the corresponding sensor sensitivity for gravity and anomalous magnetic field related to each prism cell.\n\nThe current implementation includes magnetic and gravity forward models, which are defined in the module `sensormodel.py` by the functions `A_sens()`,`grav_func()`, and `magn_func()`. The easiest way to add custom models is to create a new forward model function similar to the included functions `grav_func()` or `magn_func` and to compute the forward model matrix with `A_sens()`, if possible. The custom function need to describe the sensitivity or relationship for a particular point relative to the sensor origin (see, e.g., `grav_func()`).\n\nIn general any linear forward model can be added by changing accordingly the forward model matrix as computed by `A_sens()` as long as this function returns the matrix **G** that satisfies the linear relation **y** = **G** ***P***.\n\n\n### Gaussian Process Kernel Functions\n\nGaussian Processes (GPs) are a flexible, probabilistic approach using kernel machines and can propagate consistently uncertainties from input to output space under the Bayesian formalism. Another advantage of GPs is that their marginal likelihood function is well defined by the values of their hyper-parameters, and can thus be optimized.\nThe choice for an appropriate covariance (kernel) function is important and there are many stationary (invariant to translation in input space) and non-stationary covariance functions available (for an overview, see, e.g., Rasmussen and Williams 2006). To handle the computational problem of inverting a large covariance matrix, GeoBO uses by default an intrinsically sparse covariance function (Melkumyan et, al. 2009). However, other standard kernel functions are available (see module `kernels.py`), which includes the squared exponential \nand Matern32 function and their their corresponding multi-kernel covariance functions (see Melkumyan et. al. 2011). \n\nThe settings yaml file allows you to choose the kernel function by configuring the parameter `kernelfunc`,  which can be set either to 'sparse' (Default), 'exp' (squared exponential) or 'matern32'. New custom kernels can be a added in the module `kernels.py`, which requires to write their covariance function (see as example `gpkernel()`) and cross-covariance function (see as example `gpkernel_sparse()`), and then to add their function name to settings.yaml and to `create_cov()` in `kernels.py`.  \n\nThe hyperparameters of the GP kernel can be configured in the settings yaml file (see Gaussian Process Settings) and are given by the lengthscale (`gp_lengthscale`), the noise regularization terms (`gp_err`) per forward model, and the cross-covariance amplitude terms which (`w1,w2,w3`) that coorrepond to the correlation coefficients between the model properties (e.g., rock density ,magnetic susceptibility, and drillcore measurements). The mathematical details for construction of the Multi-Kernel Covariance Functions are described in Haan et al 2020.\n\n\n### Bayesian Optimisation Options\n\nTo find the optimal new sampling point, GeoBO maximises the objective function (acquisition function) which is defined by the Upper Confidence Bound (UCB)\n\nUCB(x) = *m*(x) + *k* *sigma*(x) - *b* *c*(x)\n\nwith the mean value for the prediction *m*(x), the variance *sigma*<sup>2</sup>(x), and a cost function *c*(x), which is defined by the cost of obtaining a measurement at the sample point x. The parameter *k* and *b* define the trade-off in exploration-to-exploitation and gain-to-cost, respectively. For example, maximizing the mean value can be beneficial if the goal is to sample new data at locations with high density or mineral content, and not only where the uncertainty is high. \nThe parameters *k* and *b* can be accordingly specified by the user in the settings yaml file.  Moreover, the settings allow the user to choose between vertical and non-vertical drillcore; in the latter case GeoBO is optimising also dip and azimuthal angle of the  drillcore in addition to drillcore position.\n\n\n## Literature\n\nSebastian Haan, Fabio Ramos, Dietmar Muller, \"Multi-Objective Bayesian Optimisation and Joint Inversion for Active Sensor Fusion\", Geophysics, 86(1), pp.1-78. [arXiv Preprint](https://arxiv.org/abs/2010.05386)\n\nCarl Edward Rasmussen and Christopher KI Williams, Gaussian process for machine learning, MIT press, 2006.\n\nLi Yaoguo and Douglas W Oldenburg, “3d-inversion of gravity data,” Geophysics, vol. 63, no. 1, pp. 109–119, 1998.\n\nArman Melkumyan and Fabio Ramos, “A sparse covariance function for exact gaussian process inference in large datasets.,” in IJCAI, 2009, vol. 9, pp. 1936–1942\n\nArmon Melkuyman and Fabio Ramos, “Multi-kernel gaussian processes,” in IJCAI, 2011, vol. 22, p. 1408\n\nReid, A., O. Simon Timothy, E. V. Bonilla, L. McCalman, T. Rawling, and F. Ramos, 2013, Bayesian joint inversions for the exploration of earth resources.: IJCAI, 2877\n\nEric Brochu, Vlad M Cora, and Nando De Freitas, “A tutorial on bayesian optimization of expensive cost functions, with application to active user modeling and hierarchical reinforcement learning,” arXiv preprint arXiv:1012.2599, 2010.\n\n\n## Related Software\n\nFor the inversion part, GeoBO uses a direct inversion method via transformation of Gaussian Process priors, which enables joint inversion but is limited to linear forward models (e.g. gravity, magnetics, drillcores). For solving more complex non-linear forward models (e.g., seismic, or prior geological knowledge), the following bayesian inversion methods can potentially be applied to generate 3D geophysical surrogate models or to further refine GeoBo's 3D posterior model:\n\n- hIPPYlib: an Extensible Software Framework for Large-scale Deterministic and Bayesian Inverse Problems. [Publication Link](https://www.theoj.org/joss-papers/joss.00940/10.21105.joss.00940.pdf); the software code is available at [hippylib.github.io](https://hippylib.github.io/)\n\n- Obsidian: a flexible software platform for MCMC sampling of 3-D multi-modal geophysical models on distributed computing clusters. [Publication Link](https://gmd.copernicus.org/articles/12/2941/2019/); the code for version 0.1.2 of Obsidian is available at [https://doi.org/10.5281/zenodo.2580422](https://doi.org/10.5281/zenodo.2580422)\n\n- GemPy: open-source stochastic geological modeling and inversion; geoscientific model development. See [gempy.org](https://www.gempy.org/)\n\n\n\n## Attribution and Acknowledgments\n\nAcknowledgments are an important way for us to demonstrate the value we bring to your research. Your research outcomes are vital for ongoing funding of the Sydney Informatics Hub.\n\nIf you make use of this code for your research project, please include the following acknowledgment:\n\n“This research was supported by the Sydney Informatics Hub, a Core Research Facility of the University of Sydney.”\n\n### Project Contributors\n\nKey project contributors to the GeoBO project are:\n\n- Dr. Sebastian Haan (USYD, Sydney Informatics Hub): Expert in machine learning and physics, main contributor and software development of GeoBO.\n- Prof. Fabian Ramos (USYD): Computational scientist and research expert in machine learning and bayesian computational techniques.\n- Prof. Dietmar Muller (USYD, School of Geoscience): Research expert in geophysics and geoscience applications.\n- Dr. Ben Mather (USYD, Sydney Informatics Hub/School of Geoscience ): Computational Geophysicist, GeoBO testing.\n\n\n## License\n\nCopyright 2020 Sebastian Haan\n\nGeoBO is free software: you can redistribute it and/or modify it under the terms of the GNU Affero General Public License (AGPL version 3) as published by the Free Software Foundation.\n\nThis program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU Affero General Public License for more details.\n\nYou should have received a copy of the GNU Affero General Public License along with this program (see LICENSE.md). If not, see [https://www.gnu.org/licenses/](https://www.gnu.org/licenses/).\n\n\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/sebhaan/geobo",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "geobo",
    "package_url": "https://pypi.org/project/geobo/",
    "platform": "",
    "project_url": "https://pypi.org/project/geobo/",
    "project_urls": {
      "Homepage": "https://github.com/sebhaan/geobo"
    },
    "release_url": "https://pypi.org/project/geobo/1.0.0/",
    "requires_dist": [
      "numpy (>=1.15.0)",
      "scipy (>=1.1.0)",
      "matplotlib (>=2.2.2)",
      "scikit-image (>=0.14.0)",
      "rasterio (>=1.0.20)",
      "pandas (>=0.23.4)",
      "pyvista (>=0.23.0)",
      "PyYAML (>=5.3)"
    ],
    "requires_python": ">=3.6",
    "summary": "Python package for Multi-Objective Bayesian Optimisation and Joint Inversion in Geosciences",
    "version": "1.0.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 9177525,
  "releases": {
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7a8d7697b5a5cf1b8271cb102a0bc4c3caa76897c6b323ae23d04b566a9ed4fe",
          "md5": "b7603475fabb19172bac4c4fe4a07471",
          "sha256": "53fcee32d4d0c2a62b54f31155983a8e4f5096fbb6da1b61ea13fbba0defcfeb"
        },
        "downloads": -1,
        "filename": "geobo-0.1.0-py3.7.egg",
        "has_sig": false,
        "md5_digest": "b7603475fabb19172bac4c4fe4a07471",
        "packagetype": "bdist_egg",
        "python_version": "3.7",
        "requires_python": ">=3.6",
        "size": 641192,
        "upload_time": "2020-11-14T01:00:26",
        "upload_time_iso_8601": "2020-11-14T01:00:26.630380Z",
        "url": "https://files.pythonhosted.org/packages/7a/8d/7697b5a5cf1b8271cb102a0bc4c3caa76897c6b323ae23d04b566a9ed4fe/geobo-0.1.0-py3.7.egg",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1233a94e910440f31d4e9c802b44c1599c624fd43e409892060bec1aff3458b1",
          "md5": "30b5a62ffee209bdc9710fe9e411dcd8",
          "sha256": "0677284c0c240e3dac3b38a9dd9f98909c3a0cf7e27b28697431b3e52a192276"
        },
        "downloads": -1,
        "filename": "geobo-0.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "30b5a62ffee209bdc9710fe9e411dcd8",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 627249,
        "upload_time": "2020-11-14T01:00:23",
        "upload_time_iso_8601": "2020-11-14T01:00:23.882414Z",
        "url": "https://files.pythonhosted.org/packages/12/33/a94e910440f31d4e9c802b44c1599c624fd43e409892060bec1aff3458b1/geobo-0.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "43b7e0f3b3ca66e751e59adebfd9824ad1c6e146ba0c42894dffcf9c0481ccbc",
          "md5": "efe2acd64b18793aa6b68bc1e3c1e2c4",
          "sha256": "be6447ba9306ccb82d8410187e3091ed8426b5de2d1b1ea089f613b7528cad6d"
        },
        "downloads": -1,
        "filename": "geobo-0.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "efe2acd64b18793aa6b68bc1e3c1e2c4",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 608127,
        "upload_time": "2020-11-14T01:00:30",
        "upload_time_iso_8601": "2020-11-14T01:00:30.975592Z",
        "url": "https://files.pythonhosted.org/packages/43/b7/e0f3b3ca66e751e59adebfd9824ad1c6e146ba0c42894dffcf9c0481ccbc/geobo-0.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d31e8615d31a42ca2f2f4c990517291f258b3ebbce180dbc350d67f3b481a44e",
          "md5": "47c9d99c2cb3033bb765478b3667fa6f",
          "sha256": "099795cd75988af521d02fc8f950f3a49168c864a48b0ade88137ff3e0195b78"
        },
        "downloads": -1,
        "filename": "geobo-0.1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "47c9d99c2cb3033bb765478b3667fa6f",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 627650,
        "upload_time": "2020-11-18T10:24:59",
        "upload_time_iso_8601": "2020-11-18T10:24:59.110993Z",
        "url": "https://files.pythonhosted.org/packages/d3/1e/8615d31a42ca2f2f4c990517291f258b3ebbce180dbc350d67f3b481a44e/geobo-0.1.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f1dabe86b839b8ec48cf2961fd11ee1ec9635e2aae2050620f8699ba590683fd",
          "md5": "35092d07ded60a57ef35f446d0d0852f",
          "sha256": "ac2f38052fc891522f74aea5a53bc675eccc3f196a85abaf625fafe7daec68dc"
        },
        "downloads": -1,
        "filename": "geobo-0.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "35092d07ded60a57ef35f446d0d0852f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 608500,
        "upload_time": "2020-11-18T10:25:06",
        "upload_time_iso_8601": "2020-11-18T10:25:06.817807Z",
        "url": "https://files.pythonhosted.org/packages/f1/da/be86b839b8ec48cf2961fd11ee1ec9635e2aae2050620f8699ba590683fd/geobo-0.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8840dbaf2fcb75367ecb9382308410f072ac7e399dd8bcfcbea9309d0bab5ad0",
          "md5": "6567e654b3fa378b501a8a12f64f5c07",
          "sha256": "90a9fecd4d28fb3da301593e7bad02adb1c0b6942bf8393f2959effb9b38a2c3"
        },
        "downloads": -1,
        "filename": "geobo-1.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "6567e654b3fa378b501a8a12f64f5c07",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 627653,
        "upload_time": "2021-01-19T23:31:19",
        "upload_time_iso_8601": "2021-01-19T23:31:19.778022Z",
        "url": "https://files.pythonhosted.org/packages/88/40/dbaf2fcb75367ecb9382308410f072ac7e399dd8bcfcbea9309d0bab5ad0/geobo-1.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5fa24217b3db06fd8472fe51adc4d444ac84460400bce197f242753f3171f46f",
          "md5": "fb09113fde75fda1ec22d1b5f521c2d4",
          "sha256": "0cf872d071255959540aa0f56de4067d44e366edbf9293dabd202148f5b50ed2"
        },
        "downloads": -1,
        "filename": "geobo-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "fb09113fde75fda1ec22d1b5f521c2d4",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 608451,
        "upload_time": "2021-01-19T23:31:21",
        "upload_time_iso_8601": "2021-01-19T23:31:21.347949Z",
        "url": "https://files.pythonhosted.org/packages/5f/a2/4217b3db06fd8472fe51adc4d444ac84460400bce197f242753f3171f46f/geobo-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "8840dbaf2fcb75367ecb9382308410f072ac7e399dd8bcfcbea9309d0bab5ad0",
        "md5": "6567e654b3fa378b501a8a12f64f5c07",
        "sha256": "90a9fecd4d28fb3da301593e7bad02adb1c0b6942bf8393f2959effb9b38a2c3"
      },
      "downloads": -1,
      "filename": "geobo-1.0.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "6567e654b3fa378b501a8a12f64f5c07",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6",
      "size": 627653,
      "upload_time": "2021-01-19T23:31:19",
      "upload_time_iso_8601": "2021-01-19T23:31:19.778022Z",
      "url": "https://files.pythonhosted.org/packages/88/40/dbaf2fcb75367ecb9382308410f072ac7e399dd8bcfcbea9309d0bab5ad0/geobo-1.0.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "5fa24217b3db06fd8472fe51adc4d444ac84460400bce197f242753f3171f46f",
        "md5": "fb09113fde75fda1ec22d1b5f521c2d4",
        "sha256": "0cf872d071255959540aa0f56de4067d44e366edbf9293dabd202148f5b50ed2"
      },
      "downloads": -1,
      "filename": "geobo-1.0.0.tar.gz",
      "has_sig": false,
      "md5_digest": "fb09113fde75fda1ec22d1b5f521c2d4",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 608451,
      "upload_time": "2021-01-19T23:31:21",
      "upload_time_iso_8601": "2021-01-19T23:31:21.347949Z",
      "url": "https://files.pythonhosted.org/packages/5f/a2/4217b3db06fd8472fe51adc4d444ac84460400bce197f242753f3171f46f/geobo-1.0.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}