{
  "info": {
    "author": "Andrew D. Wickert",
    "author_email": "awickert@umn.edu",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "[![Build Status](https://travis-ci.org/awickert/gFlex.svg?branch=master)](https://travis-ci.org/awickert/gFlex)\n\n# gFlex\n\n***Multiple methods to solve elastic plate flexure, designed for applications to Earth's lithosphere.***\n\nThese instructions are meant to take an user familiar with computers but new to (or a beginner with) Python through the basics of how to get gFlex to work. The Python scripting part towards the end should be pretty straightforward as well, insofar as information is provided on how to get and set the chosen values inside gFlex. *Please leave a message if you have trouble working with gFlex; your comments could assist both you and the more general improvement of this documentation.*\n\nWhen you use gFlex, please cite:\n\n**Wickert, A. D. (2016), [Open-source modular solutions for flexural isostasy: gFlex v1.0](https://www.geosci-model-dev.net/9/997/2016/gmd-9-997-2016.html), *Geosci. Model Dev.*, *9*(3), 997–1017, doi:10.5194/gmd-9-997-2016.**\n\n## Download and Installation\n\n#### Python\n\ngFlex has been tested on **Python 2.7**, and should work (with a few possible changes) on future versions of Python 2.X. It has not been tested on Python 3.X.\n\nIn order to run properly, gFlex requires the following Python dependencies:\n* numpy\n* scipy\n* matplotlib\n* setuptools\n* pip (optional)\n\n*For users who are new to Python, follow these directions to install the Python interpreters onto your computer.*\n\n###### Linux\n\nUse your package manager to download and install the required Python packages. For Debian/Ubuntu, it will be something like:\n\n```bash\n# Basic packages\nsudo apt-get install \\\npython python-numpy python-scipy \\\npython-setuptools python-matplotlib \n\n# pip (recommended for automatic installs via setuptools)\nsudo apt-get install python-pip\n\n# iPython console -- very useful (optional)\nsudo apt-get install ipython\n\n# Sypder IDE (I don't personally use it but many others like it: optional)\nsudo apt-get install spyder\n```\n\n###### Windows\n\nDownload [**python(x,y)**](https://code.google.com/p/pythonxy/wiki/Downloads) or another full-featured distribution such as **Anaconda**; both of these distributions have been tested successfully with gFlex. Python(x,y) and several others also contain the required packages (including the numerical libraries), the iPython console, and the Spyder IDE; [**Spyder**](https://code.google.com/p/spyderlib/) is a nice IDE that will provide a familiar-looking interface for users accustomed to Matlab.\n\n###### Mac\n\nThe current recommendation is to use a package manager like [**homebrew**](http://brew.sh/). With this you can install Python, and then move on to using **pip** (or **homebrew**) to install the Python modules. A good introduction to this can be found here: http://www.thisisthegreenroom.com/2011/installing-python-numpy-scipy-matplotlib-and-ipython-on-lion. See the **Linux** instructions for the list of packages that you will need; after installing pip, these commands can be substituted as follows, e.g.,\n```bash\n# Homebrew\nsudo brew install python-numpy\n# Pip\npip install numpy\n```\n\nRecent efforts to download Python distributions (both **Anaconda** and **Enthought**) have not met with success with both gFlex and GRASS, though **Anaconda** has been tested successfully with Windows. As a result, it should be more successful to keep the Python packages managed better by something like **homebrew** with **pip**.\n\n##### Setuptools and ez_setup (Windows and Mac with distributions)\n\nThe distributions for Mac and Windows do not come with setuptools, which is required to install gFlex. However, if you install ez_setup, the gFlex install script will automatically install setuptools for you. Simply type:\n```bash\npip install ez_setup # Windows or Mac without special privileges required\nsudo pip install ez_setup # Mac where sudo privileges are required\n```\nOf course, one can also bypass the need for the install script to install setuptools by using pip preemptively:\n```bash\npip install setuptools # Windows or Mac without special privileges required\nsudo pip install setuptools # Mac where sudo privileges are required\n```\n\n#### gFlex\n\n##### Downloading and Installing in One Step from PyPI using pip\n\ngFlex is downloadable from the Python Package Index ([PyPI](https://pypi.python.org/pypi)); see https://pypi.python.org/pypi/gFlex.\n\nIf you have **pip**, you may simply type:\n```bash\npip install \npip install gflex\n# Or if the destination install folder requires sudo access\n# (for UNIX-like systems)\nsudo pip install gflex\n# pip install gFlex works too -- install is caps-insensitive\n```\nand you will have a full, running copy of the latest release version of gFlex.\n\n##### Downloading\n\ngFlex may be downloaded here at GitHub, by either:\n* Copying the link at right and pasting it into the command prompt as follows:\n```bash\ngit clone <LINK>\n```\n* Downloading and extracting the compressed ZIP file (link at right)\n* Clicking on the link to add gFlex to your local GitHub desktop app (for Windows or Mac)\n\n# Installing\n\nInstall gFlex at the command prompt using [setuptools](https://pypi.python.org/pypi/setuptools). If you have administrator privileges, which *is often also the case when doing this install under Windows*, you may drop the \"sudo\". For standard Linux or Mac users, the \"sudo\" will remain necessary, and you will have to enter your administrator password for the program to be added to your local set of applications (e.g., as \"/usr/local/bin/gflex\").\n\n```bash\n# For standard Linux/Mac users:\nsudo python setup.py install\n# OR\nsudo python setup.py develop # If you want the install to see instantly\n                             # any changes made in the source repository\n\n# For Windows users or Unix-type users with SuperUser privileges:\npython setup.py install\n# OR\npython setup.py develop # If you want the install to see instantly\n                        # any changes made in the source repository\n```\n\n## Running\n\nOnce gFlex is installed, it is possible to run it in four ways:\n 1. With a configuration file\n 2. Within a Python script\n 3. Within GRASS GIS\n 4. As part of the Landlab Earth-surface modeling framework, including an interface to the the Community Surface Dynamics Modeling System [Component Model Interface (CMI)](http://csdms.colorado.edu/wiki/CMI_Description)\n\nFor options 1 and 2, there are pre-built methods that can be selected along the way to visualize results. These use Python's Matplotlib plotting library. For option 3, GRASS GIS is used for visualization. In Option 4, output from Landlab can be visualized with Matplotlib, and output from CSDMS sets of models can be visualized using tools such as [VisIt](https://wci.llnl.gov/simulation/computer-codes/visit/) ([CSDMS page about VisIt](http://csdms.colorado.edu/wiki/CMT_visualization)) and [ParaView](http://www.paraview.org/). ParaView also now has [Python bindings](http://www.paraview.org/python/), which can further be used to visualize outputs produced with any of these methods.\n\n#### With configuration file\n\nA configuration file can be generated to run gFlex; see examples in the **input/** directory. To run gFlex using this file, one simply opens a terminal window and types:\n\n```bash\n# run like this:\ngflex <path-to-configuration-file>\n```\n\nThis can be run from any directory, as the installation of gFlex adds the program \"gflex\" to the system path.\n\nFor help constructing configuration files, see the blank template files **input/template1D** and **input/template2D**, as well as the other examples found in the **input/** directory. The **input/** directory also contains **input/README.md**, which provides a further local description of the files available. **input/input_help** provides a longer explanation of what the parameters are, and is therefore reproduced immediately below for reference:\n\n```Lisp\n; input_help\n; All units are SI. Not all entries are needed.\n; Standard parameter values for Earth are included.\n\n[mode]\n; 1 (line) or 2 (surface) dimensions\ndimension=2\n; Solution method: FD (Finite Difference), FFT (Fast Fourier \n; Transform, not yet implemented), SAS (Spatial domain analytical \n; solutions), or SAS_NG (SPA, but do not require a uniform grid\n; - NG = \"no grid\")\n; For SAS_NG, 1D data must be provided and will be returned in \n; two columns: (x,q0) --> (x,w). 2D data are similar, except\n; will be of the form (x,y,[q0/in or w/out])\n; I am working on gridded output for these, so this might change\n; in the future.\n; Both the FFT and SPA techniques rely on superposition \n; of solutions, because they can be combined linearly, whether in \n; the spectral or the spatial domain)\nmethod=SPA\n; Plate solutions can be:\n;  * vWC1994 (best), or\n;  * G2009 (from Govers et al., 2009; not bad, but not \n;           as robust as vWC1994)\nPlateSolutionType=vWC1994\n\n[parameter]\nYoungsModulus=65E9\nPoissonsRatio=0.25\nGravAccel=9.8\nMantleDensity=3300\n; This is the density of material (e.g., air, water) \n; that is filling (or leaving) the hole that was \n; created by flexure. If you do not have a constant \n; density of infilling material, for example, at a \n; subsiding shoreline, you must instead iterate (see\n; [numerical], below).\nInfillMaterialDensity=0\n[input]\n; space-delimited array of loads\n; stresses (rho*g*h) if gridded (dx (and if applicable, dy)) will be applied\n;   to convert them into masses\n; forces (rho*g*h*Area) if not gridded (SAS_NG)\n; If the solution method (above) is selected as \"SAS_NG\", then this file\n; will actually be of the format (x,[y],q0) and the code will sort it out.\n; (Once again, working on a gridded output option for ungridded inputs)\nLoads=q0_sample/2D/central_square_load.txt\n;\n; scalar value or space-delimited array of elastic thickness(es)\n; array used for finite difference solutions\nElasticThickness=Te_sample/2D/10km_const.txt\n;\n; xw and yw are vectors of desired output points for the SAS_NG method.\n; If they are not specified and a SAS_NG solution is run, the solution will be \n; calculated at the points with the loads.\n; they are ignored if a different solution method is chosen.\nxw=\nyw=\n\n[output]\n; DeflectionOut is for writing an output file. \n; If this is blank, no output is printed.\n; Otherwise, a space-delimited ASCII file of \n; outputs is with this file name (and path).\nDeflectionOut=tmpout.txt\n;\n; Acceptable inputs to \"Plot\" are q0 (loads), w (deflection), or both; any \n; other entry here will result in no plotting.\n; Automatically plots a 1D line or 2D surface based on the choice \n; of \"dimension\" variable in [mode]\nPlot=both\n\n[numerical]\n; dx [m]\nGridSpacing_x=\n;\n; Boundary conditions can be:\n; (FD): 0Slope0Shear, 0Moment0Shear, 0Displacement0Slope, Mirror, or Periodic\n; For SAS or SAS_NG, NoOutsideLoads is valid, and no entry defaults to this\nBoundaryCondition_West=\nBoundaryCondition_East=\n;\n; Solver can be direct or iterative\nSolver=\n; Tolerance between iterations [m]\n; If you have chosen an iterative solution type (\"Solver\"), it will iterate\n; until this is the difference between two subsequent iterations.\n; Set as 0 if you don't want to iterate\nconvergence=1E-3\n\n[numerical2D]\n; dy [m]\nGridSpacing_y=\n;\n; Boundary conditions can be:\n; (FD): 0Slope0Shear, 0Moment0Shear, 0Displacement0Slope, Mirror, or Periodic\n; For SAS or SAS_NG, NoOutsideLoads is valid, and no entry defaults to this\nBoundaryCondition_North=\nBoundaryCondition_South=\n; \n; Flag to enable lat/lon input (true/false). By default, this is false\nlatlon=\n; radius of planet [m], for lat/lon solutions\nPlanetaryRadius= \n\n[verbosity]\n; true/false. Defaults to true.\nVerbose=\n; true/false. Defaults to false.\nDebug=\n; true/false -- total silence if true. Defaults to false.\nQuiet=\n```\n\n#### Within a Python script (with or without a configuration file)\n\nYou may run gFlex from other Python programs. When you install it (above), this also produces a Python module that you may import to access it while scripting.\n\n##### With no configuration file (recommended)\n**input/run_in_script_2D.py**, reproduced below, is a good example of how to set the variables and run the model. This method requires no input file, as all of the values are set inside the Python script that imports gflex. This is essentially how the GRASS GIS interface was written, and is a way to embed the abilities of gFlex into another model. A one-dimensional example, **input/run_in_script_1D.py**, is also available.\n\n```python\n#! /usr/bin/env python\n\nimport gflex\nimport numpy as np\nfrom matplotlib import pyplot as plt\n\nflex = gflex.F2D()\n\nflex.Quiet = False\n\nflex.Method = 'FD' # Solution method: * FD (finite difference)\n                   #                  * SAS (superposition of analytical solutions)\n                   #                  * SAS_NG (ungridded SAS)\nflex.PlateSolutionType = 'vWC1994' # van Wees and Cloetingh (1994)\n                                   # The other option is 'G2009': Govers et al. (2009)\nflex.Solver = 'direct' # direct or iterative\n# convergence = 1E-3 # convergence between iterations, if an iterative solution\n                     # method is chosen\n\nflex.g = 9.8 # acceleration due to gravity\nflex.E = 65E9 # Young's Modulus\nflex.nu = 0.25 # Poisson's Ratio\nflex.rho_m = 3300. # MantleDensity\nflex.rho_fill = 0. # InfiillMaterialDensity\n\nflex.Te = 35000.*np.ones((50, 50)) # Elastic thickness [m] -- scalar but may be an array\nflex.Te[:,-3:] = 0.\nflex.qs = np.zeros((50, 50)) # Template array for surface load stresses\nflex.qs[10:40, 10:40] += 1E6 # Populating this template\nflex.dx = 5000. # grid cell size, x-oriented [m]\nflex.dy = 5000. # grid cell size, y-oriented [m]\n# Boundary conditions can be:\n# (FD): 0Slope0Shear, 0Moment0Shear, 0Displacement0Slope, Mirror, or Periodic\n# For SAS or SAS_NG, NoOutsideLoads is valid, and no entry defaults to this\nflex.BC_W = '0Displacement0Slope' # west boundary condition\nflex.BC_E = '0Moment0Shear' # east boundary condition\nflex.BC_S = '0Displacement0Slope' # south boundary condition\nflex.BC_N = '0Displacement0Slope' # north boundary condition\n\n# latitude/longitude solutions are exact for SAS, approximate otherwise\n#latlon = # true/false: flag to enable lat/lon input. Defaults False.\n#PlanetaryRadius = # radius of planet [m], for lat/lon solutions\n\nflex.initialize()\nflex.run()\nflex.finalize()\n\n# If you want to plot the output\nflex.plotChoice='both'\n# An output file for deflections could also be defined here\n# flex.wOutFile = \nflex.output() # Plots and/or saves output, or does nothing, depending on\n              # whether flex.plotChoice and/or flex.wOutFile have been set\n# TO OBTAIN OUTPUT DIRECTLY IN PYTHON, you can assign the internal variable,\n# flex.w, to another variable -- or as an element in a list if you are looping\n# over many runs of gFlex:\ndeflection = flex.w\n```\n\n##### With a configuration file\n\nIf you would like to use a Python script with a configuration file, this is also possible.\n\n```python\nimport gflex\n\n# To use a configuration file:\nfilename = '../gflex/input/input_f1d_test' # it works for usage (1) and (2)\nobj = gflex.WhichModel(filename)\n\n## SET MODEL TYPE AND DIMENSIONS HERE ##\n########################################\nif obj.dimension == 1:\n  obj = gflex.F1D(filename)\nelif obj.dimension == 2:\n  obj = gflex.F2D(filename)\n\n# Then run the code!\nobj.initialize(filename)\nobj.run()\nobj.finalize()\n\n# Standalone plotting output if you so desire\nflex.plotChoice='w'\nobj.output()\n```\n\n\n#### Within GRASS GIS\n\nTo run gFlex inside of GRASS GIS 7, run the following commands from within a GRASS GIS session:\n\n```bash\ng.extension r.flexure\ng.extension v.flexure\n```\n\nThis will reach into the GRASS GIS subversion repository, download the source code, and install the packages. **r.flexure** is used for raster grids by either finite difference or analytical methods. **v.flexure** takes advantage of the ungridded analytical method to solve for flexure at an aribtrary set of load points, albeit limited to cases with constant elastic thickness. These are stored at and have help files located at, respectively:\n\n* **r.flexure**\n * Source: http://trac.osgeo.org/grass/browser/grass-addons/grass7/raster/r.flexure\n * Manual page (HTML): http://grass.osgeo.org/grass70/manuals/addons/r.flexure.html\n* **v.flexure**\n * Source: http://trac.osgeo.org/grass/browser/grass-addons/grass7/vector/v.flexure\n * Manual page (HTML): http://grass.osgeo.org/grass70/manuals/addons/v.flexure.html\n\nWhen running **r.flexure**, it is important to ensure that the elastic thickness map is at or properly interpolated to the computational region (**g.region**) resolution before solving. A nearest-neighbor interpolated Te map will cause perceived gradients in elastic thickness to be very sharp, and this will strongly affect (and misdirect) the flexural solutions.\n\n#### As part of Landlab and the CSDMS CMI\n\nLandlab is an in-development (but nearing release) Earth-surface modeling framework built to facilitate easy integration of geomorphic, ecological, hydrological, geological, etc. Earth-surface related models to simulate and investigate the links between multiple processes. gFlex can be linked with Landlab, and the code to do this is available within the Landlab repository at https://github.com/landlab/landlab/tree/master/landlab/components/gFlex.\n\nThe Landlab interface to gFlex also provides gFlex with the Community Surface Dynamics Modeling System (CSDMS) [Component Model Interface (CMI)](http://csdms.colorado.edu/wiki/CMI_Description) interface. This allows it to be run as a coupled component across multiple programming languages and paradigms as part of the CSDMS community of models. For more information on model coupling with CSDMS, see the example presentation at http://csdms.colorado.edu/w/images/CSDMS_lecture7.pdf and the paper on the model coupling published by [Peckham et al., \"A component-based approach to integrated modeling in the geosciences: The design of CSDMS\"](http://www.sciencedirect.com/science/article/pii/S0098300412001252).\n\n### Plotting\n\nThere are four plot choices, defined via `self.plotChoice`:\n* `'q'`: plots the load in mantle-density-equivalent units of length\n* `'w'`: plots the deflection in units of length\n* `'both'`: plots both deflection and loads in separate panels of a 2-subplot figure\n* `'combo'`: (1D only): plots lithospheric deflections and the deflected mantle-density-equivalent load atop it.\n  * Note that the load does not affect the area above/below the datum filled when `rho_fill != 0`. This affects the buoyant balance associated with the motion of the plate, with no additional considerations for topogrpahy. If you would like to include topogrpahy, an iterative approach (e.g., finding areas below sea level, filling them, flexing, finding new areas below sea level, and so on) is recommended.\n\n## Utilities\n\nThe \"utilities\" folder currently contains only one program, `flexural_wavelength_calculator.py`. Operating it is simple and fairly rudimentary: just edit the input variables directly in the calculator Python file, and then run it to see what the flexural parameter, first zero-crossing point (on the load-side of the forebulge), and the flexural wavelength.\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "https://github.com/awickert/gFlex/tarball/v1.1.1",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/awickert/gFlex",
    "keywords": "geophysics,geology,geodynamics,lithosphere,isostasy,GRASS GIS",
    "license": "GPL v3",
    "maintainer": "",
    "maintainer_email": "",
    "name": "gFlex",
    "package_url": "https://pypi.org/project/gFlex/",
    "platform": "",
    "project_url": "https://pypi.org/project/gFlex/",
    "project_urls": {
      "Download": "https://github.com/awickert/gFlex/tarball/v1.1.1",
      "Homepage": "https://github.com/awickert/gFlex"
    },
    "release_url": "https://pypi.org/project/gFlex/1.1.1/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "One- and two-dimensional plate bending, designed for Earth's lithosphere",
    "version": "1.1.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 10751697,
  "releases": {
    "0.8": [],
    "0.8.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a46a28aa551a31149e35011b3f5d2054900abf7e99428c492687723533c43419",
          "md5": "d86946ad863a44f8f4a694e87a502c1f",
          "sha256": "97352ad9b6460e5b5e882e2e92885e98ccc0006dc7a633bba19af2e5826cca9b"
        },
        "downloads": -1,
        "filename": "gFlex-0.8.1.tar.gz",
        "has_sig": false,
        "md5_digest": "d86946ad863a44f8f4a694e87a502c1f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 32442,
        "upload_time": "2015-03-04T11:29:18",
        "upload_time_iso_8601": "2015-03-04T11:29:18.180045Z",
        "url": "https://files.pythonhosted.org/packages/a4/6a/28aa551a31149e35011b3f5d2054900abf7e99428c492687723533c43419/gFlex-0.8.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.9": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f91a11d62f88c6154f3e11e70560d8db21f87f3c42257823a1b4cfa177c9ea67",
          "md5": "a1f1c903aa2221bd1484f245ae52dd23",
          "sha256": "b9c91c312f54bf95fed1e7b09bf84d5170a1dd1cce05e82987b2ca7e4bbb4a5e"
        },
        "downloads": -1,
        "filename": "gFlex-0.9.tar.gz",
        "has_sig": false,
        "md5_digest": "a1f1c903aa2221bd1484f245ae52dd23",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 31690,
        "upload_time": "2015-03-06T05:50:46",
        "upload_time_iso_8601": "2015-03-06T05:50:46.959730Z",
        "url": "https://files.pythonhosted.org/packages/f9/1a/11d62f88c6154f3e11e70560d8db21f87f3c42257823a1b4cfa177c9ea67/gFlex-0.9.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "806391e32deaa00bed2e7d774e8ff5e203c4a38893acf70361bd323b2a61141a",
          "md5": "131c75d456cdd8590541dde823880353",
          "sha256": "83071457692862b69b5ada9314b03b003c90036bf85c74be3a2e59cf5772e9b8"
        },
        "downloads": -1,
        "filename": "gFlex-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "131c75d456cdd8590541dde823880353",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 32252,
        "upload_time": "2017-05-10T15:04:39",
        "upload_time_iso_8601": "2017-05-10T15:04:39.007425Z",
        "url": "https://files.pythonhosted.org/packages/80/63/91e32deaa00bed2e7d774e8ff5e203c4a38893acf70361bd323b2a61141a/gFlex-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "19d2862552d2f5688a1d0890108df156cd9c91d60382c4a8fd83dc1646d2234e",
          "md5": "928b1196564b745b1654a9e06e0c4edb",
          "sha256": "4d620390f4208dc57540ebd8784bc29f4a369691e01b68dcbfdc5189f14178b3"
        },
        "downloads": -1,
        "filename": "gFlex-1.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "928b1196564b745b1654a9e06e0c4edb",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 40658,
        "upload_time": "2018-05-29T04:32:51",
        "upload_time_iso_8601": "2018-05-29T04:32:51.641075Z",
        "url": "https://files.pythonhosted.org/packages/19/d2/862552d2f5688a1d0890108df156cd9c91d60382c4a8fd83dc1646d2234e/gFlex-1.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ab7ee1011a75232295e3358207757c2cd2a2135b903a1607555e46f51da7c78e",
          "md5": "fb9b032ad536ac89a6fab491af050996",
          "sha256": "83a76ccd3f3768df6861d09a3aad29074d34428c8f59f0e887c65a18e801ff1f"
        },
        "downloads": -1,
        "filename": "gFlex-1.1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "fb9b032ad536ac89a6fab491af050996",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 56286,
        "upload_time": "2021-06-26T16:52:21",
        "upload_time_iso_8601": "2021-06-26T16:52:21.514480Z",
        "url": "https://files.pythonhosted.org/packages/ab/7e/e1011a75232295e3358207757c2cd2a2135b903a1607555e46f51da7c78e/gFlex-1.1.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "375a8daa983ff2b4bfd9fe98cec6c0ba12cb431cc01b5ff3421d6048a3f7326f",
          "md5": "30df88860ec402170cede76b1f2ed92a",
          "sha256": "5d5582a6803e885e9867c41051beab16551ef1eacf64d2898cd4976a6817eba9"
        },
        "downloads": -1,
        "filename": "gFlex-1.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "30df88860ec402170cede76b1f2ed92a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 52920,
        "upload_time": "2021-06-26T16:52:23",
        "upload_time_iso_8601": "2021-06-26T16:52:23.218680Z",
        "url": "https://files.pythonhosted.org/packages/37/5a/8daa983ff2b4bfd9fe98cec6c0ba12cb431cc01b5ff3421d6048a3f7326f/gFlex-1.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "ab7ee1011a75232295e3358207757c2cd2a2135b903a1607555e46f51da7c78e",
        "md5": "fb9b032ad536ac89a6fab491af050996",
        "sha256": "83a76ccd3f3768df6861d09a3aad29074d34428c8f59f0e887c65a18e801ff1f"
      },
      "downloads": -1,
      "filename": "gFlex-1.1.1-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "fb9b032ad536ac89a6fab491af050996",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 56286,
      "upload_time": "2021-06-26T16:52:21",
      "upload_time_iso_8601": "2021-06-26T16:52:21.514480Z",
      "url": "https://files.pythonhosted.org/packages/ab/7e/e1011a75232295e3358207757c2cd2a2135b903a1607555e46f51da7c78e/gFlex-1.1.1-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "375a8daa983ff2b4bfd9fe98cec6c0ba12cb431cc01b5ff3421d6048a3f7326f",
        "md5": "30df88860ec402170cede76b1f2ed92a",
        "sha256": "5d5582a6803e885e9867c41051beab16551ef1eacf64d2898cd4976a6817eba9"
      },
      "downloads": -1,
      "filename": "gFlex-1.1.1.tar.gz",
      "has_sig": false,
      "md5_digest": "30df88860ec402170cede76b1f2ed92a",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 52920,
      "upload_time": "2021-06-26T16:52:23",
      "upload_time_iso_8601": "2021-06-26T16:52:23.218680Z",
      "url": "https://files.pythonhosted.org/packages/37/5a/8daa983ff2b4bfd9fe98cec6c0ba12cb431cc01b5ff3421d6048a3f7326f/gFlex-1.1.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}