{
  "info": {
    "author": "Helgi Hilmarsson & Arvind Kumar",
    "author_email": "helgi37@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: Free for non-commercial use",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "<img align=\"left\" src=\"https://raw.githubusercontent.com/AI-sandbox/gnomix/main/doc/fig/G-Nomix.png\" width=18.7% height=18.7%> \n\n# High Resolution Ancestry Deconvolution for Next Generation Genomic Data \n<br>\n\n\n![Visualization of the process](https://raw.githubusercontent.com/AI-sandbox/gnomix/main/doc/fig/gnomix_diagram.png)\n\nThis repository includes a python implementation of G-Nomix, a fast, scalable, and accurate local ancestry method. See [demo](demo.ipynb).\n\nG-Nomix can be used in two ways:\n\n- training a model from scratch using reference training data or \n- loading a pre-trained G-Nomix model (see **Pre-Trained Models** below)\n\nIn both cases the models are used to infer local ancestry on provided query data that has already been phased (using a program like beagle, shapeit, or eagle) and pre-processed to have the same sites as the reference training samples on the same strand, or if a pre-trained model is used instead see **Pre-Trained Models** below for requirements. \n\n## Installation and Dependencies\n\nTo install the software, navigate to the desired folder and enter in the command line interface:\n```\ngit clone https://github.com/AI-sandbox/gnomix\ncd gnomix\n```\n\nThe dependencies are listed in *requirements.txt*. Assuming [pip](https://pip.pypa.io/en/stable/) is already installed, they can be installed via\n```\n$ pip install -r requirements.txt\n```\n\nThe combined runtime for the cloning and the dependency installation should be around 2 minutes on a normal laptop.\n\nThe software has been tested in Python 3.7.4 on the following operating systems:\n- Linux: Ubuntu 18.04.5\n- macOS: Monterey (12.0.1)\n\n## Usage\n\n### When Using Pre-Trained Models\ngnomix.py loads and uses a pre-trained G-Nomix model to predict the ancestry for a given *<query_file>* and a chromosome.\n\nTo execute the program with a pre-trained model run:\n```\n$ python3 gnomix.py <query_file> <output_folder> <chr_nr> <phase> <path_to_model> \n```\n\nwhere \n- <*query_file*> is a .vcf or .vcf.gz file containing the query haplotypes which are to be analyzed (see example in the **demo/data/** folder)\n- <*output_folder*> is where the results will be written (see details in **Output** below and an example in the **demo/data/** folder)\n- <*chr_nr*> is the chromosome number\n- <*phase*> is either True or False corresponding to the intent of using the predicted ancestry for phasing correction (see details in **Phasing** below and in the **gnofix/** folder). Note that initial phasing (using a program like beagle, shapeit, or eagle) must still have been performed first.\n- <*path_to_model*> is a path to the model used for predictions (see **Pre-trained Models** below)\n\n### Downloading pre-trained models\nIn order to incorporate our pre-trained models into your pipeline, please use the following command to download pre-trained models for the whole human genome. The SNPs used for our pre-trained models are also included in the form of a plink .bim file for every chromosome.\n```\nsh download_pretrained_models.sh\n```\nThis creates a folder called **pretrained_gnomix_models**. For each chromosome, we publish a *default_model.pkl* which can be used as a pre-trained model in the <*path_to_model*> field and a *.bim* file as explained above.\n\nWhen making predictions, the input to the model is an intersection of the pre-trained model SNP positions and the SNP positions from the <query_file>. That means that the set of positions that are only in the original training input used to create the model (and not in the query samples) are encoded as missing, while the set of positions only in the <query_file> are discarded. We suggest that you attempt to have your query samples include as many model snps (listed in the *.bim* files) as possible (never less than 80% for sufficient accuracy. When the script is executed, it will log the intersection-ratio between these model snps and the snps in your query samples, since the anceestry inference performance will depend on how many of the model's snp positions are missing in your query samples. *If the intersection is low, you must either impute your query samples to match the full set of snps that are present in the pre-trained model or you must train your own new model using references that contain all the snps in your query samples.* N.B. Your query samples must have snps that are defined on the same strand as in the model. You can use the included model *.bim* files as a reference to find and then flip any snps in your query samples that are defined on the opposite strand. (If this step is not performed your query samples will appear to have snps containing variation unseen during the model's training and will thus be be assigned unpredictable ancestries.)\n\nThe models named **default_model.pkl** are trained on hg build 37 references from the following biogeographic regions: *Subsaharan African (AFR), East Asian (EAS), European (EUR), Native American (NAT), Oceanian (OCE), South Asian (SAS), and West Asian (WAS)* and the model labels and predicts them as 0, 1, .., 6 respectively. The populations used to train these ancestries are given in the supplementary section of the reference provided at the bottom of this readme.\n\n### When Training a Model From Scratch\n\nTo execute the program when training a model run:\n```\n$ python3 gnomix.py <query_file> <output_folder> <chr_nr> <phase> <genetic_map_file> <reference_file> <sample_map_file>\n```\n\nwhere the first 4 arguments are described above in the pre-trained setting and \n- <*genetic_map_file*> is the genetic map file. It's a .tsv file with 3 columns; chromosome number, SNP physical position and SNP genetic position. There should be no headers unless they start with \"#\". See example in the **demo/data/** folder.\n- <*reference_file*> is a .vcf or .vcf.gz file containing the reference haplotypes (in any order)\n- <*sample_map_file*> is a sample map file matching reference samples to their respective reference populations\n\nThe program uses these two files as input to our simulation algorithm (see **pyadmix/**) to create training data for the model. Also, note that when running inference on the trained models, the <*query_file*> needs to have the same build as the genetic map used to train the model. (For instance, in the case of humans, it is build37 or build38)\n\n### Demo\n\nAfter downloading our pre-trained models, one can demo the software in inference mode by running:\n```\npython3 gnomix.py demo/data/small_query_chr22.vcf.gz demo_output 22 True pretrained_gnomix_models/chr22/model_chm_22.pkl\n```\nThis small query file contains only 9 samples of European, East Asian and African ancestry. The execution should take around a minute on a standard laptop. The inference can be analyzed, for example in the file demo_output/quer_results.msp, where we expect to see those three ancestries being inferred. For more details on those analysis, see the section on output below.\n\nFor more demos with training and larger datasets, see the [demo](demo.ipynb) notebook *demo.ipynb*.\n\n### Advanced Options\nMore advanced configuration settings can be found in *config.yaml*. \nThey include general settings, simulation settings and model settings. More details are given in the file itself. If training a model from scratch you can also pass an alternative config file as the last argument:\n\n```\n$ python3 gnomix.py <query_file> <output_folder> <chr_nr> <phase> <genetic_map_file> <reference_file> <sample_map_file> <config_file>\n```\n\nIf no config is given, the program uses the default (*config.yaml*). The config file has advanced training options. Some of the parameters are\n- verbose (bool) - verbosity (default True)\n- simulation:\n  - run: (bool) - whether to run simulation or not, can be skipped if previously done (default True)\n  - path: (path) - # where to store the simulated data, if run is False this is where the simulation data will be sought, default is <output_folder>/generated_data/\n  - r_admixed (float,positive) - number of simulated admixed individuals generated when training the model = r_admixed x size of sample map (number of reference samples). The default is 1. Set it lower if memory is an issue. (To overcome memory constraints a minor allele frequency filter can also be used to remove very rare variants.)\n  - splits: must contain proportion for train1, train2 and optionally validation. If validation ratio is 0, validation is not performed.\n  - generations indicates the total specturem of generations since admixture to simulate, not critical\n  - rm_data (bool) - whether to remove simulated data after training (to conserve disk space). It is set to false if run is False. Default False.\n- model:\n  - name (string) - model's name: default is \"model\"\n  - inference (string) - 4 possible options - best / fast / large / default. \"best\" uses random string kernel base + xgboost smoother and is recommended for array data. \"fast\" uses logistic regression base + crf smoother. \"large\" uses logistic regression + convolutional smoother and is good for large datasets for which memory requirements are an issue. \"default\" uses logistic regression base + xgboost smoother and on whole genome has nearly the same accuracy as \"best,\" but with much faster runtime.\n  - window_size_cM (float, positive) -  size of window in centiMorgans, use larger windows if snp density is lower e.g. genotype data vs. sequence (default .5)\n  - smooth_size (int, positive) - number of windows to be taken as context for smoother (default 75)\n  - context_ratio (float between 0 and 1) - context of base model windows (default .5)\n  - retrain_base (bool) - retrain base models using both train1 and train2 once smoother is trained, validation data for a final base model (default True)\n  - calibrate (bool) - applies calibration on output probabilities (default False)\n  - n_cores (int, positive) - how many units of cpu to use (default is maximum)\n- inference:\n  - bed_file_output: generate files for each individual that show the run length encoding of their ancestry segments (default False)\n  - snp_level_inference: output ancestry inference for each marker of the query file (default False)\n  - visualize_inference: create pictures showing the ancestry segments colored along each individual's chromosomes using Tagore (default False)\n\n#### More model combinations\n\nFor more base + smoother combinations one can edit the *gnomix.py* file in the following way:\n\nimport the base model of choice from src/base/model e.g., \n\n```python\nfrom src.Base.models import LogisticRegressionBase\n```\n\nimport the smoother of choice from src/smooth/model e.g., \n\n```python\nfrom src.Smooth.models import XGB_Smoother\n```\n\nand then, in the train_model() function in initilize the Gnomix object with the imported models:\n \n```python\nmodel = Gnomix(\n\t...,\n\tbase = LogisticRegressionBase,\n\tsmooth = XGB_Smoother,\n\t...\n)\n```\n\n\n## Output\n\nThe results (including predictions, trained models and analysis) are stored in the *<output_folder>*.\n\n### Inference\n\nThe inference is written to two files, one for a single ancestry estimates for each marker (qery_results.msp) and one for probability estimates for each ancestry at each marker (query_results.fb). Below, we describe the both files in more detail.\n\n#### query_results.msp\n\nIn the query_results.msp file, the first line is a comment line, that specifies the order and encoding of populations, eg:\n#Sub_population order/code: golden_retriever=0 labrador_retriever=1 poodle poodle_small=2\n\nThe second line specifies the column names, and every following line marks an interval on the genome.\n\nThe first 6 columns specify\n- the chromosome\n- interval of genetic marker's physical position in basepair units (one column represents the starting point and one the end point)\n- interval of genetic position in centiMorgans (one column represents the starting point and one the end point)\n- number of *<query_file>* SNP positions that are included in interval\n\nThe remaining columns give the predicted reference panel population for the given interval. A genotype has two haplotypes, so the number of predictions for a genotype is 2*(number of genotypes) and therefore the total number of columns in the file is 6 + 2*(number of genotypes)\n\n#### query_results.fb\n\nIn the query_results.fb file, the first line is a comment line, that specifies the order of the populations, eg:\n#reference_panel_population:\tAFR\tEUR\tNAT\n\nThe second line specifies the column names, and every following line marks an interval on the genome.\n\nThe first 4 columns specify\n- the chromosome\n- mean of genetic marker's physical position in base pair units\n- mean of genetic position in centiMorgans\n- genetic marker index\n\nThe remaining columns represent the query hapotypes and reference panel population and each line markes the estimated probability of the given genome position coming from the population. A genotype has two haplotypes, so the number of predictions for a genotype is 2*(number of genotypes)*(number of reference populations) and therefore the total number of columns in the file is 6 + 2*(number of genotypes)*(number of reference populations).\n\n#### query_results.lai **(BETA)**\n\nThe query_results.lai is an optional output that includes the inferred ancestry label for each marker in the query file. Please note that this feature is in beta stage and therefore the program does not export this file unless *snp_level_inference* is set to *True* in the *config.yaml* file.\n\nThe first line of the output file is a comment line, that specifies the order and encoding of populations, eg:\n#Sub_population order/code: golden_retriever=0 labrador_retriever=1 poodle poodle_small=2\njust like in the msp file.\n\nThe second line specifies the column names, and every following line marks a genome position.\n\nThe first column indicates the physical position of the SNP and the remaining columns give the predicted reference panel population for the given interval. A genotype has two haplotypes, so the number of predictions for a genotype is 2*(number of genotypes) and therefore the total number of columns in the file is 1 + 2*(number of genotypes).\n\n#### query_file_phased.vcf\n\nWhen using Gnofix for phasing error correcting (See Phasing below), the inference above will be performed on the query haplotype phased by Gnofix. These phased haplotypes will then also be exported to query_file_phased.vcf in the *<output_folder>*/ folder.\n\n### Visualization\nTo visualize the local ancestry output along the chromosome using [tagore](https://pypi.org/project/tagore/#usage) for plotting, use the visualize_inference True option in the config file.\n\n### Model\nWhen training a model, the resulting model will be stored in *<output_folder>/models*. That way it can be re-used for analyzing another dataset.\nThe model's estimated accuracy is logged along with a confusion matrix which is stored in *<output_folder>/models/analysis*.\n\n### Simulated data\nThe program simulates training data and stores it in *<output_folder>/generated_data*. To automatically remove the created data when training is done,\nset *rm_simulated_data* to True in *config.yaml*. Note that in some cases, the simulated data can be re-used for training with similar settings. \nIn those cases, not removing the data and then setting *run_simulation* to False will re-use the previously simulated data which can save a lot of time and compuation.\n\n## Phasing\n\n![Depiction of the process](https://raw.githubusercontent.com/AI-sandbox/gnomix/main/src/Gnofix/figures/XGFix.gif)\n\nAccurate phasing of genomic data is crucial for human demographic modeling and identity-by-descent analyses. It has been shown that leveraging information about an individual’s genomic ancestry improves performance of current phasing algorithms. Gnofix is a method that uses local ancestry inference to do exactly that. If you suspect your data might have phasing errors (generally the case unless trio phasing was possible), we recommend using this option <*phase*> as True. See the **gnofix/** folder if interested in more details on the algorithm. \n\n![Local Ancestry for Phasing Error Correction](https://raw.githubusercontent.com/AI-sandbox/gnomix/main/src/Gnofix/figures/laipec_resized.png)\nSequenced haplotypes phased with a phasing software (left). LAI is used to label haplotypes with ancestry predictions and phasing errors become evident (center). Phasing error correction using LAI is applied to correct phasing errors (right). Small numbers of phasing errors do not, however, impact the correct association of a variant with an ancestry, and so are typically only a visual nuisance.\n\n## Calibration\nTo ensure that G-Nomix outputs probability estimates that reflect it's true confidence and accuracy, we recommend using calibration. We use Isotonic Regression to map the predicted probabilities to calibrated probabilities where the latter are more likely to have predictions with a confidence of X% correct matching their actual X% frequency of being correct in practice.\n\n## License\n\n**NOTICE**: This software is available for use free of charge for academic research use only. Commercial users, for profit companies or consultants, and non-profit institutions not qualifying as \"academic research\" must contact the [Stanford Office of Technology Licensing](https://otl.stanford.edu/) for a separate license. This applies to this repository directly and any other repository that includes source, executables, or git commands that pull/clone this repository as part of its function. Such repositories, whether ours or others, must include this notice. Academic users may fork this repository and modify and improve to suit their research needs, but also inherit these terms and must include a licensing notice to this effect.\n\n## Cite\n\n#### When using this software, please cite: \n### Helgi Hilmarsson, Arvind S Kumar, Richa Rastogi, Carlos D Bustamante, Daniel Mas Montserrat, Alexander G Ioannidis: \"High Resolution Ancestry Deconvolution for Next Generation Genomic Data\"\n\nhttps://www.biorxiv.org/content/10.1101/2021.09.19.460980v1\n\n```\n@article {Hilmarsson2021.09.19.460980,\n\tauthor = {Hilmarsson, Helgi and Kumar, Arvind S and Rastogi, Richa and Bustamante, Carlos D and Mas Montserrat, Daniel and Ioannidis, Alexander G},\n\ttitle = {High Resolution Ancestry Deconvolution for Next Generation Genomic Data},\n\telocation-id = {2021.09.19.460980},\n\tyear = {2021},\n\tdoi = {10.1101/2021.09.19.460980},\n\tpublisher = {Cold Spring Harbor Laboratory},\n\tabstract = {As genome-wide association studies and genetic risk prediction models are extended to globally diverse and admixed cohorts, ancestry deconvolution has become an increasingly important tool. Also known as local ancestry inference (LAI), this technique identifies the ancestry of each region of an individual{\\textquoteright}s genome, thus permitting downstream analyses to account for genetic effects that vary between ancestries. Since existing LAI methods were developed before the rise of massive, whole genome biobanks, they are computationally burdened by these large next generation datasets. Current LAI algorithms also fail to harness the potential of whole genome sequences, falling well short of the accuracy that such high variant densities can enable. Here we introduce G-Nomix, a set of algorithms that address each of these points, achieving higher accuracy and swifter computational performance than any existing LAI method, while also enabling portable models that are particularly useful when training data are not shareable due to privacy or other restrictions. We demonstrate G-Nomix (and its swift phase correction counterpart Gnofix) on worldwide whole-genome data from both humans and canids and utilize its high resolution accuracy to identify the location of ancient New World haplotypes in the Xoloitzcuintle, dating back over 100 generations. Code is available at https://github.com/AI-sandbox/gnomixCompeting Interest StatementCDB is the founder and CEO of Galatea Bio Inc and on the boards of Genomics PLC and Etalon.},\n\tURL = {https://www.biorxiv.org/content/early/2021/09/21/2021.09.19.460980},\n\teprint = {https://www.biorxiv.org/content/early/2021/09/21/2021.09.19.460980.full.pdf},\n\tjournal = {bioRxiv}\n}\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/AI-sandbox/gnomix",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "gnomix",
    "package_url": "https://pypi.org/project/gnomix/",
    "platform": null,
    "project_url": "https://pypi.org/project/gnomix/",
    "project_urls": {
      "Bug Tracker": "https://github.com/AI-sandbox/gnomix/issues",
      "Homepage": "https://github.com/AI-sandbox/gnomix"
    },
    "release_url": "https://pypi.org/project/gnomix/0.0.7/",
    "requires_dist": null,
    "requires_python": ">=3.6",
    "summary": "A fast, scalable, and accurate local ancestry method",
    "version": "0.0.7",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 14246036,
  "releases": {
    "0.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "43c2c5c9528bfa52a2aec6c514d2c308dcdeb6a018117ccbebccfb29e50845cb",
          "md5": "caacb7837898c48a8822f6c58c3b7f84",
          "sha256": "4354dde896c084e98cfcdda0f3b116a9ebd9fe367b6a49c8d2761fdb03f83ad6"
        },
        "downloads": -1,
        "filename": "gnomix-0.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "caacb7837898c48a8822f6c58c3b7f84",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 20991,
        "upload_time": "2022-06-20T16:31:33",
        "upload_time_iso_8601": "2022-06-20T16:31:33.565283Z",
        "url": "https://files.pythonhosted.org/packages/43/c2/c5c9528bfa52a2aec6c514d2c308dcdeb6a018117ccbebccfb29e50845cb/gnomix-0.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "38ae0525c90e48d615ac541d46395fbfcc335006af4d27fd2587e9de58872952",
          "md5": "55d221ba479668c36a344297a4e035dc",
          "sha256": "2f673d008d2c62e39469d4a6d8ea720b81df762823f48748ab03eacf48bbe3e9"
        },
        "downloads": -1,
        "filename": "gnomix-0.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "55d221ba479668c36a344297a4e035dc",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 37841,
        "upload_time": "2022-06-20T17:30:12",
        "upload_time_iso_8601": "2022-06-20T17:30:12.425311Z",
        "url": "https://files.pythonhosted.org/packages/38/ae/0525c90e48d615ac541d46395fbfcc335006af4d27fd2587e9de58872952/gnomix-0.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "38f4a394369b44c6a6cb2684780cbde7453adc03e98184ae732281b4535416d7",
          "md5": "2fa15a4cc6b28d8bcef7a72c7838c3cd",
          "sha256": "ecc1d7bced9b290cc42aaee04413ff04480e90b731e0bff2b0297ec0dfd35526"
        },
        "downloads": -1,
        "filename": "gnomix-0.0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "2fa15a4cc6b28d8bcef7a72c7838c3cd",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 25914,
        "upload_time": "2022-06-20T18:15:29",
        "upload_time_iso_8601": "2022-06-20T18:15:29.540624Z",
        "url": "https://files.pythonhosted.org/packages/38/f4/a394369b44c6a6cb2684780cbde7453adc03e98184ae732281b4535416d7/gnomix-0.0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d18d1f4312344a6c98b68520ba0cf63b219a286f34a95415585d4b87c421b3e5",
          "md5": "edfb7d17d33cf2418a7e1eb8077bea64",
          "sha256": "f0a3c6f1c3e7e440943d2ceaf510ce14c3e1cd6f59383f0f4ddb679b8f37801e"
        },
        "downloads": -1,
        "filename": "gnomix-0.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "edfb7d17d33cf2418a7e1eb8077bea64",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 30772,
        "upload_time": "2022-06-20T18:15:31",
        "upload_time_iso_8601": "2022-06-20T18:15:31.480993Z",
        "url": "https://files.pythonhosted.org/packages/d1/8d/1f4312344a6c98b68520ba0cf63b219a286f34a95415585d4b87c421b3e5/gnomix-0.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8342ce5559b26c0df2a7e89070fd94db5d97f49907585f275fd2765a0620db6f",
          "md5": "a1e8b06990c1c20eeefe9275f85b6e01",
          "sha256": "0d21d16de34769c09c0025e175a9912f8e0e3e47674cad914fe7316b205859b7"
        },
        "downloads": -1,
        "filename": "gnomix-0.0.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "a1e8b06990c1c20eeefe9275f85b6e01",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 25924,
        "upload_time": "2022-06-20T18:27:48",
        "upload_time_iso_8601": "2022-06-20T18:27:48.071243Z",
        "url": "https://files.pythonhosted.org/packages/83/42/ce5559b26c0df2a7e89070fd94db5d97f49907585f275fd2765a0620db6f/gnomix-0.0.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b468410a308ddde58841aff3badf668ec7cd25d56fa20c7541f50c2b3f450729",
          "md5": "7c6d93b4873b3777ad8eb733399d7238",
          "sha256": "79dc5fa6c414dc609d17895dc90e17d4cabcc2e4d77a281e320983fdf1d88123"
        },
        "downloads": -1,
        "filename": "gnomix-0.0.3.tar.gz",
        "has_sig": false,
        "md5_digest": "7c6d93b4873b3777ad8eb733399d7238",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 30806,
        "upload_time": "2022-06-20T18:27:50",
        "upload_time_iso_8601": "2022-06-20T18:27:50.090453Z",
        "url": "https://files.pythonhosted.org/packages/b4/68/410a308ddde58841aff3badf668ec7cd25d56fa20c7541f50c2b3f450729/gnomix-0.0.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c2a4093c97d7332b02fa81ccb1944a53643de7170c995a20896e6035a7baa44a",
          "md5": "046391064fc1f189a20d2ded106e3283",
          "sha256": "a3ff2e43511ec511bee38561bb6a9af8e3ec2abb06c9ea24904e896a93f1271f"
        },
        "downloads": -1,
        "filename": "gnomix-0.0.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "046391064fc1f189a20d2ded106e3283",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 25917,
        "upload_time": "2022-06-20T18:37:35",
        "upload_time_iso_8601": "2022-06-20T18:37:35.253830Z",
        "url": "https://files.pythonhosted.org/packages/c2/a4/093c97d7332b02fa81ccb1944a53643de7170c995a20896e6035a7baa44a/gnomix-0.0.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2913ac5a87ec7e2cd3ad6216cb0fc77673ddf820ac590eddab766ca50f75e0e9",
          "md5": "10e3b3ad3bf908c2c89af1a8ba938986",
          "sha256": "373eb7928a92ab2414ea69f960b67868ea44d936da750f61d1eb0ae250141559"
        },
        "downloads": -1,
        "filename": "gnomix-0.0.4.tar.gz",
        "has_sig": false,
        "md5_digest": "10e3b3ad3bf908c2c89af1a8ba938986",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 30769,
        "upload_time": "2022-06-20T18:37:37",
        "upload_time_iso_8601": "2022-06-20T18:37:37.355012Z",
        "url": "https://files.pythonhosted.org/packages/29/13/ac5a87ec7e2cd3ad6216cb0fc77673ddf820ac590eddab766ca50f75e0e9/gnomix-0.0.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1804e5977d006f8c63d65f2c554228419def3c73f99af0c26ea2c649a9614914",
          "md5": "5623ac00bdd94b0576a0aaa91a0f6902",
          "sha256": "33e9939a0a57e93ec70be27ce467e7e97256186b13eb619d5ff10c21d265200e"
        },
        "downloads": -1,
        "filename": "gnomix-0.0.6-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "5623ac00bdd94b0576a0aaa91a0f6902",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 25889,
        "upload_time": "2022-06-21T06:05:25",
        "upload_time_iso_8601": "2022-06-21T06:05:25.136631Z",
        "url": "https://files.pythonhosted.org/packages/18/04/e5977d006f8c63d65f2c554228419def3c73f99af0c26ea2c649a9614914/gnomix-0.0.6-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e2983caecf7767c71948261f022ba20494d8157ae22f1b53c13ac3de82a682c4",
          "md5": "d2ae6f7e023bfbf4eeace91eb9222992",
          "sha256": "5f2b7bdfab8dd0e77f331a60b2bc6e34d95a5bf6a1e05dbfdfbd6d2b8ca47d78"
        },
        "downloads": -1,
        "filename": "gnomix-0.0.6.tar.gz",
        "has_sig": false,
        "md5_digest": "d2ae6f7e023bfbf4eeace91eb9222992",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 30752,
        "upload_time": "2022-06-21T06:05:26",
        "upload_time_iso_8601": "2022-06-21T06:05:26.758458Z",
        "url": "https://files.pythonhosted.org/packages/e2/98/3caecf7767c71948261f022ba20494d8157ae22f1b53c13ac3de82a682c4/gnomix-0.0.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.7": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d4dfcf2419cd493e03e897ccfd9bf0981bfc169c5bbfa68708a03498777e18e2",
          "md5": "d6f96926d501ca12a52005e79554c914",
          "sha256": "971a69418c0e4d80633360f4c7ea1931d672f154941c7bc1d4a44f0b4d709729"
        },
        "downloads": -1,
        "filename": "gnomix-0.0.7-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "d6f96926d501ca12a52005e79554c914",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 25945,
        "upload_time": "2022-06-25T17:01:34",
        "upload_time_iso_8601": "2022-06-25T17:01:34.209315Z",
        "url": "https://files.pythonhosted.org/packages/d4/df/cf2419cd493e03e897ccfd9bf0981bfc169c5bbfa68708a03498777e18e2/gnomix-0.0.7-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c415c4f308b13692e92aed498597e9c92c6eff53e650c9de6cf0bc9cc9dc9874",
          "md5": "a94a349f33fede1ae09760f84513a6d6",
          "sha256": "11ff33182481cf74fd875e4be4ffc5b0709fd5803b434a92cfe3c20463e28bb3"
        },
        "downloads": -1,
        "filename": "gnomix-0.0.7.tar.gz",
        "has_sig": false,
        "md5_digest": "a94a349f33fede1ae09760f84513a6d6",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 30858,
        "upload_time": "2022-06-25T17:01:36",
        "upload_time_iso_8601": "2022-06-25T17:01:36.540200Z",
        "url": "https://files.pythonhosted.org/packages/c4/15/c4f308b13692e92aed498597e9c92c6eff53e650c9de6cf0bc9cc9dc9874/gnomix-0.0.7.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "d4dfcf2419cd493e03e897ccfd9bf0981bfc169c5bbfa68708a03498777e18e2",
        "md5": "d6f96926d501ca12a52005e79554c914",
        "sha256": "971a69418c0e4d80633360f4c7ea1931d672f154941c7bc1d4a44f0b4d709729"
      },
      "downloads": -1,
      "filename": "gnomix-0.0.7-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "d6f96926d501ca12a52005e79554c914",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6",
      "size": 25945,
      "upload_time": "2022-06-25T17:01:34",
      "upload_time_iso_8601": "2022-06-25T17:01:34.209315Z",
      "url": "https://files.pythonhosted.org/packages/d4/df/cf2419cd493e03e897ccfd9bf0981bfc169c5bbfa68708a03498777e18e2/gnomix-0.0.7-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "c415c4f308b13692e92aed498597e9c92c6eff53e650c9de6cf0bc9cc9dc9874",
        "md5": "a94a349f33fede1ae09760f84513a6d6",
        "sha256": "11ff33182481cf74fd875e4be4ffc5b0709fd5803b434a92cfe3c20463e28bb3"
      },
      "downloads": -1,
      "filename": "gnomix-0.0.7.tar.gz",
      "has_sig": false,
      "md5_digest": "a94a349f33fede1ae09760f84513a6d6",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 30858,
      "upload_time": "2022-06-25T17:01:36",
      "upload_time_iso_8601": "2022-06-25T17:01:36.540200Z",
      "url": "https://files.pythonhosted.org/packages/c4/15/c4f308b13692e92aed498597e9c92c6eff53e650c9de6cf0bc9cc9dc9874/gnomix-0.0.7.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}