{
  "info": {
    "author": "PCigales",
    "author_email": "",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "License :: OSI Approved :: GNU General Public License v3 or later (GPLv3+)",
      "Operating System :: Microsoft :: Windows",
      "Programming Language :: Python :: 3",
      "Topic :: Scientific/Engineering :: GIS"
    ],
    "description": "# GPXTweaker (éditeur GPX / GPX editor)\r\nA script in Python 3 to visualize, in 2D and 3D, and edit GPX tracks\r\n\r\nThis program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.\r\nThis program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for more details.\r\nYou should have received a copy of the GNU General Public License along with this program.  If not, see <https://www.gnu.org/licenses/>.\r\n\r\nThis program uses the MapLibre GL JS library (https://github.com/maplibre/maplibre-gl-js), licensed under the 3-Clause BSD license, to display tiles sets defined from a style in JSON format, by import of the main script and its style in the web interface pages, if the feature is enabled in the configuration file through the [JSONTiles] part on the [[Global]] section.\r\n\r\nDescription in english in the second part of this document.\r\n\r\n\r\n----------Français----------\r\n\r\nGPXTweaker est une application, écrite en Python (≥ 3.8) et en Javascript, de visualisation, en 2D et en 3D, et d'édition, au travers d'une interface web, de trace GPX sur fond cartographique. Elle offre également la possibilité d'afficher des photos et vidéos géolocalisées. Aucune dépendance n'est requise.\r\n\r\nLors de la sauvegarde de la trace mise à jour, le fichier inital est renommé, par ajout du suffixe \" - original\" ou, les fois suivantes, \" - backup\", dans le même répertoire. Les données inchangées sont, autant que faire se peut, conservées en l'état, sans altération, pour assurer la préservation des champs constituant des extensions par rapport aux standards.\r\n\r\nMalgré des tests approfondis, l'utilitaire est toujours susceptible de comporter des erreurs de programmation. Il convient de ce fait de faire preuve de prudence lors de son utilisation en conditions réelles en s'assurant de l'absence de perte ou de corruption de données au niveau de la trace modifiée telle qu'enregistrée par rapport à la version d'origine avant de supprimer le fichier initial.\r\nL'outil est compatible avec MyTrails, quant à la prise en compte des données d'altitude issues du capteur de pression barométrique.\r\nSi le fichier indiqué n'existe pas, une nouvelle trace sera créée à partir de zéro.\r\n\r\nLe fond sur lequel est affichée la trace peut être formé d'une carte générée par interrogation d'un serveur WMS ou enregistrée en local ou sur un serveur, ou bien être construit à partir de tuiles récupérées sur un serveur WMTS ou Web ou sauvegardées localement.\r\nSont déjà paramétrées et utilisables au travers d'un alias les sources suivantes: IGN (moyennant l'indication de la clé et d'informations complémentaires de connexion au serveur), OSM, Google, Bing.\r\n\r\nLes données d'élévation contenues dans la trace peuvent être complétées ou remplacées par les informations obtenues par interrogation d'un serveur WMS ou WMTS ou l'API IGN (moyennant l'indication de la clé et d'informations complémentaires de connexion au serveur) renvoyant une réponse au format x-bil-32 ou hgt.\r\n\r\nLe tracé de point en point peut s'effectuer en ligne droite ou en suivant les chemins, grâce à un service de calcul d'itinéraires (IGN et OSRM sont déjà configurés).\r\n\r\nLes modifications et insertions de points peuvent être annulées/rétablies soit point par point, soit par segment et, s'il s'agit d'une opération portant sur plusieurs points (comme un suivi de chemin), par lot, sur un segment ou sur l'ensemble de la trace.\r\n\r\nLa trace peut, irréversiblement, être purgée des éléments décochés en la sauvant puis en actualisant la page d'interface.\r\n\r\nLe calcul des statistiques de la trace peut être partiellement (option Gpu_comp sur 1) ou totalement (option Gpu_comp sur 2) déchargé vers le processeur graphique.\r\n\r\nIl est possible d'assembler une carte à partir de tuiles au format jpeg au moyen du programme jpegtran.\r\n\r\nL'application peut être configurée de sorte à accéder aux ressources distantes via un proxy; l'authentification basique et le chiffrement de bout en bout (TLS-in-TLS) sont pris en charge.\r\n\r\nMode d'emploi:\r\n  - copier le script GPXTweaker.py dans un répertoire\r\n  - copier et personnaliser le fichier de configuration GPXTweaker.cfg dans le même répertoire\r\n  - en option: copier le fichier de commandes jpegtran.bat et modifier le chemin d'accès vers le programme jpegtran (à télécharger)\r\n  - lancer GPXTweaker en observant la syntaxe de ligne de commande décrite ci-dessous\r\n\r\nLe module fournit diverses classes destinées à la manipulation directe de contenus cartographiques. Le fichier \"test.py\" expose différents cas d'usage possibles.\r\n\r\nSyntaxe:  \r\n\r\n  GPXTweaker [-h] URI [--conf|-c CONF] [--trk|-t TRK] [--map|-m MAP] [--emap|-e EMAP] [--box|-b BOX] [--size|-s SIZE] [--dpi|-d DPI] [--record|-r RECORD] [--noopen|-n] [--v|-v VERBOSITY]  \r\noù:  \r\n  -h: afficher l'aide  \r\n  URI: le chemin d'accès à la trace (en local ou, en lecture seule, sur un serveur) ou argument pas mentionné pour démarrer avec l'explorateur de traces  \r\n  CONF: le chemin d'accès au fichier de configuration (même répertoire que le script par défaut)  \r\n  TRK: l'indice de la trace (commençant à 0, pour les fichiers gpx contenant plusieurs traces) (0, c'est à dire la première, par défaut)  \r\n  MAP: le chemin d'accès complet à la carte (en local ou sur un serveur) ou le nom d'un fournisseur de carte paramétré dans le fichier de configuration ou vide pour utiliser le premier founisseur de carte configuré, ou non mentionné pour utiliser les fournisseurs de tuiles définis dans ce même fichier  \r\n  EMAP: le chemin d'accès complet à la carte d'altitudes ou le nom d'un fournisseur de cartes d'altitudes paramétré dans le fichier de configuration ou vide pour utiliser le premier fournisseur de carte d'altitudes configuré, ou non mentionné pour utiliser les fournisseurs de tuiles et données d'altitudes définis dans ce même fichier  \r\n  BOX: si le chemin d'une carte ou le nom d'un fournisseur de carte est mentionné ou laissé vide, la boîte au format \"minlat, maxlat, minlon, maxlon\" (avec les \"\") de la carte à retourner peut être indiquée au moyen de ce paramètre  \r\n  SIZE: si le chemin d'une carte ou le nom d'un fournisseur de carte est mentionné ou laissé vide, les dimensions au format \"hauteur, largeur\" (avec les \"\") de la carte à retourner peuvent être indiquées au moyen de ce paramètre  \r\n  DPI: si le nom d'un fournisseur de carte est mentionné ou laissé vide, la densité d'image en pixels par pouce de la carte à retourner peut être indiquée au moyen de ce paramètre (90 par défaut)  \r\n  RECORD: si le nom d'un fournisseur de carte est mentionné ou laissé vide, ce paramètre permet d'indiquer un répertoire dans lequel enregistrer la carte  \r\n  -noopen: pour que le script n'ouvre pas la page d'interface dans le navigateur par défaut (et ainsi pouvoir utiliser un autre navigateur)  \r\n  VERBOSITY: niveau de verbosité de 0 à 2 (0 par défaut)\r\n\r\nExemples:  \r\n\r\n  GPXTweaker -v 1  \r\n  GPXTweaker t.gpx  \r\n  GPXTweaker t.gpx -m \"d:\\maps\\m.png\" -v 1  \r\n  GPXTweaker t.gpx -c \"%appdata%\\gpxtweaker\\\" -m \"IGN PLANV2\" -e -s \"3000, 6000\"\r\n\r\nDans l'interface:\r\n  - clic gauche sur la carte pour la faire glisser\r\n  - clic gauche sur un point pour le sélectionner ou le déplacer\r\n  - clic gauche sur un segment pour le sélectionner\r\n  - clic droit sur la carte pour insérer un point après le point sélectionné ou un point de cheminement sinon\r\n  - ctrl + clic droit sur la carte pour insérer un point après le point sélectionné en mode suivi de chemin\r\n  - clic droit sur un point ou un segment pour le masquer\r\n  - roulette souris pour faire glisser la carte verticalement\r\n  - shift + roulette souris pour faire glisser la carte horizontalement\r\n  - ctrl + roulette souris pour zoomer ou dézoomer\r\n  - alt + roulette souris pour passer au point ou segment suivant ou précédent\r\n  - ctrl + clic sur les boutons de zoom pour modifier l'opacité de la carte\r\n\r\nPour associer les fichers dont l'extension est \".gpx\" avec GPXTweaker:\r\n  - créer dans le même répertoire un fichier GPXTweaker.bat contenant la ligne, en remplaçant [path] par le chemin d'accès au script: @\"[path]\\GPXTweaker.py\" %1\r\n  - dans l'explorateur de fichiers, double-cliquer sur un fichier \".gpx\", cliquer sur \"plus d'applications\" puis sur \"rechercher une autre application\", et naviguer jusque puis choisir \"GPXTweaker.bat\"\r\n\r\n\r\n----------English----------\r\n\r\nGPXTweaker is an application, in Python (≥ 3.8) and Javascript, for visualizing, in 2D and in 3D, and editing, throught a web interface, GPX tracks on a cartographic background. It also offers the possibility of displaying geotagged photos and videos. No dependency is required.\r\n\r\nWhen saving the updated track, the inital file is renamed, by adding the suffix \"- original\" or, the following times, \"- backup\", in the same folder. Unchanged datas are, as much as possible, kept as they are, without alteration, in order to ensure the conservation of fields constituting extensions relatively to standards.\r\n\r\nDespite extensive testing, the utility is still susceptible to include programming errors. It is therefore necessary to be careful when using it in real conditions by making sure that no data loss or corruption occurred in the modified track as saved compared to the original version before deleting the initial file.\r\nThe tool is compatible with MyTrails in taking into account altitude datas coming from the barometric pressure sensor.\r\nIf the indicated file does not exist, a new track will be created from scratch.\r\n\r\nThe background on which the track is displayed can be made of a map generated by interrogation of a WMS server or saved locally or on a server, or also be built from tiles retrieved from a WMTS or Web server or stored locally.\r\nAre already set and callable under an alias these sources: IGN (provided a key and suitable connexion infos are given), OSM, Google, Bing.\r\n\r\nElevation datas included in the track can be completed or replaced by the informations obtained by interrogation or a WMS or WMTS server\r\n or the IGN API (provided a key and suitable connexion infos are given) sending back a response in x-bil-32 or hgt format.\r\n\r\nThe drawing from point to point can be done in straight line or following pathes, thanks to a service of itineraries calculation (IGN ans OSRM are already configured).\r\n\r\nModifications and insertions of points can be undone/redone either point by point, or by segment and, if an operation dealing with several points is concerned (such as path following), by batch, on a segment or on the whole track.\r\n\r\nThe track can, irreversibly, be purged of unchecked elements by saving it then reloading the interface page.\r\n\r\nThe computation of the statistics of the track can be partially (option Gpu_comp on 1) ou totally (option Gpu_comp on 2) onto the graphics processor unit.\r\n\r\nIt is possible to assemble a map from tiles in jpeg format thanks to the program jpegtran.\r\n\r\nThe application can be configured to access remote resources through a proxy; basic authentication and end-to-end encryption (TLS-in-TLS) are supported.\r\n\r\nInstructions:\r\n  - copy the script GPXTWeaker in a folder\r\n  - copy and customize the configuration file GPXTweaker.cfg in the same folder\r\n  - optionally: copy the batch file jpegtean.bat and modify the path to the program jpegtran (needs to be downloaded)\r\n  - run GPXTweaker accordingly to the command line syntax describede below\r\n\r\nThe module provides different classes designed for direct handling of cartographic contents. The file \"test.py\" exsposes different possible use cases.\r\n\r\nSyntax:  \r\n\r\n  GPXTweaker [-h] URI [--conf|-c CONF] [--trk|-t TRK] [--map|-m MAP] [--emap|-e EMAP] [--box|-b BOX] [--size|-s SIZE] [--dpi|-d DPI] [--record|-r RECORD] [--noopen|-n] [--v|-v VERBOSITY]  \r\nwhere:  \r\n  -h: shows the help  \r\n  URI: the path to the track (on local or, in read only mode, on a server) or argument not mentioned to start with the explorer of tracks  \r\n  CONF: the path to the configuration file (same folder as the script by default)  \r\n  TRK: the index of the track (starting at 0, for the gpx files containing several tracks) (0, that is to say the first one, by défault)  \r\n  MAP: the full path to the map (on local or on a server) or the name of a map provider set in the configuration file or blank to use the first map provider configured, or not mentioned in order to use the tiles providers defined in this file  \r\n  EMAP: the full path to the elevations map or the name of an elevations map provider set in the configuration file or blank to use the first elevations map provider configured, or not mentioned in order to use the elevations tiles or data providers defined in this file  \r\n  BOX: if the path to a map or the name of a map provider is mentioned or kept blank, the box in format \"minlat, maxlat, minlon, maxlon\" (with the \"\") of the map to be retrieved can be indicated with this argument  \r\n  SIZE: if the path to a map or the name of a map provider is mentioned or kept blank, the dimensions in format \"height, width\" (with the \"\") of the map to be retrieved can be indicated with this argument  \r\n  DPI: if the name of a map provider is mentioned or kept blank, the image density in dots per inch of the map to be retrieved can be indicated with this argument (90 by default)  \r\n  RECORD: if the name of a map provider is mentioned or kept blank, this argument allows to indicate a folder in which save the map  \r\n  -noopen: so that the script does not open the interface page in the default browser (and so, be able to use another browser)  \r\n  VERBOSITY: verbosity level from 0 to 2 (0 by default)\r\n\r\nExamples:  \r\n\r\n  GPXTweaker -v 1  \r\n  GPXTweaker t.gpx  \r\n  GPXTweaker t.gpx -m \"d:\\maps\\m.png\" -v 1  \r\n  GPXTweaker t.gpx -c \"%appdata%\\gpxtweaker\\\" -m \"IGN PLANV2\" -e -s \"3000, 6000\"\r\n\r\nIn the interface:\r\n  - left click on the map to scroll it\r\n  - left click on a dot to select or move it\r\n  - left click on a segment to select it\r\n  - right click on the map to insert a dot after the selected dot or a waypoint otherwise\r\n  - ctrl + right click on the map to insert a dot after the selected one in path following mode\r\n  - right click on a dot or a segment to hide it\r\n  - mouse wheel to scroll the map vertically\r\n  - shift + mouse wheel to scroll the map horizontally\r\n  - ctrl + mouse wheel to zoom in or out\r\n  - alt + mouse wheel to switch to the next or previous point or segment\r\n  - ctrl + click on the zoom buttons to change the opacity of the map\r\n\r\nIn order to associate the files whose extension is \".gpx\" with GPXTweaker:\r\n  - create in the same folder a file GPXTweaker.bat containing the line, replacing [path] by the path to the script: @\"[path]\\GPXTweaker.py\" %1\r\n  - in the files explorer, double-click on a \".gpx\" file, click on \"more applications\" then on \"look for another application\", and navigate towards then choose \"GPXTweaker.bat\"\r\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/PCigales/GPXTweaker",
    "keywords": "gpx,gis,wms,wmts,3d,wgs84,mercator,geotag",
    "license": "GNU GPLv3",
    "maintainer": "",
    "maintainer_email": "",
    "name": "GPXTweaker",
    "package_url": "https://pypi.org/project/GPXTweaker/",
    "platform": "win64",
    "project_url": "https://pypi.org/project/GPXTweaker/",
    "project_urls": {
      "Bug Tracker": "https://github.com/PCigales/GPXTweaker/issues",
      "Homepage": "https://github.com/PCigales/GPXTweaker"
    },
    "release_url": "https://pypi.org/project/GPXTweaker/1.15.0/",
    "requires_dist": null,
    "requires_python": ">=3.8",
    "summary": "A script in Python 3 to visualize, in 2D and 3D, and edit GPX tracks",
    "version": "1.15.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17448380,
  "releases": {
    "1.10.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5a041d48772bdcd7af3b32374cfc952ea12695c6a9656365faea43198a6704d7",
          "md5": "d7d2b9212d43bd0bbbf3962314a02ed3",
          "sha256": "73475561b2b5534a5a90448262d5bf2f7accd73093bade2fcc49961cd465525c"
        },
        "downloads": -1,
        "filename": "GPXTweaker-1.10.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "d7d2b9212d43bd0bbbf3962314a02ed3",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 159126,
        "upload_time": "2022-06-02T15:35:15",
        "upload_time_iso_8601": "2022-06-02T15:35:15.819810Z",
        "url": "https://files.pythonhosted.org/packages/5a/04/1d48772bdcd7af3b32374cfc952ea12695c6a9656365faea43198a6704d7/GPXTweaker-1.10.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "efd3c85bbf63ebd2a4a0dd84b7cbc42745f2e9aecca6545fad27d7e0952ab45b",
          "md5": "126bd5dd5474d00b6d94cae12c2d7f56",
          "sha256": "5af82772efb945b7ac7559c4045d11fe99bd494416a3a106cf01e0fe5c257952"
        },
        "downloads": -1,
        "filename": "GPXTweaker-1.10.0.tar.gz",
        "has_sig": false,
        "md5_digest": "126bd5dd5474d00b6d94cae12c2d7f56",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 158002,
        "upload_time": "2022-06-02T15:35:17",
        "upload_time_iso_8601": "2022-06-02T15:35:17.058377Z",
        "url": "https://files.pythonhosted.org/packages/ef/d3/c85bbf63ebd2a4a0dd84b7cbc42745f2e9aecca6545fad27d7e0952ab45b/GPXTweaker-1.10.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.11.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "86019075af32c2521ca61445bbfb818a12d7b926fa0c28a9ffcf1ec045090a3c",
          "md5": "17f208d1a13da7f17d8d46c8d0b82728",
          "sha256": "06a399671a27a46f11c19f7bef6bf063c6604ab2b9fa0197ee6cc55b2ff5ac49"
        },
        "downloads": -1,
        "filename": "GPXTweaker-1.11.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "17f208d1a13da7f17d8d46c8d0b82728",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 163717,
        "upload_time": "2022-08-25T19:25:09",
        "upload_time_iso_8601": "2022-08-25T19:25:09.684418Z",
        "url": "https://files.pythonhosted.org/packages/86/01/9075af32c2521ca61445bbfb818a12d7b926fa0c28a9ffcf1ec045090a3c/GPXTweaker-1.11.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "83d39cde7e86c5994a4fd219acff45d076f6194373be4744d6635f67bcf70ece",
          "md5": "abead5752dcecb54de76c3647088b674",
          "sha256": "039f17101f75877f62391c302d96b92b5f09fb3739b62bc3066c2fca5ff5159e"
        },
        "downloads": -1,
        "filename": "GPXTweaker-1.11.0.tar.gz",
        "has_sig": false,
        "md5_digest": "abead5752dcecb54de76c3647088b674",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 166134,
        "upload_time": "2022-08-25T19:25:11",
        "upload_time_iso_8601": "2022-08-25T19:25:11.145986Z",
        "url": "https://files.pythonhosted.org/packages/83/d3/9cde7e86c5994a4fd219acff45d076f6194373be4744d6635f67bcf70ece/GPXTweaker-1.11.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.12.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "44404014f7e08656c5bd6518bd390ea9df336caf5306fba66ff961f2aca30daf",
          "md5": "4650486a7e96c6d63468783e5919f77c",
          "sha256": "ec74406f45b8175964a6dd9bb2c0b78bfd6e591318ded51b7b18fb0f969a5673"
        },
        "downloads": -1,
        "filename": "GPXTweaker-1.12.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "4650486a7e96c6d63468783e5919f77c",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 165710,
        "upload_time": "2022-09-24T15:11:32",
        "upload_time_iso_8601": "2022-09-24T15:11:32.599635Z",
        "url": "https://files.pythonhosted.org/packages/44/40/4014f7e08656c5bd6518bd390ea9df336caf5306fba66ff961f2aca30daf/GPXTweaker-1.12.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "31994619f905286f1dee194b86b361b2c3a8a4e9ba86d1088b76135b9b06533f",
          "md5": "c83bd4b1640e5e8d7aefe777c1666250",
          "sha256": "8d625ceb92869b11733f5576b5568308ffcbc1f8317306fad29e421eda5ac4aa"
        },
        "downloads": -1,
        "filename": "GPXTweaker-1.12.0.tar.gz",
        "has_sig": false,
        "md5_digest": "c83bd4b1640e5e8d7aefe777c1666250",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 168079,
        "upload_time": "2022-09-24T15:11:33",
        "upload_time_iso_8601": "2022-09-24T15:11:33.847010Z",
        "url": "https://files.pythonhosted.org/packages/31/99/4619f905286f1dee194b86b361b2c3a8a4e9ba86d1088b76135b9b06533f/GPXTweaker-1.12.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.12.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "efc896e0340235670fedf839d513a022e37b59ab8943761a57a96a421176b21f",
          "md5": "64eb627bacae85cdffe11352e517b8df",
          "sha256": "cc164678ddef3de020e029682f054f169faee628d31c5b9baded39087af99209"
        },
        "downloads": -1,
        "filename": "GPXTweaker-1.12.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "64eb627bacae85cdffe11352e517b8df",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 166441,
        "upload_time": "2022-10-13T14:17:35",
        "upload_time_iso_8601": "2022-10-13T14:17:35.261133Z",
        "url": "https://files.pythonhosted.org/packages/ef/c8/96e0340235670fedf839d513a022e37b59ab8943761a57a96a421176b21f/GPXTweaker-1.12.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e06ccac48bd6b0b105be5bada29f6be9b6ad535a8574991fa0402de480b6d673",
          "md5": "e1b67b863ba3fc3aae52d3f9a759139f",
          "sha256": "bfdce5b80d5222fca27bb4df80e4928f862c485866b500a4b243c8d130c9a044"
        },
        "downloads": -1,
        "filename": "GPXTweaker-1.12.1.tar.gz",
        "has_sig": false,
        "md5_digest": "e1b67b863ba3fc3aae52d3f9a759139f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 169248,
        "upload_time": "2022-10-13T14:17:36",
        "upload_time_iso_8601": "2022-10-13T14:17:36.690543Z",
        "url": "https://files.pythonhosted.org/packages/e0/6c/cac48bd6b0b105be5bada29f6be9b6ad535a8574991fa0402de480b6d673/GPXTweaker-1.12.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.15.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a128f70621cf6ffdc1888afa3e6396aa2141fc39aed4937733c54ad8137ebcda",
          "md5": "ba15939eecc36afc11ed18075df82886",
          "sha256": "94761e7964acea5b9bd9b60650599e0d63ddedcacb0959692a8e527f7fa90931"
        },
        "downloads": -1,
        "filename": "GPXTweaker-1.15.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "ba15939eecc36afc11ed18075df82886",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 196932,
        "upload_time": "2023-03-26T09:26:07",
        "upload_time_iso_8601": "2023-03-26T09:26:07.879547Z",
        "url": "https://files.pythonhosted.org/packages/a1/28/f70621cf6ffdc1888afa3e6396aa2141fc39aed4937733c54ad8137ebcda/GPXTweaker-1.15.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ea687b69efb072d733fce44b7a05cbde3d0e8e755a048ad506b55f3a0366af60",
          "md5": "d9712bfe31c1c622f8ce01c309c8154e",
          "sha256": "d0f6b6526c345983b4c93b874d85cc97f8c6115f4d1c83c5816dc570bf870a3f"
        },
        "downloads": -1,
        "filename": "GPXTweaker-1.15.0.tar.gz",
        "has_sig": false,
        "md5_digest": "d9712bfe31c1c622f8ce01c309c8154e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 199615,
        "upload_time": "2023-03-26T09:26:09",
        "upload_time_iso_8601": "2023-03-26T09:26:09.850995Z",
        "url": "https://files.pythonhosted.org/packages/ea/68/7b69efb072d733fce44b7a05cbde3d0e8e755a048ad506b55f3a0366af60/GPXTweaker-1.15.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.6.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a65f472a4feb9503e5d336c04c10b1a3063d87cca085649bece4a61e44d85927",
          "md5": "4e5955cafccefa540ae54202292dd491",
          "sha256": "a61a1d33a95111ff0385f1c4631bf8c30f9c5bb1d3ff8c13d370736064110ea9"
        },
        "downloads": -1,
        "filename": "GPXTweaker-1.6.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "4e5955cafccefa540ae54202292dd491",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 136749,
        "upload_time": "2022-02-06T00:09:53",
        "upload_time_iso_8601": "2022-02-06T00:09:53.113137Z",
        "url": "https://files.pythonhosted.org/packages/a6/5f/472a4feb9503e5d336c04c10b1a3063d87cca085649bece4a61e44d85927/GPXTweaker-1.6.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a4c2e6af0f7f9e3d31e70114ae97e8ec04316a0e8b35524a1829f31448064662",
          "md5": "46b76fec68315a78a31ff4e83fe8442f",
          "sha256": "51394edac8df71f970e0a7fc971434de67f5c8097854e97b37291ada9136f5cd"
        },
        "downloads": -1,
        "filename": "GPXTweaker-1.6.0.tar.gz",
        "has_sig": false,
        "md5_digest": "46b76fec68315a78a31ff4e83fe8442f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 136129,
        "upload_time": "2022-02-06T00:09:54",
        "upload_time_iso_8601": "2022-02-06T00:09:54.160237Z",
        "url": "https://files.pythonhosted.org/packages/a4/c2/e6af0f7f9e3d31e70114ae97e8ec04316a0e8b35524a1829f31448064662/GPXTweaker-1.6.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.7.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "10ccf5ec6b14471e7f16f938814e0661f4a97472d727f4379b02e3a608e679c4",
          "md5": "cebb0241179639cc1140e867bbcca368",
          "sha256": "37d3e0bc9cf36e275c0ea9a93cafbf2f35cdbfb78dbb476bfe850fd9dff4e240"
        },
        "downloads": -1,
        "filename": "GPXTweaker-1.7.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "cebb0241179639cc1140e867bbcca368",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 142670,
        "upload_time": "2022-03-05T23:55:22",
        "upload_time_iso_8601": "2022-03-05T23:55:22.037805Z",
        "url": "https://files.pythonhosted.org/packages/10/cc/f5ec6b14471e7f16f938814e0661f4a97472d727f4379b02e3a608e679c4/GPXTweaker-1.7.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "22c219d170bdd33517d54e99d613efa261bf446b954d35d05a84a7ed151e7e97",
          "md5": "2d22e3e0a20b2d835d6ca9188ddeef18",
          "sha256": "cedf0d4971671c2d6c435381c2b8a50a359cf41445654edb63a7a5b568f0f496"
        },
        "downloads": -1,
        "filename": "GPXTweaker-1.7.0.tar.gz",
        "has_sig": false,
        "md5_digest": "2d22e3e0a20b2d835d6ca9188ddeef18",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 141797,
        "upload_time": "2022-03-05T23:55:23",
        "upload_time_iso_8601": "2022-03-05T23:55:23.360914Z",
        "url": "https://files.pythonhosted.org/packages/22/c2/19d170bdd33517d54e99d613efa261bf446b954d35d05a84a7ed151e7e97/GPXTweaker-1.7.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.9.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "aac052777715b588bf0ada036285f749a98890e8b914b391161e3bc9a52755af",
          "md5": "decee36521b4dcdb597c723f83feae6b",
          "sha256": "e80c3f97f0527fe2da3eed6ce7dee763d2330f89ec2cd7281b5c3569cc36d501"
        },
        "downloads": -1,
        "filename": "GPXTweaker-1.9.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "decee36521b4dcdb597c723f83feae6b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 152758,
        "upload_time": "2022-03-31T18:59:53",
        "upload_time_iso_8601": "2022-03-31T18:59:53.142030Z",
        "url": "https://files.pythonhosted.org/packages/aa/c0/52777715b588bf0ada036285f749a98890e8b914b391161e3bc9a52755af/GPXTweaker-1.9.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1f31022fcf58c8cab32c8827bae1fb3d5eb5776786da20b7d870c2f1a8badbc0",
          "md5": "273bc4e878dc5cdd3b0c1047b643469f",
          "sha256": "6ea7dd8d2092313a6eedc13a4ce8da82d8ac2e7392d99194a53b8a04cd8ee8b7"
        },
        "downloads": -1,
        "filename": "GPXTweaker-1.9.1.tar.gz",
        "has_sig": false,
        "md5_digest": "273bc4e878dc5cdd3b0c1047b643469f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 151564,
        "upload_time": "2022-03-31T18:59:54",
        "upload_time_iso_8601": "2022-03-31T18:59:54.553519Z",
        "url": "https://files.pythonhosted.org/packages/1f/31/022fcf58c8cab32c8827bae1fb3d5eb5776786da20b7d870c2f1a8badbc0/GPXTweaker-1.9.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.9.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3de0814d0b6ef5f92d88f4c177acac31f2ae47283bbf1a6cc947f7325af5f8dc",
          "md5": "4507fb8330ae57daa7d3023763e86c40",
          "sha256": "291687f328f7d3e7b099cf794375748e1441c4189ebded948994b10f1e9ffc1b"
        },
        "downloads": -1,
        "filename": "GPXTweaker-1.9.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "4507fb8330ae57daa7d3023763e86c40",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 153073,
        "upload_time": "2022-04-27T20:30:50",
        "upload_time_iso_8601": "2022-04-27T20:30:50.623355Z",
        "url": "https://files.pythonhosted.org/packages/3d/e0/814d0b6ef5f92d88f4c177acac31f2ae47283bbf1a6cc947f7325af5f8dc/GPXTweaker-1.9.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "863506024c3dcd75b215e4c517f143e3bd26c3a72a10fd3753eb94feace8712f",
          "md5": "7702c0b351a61b72cbf12e9d9c2acbb6",
          "sha256": "ba7a3f151abaada8708599a00fc4b4f22fe0a15e49e1664c96bc32bc0bb367b5"
        },
        "downloads": -1,
        "filename": "GPXTweaker-1.9.2.tar.gz",
        "has_sig": false,
        "md5_digest": "7702c0b351a61b72cbf12e9d9c2acbb6",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 151820,
        "upload_time": "2022-04-27T20:30:54",
        "upload_time_iso_8601": "2022-04-27T20:30:54.668914Z",
        "url": "https://files.pythonhosted.org/packages/86/35/06024c3dcd75b215e4c517f143e3bd26c3a72a10fd3753eb94feace8712f/GPXTweaker-1.9.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "a128f70621cf6ffdc1888afa3e6396aa2141fc39aed4937733c54ad8137ebcda",
        "md5": "ba15939eecc36afc11ed18075df82886",
        "sha256": "94761e7964acea5b9bd9b60650599e0d63ddedcacb0959692a8e527f7fa90931"
      },
      "downloads": -1,
      "filename": "GPXTweaker-1.15.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "ba15939eecc36afc11ed18075df82886",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.8",
      "size": 196932,
      "upload_time": "2023-03-26T09:26:07",
      "upload_time_iso_8601": "2023-03-26T09:26:07.879547Z",
      "url": "https://files.pythonhosted.org/packages/a1/28/f70621cf6ffdc1888afa3e6396aa2141fc39aed4937733c54ad8137ebcda/GPXTweaker-1.15.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "ea687b69efb072d733fce44b7a05cbde3d0e8e755a048ad506b55f3a0366af60",
        "md5": "d9712bfe31c1c622f8ce01c309c8154e",
        "sha256": "d0f6b6526c345983b4c93b874d85cc97f8c6115f4d1c83c5816dc570bf870a3f"
      },
      "downloads": -1,
      "filename": "GPXTweaker-1.15.0.tar.gz",
      "has_sig": false,
      "md5_digest": "d9712bfe31c1c622f8ce01c309c8154e",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.8",
      "size": 199615,
      "upload_time": "2023-03-26T09:26:09",
      "upload_time_iso_8601": "2023-03-26T09:26:09.850995Z",
      "url": "https://files.pythonhosted.org/packages/ea/68/7b69efb072d733fce44b7a05cbde3d0e8e755a048ad506b55f3a0366af60/GPXTweaker-1.15.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}