{
  "info": {
    "author": "Daniel L. Bates",
    "author_email": "danbates@verizon.net",
    "bugtrack_url": null,
    "classifiers": [
      "Intended Audience :: End Users/Desktop",
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# hanoitoys Package\nlast change 08-Feb-2022\n### A collection of Tower of Hanoi solutions.\naka Tower of Lucas, \naka Tower of Brahma, \nmostly toy programs showing non recursive solutions to the Classical (3 pegs/needles) Hanoi.  \nOne solution generator to Super Hanoi aka Hanoi on steroids.\nThis is the Tower of Hanoi with more than 3 pegs/needles. This is the Steward Frame algorithm.\nThis has an optional turtle grapics display.\n\n\n## The toy solutions\n### HanoiClassical.py\nThis is the classical Hanoi solution using recursion. The CS 101 method.  \n#### 1st the classical Tower of Hanoi\nThe classical Tower of Hanoi has 3 posts or needles and n discs. One of the posts is where all n discs are located at when the puzzle starts. This post \nis called source.\nThe goal is to move all the discs to the destination peg. Subject to 3 rules.  \nRule # 1 : A larger disc is never placed on top of a smaller disc.  \nRule # 2 : Only one Disc may be moved at a time.  \nRule # 3 is that in that the sequence of moves leading to the solution may not have any repeated states.  \nThere is another disc labeled Store.   \n\n\nThis leads us to the fact there is only one sequence of states that leads to a solution for classical Tower of Hanoi.  \n\nIn a second sense this is the classical most known solution, the recursive solution.  \nThe base case is you can move one disk from x to y when y does not have any smaller disc.\nEach level of recursion does relabel the pegs. The former labeling is restored by returning.\n```\ndef recursive_hanoi (source, store, destination, n):\n    if n == 1:\n        move the one disc\n        return\n    recursive_hanoi (source, destination, store, n - 1\n    recursive_hanoi (source, store, destination, 1)\n    recursive_hanoi (store, source, destination, n - 1)\n```\n#### HanoiOlive.py is a nonrecursive Olive algorithm.\nFrancois Edourard Lucas who wrote about this problem and gave it the Tower of Hanoi name (writing under the nom de plume of M Claus, Claus being an anagram of Lucas) \n. Raoul Olive, a nephew of Lucas, observed the smallest\ndisc moves every other move. The motion of this peg depends on the parity of n.  \nWhen n is odd the smallest disc moves from source to destination to store, then back to source.  \nWhen n is even the smallest disc moves from source to store to destination, then back to source.  \nWhen the smallest disc is not being moved there is only 1 legal move involving the two pegs the smallest disc is not occupying.\n#### HanoiIdlePeg.py is another non recursive refinement.\nHere we add a marker which is like a smaller disc which marks the Idle (non participating peg). With a real puzzle with discs and wooden pegs you can often\nlet a sewing thimble represent the Idle peg. We do not count the Idle Peg token in the number of discs n.  \nFor Odd n we move clockwise source -> store -> destination -> source.  \nFor Even n we move counter clockwise source -> destination -> store -> source.  \nwe repeatedly move the Idle token then find the legal move that can be made with the remaining participating pegs.\n\n#### HanoiNR.py\nHanoiNR.py is also included. This is the Wikipedia non recursive Tower of Hanoi solution.\n## Tower of Hanoi on steroids. Number of pegs > 3. The Steward, Frame Algorithm.  CS 501\nWhile Francois Edourard Lucas aka M Claus did undoubtedly write on the more than three peg Tower of Hanoi, we will now visit that problem disguised as the Reve's\nPuzzle. In 1907 Henry Ernest Dudeney wrote a book of mathematical puzzles called \"*The Canterbury Puzzles and Other Curious Problems*\". In this work the characters are from Chaucer's \"*The Canterbury Tales*\" are on a pilgrimage and resting at a tavern where each of them presents a puzzle to their fellow travelers. The first of these is the Reve's[^1] puzzle. In the Reve's puzzle the are 4 stools and 8 cheeses of various sizes. These are on a stool in order, the smaller the cheese the closer to the top of the stack. The puzzle is to move the cheeses to another stool in the same order. Only one cheese can be moved at a time. A cheese can only be moved to an empty stool or the top of a larger cheese. Only one cheese can be moved at a time.\n\nClearly  this is equivalent to a 4 peg/needle 8 disc Tower of Hanoi problem.\n\n### Reve's puzzle being solved by Dan's Hanoi (Hanoi.py in this package)\n\n![Reve's puzzle being solved by Dan's Hanoi](Reves.png)\n\nIn 1941 B. M. Stewart and J. S. Frame each independently came up with\na algorithm to solve the generalized (n > 3) Tower of Hanoi puzzle. This\npartitioned the initial stack of disks into sequential groups. The\nsubproblems being to move each group to a peg (a recursive task) and\nreassemble them on the destination peg/needle.  They believed this\nsolution was 'Optimal'. This is known as the Frame Stewart conjecture.\nIn 2018 this conjecture was proved by Roberto Demontis.  \n#### What is Optimal?\n  In classical (3 peg/needle) Hanoi the constraint to not\nrepeat a state means there is only one solution. That solution is\noptimal, there are no solutions using fewer moves because there are no\nother solutions period. The optimal solution has 2^n^-1 solutions.\nThis is not true when you go beyond 3 pegs. There are many solutions,\neven when we keep the no repeated state requirement. The ones where no\nother solutions that take less moves are optimal. Clearly you can\nremap all pegs/needles other than the source and destination in (n-2)!\nways. And at each sub problem you can remap. There are therefore many\nOptimal solutions.  \n\n#### The solutions take far fewer moves than the classical Tower of Hanoi does.\nConsider the 64 disc 4 needle\nsolutions: You could just not use one needle and solve this\nclassically. Or you could move the top disc to a needle and solve the\nrest as a 63 disc classical Tower of Hanoi. This would take a tiny bit\nmore than half the moves of the 64 disc classical Tower of Hanoi\nsolution. Or move two discs and then 62 classical, which would be a\nfourth the moves. The first few n values of this are: \n|n|Number of moves| \n|---|------------------------| \n|0|18,446,744,073,709,551,615|\n|1|9,223,372,036,854,775,809|\n|2|4,611,686,018,427,387,909|\n|3|2,305,843,009,213,693,965|\n|4|1,152,921,504,606,847,005|\n|5|576,460,752,303,423,549|\nAt n=53 we do the best we can at 18,433 moves.  \n\n#### We need an estimate for cost.  \nWe can guide our algorithm by a Cost[^2] Estimator. \nIt too will be recursive. We just have to\nknow how many moves, not actually make the moves. However the\nestimator has to not only tell us how few moves we can get away with\nbut what direction we have to go to get there.  \nHere is an estimator:\n``` \n@functools.lru_cache(maxsize=3000) \ndef est (NumDiscs: int, NumStore: int) -> tuple: \n    # returned tuple (num of moves, first move this many to storage needle \n    # can use min on list of these tuples to get tuple to return.  \n    # or alternatively track the minimum without a list \n    if NumStore == 1 or NumDiscs < 3:\n       # base case is classic Hanoi.\n       return ((1 << NumDiscs) - 1, 1) # 2 ** NumDiscs - 1; this is faster.\n    possibilities = list() \n    # build a list of sub problems \n    for n in range(1, NumDiscs):\n\tmoves = est(n, NumStore)[0] << 1\t\t# n src->stor, n\n       stor->dest moves += est(NumDiscs - n, NumStore - 1)[0] # NumDiscs-n\n       src->dest possibilities.append((moves, n))\t\n       # ok in list see if it is best later \n       return min(possibilities) \n```\nThis recursive solution is of order n factorial O(n!) Far worse for n > 3 than say Fibbinacci\nO(2^n^). If you try this for yourself best use *memoization*.  The\nlru_cache decorator from functools is a godsend. Fail to do this means\nthe mean time to fail for the hardware may foil your attempt.  \nThe estimator 'est' returns a tuple, the first element is the number of\nmoves (the thing we want to minimize), The second is the number of\ndiscs from the top of the source peg/needle to move to one of the available storage\npeg/needles.\n\n As to which available peg/needle it does not matter.\nInitially this was coded with the Python set object to hold the\navailable storage pegs, but to make it seem as if it was not just\nguessing, I implemented a ordered set which is just an int with bits\nset for pegs.  Note: At a any particular point in the recursion some\nof the available pegs may have discs on them, only they will be bigger\ndiscs then the ones you are trying to move.  \n\n#### Labeling the pegs/needles.\n\nWhen there are more than 3 needles, calling them source, store and destination no longer works.\nThe Hanoi.py in the package names them first after the English alphabet Uppercase. The 27th is lower case 'a'.\nWe continue on through the lower case letter to the 52nd which is lower case zed 'z'. Needles 53 through 76 are given\nGreek letters, which are spelled out in English in the normal output and use unicode equivalents in the graphics.\n\n\nThe source at the top level is always labeled 'A'. The destination is last needle, if it were the 64th it would be 'nu'.\n\n#### The Dialogue.\n\nThe Dialogue is not a Turtle dialogue or a tkinter dialogue. This is a default stdin/stdout dialog. Turtle is not even initialized until\nwe know we need a graphical output. There are two flavors: text mode output and graphics. The graphics dialog needs the same information and\na little bit more than the text dialog. So the last question of the text mode dialogue is \"Do you want a graphical representation?\" to which\na reply of the single character 'n' is acceptable. The other questions are \"Enter Number of Needles :\" and\n\"Enter Number of Discs :\".\n\n\nThe example shown sets up for a textual only solution to the Reve's puzzle.\n```\nEnter Number of Needles : 4\nEnter Number of Discs : 8\nDo you want a graphical representation?n\n1:Moving disc from A to C\n2:Moving disc from A to B\n3:Moving disc from A to D\n4:Moving disc from B to D\n5:Moving disc from A to B\n6:Moving disc from D to A\n7:Moving disc from D to B\n8:Moving disc from A to B\n9:Moving disc from C to B\n10:Moving disc from A to C\n11:Moving disc from A to D\n12:Moving disc from C to D\n13:Moving disc from A to C\n14:Moving disc from D to A\n15:Moving disc from D to C\n16:Moving disc from A to C\n17:Moving disc from A to D\n18:Moving disc from C to D\n19:Moving disc from C to A\n20:Moving disc from D to A\n21:Moving disc from C to D\n22:Moving disc from A to C\n23:Moving disc from A to D\n24:Moving disc from C to D\n25:Moving disc from B to A\n26:Moving disc from B to D\n27:Moving disc from B to C\n28:Moving disc from D to C\n29:Moving disc from B to D\n30:Moving disc from C to B\n31:Moving disc from C to D\n32:Moving disc from B to D\n33:Moving disc from A to D\n```\nMost people will want to answer a single lower case 'y' to the graphics question. The graphics display has the 'A' (source) needle on\nthe lower left hand side of the display and the Destination needle on the right hand side. There are never any needles above the Destination needle. The whole right hand column except for the destination needle is reserved to move discs vertically to the desired row. This area will be referred to as the 'elevator' In each row there is a little space above the needle for horizontal disc motion. These will be referred to as 'skyways'.\n\nWhen the graphic dialog asks \"How many Columns :\" This always excludes the destination needle. On the bottom row there is an extra column. \nThe program figures out how many rows it needs. An example needles=8, discs=11, columns=4 will have two rows. The bottom row with 'A', 'B', 'C', 'D' and 'H'.\nThe top row with 'E', 'F', 'G'.\n\nThe next question is \"Do you want a faster move of discs?\". A 'n' is usually called for. If you want the discs to move in a straight line from where they start to where they are going regardless of what is in the way than a 'y' response is appropriate. This speeds up some puzzles by quite a bit. \n\n#### The graphics option.\n\nThe fast move from A to X is from the top disc on needle A to the place on needle X above the top disc in a straight line.\n\nThe normal move is somewhat involved. Where A and X are on same row A's top disc ascends the skyway, moves left or right to just above needle X and \ndescends into place.\nOn different rows A'a top disc ascends to the skyway, moves left to the elevator ascends or descends to the skyway for the row X is on, moves left till it \nis over X and descends into place.\n\nHere is a sample picture captured for the 8 Needle, 11 discs, 3 column example:\n![8 Needle, 11 discs, 3 column](N8D11C4.png)\n\n#### Things you might want to try.\n\nIn classical Tower of Hanoi with 3 needles and 64 needles, the Sun would become a Red Giant, Earth incinerated and the Milky Way would have collided with Andromeda and you still would not have a solution. But with 4 needles, 64 Discs and no graphics, this takes maybe 7 seconds.\n\n\nAnother to try takes only 127 moves. This is 65 needles, 64 Discs, 8 columns and and fast graphics. This does exactly what you might think. There is no special case for this, it falls out of the more general solution. It is odd the number of moves with 3 needles is 2^n^-1, but with n+1 needles it is 2n-1.\n\n#### For more information.\nI highly recommend the following book in either 1st or 2nd edition:  \n*The Tower of Hanoi -- Myths and Maths *  \nAuthored by:  \n*Andreas M. Hinz, Sandi Klavzar, Uros Milutinovis, Ciril Petr*  \nPublished by Birkhauser  \nFirst Edition ISBN 978-3-0348-0237-6  \n[Website (unfortunately **unsecure** http) tohbook.info](http://tohbook.info)  \n[Widipedia article about the book](https://en.wikipedia.org/wiki/The_Tower_of_Hanoi_%E2%80%93_Myths_and_Maths)\n\n\nThis material is found in a much expanded form in a chapter of a book I have written. I will update this notice when it is published.  \n \n[^1]: Reve from the word Reeve: honored official. The Reeve of the Shire is the source of the modern word Sheriff.  \n[^2]: Luke 14:28 For which of you, intending to build a tower, sitteth not down first, and counteth the cost, whether he have sufficient to finish it?  \n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/DanLBates/hanoitoys",
    "keywords": "'Tower','of','Hanoi','Lucas','Brahma','Brahman','Steward','Frame','dan.bates'",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "hanoitoys",
    "package_url": "https://pypi.org/project/hanoitoys/",
    "platform": null,
    "project_url": "https://pypi.org/project/hanoitoys/",
    "project_urls": {
      "Homepage": "https://github.com/DanLBates/hanoitoys"
    },
    "release_url": "https://pypi.org/project/hanoitoys/0.1.3/",
    "requires_dist": null,
    "requires_python": ">=3.8",
    "summary": "A collection of Tower of Hanoi solutions including the Steward Frame algorithm.",
    "version": "0.1.3",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 13584302,
  "releases": {
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f7016118bbb1e74d31a870ccfcf9d655929f34bcf6b4ecd42e44bde44bb380c6",
          "md5": "ae3ebac9e727939575f580575d5c9427",
          "sha256": "aa6e75a865ce3e1b986f91e679bef51f8e66ebbc8c47041eb17f9f220e9d5759"
        },
        "downloads": -1,
        "filename": "hanoitoys-0.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "ae3ebac9e727939575f580575d5c9427",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 18190,
        "upload_time": "2022-01-27T21:58:45",
        "upload_time_iso_8601": "2022-01-27T21:58:45.152912Z",
        "url": "https://files.pythonhosted.org/packages/f7/01/6118bbb1e74d31a870ccfcf9d655929f34bcf6b4ecd42e44bde44bb380c6/hanoitoys-0.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9fc68230e36651439308fbfa74aa641f3f5a64ad12efa8aec6845e7fc1eb445b",
          "md5": "c84b9d911f504f312a0f347f66614d17",
          "sha256": "91cbae309dabc7f649cd20203ea359749ceda8a59f050a79c54819a55c8b1eff"
        },
        "downloads": -1,
        "filename": "hanoitoys-0.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "c84b9d911f504f312a0f347f66614d17",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 27681,
        "upload_time": "2022-01-27T21:58:46",
        "upload_time_iso_8601": "2022-01-27T21:58:46.508028Z",
        "url": "https://files.pythonhosted.org/packages/9f/c6/8230e36651439308fbfa74aa641f3f5a64ad12efa8aec6845e7fc1eb445b/hanoitoys-0.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6fb46396b3b046d4d0886501b0d3a37b25cdcfd8fafb5b9bda3d14121eb3f6fa",
          "md5": "c49cf81b8fe4493e1071647e6322b3d3",
          "sha256": "ae256206e97bdada98f7c3eea8d03057f81dbfc28baade85befd4feb610ddd96"
        },
        "downloads": -1,
        "filename": "hanoitoys-0.1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "c49cf81b8fe4493e1071647e6322b3d3",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 18175,
        "upload_time": "2022-02-07T22:33:28",
        "upload_time_iso_8601": "2022-02-07T22:33:28.468973Z",
        "url": "https://files.pythonhosted.org/packages/6f/b4/6396b3b046d4d0886501b0d3a37b25cdcfd8fafb5b9bda3d14121eb3f6fa/hanoitoys-0.1.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b5556a4ee45ef57fbc9e967ad454adc8e92280f57adee408d7c4cbb09c6c1362",
          "md5": "2d06434292b03acac369c2569e7d9e89",
          "sha256": "59c881e13331a19a36297923d56de41efe64f92c08215a028a80f931f4b0c02d"
        },
        "downloads": -1,
        "filename": "hanoitoys-0.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "2d06434292b03acac369c2569e7d9e89",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 27654,
        "upload_time": "2022-02-07T22:33:29",
        "upload_time_iso_8601": "2022-02-07T22:33:29.948276Z",
        "url": "https://files.pythonhosted.org/packages/b5/55/6a4ee45ef57fbc9e967ad454adc8e92280f57adee408d7c4cbb09c6c1362/hanoitoys-0.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "57dfbf2c3af493d51a34c3ecc18971dd80ea8f2b37702192beaf6d80e87d2726",
          "md5": "d3bd1998530f92ae140b4139a120b62c",
          "sha256": "db580e9a687ff59345137cafdbd972d0d7422fb63c3c60e6d818519e13165168"
        },
        "downloads": -1,
        "filename": "hanoitoys-0.1.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "d3bd1998530f92ae140b4139a120b62c",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 18169,
        "upload_time": "2022-02-08T21:12:51",
        "upload_time_iso_8601": "2022-02-08T21:12:51.086140Z",
        "url": "https://files.pythonhosted.org/packages/57/df/bf2c3af493d51a34c3ecc18971dd80ea8f2b37702192beaf6d80e87d2726/hanoitoys-0.1.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3fad02267b6877ab9fb4de3a25c71673bf98c71fb4b3ca63559f6f306b415915",
          "md5": "909375b82f47363b4df3ea4b943250c5",
          "sha256": "af4a973f1df7fa6e5cb821781a0c2c782186b36234bc4e45dde47233b59413e8"
        },
        "downloads": -1,
        "filename": "hanoitoys-0.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "909375b82f47363b4df3ea4b943250c5",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 27643,
        "upload_time": "2022-02-08T21:12:52",
        "upload_time_iso_8601": "2022-02-08T21:12:52.965327Z",
        "url": "https://files.pythonhosted.org/packages/3f/ad/02267b6877ab9fb4de3a25c71673bf98c71fb4b3ca63559f6f306b415915/hanoitoys-0.1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a4f71ea61b470a7acec4678b8ed63a96e88ccd095fa58417392bd03ca5942c5b",
          "md5": "d15032e0d3464ff97d59d08045252a84",
          "sha256": "692bd1549c9e0cdfbe6befc94c5dca945e5d84e5b964ed2cd321ebdcefc7be1d"
        },
        "downloads": -1,
        "filename": "hanoitoys-0.1.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "d15032e0d3464ff97d59d08045252a84",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 18176,
        "upload_time": "2022-04-21T22:49:04",
        "upload_time_iso_8601": "2022-04-21T22:49:04.525860Z",
        "url": "https://files.pythonhosted.org/packages/a4/f7/1ea61b470a7acec4678b8ed63a96e88ccd095fa58417392bd03ca5942c5b/hanoitoys-0.1.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1cb342d50c626445ebef15d66acc6aebbdc3ab1d0f78f9a1b69b2abe3f9bb318",
          "md5": "610f98734ce49b9f7383a18db8594ec1",
          "sha256": "dd5ba91ceed7a3ea8fcc1cd856bfee826fca75b129f103a42dce2f7e34c4abfc"
        },
        "downloads": -1,
        "filename": "hanoitoys-0.1.3.tar.gz",
        "has_sig": false,
        "md5_digest": "610f98734ce49b9f7383a18db8594ec1",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 27683,
        "upload_time": "2022-04-21T22:49:06",
        "upload_time_iso_8601": "2022-04-21T22:49:06.088540Z",
        "url": "https://files.pythonhosted.org/packages/1c/b3/42d50c626445ebef15d66acc6aebbdc3ab1d0f78f9a1b69b2abe3f9bb318/hanoitoys-0.1.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "a4f71ea61b470a7acec4678b8ed63a96e88ccd095fa58417392bd03ca5942c5b",
        "md5": "d15032e0d3464ff97d59d08045252a84",
        "sha256": "692bd1549c9e0cdfbe6befc94c5dca945e5d84e5b964ed2cd321ebdcefc7be1d"
      },
      "downloads": -1,
      "filename": "hanoitoys-0.1.3-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "d15032e0d3464ff97d59d08045252a84",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.8",
      "size": 18176,
      "upload_time": "2022-04-21T22:49:04",
      "upload_time_iso_8601": "2022-04-21T22:49:04.525860Z",
      "url": "https://files.pythonhosted.org/packages/a4/f7/1ea61b470a7acec4678b8ed63a96e88ccd095fa58417392bd03ca5942c5b/hanoitoys-0.1.3-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "1cb342d50c626445ebef15d66acc6aebbdc3ab1d0f78f9a1b69b2abe3f9bb318",
        "md5": "610f98734ce49b9f7383a18db8594ec1",
        "sha256": "dd5ba91ceed7a3ea8fcc1cd856bfee826fca75b129f103a42dce2f7e34c4abfc"
      },
      "downloads": -1,
      "filename": "hanoitoys-0.1.3.tar.gz",
      "has_sig": false,
      "md5_digest": "610f98734ce49b9f7383a18db8594ec1",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.8",
      "size": 27683,
      "upload_time": "2022-04-21T22:49:06",
      "upload_time_iso_8601": "2022-04-21T22:49:06.088540Z",
      "url": "https://files.pythonhosted.org/packages/1c/b3/42d50c626445ebef15d66acc6aebbdc3ab1d0f78f9a1b69b2abe3f9bb318/hanoitoys-0.1.3.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}