{
  "info": {
    "author": "Daniel Cote",
    "author_email": "dccote@cervo.ulaval.ca",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 4 - Beta",
      "Intended Audience :: Education",
      "Intended Audience :: Science/Research",
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.7",
      "Topic :: Education",
      "Topic :: Scientific/Engineering :: Physics"
    ],
    "description": "# PyHardwareLibrary\n\nA simple device-oriented library for controlling hardware devices in the laboratory.\n\nYou may be here for one of two things:\n\n1. You want to use a device (e.g., Ocean Insight spectrometer), get data, and save it.\n2. You want to program a driver to get a new device to work on your computer.\n\nIf this applies to you, then keep reading.\n\n## Learning more\n\nIf you are interested in learning more about:\n\n* **USB itself** and connectivity details, please read [README-USB.md](README-1-USB.md).\n* **RS-232 and its relation to USB**, please read [README-RS232.md](README-2-RS232.md)\n* **experimenting with an RS-232 chip from FTDI**, please read [DAQ I/O with UM232R (french only)](https://github.com/dccote/Enseignement/blob/4c8eca0c7ca7ec74c60774af57483f5d77fb60be/DAQ/Semaine-02.pdf). You can probably Google translate or DeepL translate the Markdown file [here](https://github.com/dccote/Enseignement/blob/4c8eca0c7ca7ec74c60774af57483f5d77fb60be/DAQ/Semaine-02.md).\n* **USB Cameras**, please read [README-USB-Cameras.md](README-3-USB-Cameras.md)\n* how `PyHardwareLibrary` **deals with the many different ports**, please read [README-Communication ports.md](README-5-Communication-ports.md)\n* **the process involved in supporting a new device** in  `PyHardwareLibrary` but also in general, please read [README-New-device-coding-example.md](README-4-New-device-coding-example.md)\n\nIt would be a good plan to read all of the above, essentially in that order.\n\n## What is the purpose of this hardware library?\n\nWe often need to control devices in the laboratory (linear stages, spectrometers, cameras, shutters, etc...).  The drivers provided by many companies are a good start, but integrating the devices in custom software sometimes gets difficult. This Python module was created to **facilitate the development of drivers**,  **facilitate the creation of applications**, and **provide minimal but useful applications** for hardware that is often used in the lab. It originates from a (private) project that I personnally maintained for nearly 10 years where drivers were written in Objective-C and included support for more than 30 different devices used in my laboratory.  However, Python is more commonly taught in school and supports essentially all platforms, therefore I started this project so that I can 1) teach how to go about developing simple drivers, 2) teach good programming practices to students, 3) get the hardware working for my own lab regardless of the platforms used (we use macOS and Windows), 4) get help to shorten the development cycles to support more devices.\n\nWhy Python? Python is object-oriented (essential) and offers reasonable performance. Python also has the quality of being a very nice team player: it is fairly easy to integrate Python with anything, on any platform and the community is extremely active.  It is obvious by the numerous Python SDKs from companies, the thousands of modules on PyPi.org, and the support from all vendors (Microsoft, Apple and Linux). Python is also not a dead language: I am very pleased to see the language evolve over the years with new language features and new standard modules. \n\n## Getting started with using devices\n\nTo use this module, you need to install it by [downloading it](https://github.com/DCC-Lab/PyHardwareLibrary/archive/refs/heads/master.zip) from GitHub then typing: `python setup.py install`.\n\nRight now, the only useful devices supported are the Ocean Insight spectrometers, `USB2000` and `USB4000`. If you only want to use it, then the following two-line script will do:\n\n```python\nfrom hardwarelibrary.spectrometers import OISpectrometer\n\nOISpectrometer.displayAny()\n```\n\nThe first supported spectrometer connected will be chosen and a window will appear displaying the spectrum.\n\nIf you want to do more such as integrating it in some other software you are writing, at this point the best option is to type `help(someClass)` to get the help from the code:\n\n```python\n>>> from hardwarelibrary.spectrometers import OISpectrometer\n>>> help(OISpectrometer)\n\nHelp on class OISpectrometer in module hardwarelibrary.spectrometers.oceaninsight:\n\nclass OISpectrometer(builtins.object)\n |  OISpectrometer(idProduct, model, serialNumber=None)\n |  \n |  An Ocean insight (Ocean Optics) spectrometer.  This allows complete access\n |  to the hardware with simple functions to get the spectrum, or modify the\n |  integration time. It is the base class for all Ocean Insight Spectrometers,\n |  but you will not instantiate this directly: use USB2000() or USB4000(),\n |  or simply: OISpectrometer.any() to get any spectrometer.\n |  \n |  Access to the device is done with pyusb and does not require any\n |  additional information. The USB-specific attributes of the spectrometers are\n |  available,  but are not needed for standard usage.  If you need to\n |  implement additional functions and communicate with the device (not all\n |  capabilities are currently coded), then you could implement them in a\n |  separate function.\n |  [...]\n |  getCalibration(self)\n |      Get the hardcoded calibration from the spectrometer.  It is a\n |      3rd-order polynomial. Currently, no nonlinearities are considered.\n |  \n |  getIntegrationTime(self)\n |      Get the integration time in as a float value in milliseconds\n |      cls.timeScale is 1 for ms and 1000 if it is stored in µs\n |  \n |  getParameter(self, index)\n |      Get any of the 20 parameters hardcoded into the spectrometer.\n |      \n |      Parameters\n |      ----------\n |      \n |      index: int\n |          0 – Serial Number\n |          1 – 0th order Wavelength Calibration Coefficient \n |          2 – 1st order Wavelength Calibration Coefficient\n[...]\n\n```\n\n\n\nOf course, other devices will be supported in the near future.  As mentionned elsewhere in this document, the present `PyHardwareLibrary` project originates from a private `HardwareLibrary` project that supports many different devices, such as Sutter Instruments stages, many Thorlabs devices (stages, shutters, rotation stages, flip mirrors), Spectra Physics Lasers, Cobolt Lasers, Olympus microscopes, GenTech-EO power meters, LabJack, Zaber, Marzhauer, Prior, Newport, Intellidrive, so it is a question of time (and need) before they are ported to `PyHardwareLibrary`.\n\n## Getting started with coding for new devices\n\nBut maybe your interest is not just in using the devices, but also in learning how to code to control them. You should find extensive documentation here on how to proceed.\n\nYou will find a simple, trivial script named `cobolt.py` to change the power of a Cobolt laser. There are three versions, you should read all three examples :\n\n1. `1-simple`: a very trivial implementation with simple commands in sequence\n2. `2-class`: a class implementation of `CoboltLaser` that partially encapsulates the details and exposes a few functions: `setPower()` and `power()`\n3. `3-class+debugPort`: a class implementation with a debug port that mimicks the real device\n4. The main part of the code has a `CoboltDevice` that supports `turnOn()` `turnOff()`, `setPower()` and `power()`\n\nThis is just a very simple example with a laser that probably few people have access to, but should give a general idea.\n\n### Strategy\n\nHow does one go about supporting a new device? What is the best strategy?\n\n1. Obtain the manual.  Look for connectivity information (typically, search for `ASCII` or `serial` in the text). You will find information such as \"baud rate, stop bits, hardware handshake\" and most importantly \"ASCII or binary commands\". This is what you need.\n\n   1. If you can't get the manual from the web site, contact the company.  As mentionned above, many will gladly help you: they usually want to sell devices or satisfy customers who did buy them.\n   \n2. Connect to the device, one way or another.\n\n   1. If necessary, a driver may need to be installed to serialize the device (to make it appear as a serial port). In this case, you would use the `SerialPort` class after having installed that driver. \n      1. Not all devices can appear as a \"serial port\".  Simple devices (e.g. a translation stage) are fine because they simply read commands ('MOVE\") and reply (\"OK\").  However, others (camera, spectrometers) respond to commands and transmit data, sometime a lot of it and require many communication lines.  The USB standard provides that (with *endpoints*), but not the old-style serial port that essentially is just a two-way communication on a single channel. \n      2. Also, for a device to appear as a serial port, the manufacturer needs to provide a certain amount of information in the USB descriptor of the device. If they don't, you are out of luck.\n   2. If standard serial ports are not available, direct USB access may be needed with `libusb` and `PyUSB`.  This is the most elegant solution, but requires some knowledge of USB.  `PyHardwareLibrary` makes use of `PyUSB` extensively, and `USBPort` simplifies communication.\n   3. Figure out (ideally through testing, see next point) how to connect with `SerialPort` or `USBPort`, both derived classes from `CommunicationPort`\n\n3. Identify commands and write very simple tests with `SerialPort`  to confirm connectivity and validate command syntax (see the other [section](#Testing-serial-ports) below for more details):\n\n   ```python\n       class TestCoboltSerialPort(unittest.TestCase):\n   \t\t\t\tdef testLaserOn(self):\n   \t\t\t\t\tself.port = SerialPort(\"COM5\") # Are settings right? Baud rate, stop bits, etc...\n   \t\t\t\t\tself.port.writeStringExpectMatchingString('l1\\r',replyPattern='OK')\n   \n   ```\n\n4. Create a `DebugSerialPort`, based on `CommunicationPort`  replicating the behaviour of `SerialPort()` to mimic a real serial port.  See `CoboltDebugSerial` for an example.\n\n5. Complete *serial* tests that will test both the real port and the debug port. Both must behave identicially.\n\n6. *This part is not fully implemented yet:* Start wrapping the complex serial communication inside a `PhysicalDevice`-derivative (e.g., `LaserSourceDevice`, `LinearMotionDevice`, etc…). For an example, see `CoboltDevice` which derives from `LaserSourceDevice`.  For more details on the strategy for `PhysicalDevice`, see the section : `PhysicalDevice` implementation.\n\n7. Write a series of device tests.  For examples, see `testCoboltDevice`.\n\n8. In your device, you must be able to use your `DebugSerialPort`.  That way, the `testCoboltDevice` can run both on a real device and a debug device.\n\n9. When all tests pass (`Port`, `DebugPort`, `Device`, `DebugDevice`), you are done\n\n### Testing serial ports\n\nWhen testing serial ports, we want to test both the real connection to a given device and a mock implementation (*e.g,* `DebugPort`) that behaves like it.  Hence, we want to run a series of tests on each port. The best strategy to run a series of tests on two different instances is the following:\n\n1. Create a `BaseTestCases` class that does not inherit from `unittest.TestCase`, with an internal class that does inherit from `unittest.TestCases`:\n\n   ```python\n   class BaseTestCases:\n\n      class TestCoboltSerialPort(unittest.TestCase):\n         self.port = None\n\n         ...\n   ```\n\n\n2. Declare variables that are useful for the test (`self.port` for instance).\n\n3. Do not define `setUp()` or `tearDown()`\n\n4. Populate the class with all test methods you need, with names that start with `test*`:\n   ```python\n   class BaseTestCases:\n   \n    class TestCoboltSerialPort(unittest.TestCase):\n        port = None\n   \n        def testCreate(self):\n            self.assertIsNotNone(self.port)\n   \n        def testCantReopen(self):\n            self.assertTrue(self.port.isOpen)\n            with self.assertRaises(Exception) as context:\n                self.port.open()\n        ...\n   ```\n\n5. In the same file, define two test subclasses that inherit from `BaseTestCases` with `setUp()` and `tearDown()` mehods that are specific to either the real port or debug port. They will therefore inherit all the methods from the parent class `BaseTestCases` and have all test methods.\n\n   ```python\n   class TestDebugCoboltSerialPort(BaseTestCases.TestCoboltSerialPort):\n       def setUp(self):\n          self.port = CommunicationPort(port=CoboltDebugSerial())\n          self.assertIsNotNone(self.port)\n          self.port.open()\n   \n       def tearDown(self):\n          self.port.close()\n   \n   class TestRealCoboltSerialPort(BaseTestCases.TestCoboltSerialPort):\n      def setUp(self):\n          try:\n                self.port = CommunicationPort(port=\"COM5\")\n                self.port.open()\n          except:\n                raise unittest.SkipTest(\"No cobolt serial port at COM5\")\n      def tearDown(self):\n          self.port.close()\n   ```\n\n6. If you have test methods that are specific to a given port, then define them in the specific class.\n\n7. Add the following at the end of the file:\n\n   ```python\n   if __name__ == '__main__':\n       unittest.main()\n   ```\n\n8. By running the tests in this file with `python testCoboltSerial.py`, the unittest framework will automatically run all tests from both `TestDebugCoboltSerialPort` and `TestRealCoboltSerialPort`.  Of course, both should pass all tests for success.\n\n9. This strategy can be reused to test a `Device` and its `DebugDevice` counterpart.\n\n\n\n## Design goals\n\n*This part is not fully implemented yet in this library, but was implemented in a separate project.*\n\nCommunicating with the device through serial ports is the first step.  However, most of the time, we care about some tasks we want to do with the device (turn on and use laser, acquire spectrum from spectrometer, etc...).  Therefore, after having figured out what the commands are and how the device responds, it is important to \"wrap\" or encapsulate all of those commands inside a class (or object) that represents the device to the end-user and make it easy to use without having to know the details. `PyHardwareLibrary` uses a base class called `PhysicalDevice` \n\nA real physical device is not simple to handle: errors can occur at any time (because of the device itself), because the user did not connect it or did not turn it on, because the device is in an irregular  state (e.g., it reached the end of the travel range for instance).  Hence, it becomes important to handle errors gracefully but especially robustly.\n\nThe strategy used by the present library is the following:\n\n1. Many properties of devices are common: the have a USB vendor ID, a product ID, a serial number etc…  This is included in a parent class called `PhysicalDevice` that is the parent to all devices.\n2. Many methods are also common: all devices must be initialized, shutdown, etc… These methods are defined in the parent class, but call the device-specific method of the derived class. For instance, `initializeDevice()` does a bit of housekeeping (is the device already initialized? was the underlying initializing successful?) and calls `doInitializeDevice` that must be implemented by the derived class. If initialization fails, it must raise an error. The class must confirm the device responds to at least one internal command to confirm it is indeed the expected device.\n3. For specific classes of devices (e.g., `LaserSourceDevice`), specific methods are used to hide the details of the implementation: `LaserSourceDevice.turnOn()`, `LaserSourceDevice.power()`, `LaserSourceDevice.setPower()`, etc… These methods call device-specific methods with similar names (prefixed by `do`) in the derived class (e.g., `doTurnOn()`)\n4. Methods that start with `do` *will communicate* with the device through the serial port.  They must store the result of the request into an instance variable (to cache the value and to avoid to go back to the serial port each time the value is needed). For instance, an instance `self.power` stores the result obtained from `doGetPower()`.\n5. `do` methods are *never* called by users.  Users call the `turnOn()` method but not the `doTurnOn()` method. If Python as a language allowed it, the `do` methods would be hidden and private, but it does not look possible: the only convention is to use `_do` but it is only a convention, functions can still be called.\n\n\n\n## Motivation\n\nI must also vent my frustration that end-user software from the manufacturers is often abysmaIly-designed, buggy and/or simply frustrating to use but most of the time, all of the above. I have even seen example code from companies that simply does not even compile. Others will only support Windows 7, and even say it with a straight face in 2021 like it's totally normal. On top of that, many companies will claim (erroneously) that their hardware cannot run on macOS, my platform of choice.  This is usually because of shear laziness or straight out incompetence: as long as it can connect to the computer, it can be supported.  For USB devices, it is often **trivial** to write a \"driver\" to support a device with appropriate documentation, and I have done it on numerous occasions. The rule of thumb is that the companies that have good software say, on Windows, usually have good software on many platforms, as they obviously understand how to program and undertand the simplicity of writing cross-platform code if you make it a design requirement. On the other hand, I have found that lack of support for platforms other than Windows usually translates in fairly crappy software on Windows anyway: these companies tend to be hardware companies that consider software only secondary and probably farm it out.  Shout out to ActiveSilicon, Sutter Instruments, Hamamatsu, Ocean Insight (for their documentation but certainly not for their software), and Thorlabs for being friendly to developers: they provide all the necessary information upon request and are of great help to scientists. On the other hand, here is a middle finger🖕 to many other companies I will not name here, but many camera providers come to mind (some located near *Princeton* University) as well as a prominent company that rhymes with *ationalinstruments* that wins the grand prize for its uselessness and overall incompetence at providing anything useful in software to their end users for the last 20 years despite producing great hardware (somebody should also let them know that more than 12 pixels can be used to draw icons because this <img src=\"README.assets/automation.png\" alt=\"automation\" style=\"zoom:200%;\" /> with a big red x in it apparently represents \"automation\" and this <img src=\"README.assets/Am.png\" alt=\"Am\" style=\"zoom:200%;\" /> is \"amplitude modulation\". It would be funny if it wasn't so sad).\n\n## Contact\n\nProf. Daniel Côté, Ph.D. and P.Eng, dccote@cervo.ulaval.ca\n\nGroup web site: http://www.dcclab.ca\n\nYoutube channel: http://www.youtube.com/user/dccote\n\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/DCC-Lab/PyHardwareLibrary",
    "keywords": "hardware devices usb communication app control spectrometer powermeter camera",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "hardwarelibrary",
    "package_url": "https://pypi.org/project/hardwarelibrary/",
    "platform": null,
    "project_url": "https://pypi.org/project/hardwarelibrary/",
    "project_urls": {
      "Homepage": "https://github.com/DCC-Lab/PyHardwareLibrary"
    },
    "release_url": "https://pypi.org/project/hardwarelibrary/1.0.3/",
    "requires_dist": [
      "numpy",
      "matplotlib",
      "PySerial",
      "PyUSB",
      "pyftdi",
      "LabJackPython"
    ],
    "requires_python": ">=3.7",
    "summary": "Cross-platform (macOS, Windows, Linux, etc...) library to control various hardware devices mostly for scientific applications.",
    "version": "1.0.3",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 14292276,
  "releases": {
    "0.9.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "284a97fa94680c11aafc953393f8510872620a2b4854498e369b6908e81c79b2",
          "md5": "a8ba7330b127b831e18de986d6be5a01",
          "sha256": "30b0ee7e7d345f98896da4fbda0c795a507537505abd9a39322665dd68cc8c00"
        },
        "downloads": -1,
        "filename": "hardwarelibrary-0.9.3-py2-none-any.whl",
        "has_sig": false,
        "md5_digest": "a8ba7330b127b831e18de986d6be5a01",
        "packagetype": "bdist_wheel",
        "python_version": "py2",
        "requires_python": ">=3.7",
        "size": 113768,
        "upload_time": "2021-06-18T17:52:43",
        "upload_time_iso_8601": "2021-06-18T17:52:43.872156Z",
        "url": "https://files.pythonhosted.org/packages/28/4a/97fa94680c11aafc953393f8510872620a2b4854498e369b6908e81c79b2/hardwarelibrary-0.9.3-py2-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "50d6c86dd2db8deb0d7bcca08c9ff9d7783337862047f6a9ef4dc78c56f09674",
          "md5": "b1d8eefa2c6640ab95d23ccce19c694a",
          "sha256": "28b45cd017384f2cf0565c07d2e697763a815b6dfbed8b1b377aaae2a5d5e72d"
        },
        "downloads": -1,
        "filename": "hardwarelibrary-0.9.3.tar.gz",
        "has_sig": false,
        "md5_digest": "b1d8eefa2c6640ab95d23ccce19c694a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 103420,
        "upload_time": "2021-06-18T17:52:45",
        "upload_time_iso_8601": "2021-06-18T17:52:45.828348Z",
        "url": "https://files.pythonhosted.org/packages/50/d6/c86dd2db8deb0d7bcca08c9ff9d7783337862047f6a9ef4dc78c56f09674/hardwarelibrary-0.9.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.9.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "678fb0225dba7cf5d32a2e973a04b5b5e2b005dc50a72e7b7f567d13f7ac2658",
          "md5": "14ab6eeb90c6950784e9ea00173a5919",
          "sha256": "e8e677e092838c6a78c5273d918400ed449b67d0b625c5216cb4532854e20fdc"
        },
        "downloads": -1,
        "filename": "hardwarelibrary-0.9.4-py2-none-any.whl",
        "has_sig": false,
        "md5_digest": "14ab6eeb90c6950784e9ea00173a5919",
        "packagetype": "bdist_wheel",
        "python_version": "py2",
        "requires_python": ">=3.7",
        "size": 113768,
        "upload_time": "2021-06-18T19:02:59",
        "upload_time_iso_8601": "2021-06-18T19:02:59.276398Z",
        "url": "https://files.pythonhosted.org/packages/67/8f/b0225dba7cf5d32a2e973a04b5b5e2b005dc50a72e7b7f567d13f7ac2658/hardwarelibrary-0.9.4-py2-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e5e63cd25ea9d8ae02f78027613f9717b4cdafec302a0812496b2567ba86f4dd",
          "md5": "51d3d088899c5a17994093cc3c3453f3",
          "sha256": "f6dd7f925424ef9c6578216cef8d9e0e1d36984399a4f9d9629d0cfeb41fa3ab"
        },
        "downloads": -1,
        "filename": "hardwarelibrary-0.9.4.tar.gz",
        "has_sig": false,
        "md5_digest": "51d3d088899c5a17994093cc3c3453f3",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 103437,
        "upload_time": "2021-06-18T19:03:01",
        "upload_time_iso_8601": "2021-06-18T19:03:01.260633Z",
        "url": "https://files.pythonhosted.org/packages/e5/e6/3cd25ea9d8ae02f78027613f9717b4cdafec302a0812496b2567ba86f4dd/hardwarelibrary-0.9.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.9.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a75a3aadd8213ac309c2d394539d65819879806f3ffcd74b1999ee1d63f1f214",
          "md5": "be3dfbc67878b2ddb56208e9a6c52999",
          "sha256": "fb9e9b58f9ecd47af208d0a5e36796e22b4f42bc1eb8ba9fd932a50f7d40f322"
        },
        "downloads": -1,
        "filename": "hardwarelibrary-0.9.5-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "be3dfbc67878b2ddb56208e9a6c52999",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 117336,
        "upload_time": "2021-07-28T21:49:09",
        "upload_time_iso_8601": "2021-07-28T21:49:09.859916Z",
        "url": "https://files.pythonhosted.org/packages/a7/5a/3aadd8213ac309c2d394539d65819879806f3ffcd74b1999ee1d63f1f214/hardwarelibrary-0.9.5-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7676ac357749123efb5bd382fe3a67544fad1fe7b669688636f5167c542a59fb",
          "md5": "89edb7929105bd42a30c54ebaf6aa793",
          "sha256": "7136a03d0235674e0d21fcecfbd9f21366b006846c22c78b8c5085a8da6c9d58"
        },
        "downloads": -1,
        "filename": "hardwarelibrary-0.9.5.tar.gz",
        "has_sig": false,
        "md5_digest": "89edb7929105bd42a30c54ebaf6aa793",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 100155,
        "upload_time": "2021-07-28T21:49:11",
        "upload_time_iso_8601": "2021-07-28T21:49:11.748653Z",
        "url": "https://files.pythonhosted.org/packages/76/76/ac357749123efb5bd382fe3a67544fad1fe7b669688636f5167c542a59fb/hardwarelibrary-0.9.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.9.7": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1ae2d95b8563e976e57ec7eca8a4d7f7a9698e8d5ea8ecce8c04eab88b57c2a2",
          "md5": "6be0652d6e839c0e4de0483f079c17b1",
          "sha256": "ec8875ff3fbe6d68477456bec09f2fdbf03dd71f2e0118282d446a2daa9bbe02"
        },
        "downloads": -1,
        "filename": "hardwarelibrary-0.9.7-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "6be0652d6e839c0e4de0483f079c17b1",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 119098,
        "upload_time": "2021-10-04T02:26:28",
        "upload_time_iso_8601": "2021-10-04T02:26:28.458981Z",
        "url": "https://files.pythonhosted.org/packages/1a/e2/d95b8563e976e57ec7eca8a4d7f7a9698e8d5ea8ecce8c04eab88b57c2a2/hardwarelibrary-0.9.7-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f484f8067373c2488f70f29970ba3b77cde0b3578a16f4d10740a14815a9d1fb",
          "md5": "2a6885e8609137b427223a982539e20f",
          "sha256": "39e8e34b4338201a2b923c3e77def5664202da61ac0410f28779472eef40f125"
        },
        "downloads": -1,
        "filename": "hardwarelibrary-0.9.7.tar.gz",
        "has_sig": false,
        "md5_digest": "2a6885e8609137b427223a982539e20f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 104269,
        "upload_time": "2021-10-04T02:26:30",
        "upload_time_iso_8601": "2021-10-04T02:26:30.524226Z",
        "url": "https://files.pythonhosted.org/packages/f4/84/f8067373c2488f70f29970ba3b77cde0b3578a16f4d10740a14815a9d1fb/hardwarelibrary-0.9.7.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.9.8": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b358060a8cd875232b74d3cc955058d7f8b30b058f60bce642de179f66557301",
          "md5": "19f425c677c573a1be436be8adae8f4b",
          "sha256": "4193baa7097261656ca88b499c1846da64227c74459c5ca1f403a51197b2e9c9"
        },
        "downloads": -1,
        "filename": "hardwarelibrary-0.9.8-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "19f425c677c573a1be436be8adae8f4b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 119267,
        "upload_time": "2021-10-04T04:11:08",
        "upload_time_iso_8601": "2021-10-04T04:11:08.487279Z",
        "url": "https://files.pythonhosted.org/packages/b3/58/060a8cd875232b74d3cc955058d7f8b30b058f60bce642de179f66557301/hardwarelibrary-0.9.8-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "892b917337d1a4241614cb8c93c7aebd5f6707f4a023b2d2ac58c4ee694b0f69",
          "md5": "eb70b4f04799fffd3f864269d7c0c8aa",
          "sha256": "19057f11f97049ced969aa24057b6fde0297127d0b566ba7a0e562ce67ea72c3"
        },
        "downloads": -1,
        "filename": "hardwarelibrary-0.9.8.tar.gz",
        "has_sig": false,
        "md5_digest": "eb70b4f04799fffd3f864269d7c0c8aa",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 104467,
        "upload_time": "2021-10-04T04:11:10",
        "upload_time_iso_8601": "2021-10-04T04:11:10.656339Z",
        "url": "https://files.pythonhosted.org/packages/89/2b/917337d1a4241614cb8c93c7aebd5f6707f4a023b2d2ac58c4ee694b0f69/hardwarelibrary-0.9.8.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "71dd23cd0802db385814a6073880cda91eb84a49ea52d8e1448028c58867487f",
          "md5": "c4deffa0fe95f1e6f381390202ef539a",
          "sha256": "7a36a549b0e8aef740719d46f7b76139c83a7181e626fa0181315934da94d800"
        },
        "downloads": -1,
        "filename": "hardwarelibrary-1.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "c4deffa0fe95f1e6f381390202ef539a",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 131409,
        "upload_time": "2022-06-22T03:42:29",
        "upload_time_iso_8601": "2022-06-22T03:42:29.192819Z",
        "url": "https://files.pythonhosted.org/packages/71/dd/23cd0802db385814a6073880cda91eb84a49ea52d8e1448028c58867487f/hardwarelibrary-1.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4dd156bb2f07a609beb8161bdb1e26a14dda83eb6d3bcda2b5372fed8253983c",
          "md5": "c19067a39c51a6f6a098fea282f8c5e7",
          "sha256": "909a59b7cbc81b6a7a3a6a10048fa6cd11a941f7eaa650c39a7b8646266925af"
        },
        "downloads": -1,
        "filename": "hardwarelibrary-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "c19067a39c51a6f6a098fea282f8c5e7",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 113408,
        "upload_time": "2022-06-22T03:42:31",
        "upload_time_iso_8601": "2022-06-22T03:42:31.549075Z",
        "url": "https://files.pythonhosted.org/packages/4d/d1/56bb2f07a609beb8161bdb1e26a14dda83eb6d3bcda2b5372fed8253983c/hardwarelibrary-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ee54299510486e8a82c9de3990da9872559a5106e5b60b362f98129b1cf7dadb",
          "md5": "f236a17e8f7a82eb87111bee7019c9d3",
          "sha256": "bde079778ac4e236e7f4e11e6be2dd61df2299901e8857cea9768e4908822785"
        },
        "downloads": -1,
        "filename": "hardwarelibrary-1.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "f236a17e8f7a82eb87111bee7019c9d3",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 133293,
        "upload_time": "2022-06-27T20:11:30",
        "upload_time_iso_8601": "2022-06-27T20:11:30.695126Z",
        "url": "https://files.pythonhosted.org/packages/ee/54/299510486e8a82c9de3990da9872559a5106e5b60b362f98129b1cf7dadb/hardwarelibrary-1.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2689b7974595ef244448f068d29a3096af9203c39871d7f62c15b94a4eecd7d9",
          "md5": "103d5ee0beeccc699a5f0ed989f10b8f",
          "sha256": "48f7f8dca8f8b0d99ed6ab293d82459eef702b308681d3da1d9135ea83deb49e"
        },
        "downloads": -1,
        "filename": "hardwarelibrary-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "103d5ee0beeccc699a5f0ed989f10b8f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 114955,
        "upload_time": "2022-06-27T20:11:32",
        "upload_time_iso_8601": "2022-06-27T20:11:32.912830Z",
        "url": "https://files.pythonhosted.org/packages/26/89/b7974595ef244448f068d29a3096af9203c39871d7f62c15b94a4eecd7d9/hardwarelibrary-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2b9b75e7bf74fb1ef8913824f5dcf461d3087a95d001a811123c04aa0017a92d",
          "md5": "04c086fcf51d39265adef371c17034fa",
          "sha256": "2726b5cf24b130632e7e7b2c69957a71a494400c935eb0e75ba893a0ce5f4156"
        },
        "downloads": -1,
        "filename": "hardwarelibrary-1.0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "04c086fcf51d39265adef371c17034fa",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 133599,
        "upload_time": "2022-06-27T20:17:36",
        "upload_time_iso_8601": "2022-06-27T20:17:36.516435Z",
        "url": "https://files.pythonhosted.org/packages/2b/9b/75e7bf74fb1ef8913824f5dcf461d3087a95d001a811123c04aa0017a92d/hardwarelibrary-1.0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ef26f1988e99f5b65ef662a6ee17bdab8be43053825a84fa50fb6cfc843116d7",
          "md5": "17bf0a8e39c3d3981727ff269bf4dd68",
          "sha256": "53e3f7c3629c429367117546335576538972c2eeb268b631bd046aaf464bc7ae"
        },
        "downloads": -1,
        "filename": "hardwarelibrary-1.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "17bf0a8e39c3d3981727ff269bf4dd68",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 120977,
        "upload_time": "2022-06-27T20:17:38",
        "upload_time_iso_8601": "2022-06-27T20:17:38.205158Z",
        "url": "https://files.pythonhosted.org/packages/ef/26/f1988e99f5b65ef662a6ee17bdab8be43053825a84fa50fb6cfc843116d7/hardwarelibrary-1.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "75711d9a80beed2c4e4e93ae403c5bfa00a213d5c6ca6144a7188d56e0c170c2",
          "md5": "03bf049423fd10f5673496caa80f3c12",
          "sha256": "54f55f61448d71b81b056b555636433d0fbee2b5334f34121280be1c7dba91e9"
        },
        "downloads": -1,
        "filename": "hardwarelibrary-1.0.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "03bf049423fd10f5673496caa80f3c12",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 145702,
        "upload_time": "2022-06-30T05:33:01",
        "upload_time_iso_8601": "2022-06-30T05:33:01.962756Z",
        "url": "https://files.pythonhosted.org/packages/75/71/1d9a80beed2c4e4e93ae403c5bfa00a213d5c6ca6144a7188d56e0c170c2/hardwarelibrary-1.0.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0b005462e7689ba6274e87ad64b4ccd5e62accacaaf07e404006c1917184099d",
          "md5": "1b47b2f68a67f576aeee195ab9ec7779",
          "sha256": "bc309eef506dc80d6e72ee7b5fef290b25fbd34ce2317319b3f30a4ff461aa10"
        },
        "downloads": -1,
        "filename": "hardwarelibrary-1.0.3.tar.gz",
        "has_sig": false,
        "md5_digest": "1b47b2f68a67f576aeee195ab9ec7779",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 134334,
        "upload_time": "2022-06-30T05:33:04",
        "upload_time_iso_8601": "2022-06-30T05:33:04.255081Z",
        "url": "https://files.pythonhosted.org/packages/0b/00/5462e7689ba6274e87ad64b4ccd5e62accacaaf07e404006c1917184099d/hardwarelibrary-1.0.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "75711d9a80beed2c4e4e93ae403c5bfa00a213d5c6ca6144a7188d56e0c170c2",
        "md5": "03bf049423fd10f5673496caa80f3c12",
        "sha256": "54f55f61448d71b81b056b555636433d0fbee2b5334f34121280be1c7dba91e9"
      },
      "downloads": -1,
      "filename": "hardwarelibrary-1.0.3-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "03bf049423fd10f5673496caa80f3c12",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.7",
      "size": 145702,
      "upload_time": "2022-06-30T05:33:01",
      "upload_time_iso_8601": "2022-06-30T05:33:01.962756Z",
      "url": "https://files.pythonhosted.org/packages/75/71/1d9a80beed2c4e4e93ae403c5bfa00a213d5c6ca6144a7188d56e0c170c2/hardwarelibrary-1.0.3-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "0b005462e7689ba6274e87ad64b4ccd5e62accacaaf07e404006c1917184099d",
        "md5": "1b47b2f68a67f576aeee195ab9ec7779",
        "sha256": "bc309eef506dc80d6e72ee7b5fef290b25fbd34ce2317319b3f30a4ff461aa10"
      },
      "downloads": -1,
      "filename": "hardwarelibrary-1.0.3.tar.gz",
      "has_sig": false,
      "md5_digest": "1b47b2f68a67f576aeee195ab9ec7779",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7",
      "size": 134334,
      "upload_time": "2022-06-30T05:33:04",
      "upload_time_iso_8601": "2022-06-30T05:33:04.255081Z",
      "url": "https://files.pythonhosted.org/packages/0b/00/5462e7689ba6274e87ad64b4ccd5e62accacaaf07e404006c1917184099d/hardwarelibrary-1.0.3.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}