{
  "info": {
    "author": "Liam Nestelroad",
    "author_email": "nestelroadliam@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# Hermes\n\n\n<!-- <img src=\"images/IMG_6857.jpg\" style=\"display: block;\n  margin-left: auto;\n  margin-right: auto;\n  width: 50%;\">   -->\n\n+ Status: draft\n+ Editor: Liam Nestelroad nestelroadliam@gmail.com\n+ Contributors:\n\n## Summary\n---\n\nThe Distributive Broker Protocol (DBP) defines a set of reliable core services to govern communication across a pool of nodes. DBP covers discovery, monitoring, network bridging, last value caching, and logging aggregation.\n\n## Installation\n---\n\nTo run this project, it is recommended that you use a python virtual environment. You will first need to install the appropriate Python modules with the provided requirement.txt file using the following command:\n```bash\npython3 -m venv env\nsource env/bin/activate\npip3 install -r requirements.txt\n```\nThe following modules will be installed. In reality you will only need `pyzmq`, but the others will be used for monitoring and visualizing metrics.\n+ pyzmq==22.0.2 for message sending\n+ matplotlib==3.3.3 for reports\n<!-- + ipykernel==5.4.3 -->\n+ tqdm==4.56.0 for testing progress\n\n<!-- ### Optional Jupyter Notebook -->\n\n<!-- TODO: Give directions for Jupyter Notebook Set up -->\n\n## Usage\n---\n\n<!-- TODO: Give directions for usage after project code is finished. -->\nRun the `main.py` file for a simulated test with the following command:\n\n```bash\npython3 main.py\n```\n\noptionally, you can run the `Broker.py`, `Client.py`, and `Service.py` individually in separate terminals (or different machines) to simulate a message bus. \n\n## Language\n---\n\nThe key words “MUST”, “MUST NOT”, “REQUIRED”, “SHALL”, “SHALL NOT”, “SHOULD”, “SHOULD NOT”, “RECOMMENDED”, “MAY”, and “OPTIONAL” in this document are to be interpreted as described in RFC 2119 (see [“Key words for use in RFCs to Indicate Requirement Levels\"](http://tools.ietf.org/html/rfc2119)).\n\n## Goals\n\n\n\n## Architecture Overview\n---\n\nWhen I say \"decentralized\" in this document, what I am really saying is pseudo-decentralized. This is because while there is still going to be a main node which everything has to first go though, once the information is returned, the connections between the services and clients go off the bus and talk amongst themselves. There are a few concerns regarding this setup as it makes for a much looser environment and harder to keep track of, but using the zmq monitoring and distributed logging concepts, I will try and show that these can be overcome. Refer to the following diagram for further clarification:\n\n<img src=\"images/LMB_architecture-Functional Interconnect.png\" width=\"900px\" style=\"display: block;\n  margin-left: auto;\n  margin-right: auto;\n  width: 100%;\">\n\n### The Core Catalog Service \n---\n\nIn all maters of speaking, this IS the message bus. Everything will be going through this component before its allowed to interact with anything else. New nodes that want to publish or provide services will be required to register with the CCS so that people/processes can find its IP address and port. As for providing the location of the CCS itself, a beacon will be attached so anyone who knows what to listen for can find it (more on that later).\n\nThe CCS will also \"house\" the other core components either by including their logic in its event loop or by having them persistently attached. Refer to the following diagram for further clarification:\n\n<img src=\"images/LMB_architecture-Core Catalog Service.png\" width=\"900px\" style=\"display: block;\n  margin-left: auto;\n  margin-right: auto;\n  width: 50%;\">\n\n#### Specifications\n---\n\nWe define 'client' applications as node that _request_ information from the broker and 'service' applications as nodes the _provide_ information to the broker. The DBP will consist of a few sub-protocols:\n\n+ DBP/Info Request which covers how the Broker Node provides service info with client applications.\n+ DBP/Service Registration, which covers how services register with the broker node\n+ DBP/Heartbeats, which covers how heartbeat messages should be sent between services and the broker node\n\n**ROUTER Addressing**\n\nThe broker MUST use a ROUTER socket on port 5246 to accept requests from clients, and connections from Services. The broker MAY use a separate socket for each sub-protocol, or MAY use a single socket for each sub-protocols.\n\nKeep in mind, from the ØMQ Reference Manual:\n\n    When receiving messages a ROUTER socket shall prepend a message part containing the identity of the originating peer to the message before passing it to the application. When sending messages a ROUTER socket shall remove the first part of the message and use it to determine the identity of the peer the message shall be routed to.\n\n**DBP/Info Request**\n\nDBP/Info Request is a strictly synchronous dialog initiated by the client (where ‘C’ represents the client, and ‘B’ represents the broker):\n\n    Repeat:\n      C: REQUEST\n      B: REPLY\n      ...\n\nA **_REQUEST_** command consists of a multipart message of 4 or more frames, formatted on the wire as follows:\n\n    Frame 0: Empty (zero bytes, invisible to REQ application)\n    Frame 1: 'u_U' (3 bytes for info request command)\n    Frame 2: time (current epoch time)\n    Frame 3: Service(s) info request (printable string)\n\nA **_REPLY_** command consists of a multipart message of 5 or more frames, formatted on the wire as follows:\n\n    Frame 0: Message Reply Address (from request message header)\n    Frame 1: Empty (zero bytes, invisible to REQ application)\n    Frame 2: 'o_O' (3 bytes for info retrieval response)\n    Frame 3: time (current epoch time)\n    Frame 4: Information retrieval (serialized json object)\n\nClients SHOULD use a REQ socket when implementing a synchronous request-reply pattern. The REQ socket will silently create frame 0 for outgoing requests, and remove it for replies before passing them to the calling application. Clients MAY use a DEALER (XREQ) socket when implementing an asynchronous pattern. In that case the clients MUST create the empty frame 0 explicitly.\n\nThe information request is either a specified services name or a list of currently active services available. Information that is not available should be responded with by an inactive warning.\n\n**DBP/Service Registration**\n\nDBP/Service Registration is a strictly synchronous request-reply dialog, initiated by the service node. This is the synchronous dialog (where ‘S’ represents the service, and ‘B’ represents the broker node):\n\n    S: READY\n    Repeat:\n        B: REQUEST\n        S: REPLY\n        ...\n\nA **_REGISTRATION_** request consists of a multipart message of 4 frames, formatted on the wire as follows:\n\n    Frame 0: Empty frame\n    Frame 1: 'UwU' (3 byte, representing REGISTRATION)\n    Frame 2: time (current epoch time)\n    Frame 3+: Service information (serialized json object)\n\nService information shall consist of the services name, ip address, port, function, and heartbeat timing at a minimum.\n\nAn **_UPDATE_** request consists of a multipart message of 4 frames, formatted on the wire as follows:\n\n    Frame 0: Empty frame\n    Frame 1: 'UoU' (3 byte, representing config update)\n    Frame 2: time (current epoch time)\n    Frame 3+: Updated values (serialized json object)\n\nAn **_APPROVED_** reply consists of a multipart message of 6 or more frames, formatted on the wire as follows:\n\n    Frame 0: Empty frame\n    Frame 1: 'OwO' (3 byte, representing APPROVED)\n    Frame 2: time (current epoch time)\n    Frame 3+: Optional configuration changes \n\nAn **_DENIED_** reply consists of a multipart message of 3 or more frames for unauthorized or unregistered services, formatted on the wire as follows:\n\n    Frame 0: Empty frame\n    Frame 1: '(O_O)' (one byte, representing DENIED)\n    Frame 2: time (current epoch time)\n    Frame 3+: Reasons for denial\n\n**DBP/Heartbeats**\nDBP/Heartbeats are a zmq independent messaging schema that uses raw UDP sockets to broadcast from the broker node and send one off's from the services top the broker. In the event of a missing beat, heartbeats will switch over to reliable TCP connections via req/rep zmq sockets.\n\nThe asynchronous heartbeat dialog operates on the same sockets and works thus:\n\n    Repeat:                 Repeat:\n        S: HEARTBEAT            B: HEARTBEAT\n        ...                     ...\n    S: DISCONNECT           B: DISCONNECT\n\n\n\nA **_HEARTBEAT_** message consists of a multipart message of 3 frames, formatted on the wire as follows:\n\n    Frame 0: Empty frame\n    Frame 1: '<3' (two bytes, representing HEARTBEAT)\n    Frame 2: time (current epoch time)\n    Frame 3: Service name.\n\nA **_DISCONNECT_** command consists of a multipart message of 3 frames, formatted on the wire as follows:\n\n    Frame 0: Empty frame\n    Frame 1: '</3' (3 byte, representing DISCONNECT)\n    Frame 2: time (current epoch time)\n\nAn **AWK** command consists of a multipart message of 3 frames, formatted on the wire as follows:\n\n    Frame 0: Empty frame\n    Frame 1: 'u.u' (3 byte, representing DISCONNECT)\n    Frame 2: time (current epoch time)\n\nDBP/Service commands all start with an empty frame to allow consistent processing of client and Service frames in a broker, over a single socket. The empty frame has no other significance.\n\n**Opening and Closing a Connection**\n\n+ The service node is responsible for opening and closing a logical connection. One service node MUST connect to exactly one broker using a single ØMQ DEALER (XREQ) socket.\n\n+ Since ØMQ automatically reconnects peers after a failure, every DBP command includes the protocol header to allow proper validation of all messages that a peer receives.\n\n+ The service node opens the connection to the broker by creating a new socket, connecting it, and then sending a REGISTER command. The service node MUST NOT send a further READY.\n\n+ The service node MAY send DISCONNECT at any time, including before READY. When the broker receives DISCONNECT from a service node it MUST send no further commands to that service node.\n\n+ The broker MAY send DISCONNECT at any time, by definition after it has received at least one command from the service node.\n\n+ The broker MUST respond to any valid but unexpected command by sending DISCONNECT and then no further commands to that service node. The broker SHOULD respond to invalid messages by dropping them and treating that peer as invalid.\n\n+ When the service node receives DISCONNECT it must send no further commands to the broker; it MUST close its socket, and reconnect to the broker on a new socket. This mechanism allows service nodes to re-register after a broker failure and recovery.\n\n**Heartbeating**\n\n+ HEARTBEAT commands are valid at any time, after a READY command.\n\n+ Any received command except DISCONNECT acts as a heartbeat. Peers SHOULD NOT send HEARTBEAT commands while also sending other commands.\n\n+ Both broker and worker MUST send heartbeats at regular and agreed-upon intervals. A peer MUST consider the other peer “disconnected” if no heartbeat arrives within some multiple of that interval (usually 3-5).\n\n+ If the worker detects that the broker has disconnected, it SHOULD restart a new conversation.\n\n+ If the broker detects that the worked has disconnected, it SHOULD stop sending it messages of any type.\n\n**Reference Implementations**\n\nThe C99 Majordomo examples from Chapter 4 of the Guide (see “ØMQ - The Guide\") act as the prime reference implementation for MDP. There is a Python implementation of MDP by Guido Goldstein.\n\n### The Last Cached Value Service\n---\n\nAll services that publish will be subscribed by this component in order to cache the most recent message. This is so any new client can get an immediate update without having to wait (what could be minutes) for the next round.\n\n<img src=\"images/LMB_architecture-Last Cached Value Service.png\" width=\"900px\" style=\"display: block;\n  margin-left: auto;\n  margin-right: auto;\n  width: 50%;\">\n\n#### Specifications\n---\n\n### The Distributed Logging Aggregator Service\n---\n\nEach node on the bus will come include with a logging component as part of the base template. Logs will be generated on specific events (a list in which the user can also add to). Critical events and warning logs will need to be saved in order to determine faulty software occurrence. The log aggregator will be used to pull in all of those into the bus for future analysis. Everything else will be saved to the nodes internal system via the Syslog program.\n\n<img src=\"images/LMB_architecture-Log Aggregator.png\" width=\"900px\" style=\"display: block;\n  margin-left: auto;\n  margin-right: auto;\n  width: 50%;\">\n\n### The Network Proxy Bridge Service\n---\n\nOne of the main goals for this bus was to be able to generate a message at a higher network level and propagate it down to a lower listener (or vise versa). For obvious reasons, we do not want nodes talking directly to each other over the firewalls (kinda defeats the purpose) so all messages will be routed through the interconnected brokers. This is where the bus acts like a centralized brokering system. Refer to the following image for further clarification:\n\n<img src=\"images/LMB_architecture-Network Bridge.png\" style=\"display: block;\n  margin-left: auto;\n  margin-right: auto;\n  width: 50%;\">\n\n### The UDP Beaconing Service\n---\n\nIf the CCS provides location for every other node in the system, then who provides the location for the CCS? I'm glad you asked. The beaconing service will provide a UDP broadcast across the network with a dedicated tcp header (kinda) so for those who know what to listen for can find it. Thankfully, this will be prebuilt into the base node template so every LIAMb Node can find the bus (other wise LIAMb nodes would be kinda usless). Under the hood, these UDP broadcasts will also serve as heartbeats so beacons will also be able to utilize TCP in case the network gets hit with a lot of traffic.\n\n<img src=\"images/LMB_architecture-Beaconing Service.png\" width=\"900px\" style=\"display: block;\n  margin-left: auto;\n  margin-right: auto;\n  width: 50%;\">\n\n### The Distributed Monitoring Service\n---\n\nWhile the goal here is to have a distributed like system where nodes can go off and have their own conversation with out the help of the CCS or some other broker, sometimes its necessary to listen in on either for debugging or metric gathering purposes. For that reason, the bus will come with a socket monitoring service that will inform services/clients to open a monitoring port for it to connect to and watch upon request. \n\nAdditionally, I will be necessary for the bus to know the liveliness status of all services registered so the monitoring service will handel idle heartbeats (idle meaning when the service is not in use).\n\n<img src=\"images/LMB_architecture-Distributive Monitoring Service.png\" width=\"900px\" style=\"display: block;\n  margin-left: auto;\n  margin-right: auto;\n  width: 50%;\">\n\n## Specifications\n\nBecause there are going to be a lot of moving parts here in terms of implementation, it is going to be necessary to set up standards for bus components. This ranges from assigned port numbers, topic names, message formats, and sequencing.\n\n### Port Bindings\n\nAll LIAMb Nodes shall have each subsequently generated sockets bind to ports of incrementing values starting at 5246. In the case of broker type nodes, the following internal services shall use the designated schema:\n\n+ Beacon -> 5246\n+ Bus Interface -> 5247\n+ Monitor -> 5248\n+ Network Proxy -> 5249\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/lnestelroad/Hermes",
    "keywords": "",
    "license": "GPLv3+",
    "maintainer": "",
    "maintainer_email": "",
    "name": "Hermes-lnestelroad",
    "package_url": "https://pypi.org/project/Hermes-lnestelroad/",
    "platform": "",
    "project_url": "https://pypi.org/project/Hermes-lnestelroad/",
    "project_urls": {
      "Homepage": "https://github.com/lnestelroad/Hermes"
    },
    "release_url": "https://pypi.org/project/Hermes-lnestelroad/1.0.2/",
    "requires_dist": [
      "PyYAML",
      "netifaces",
      "pyzmq"
    ],
    "requires_python": "",
    "summary": "A python message bus architecture with zeromq",
    "version": "1.0.2",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 10080011,
  "releases": {
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3de9f59ebd18cc92902d4cbdba4c3f637c3e60db78a42c63345c699de9e9bb84",
          "md5": "1bc390cadf89f1a5987172662acad5c8",
          "sha256": "664611a7c1ed9ee6225d116f4c582ae713285204efba5c914298b5d76d7af0fc"
        },
        "downloads": -1,
        "filename": "Hermes_lnestelroad-1.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "1bc390cadf89f1a5987172662acad5c8",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 40006,
        "upload_time": "2021-04-16T00:03:55",
        "upload_time_iso_8601": "2021-04-16T00:03:55.964162Z",
        "url": "https://files.pythonhosted.org/packages/3d/e9/f59ebd18cc92902d4cbdba4c3f637c3e60db78a42c63345c699de9e9bb84/Hermes_lnestelroad-1.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2671ecefe7bb1b18c8569e926b8edfc118c54e0ee2b62a5ae9a15c1229ebdb30",
          "md5": "0408fbafd37b3f9596284b132551add7",
          "sha256": "f5128cb318cd1cade2ad94a1703a808df7c3cfcdec88687531ed5fb404773ba3"
        },
        "downloads": -1,
        "filename": "Hermes-lnestelroad-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "0408fbafd37b3f9596284b132551add7",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 22649,
        "upload_time": "2021-04-16T00:03:57",
        "upload_time_iso_8601": "2021-04-16T00:03:57.148019Z",
        "url": "https://files.pythonhosted.org/packages/26/71/ecefe7bb1b18c8569e926b8edfc118c54e0ee2b62a5ae9a15c1229ebdb30/Hermes-lnestelroad-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "fc6be12b5fbdb04e513291f927332b59ac4029f2b16419c6ae24c37ecc0fb7a6",
          "md5": "c74593012ecec93730d5ad3cc0cc7213",
          "sha256": "21c3b36cff2bd322746313d3e1e4a34f2c8c9de6981a405173f5ef92aae06f77"
        },
        "downloads": -1,
        "filename": "Hermes_lnestelroad-1.0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "c74593012ecec93730d5ad3cc0cc7213",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 40006,
        "upload_time": "2021-04-16T00:55:04",
        "upload_time_iso_8601": "2021-04-16T00:55:04.678460Z",
        "url": "https://files.pythonhosted.org/packages/fc/6b/e12b5fbdb04e513291f927332b59ac4029f2b16419c6ae24c37ecc0fb7a6/Hermes_lnestelroad-1.0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "abd0e8090efe32e53660a59b07b6379d04faaeb4c2bec8d1987ddb63db31af33",
          "md5": "65cceeac0476d67e385fd1852e0a0067",
          "sha256": "0deb79e16df65e55fd6e9bd0917830f3d3ff9a1068b0a5742afb63d61eac9bf1"
        },
        "downloads": -1,
        "filename": "Hermes-lnestelroad-1.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "65cceeac0476d67e385fd1852e0a0067",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 22675,
        "upload_time": "2021-04-16T00:55:05",
        "upload_time_iso_8601": "2021-04-16T00:55:05.615643Z",
        "url": "https://files.pythonhosted.org/packages/ab/d0/e8090efe32e53660a59b07b6379d04faaeb4c2bec8d1987ddb63db31af33/Hermes-lnestelroad-1.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "fc6be12b5fbdb04e513291f927332b59ac4029f2b16419c6ae24c37ecc0fb7a6",
        "md5": "c74593012ecec93730d5ad3cc0cc7213",
        "sha256": "21c3b36cff2bd322746313d3e1e4a34f2c8c9de6981a405173f5ef92aae06f77"
      },
      "downloads": -1,
      "filename": "Hermes_lnestelroad-1.0.2-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "c74593012ecec93730d5ad3cc0cc7213",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 40006,
      "upload_time": "2021-04-16T00:55:04",
      "upload_time_iso_8601": "2021-04-16T00:55:04.678460Z",
      "url": "https://files.pythonhosted.org/packages/fc/6b/e12b5fbdb04e513291f927332b59ac4029f2b16419c6ae24c37ecc0fb7a6/Hermes_lnestelroad-1.0.2-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "abd0e8090efe32e53660a59b07b6379d04faaeb4c2bec8d1987ddb63db31af33",
        "md5": "65cceeac0476d67e385fd1852e0a0067",
        "sha256": "0deb79e16df65e55fd6e9bd0917830f3d3ff9a1068b0a5742afb63d61eac9bf1"
      },
      "downloads": -1,
      "filename": "Hermes-lnestelroad-1.0.2.tar.gz",
      "has_sig": false,
      "md5_digest": "65cceeac0476d67e385fd1852e0a0067",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 22675,
      "upload_time": "2021-04-16T00:55:05",
      "upload_time_iso_8601": "2021-04-16T00:55:05.615643Z",
      "url": "https://files.pythonhosted.org/packages/ab/d0/e8090efe32e53660a59b07b6379d04faaeb4c2bec8d1987ddb63db31af33/Hermes-lnestelroad-1.0.2.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}