{
  "info": {
    "author": "Daniel Gratz",
    "author_email": "hund.1@osu.edu",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "# Automated Fibrosis Analysis Toolkit (AFAT)\n\n*This tool was documented in [our paper](http://doi.org/10.1016/j.mex.2019.11.028) on marcophage and fibrosis quantification*\n\n*Hundlab Website: [hundlab.org](http://hundlab.org/)*\n\n*PyPI: [pypi.org/project/hundlab-AFAT](https://pypi.org/project/hundlab-AFAT/)*\n\n*Github: [github.com/hundlab/MAT](https://github.com/hundlab/AFAT)*\n\n## Setup\n\n### Windows\n\n1. Python 3 will need to be installed prior to setting up AFAT, preferably any python\n    greater than 3.7. Python 3 can be downloaded from the [python website](http://python.org).\n    The x86-64 executable installer is reccommended, as the default install configuration \n    will set python to open .py files by double clicking. If it is installed correctly opening\n    cmd or powershell window and typing `py --version` will print the installed python\n    version.\n\n2.  Install AFAT by opening a cmd or powershell window and running\n    `py -m pip install hundlab-AFAT`, this should install AFAT and all of its dependancies.\n\n3.  Once AFAT has been installed it can be run via cmd, powershell or the start menu. To run\n     type `AutomatedFibrosisAnalysisToolkit.py`. To create a desktop shortcut type\n     `AutomatedFibrosisAnalysisToolkit.py` into the start menu select `Copy full path`, then on the \n     Desktop `right-click` -> `new` -> `new shortcut` and paste the path when it askes for a\n     path.\n\n     If AFAT does not run above as described this means that the python scipts directory has\n     not been added to the windows path. To find the install location of python type \n     `py -0p` this will give the location of the python executable. In the same directory\n     as python.exe, is a Scripts directory and the `AutomatedFibrosisAnalysisToolkit.py` will\n     be in there. Once the AFAT script has been found, a shortcut can be made to it directly\n     and placed on the desktop.\n\nAfter installation, the `ConfigureColorRules.py` tool can be run in the same manner as AFAT.\n\n*Note that it may take a few seconds for AFAT to start.*\n\n### Mac/Linux\n\n1. Python 3 will need to be installed prior to setting up AFAT. Python 3 can be \n    installed via your package manager in linux, or downloaded from python.org for mac.\n    If it is installed correctly opening a terminal and typing `python --version` (in some \n    distributions such as Ubuntu the command is `python3`) should start a python prompt. It \n    may also be necessary to install Tkinter. On unbuntu the package is `python3-tk`.\n\n2. Install AFAT using pip: `python -m pip install hundlab-AFAT`\n\n3. To run AFAT use the command `AutomatedFibrosisAnalysisToolkit.py`\n\nAfter installation, the `ConfigureColorRules.py` tool can be run in the same manner as AFAT.\n\n## Usage\n\n### Version 1.0 \n\nOur paper on AFAT and MAT outline the general usage instructions and processing steps that AFAT uses\nto quantify the fibrosis and tissue content in each image. This is still an excellent starting point\nfor anyone new to using AFAT. Further, see the changes and instructions below for version 2.0.\n\n### Version 2.0\n\nThere were two primary aims in updating AFAT:\n\n1. To reduce the memory usage of AFAT. This goal arose from the need to processes more detailed images\n   of large sections of tissue as our lab equipment has improved. AFAT now uses around 4Gb of RAM for\n   a 500Mb image (8bit color only).\n\n2. To make configuring AFAT more user friendly. To this aim we have added an easier to use interface\n   for running simulations that no longer requires editing python files. Further, we have added\n   a configuration tool, that allows the color profiles to be retuned to account for differences\n   between stainings, or changed entirely to allow for different types of staining altogether.\n\n### Automated Fibrosis Analysis Toolkit\n\n![Image AFAT configure and run](./images/AFAT_configure_run.PNG)\n\nThis is the new configuration panel to select all of the inputs needed for AFAT to run the analysis.\nFirst, using `Choose Images` select any images you want to be analyzed in one batch. No special per\nbatch processing is done, so the results will be equivalent if the images are run separately or in a\nbatch, however it is likely more convenient to configure the analysis once, and then run it on all the\nimages of interest. In regards to aim 1 of version 2.0, each image is loaded separately so that\nthe overall memory usage is minimized. Second, use `Choose Save File` to select an output csv file\nto contain all of the results from the analysis (pixel counts from each step and final percentage\nstain out of stain and tissue). I typically create a new folder and save the csv file in there, so\nthat all of the results of the simulation are together in one folder. The next button, \n`Choose Save Directory`, selects the directory where the image files showing the final color\nmask for tissue, stain, background and other/unclassified will be saved. In addition to the image\nfiles, new with version 2.0 the settings that were used (including the color profiles) will be saved\nin that directory as well.\n\nThe color rules file and settings files are the detailed configuration for each analysis. A new tool\nfor creating your own color rules file will be documented below. Using this file you can change the colors\nthat AFAT will detect as tissue, stain or background. When an analysis is run, the settings will be saved\n(including the color rules) in a `settings.yaml` file. These settings can then be used by a latter analysis\non new images, or to redo the analysis on existing images.\n\n*Note: There is some randomness in the analysis that may result in multiple runs of the same image yeilding\nslightly different results.*\n\nThe check boxes at the bottom allow for control over what is saved an shown to the user. `Show Images` is not\nchecked by default, as showing the diagnostic images from each analysis may use a large amount of memory, when\nthese images can be saved to be viewed latter.\n\n### Configure Color Rules\n\n![Image Configuration menu for color rules](./images/color_rules_configure.PNG)\n\nThis is the main configuration menu for customizing the color rules. The configuration uses the HSV colorspace with all values being between 0 and 255. More information on HSV can be found online, but briefly: H refers to\nhue, the color; S refers to saturation, the intensity of the color (0 being no color/gray, 255 being intense/rich color); and V is called value, which is also related to color intensity with 0 being black and 255 being intense/rich color. Together S and V define color vs white vs black vs gray. Initially the default rules are loaded\n. These rules may be changed and new values may be added by filling in both blanks in for H, S or V. Similarly,\nexisting rules may be removed by deleting the entries in both blanks. When making changes be sure to deselect\nthe number entry box for your change to be applied (this will also be reflected in a status update in the\nbottom left-hand corner of the window).\n\n![Image Configuration display for color rules](./images/color_rules_view.jpg)\n\nAn image may be loaded using the file menu on the main configuration window. The loaded image will show up in\nthis secondary viewing window with additional information about the color rules. First, the bottom left-hand\nstatus bar displays information on the pixel the mouse is hovering over. Specifically, in the green\nhighlighted section the HSV values are displayed as well as which category that pixel would be classified\nas (using only the color rules and not the full AFAT analysis). This can be helpful for examining the normal\nrange of colors that different sections of the image take on. It is not necessary that every pixel is\nclassified by the color rules, but rules should capture the majority of their intended targets without\ncapturing unintended targets. Sometimes it is not easy to create a rule that excludes all of the undesired\npixels, in which case it may be beneficial to crop or edit out parts of the image prior to analysis. \n\nIn the top right-hand icon bar, highlighted in red, are toggle buttons to show the boundaries of each section\ntype. These can be useful for finding regions of the image which were not categorized correctly. Note: once\ntoggled they may use up a relatively large amount of memory.\n\nOnce color rules have been defined, they may be saved using the file menu on the main configuration window.\n\n## Advanced Usage\n\nThis section details the two settings files used by AFAT: `settings.yaml` and `color_rules.yaml`. While these\ntwo files are show separately, they can be combined into the settings file.\n\n### Settings file\n\n```yaml\n###############################################################################\n# k neighbors classifier settings\n## this is the second pass which attempts to classify pixes missed in the first\n## pass into blue, red, or unidentifiable.\n\n#raw settings for KNeighborsClassifier\n#see https://scikit-learn.org/stable/modules/generated/sklearn.neighbors.KNeighborsClassifier.html#sklearn.neighbors.KNeighborsClassifier\nKNN:\n  raw:\n    n_neighbors: 5\n    n_jobs: -1\n\n# minimum fraction of neighbors with the same label needed to classify a pixel\n#default 1 or 100% of neighbors must be the same\n  min_consensus: 0.8\n\n\n# These settins control the maximum number of pixels to be used by KNN\n# so if there are more pixels in the image than max_pixels only max_pixel\n# number of pixels will be used\n  max_pixels: 10_000_000\n\n# The pixels are resampled so that there are fixed fractions of each group\n# the fraction of background to be used will be calcuated by \n# 1 - frac_stain - frac_tissue\n  frac_stain: 0.375\n  frac_tissue: 0.375\n\n\n###############################################################################\n# other settings\n\n# save mask images to a directory\nsave_images: True\n\n# show image plots\nshow_images: False\n\n# save settings yaml file with analysis\n# will be saved in the same location as the csv data file\nsave_settings: True\n###############################################################################\n```\n\nOf primary interest in the settings file is the KNN settings. The `raw` settings\nwill be passed directly to the KNN constructor and can configure most aspects\nof the classifier itself. At the moment, the two options specified are \n`n_neighbors` and `n_jobs`, which control the number of already classified pixels\nto be used to classify an unknown/other pixel and the number of threads KNN should\nuse, respectively. The `min consensus` setting specifies a threshold for the number\nof neighbors which must agree in order for the pixel to be classified. (Given that\nwe are using 5 neighbors the number of agreeing neighbors will be one of 1/5... 5/5).\nIf consensus is set to 0, then all unknown/other pixels will be classified based\none the plurality of their neighbors.\n\nThe `max_pixels` settings controls the maximum number of pixels to be used to train\nthe KNN. This is set to prevent AFAT from using excessive memory, or computational\ntime. If the total number of pixels in the image is less than `max_pixels` only that\nnumber of pixels will be used to train the KNN. The `frac_stain` and `frac_tissue`\ncontrol the fraction of training pixels which are from each group. White pixels make\nup the rest of the training group, frac_white = 1 - frac_stain - frac_tissue. This\nmeans that if there are not enough pixels from a particular group (usually this is\ntrue for the stain group) they will be resampled (duplicated) until enough pixels\nare available. Briefly, this is desirable as stain is often underrepresented and\nover sampling can help to ensure that unknown pixels have a change of being classified\nas stain.\n\n### Color Rules file\n\n```yaml\ncolor_rules:\n  background:\n    S:\n    - - 0\n      - 15\n    V:\n    - - 192\n      - 255\n  tissue:\n    H:\n    - - 199\n      - 255\n    - - 0\n      - 50\n    S:\n    - - 26\n      - 255\n  stain:\n    H:\n    - - 148\n      - 183\n    S:\n    - - 40\n      - 255\n    V:\n    - - 0\n      - 150\n\n```\n\nColor rules can be specified manually by editing the color rules file. Like when using\nthe configuration tool, they are specified using ranges in the HSV colorspace.",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/hundlab/MAT",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "hundlab-AFAT",
    "package_url": "https://pypi.org/project/hundlab-AFAT/",
    "platform": "",
    "project_url": "https://pypi.org/project/hundlab-AFAT/",
    "project_urls": {
      "Homepage": "https://github.com/hundlab/MAT"
    },
    "release_url": "https://pypi.org/project/hundlab-AFAT/2.0.0/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "Automated Fibrosis Analysis Toolkit: A tool to quantify the amount of fibrosis in Masson’s Trichrome stains",
    "version": "2.0.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 11926826,
  "releases": {
    "1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b52a3277db4f5e65d2a8fb80db8913c30b5e84b0d636a48e37994b9c252dc110",
          "md5": "7b66e0b1e2e93549a2276362df3d7e18",
          "sha256": "dd7397479397d48d667ebe04eadbd2942c46c055947191e11c36a7c75541400a"
        },
        "downloads": -1,
        "filename": "hundlab_AFAT-1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "7b66e0b1e2e93549a2276362df3d7e18",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 9353,
        "upload_time": "2021-09-30T21:37:04",
        "upload_time_iso_8601": "2021-09-30T21:37:04.009199Z",
        "url": "https://files.pythonhosted.org/packages/b5/2a/3277db4f5e65d2a8fb80db8913c30b5e84b0d636a48e37994b9c252dc110/hundlab_AFAT-1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "59c27965ce273d23f812173f2cddc435c5d539e212730583f56a50e6cab8733a",
          "md5": "fb046d7e78674c5e1df5bc598dfbfcc1",
          "sha256": "47f45828032465c892e0deabb8b0df88bbaa65ab85c1510d82542df403a3a53f"
        },
        "downloads": -1,
        "filename": "hundlab-AFAT-1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "fb046d7e78674c5e1df5bc598dfbfcc1",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 110806,
        "upload_time": "2021-09-30T21:37:06",
        "upload_time_iso_8601": "2021-09-30T21:37:06.936987Z",
        "url": "https://files.pythonhosted.org/packages/59/c2/7965ce273d23f812173f2cddc435c5d539e212730583f56a50e6cab8733a/hundlab-AFAT-1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e178b5b3fc8762cce0b3551a1f37de861babb96b25f1507b6f0aa8cf9a6c7e6a",
          "md5": "f4b5d3ebda2ec55e93efc45ae7b5b926",
          "sha256": "769f0a6eb7a5dcb858a8ef3627ae5b8ba7edf43561846dea47f2804084a62101"
        },
        "downloads": -1,
        "filename": "hundlab-AFAT-2.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "f4b5d3ebda2ec55e93efc45ae7b5b926",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 290713,
        "upload_time": "2021-11-01T22:17:54",
        "upload_time_iso_8601": "2021-11-01T22:17:54.500962Z",
        "url": "https://files.pythonhosted.org/packages/e1/78/b5b3fc8762cce0b3551a1f37de861babb96b25f1507b6f0aa8cf9a6c7e6a/hundlab-AFAT-2.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "e178b5b3fc8762cce0b3551a1f37de861babb96b25f1507b6f0aa8cf9a6c7e6a",
        "md5": "f4b5d3ebda2ec55e93efc45ae7b5b926",
        "sha256": "769f0a6eb7a5dcb858a8ef3627ae5b8ba7edf43561846dea47f2804084a62101"
      },
      "downloads": -1,
      "filename": "hundlab-AFAT-2.0.0.tar.gz",
      "has_sig": false,
      "md5_digest": "f4b5d3ebda2ec55e93efc45ae7b5b926",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 290713,
      "upload_time": "2021-11-01T22:17:54",
      "upload_time_iso_8601": "2021-11-01T22:17:54.500962Z",
      "url": "https://files.pythonhosted.org/packages/e1/78/b5b3fc8762cce0b3551a1f37de861babb96b25f1507b6f0aa8cf9a6c7e6a/hundlab-AFAT-2.0.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}