{
  "info": {
    "author": "Matthew Brady",
    "author_email": "w3matt@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: Apache Software License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# Synopsys Import Yocto Build Manifest - import_yocto_bm.py - v2.7\n\n# INTRODUCTION\nThis script is provided under an OSS license as an example of how to use the Black Duck APIs to import components from a Yocto project manifest.\n\nIt does not represent any extension of licensed functionality of Synopsys software itself and is provided as-is, without warranty or liability.\n\nIf you have comments or issues, please raise a GitHub issue here. Synopsys support is not able to respond to support tickets for this OSS utility.\n\n# OVERVIEW\n\nThe `import_yocto_bm.py` script is designed to import a Yocto project build manifest created by Bitbake. It replaces all previous scripts (including https://github.com/matthewb66/import_yocto_build_manifest).\n\nIt can be used as an alternative to the standard Yocto scan process for Black Duck provided within Synopsys Detect, and provides additional capabilities including checking recipes against the Black Duck KB, replacing recipe specifications where required and propagating locally patched CVEs to the Black Duck project.\n\nVersion 2.1 provides an optional wizard mode to request additional information where it is not provided (use --nowizard to disable this mode for batch operation).\n\n# YOCTO SCANNING IN BLACK DUCK USING SYNOPSYS DETECT\n\nThe default Yocto scan process for Black Duck is to determine Bitbake dependencies using Synopsys Detect (see [Synopsys Detect - scanning Yocto](https://community.synopsys.com/s/document-item?bundleId=integrations-detect&topicId=packagemgrs%2Fbitbake.html&_LANG=enus)).\n\nYou should NOT use Black Duck Signature scanning for whole Yocto projects (although Signature scanning is useful for custom recipes which may contain OSS which you want to identify). Signature scanning will not function accurately on Yocto projects because the code is modified locally by change/diff files and no reference copy of the changed code is available, meaning that Signature matching will not be able to determine the correct Yocto modified OSS components. Yocto projects are also very large and Signature scanning can consume large volumes of server resources without providing accurate matching.\n\nWhen used to scan a Yocto project, Synopsys Detect calls Bitbake to report the project layers and recipes, checking against the recipes reported at OpenEmbedded.org (refer to [layers.openembedded.org](http://layers.openembedded.org/) to identify layers and recipes which will be mapped) and creating a Black Duck project containing the mapped components. Recipes in layers not reported at OpenEmbedded.org will not be imported into Black Duck, and you should consider using other Black Duck scan techniques to identify OSS within specific custom recipes referenced in the build. Note also that moving original OSS recipes to new layers will also stop them being reported.\n\nThe resulting project will contain mapped recipes/layers including those used to create the image but which may not delivered in the built image. Recipe matching also requires that OSS components are used within standard recipes/revisions and within the original layer. If you copy a recipe to a new or different layer, it will not be matched in the Black Duck project by Synopsys Detect.\n\nTo perform a Yocto scan using Synopsys Detect:\n- Change to the poky folder of a Yocto project\n- Run Synopsys Detect adding the options `--detect.tools=DETECTOR --detect.bitbake.package.names=core-image-sato`  (where `core-image-sato` is the package name).\n- New bitbake options have been added in Synopsys Detect 7.9 including the ability to locate the manifest files and remove build dependencies ( for example `--detect.bitbake.dependency.types.excluded=BUILD` - see (here)[https://community.synopsys.com/s/document-item?bundleId=integrations-detect&topicId=properties%2Fdetectors%2Fbitbake.html] ).\n\n# WHY THIS SCRIPT\n\nThis script provides an alternative to scanning Yocto projects in Synopsys Detect.\n\nIt should be considered in the following scenarios:\n- Where many standard OpenEmbedded recipes have been moved to new layers (meaning they will not be matched by Synopsys Detect)\n- Where OpenEmbedded recipe versions or revisions have been modified from the original\n- Where a report is required for custom recipes so they can be scanned independently \n- The identification of locally patched CVEs is desired\n\nThe script operates on a built Yocto project, by identifying the build manifest containing __only the recipes which are within the built image__ as opposed to the superset of all recipes used to build the distribution (including build tools etc.) produced by Synopsys Detect by default. This script also optionally supports extracting a list of locally patched CVEs from Bitbake and marking them as patched in the Black Duck project.\n\nRecipes/layers are checked against the recipes maintained in the Black Duck KB which have been extracted from OpenEmbedded.org and those which match are added to the created Black Duck project.\n\nThe script should be executed on a Linux workstation where Yocto has been installed and after a successful Bitbake build.\n\nIf invoked in the Yocto build folder (or the build folder is manually specified using the -y option), then it will locate the license-manifest file automatically in the tmp/deploy hierarchy. Alternatively you can specify the license.manifest file as a script option or the default wizard mode will ask you to specify the file.\n\nIf the Bitbake build was performed with the Yocto `cve_check` class configured, then the script will also locate the CVE log exported by CVE check, extract patched CVEs and set the remediation status of matching CVEs in the Black Duck project.\n\nThe script requires access to the Black Duck server via the API (see Prerequisites below) unless the -o option is used to create the output scan file for manual upload.\n\n# OVERALL SCAN PROCESS USING IMPORT_YOCTO_BM\n\nUsing this script will allow standard OSS recipes to be imported to the Black Duck project. It will also identify where standard OSS recipes have been moved to new or different layers, and match close revisions or versions which exist in the Black Duck KB.\n\nThe proposed process to scan a Yocto project using this script is:\n\n1. Use the import_yocto_bm to identify original OSS recipes within the project and create a Black Duck project version.\n\n1. Add the `--report rep.txt` option to export a report of the matched recipes. This will include reports categorised as follows:\n\n- OK = recipe matched the Black Duck KB and will be included in the Black Duck project\n- REPLACED = recipe has been moved to a new layer and the script has referenced the original layer in the KB or the recipe was changed using a replacefile entry - will be included in the Black Duck project\n- REPLACED_NOREVISION = the script has replaced the revision to match the KB - will be included in project\n- REPLACED_NOLAYER+REVISION = recipe has been moved to a new layer with a new revision and the script has referenced the original layer and revision in the KB - will be included in the Black Duck project\n- NOTREPLACED_NOVERSION = the layer and recipe exist in the KB but the version does not - will not be included in the Black Duck project\n- NOTREPLACED_NOLAYER+VERSION = the recipe exists in the KB but the layer and version do not - will not be included in the Black Duck project\n- MISSING = recipe does not exist in the KB and will not be included in the Black Duck project\n- SKIPPED = recipe is not mapped in bblayers data (corrupt yocto project?) - skipped\n\n3. For the NOTREPLACED_NOVERSION and NOTREPLACED_NOLAYER+VERSION recipes, you could consider using the `--replacefile repfile` option to map to layers/recipes and version/revisions which exist in the KB, rerunning the script to import them. See the section REPLACING RECIPE NAMES below.\n\n4. For the MISSING recipes, these are almost certainly custom recipes containing either a mix of custom application code (potentially with OSS sources) or new OSS not obtained from Openembedded.org as standard OSS recipes. Identify the layers which contain mainly custom recipes, and use standard Black Duck signature scanning (and optionally snippet scanning) to search for modified OSS within these sub-folders only. __Do not run a signature or snippet scan on the entire Yocto project__ - only use signature scanning for custom layers and recipes not mapped by this script. You can optionally combine the dependency and signature scans in the same Black Duck project.\n\n# SUPPORTED YOCTO PROJECTS\n\nThis script is designed to support Yocto versions 2.0 up to 3.3 for building projects.\n\nOSS components from OpenEmbedded recipes maintained at layers.openbedded.org should be detected by the scan. Additional OSS components managed by custom recipes will not be detected.\n\n# PREREQUISITES\n\n1. Must be run on Linux\n\n1. Python 3 must be installed.\n\n1. A supported Yocto environment (version 2.0 to 3.1) should be loaded to the current shell (see [Preconfiguration](#PRECONFIGURATION) section below). Alternatively use the --bblayer_out option to specify the output of the `bitbake-layers show-recipes` command run separately.\n\n1. The Yocto project must have been pre-built with a `license.manifest` files available.\n\n1. OPTIONAL: For patched CVE remediation in the Black Duck project, you will need to add the `cve_check` bbclass to the Yocto build configuration to generate the CVE check log output. Add the following line to the `build/conf/local.conf` file:\n\n       INHERIT += \"cve-check\"\n\nThen use the Yocto build command (e.g. `bitbake core-image-sato` which will incrementally build without needing to rerun the full build, but will add the CVE check action to generate the log files.\n\n# INSTALLATION\n\nInstall the utility using pip - for example:\n\n    pip3 install import_yocto_bm\n\nAlternatively, clone the repository and run directly using:\n\n    python3 import_yocto_bm/main.py\n\n# STANDARD USAGE\n\nRun the command `import_yocto_bm` without arguments to invoke the wizard to guide you through the required information and options.\n\nThe `import_yocto_bm` parameters for command line usage are shown below:\n\n\tusage: import_yocto_bm [-h] [-p PROJECT] [-v VERSION] [-y YOCTO_FOLDER]\n\t\t\t\t[-t TARGET] [-o OUTPUT_JSON] [-m MANIFEST]\n\t\t\t\t[-b BUILDCONF] [-l LOCALCONF] [--arch ARCH]\n\t\t\t\t[-r repfile] [--cve_check_only] [--no_cve_check]\n\t\t\t\t[--cve_check_file CVE_CHECK_FILE] [--report rep.txt] [--nowizard|-wizard]\n\n\tImport Yocto build manifest to BD project version\n\n\toptional arguments:\n\t  -h, --help            show this help message and exit\n      --blackduck_url BLACKDUCK_URL\n                            Black Duck server URL (also uses $BLACKDUCK_URL environment variable)\n      --blackduck_api_token BLACKDUCK_API_TOKEN\n                            Black Duck API token (also uses $BLACKDUCK_API_TOKEN environment variable)\n      --blackduck_trust_cert\n                            Black Duck trust server cert\n\t  -p PROJECT, --project PROJECT\n\t\t\t\tBlack Duck project to create (REQUIRED)\n\t  -v VERSION, --version VERSION\n\t\t\t\tBlack Duck project version to create (REQUIRED)\n\t  -y YOCTO_FOLDER, --yocto_build_folder YOCTO_FOLDER\n\t  \t\t\tYocto build folder (required if CVE check required or\n\t\t\t\tmanifest file not specified)\n\t  -o OUTPUT_JSON, --output_json OUTPUT_JSON\n\t\t\t\tOutput JSON bom file for manual import to Black Duck\n\t\t\t\t(instead of uploading the scan automatically)\n\t  -t TARGET, --target TARGET\n\t\t\t\tYocto target (default core-poky-sato)\n\t  -m MANIFEST, --manifest MANIFEST\n\t\t\t\tInput build manifest file (if not specified will be\n\t\t\t\tdetermined from conf files) - must be the \n\t\t\t\tlicense.manifest file (not build.manifest)\n\t  -b BUILDCONF, --buildconf BUILDCONF\n\t\t\t\tBuild config file (if not specified \n\t\t\t\tpoky/meta/conf/bitbake.conf will be used)\n\t  -l LOCALCONF, --localconf LOCALCONF\n\t\t\t\tLocal config file (if not specified \n\t\t\t\tpoky/build/conf/local.conf will be used)\n\t  -r REPFILE, --replacefile REPFILE\n\t  \t\t\tReplace file used to replace layer and recipe names\n\t  --arch ARCH           Architecture (if not specified then will be determined\n\t\t\t\tfrom conf files)\n\t  --cve_check_only      Only check for patched CVEs from cve_check and update\n\t\t\t\texisting project\n\t  --no_cve_check        Skip check for and update of patched CVEs\n\t  --cve_check_file CVE_CHECK_FILE\n\t\t\t\tCVE check output file (if not specified will be\n\t\t\t\tdetermined from conf files)\n\t  --no_kb_check         Do not check recipes against KB\n\t  --kb_recipe_dir KB_RECIPE_DIR\n                            KB recipe data directory local copy\n\t  --report rep.txt\tIf KB check is performed, produce a list of matched. modified and unmatched recipes\n\t  --bblayers_out bbfile\n\t  \t\t\tCan be used to scan a build without access to the build environment - a file \n\t\t\t\tcontaining the output of the command `bitbake-layers show-recipes '*'` instead of \n\t\t\t\tcalling the command directly as well as the license.manifest file to be specified \n\t\t\t\twith -m. Also skips identification of recipe revisions (assumes all revisions are -r0)\n      --wizard\n                Start command line wizard (Wizard will run by default if config incomplete)\n      --nowizard\n                Do not start command line wizard even if config incomplete (batch mode)\n\nThe script will use the invocation folder as the Yocto build folder (e.g. yocto_zeus/poky/build) by default (if there is a `build` sub-folder then it will be used instead). The `--yocto_folder` option can be used to specify the Yocto build folder as opposed to the invocation folder.\n\nThe `--project` and `--version` options are required to define the Black Duck project and version names for inclusion in the json output file (and update CVE patch status).\n\nThe `--output_json` option can be used to specify an output file for the project scan. If specified, then the scan will not be uploaded automatically and CVE patch checking will be skipped.\n\nThe `--replacefile` option can be used to specify a layer/recipe/version replacement file (see REPLACING LAYER AND RECIPE NAMES below).\n\nThe Yocto target and architecture values are required to locate the manifest and cve\\_check log files and will be extracted from the Bitbake config files automatically, but the `--target` and `--arch` options can be used to specify these manually.\n\nThe most recent Bitbake output manifest file (located in the `build/tmp/deploy/licenses/<image>-<target>-<datetime>/license.manifest` file) will be located automatically. Use the `--manifest` option to specify the manifest file manually.\n\nThe most recent cve\\_check log file `build/tmp/deploy/images/<arch>/<image>-<target>-<datetime>.rootfs.cve` will be located automatically if it exists. Use the `--cve_check_file` option to specify the cve\\_check log file location manually (for example to use an older copy).\n\nUse the `--cve_check_only` option to skip the scanning of the project and creation of a project, only looking for a CVE check output log file to identify and patching matched CVEs within an existing Black Duck project (which must have been created previously).\n\nUse the `--no_cve_check` option to skip the patched CVE identification and update of CVE status in the Black Duck project. \n\n# PRECONFIGURATION\n\nThe `import_yocto_bm` script calls Bitbake commands by default, so you will need to run the Yocto project config (change the location as required) before using the script - for example:\n\n    cd /home/users/myuser/yocto_zeus/poky\n    source oe-init-build-env\n\nThis will set the Yocto environment and change directory into the Yocto build sub-folder.\n\nAlternatively, you can run the `bitbake-layer show-recipes` command separately to create an output file, then use the `--bblayers_out file` option (change `file` to the output file name) or specify the file in the wizard mode.\n\nIf you want to upload the resulting project direct to Black Duck (and are not using the --output_json option), you specify the Black Duck server with URL & API_TOKEN either using command line options:\n\n      --blackduck_url SERVER_URL\n      --blackduck_api_token TOKEN\n      --blackduck_trust_cert (specify if untrusted CA certificate used for BD server)\n\nOR by setting environment variables:\n\n      BLACKDUCK_URL=https://SERVER_URL\n      BLACKDUCK_API_TOKEN=TOKEN\n\nWhere `SERVER_URL` is the Black Duck server URL and `TOKEN` is the Black Duck API token.\n\n# REPLACING RECIPE NAMES\n\nLayers and recipes extracted from the project are combined by Black Duck and used to lookup original OSS components at https://layers.openembedded.org. If OSS components are moved from original layers to a new (custom) or different layer which is not shown at https://layers.openembedded.org and which cannot be mapped by a close neighbour in the script, then they will not be mapped in the resulting Black Duck project.\n\nTo reference a specific original component, you can use the `--replacefile REPFILE` option to map OSS components back to original recipes.\n\nThe replacefile option can also be used to remap new OSS component versions (not listed at https://layers.openembedded.org) to previous versions which are listed.\n\nExample REPFILE content is shown below:\n\n\tRECIPE meta-customlayer/alsa-lib/1.2.1.2-r5 meta/alsa-lib/1.2.1.2-r0\n\nwhich will remap recipe and version `alsa-lib/1.2.1.2-r5` in the `meta-customlayer` to `meta/alsa-lib/1.2.1.2-r0` in teh Black Duck KB.\n\n# EXAMPLE USAGE\n\nCheck the [Preconfiguration](#PRECONFIGURATION) section above before running the script.\n\nTo run the utility in wizard mode, simply use the command `import_yocto_bm` and it will ask questions to determine the scan parameters.\n\nUse the option `--nowizard` to run in batch mode and bypass the wizard mode, noting that you will need to specify all required options on the command line correctly.\n\nUse the following command to scan a Yocto build, create Black Duck project `myproject` and version `v1.0`, then update CVE patch status for identified CVEs (will require the OE environment to have been loaded previously):\n\n    import_yocto_bm -p myproject -v v1.0\n\nTo scan a Yocto project specifying a different build manifest as opposed to the most recent one (will require the OE environment to have been loaded previously):\n\n    import_yocto_bm -p myproject -v v1.0 -m tmp/deploy/licenses/core-image-sato-qemux86-64-20200728105751/package.manifest\n\nTo scan the most recent Yocto build in a different build folder location (not the current folder - will require the OE environment to have been loaded previously):\n\n    import_yocto_bm -p myproject -v v1.0 --y $HOME/newyocto/poky/build\n\nTo perform a CVE check patch analysis only (to update an existing Black Duck project created previously by the script with patched vulnerabilities) use the command (will require the OE environment to have been loaded previously):\n\n    import_yocto_bm -p myproject -v v1.0 --cve_check_only\n\nTo create a JSON output scan without uploading (and no CVE patch update) use (will require the OE environment to have been loaded previously):\n\n    import_yocto_bm -p myproject -v v1.0 -o my.jsonld\n\nTo create a JSON output scan without uploading (and no CVE patch update) without checking recipes against the KB recipe list downloaded from Github (will require the OE environment to have been loaded previously):\n\n    import_yocto_bm -p myproject -v v1.0 -o my.jsonld --no_kb_check\n\nIf you are unable to load the OE environment prior to running the utility, ensure you have the output of the command `bitbake-layers show-recipes` in a file, and use the option `--bblayers_out OUTPUT_FILE` to specify the file OUTPUT_FILE containing this output, for example:\n\n    import_yocto_bm -p myproject -v v1.0 -m poky/build/tmp/output/license.manifest --bblayers_out bblayers.txt\n\n# CVEs from cve_check Versus Black Duck\n\nThe Yocto `cve_check` class works on the Bitbake dependencies within the dev environment, and produces a list of CVEs identified from the NVD for ALL packages in the development environment.\n\nThis script extracts the packages from the build manifest (which will be a subset of those in the full Bitbake dependencies for build environment) and creates a Black Duck project.\n\nThe list of CVEs reported by `cve_check` will therefore be considerably larger than seen in the Black Duck project (which is the expected situation).\n\n# OUTSTANDING ISSUES\n\nThe identification of the Linux Kernel version from the Bitbake recipes and association with the upstream component in the KB has not been completed yet. Until an automatic identification is possible, the required Linux Kernel component can be added manually to the Black Duck project.\n\n# UPDATE HISTORY\n\n## V2.7\n- Fixed issue with trustcert option usage\n\n## V2.6\n- Some wizard fixes\n\n## V2.5\n- Addressed API limits introduced in 2022.2\n\n## V2.4\n- Fixed another issue with replacefile\n\n## V2.3\n- Fixed issue with replacefile usage\n\n## V2.2\n- Various minor fixes\n\n## V2.1\n- Added extra information to report output file\n- Added defaults to wizard mode & check for bd_trustcert\n\n## V2.0\n- Added new Wizard mode\n- Other fixes to manage component version epochs\n- Updated KB data\n\n## V1.17 Beta\n- Update to new KB data \n\n## V1.16 Beta\n- Fixed CVE patch process to use new Client API class\n\n## V1.15 Beta\n- Changed KB recipe download to use json formatted files\n- Changed --kb_recipe_file to --kb_recipe_dir to support json files\n\n## V1.14 Beta\n- Reworked replacefile logic and improved console reporting\n\n## V1.13 Beta\n- replaced the --debug option with --bblayers_out with the ability to define the input file.\n- Fixed the --report option to use the specified report file (previously always wrote to report.txt)\n- Changed the recipe matching logic to also look for KB matches without revisions (-rX) to support older Yocto versions\n\n## V1.12\n- Minor bug fixes\n\n## V1.11\n- Fixed a minor issue with AUTOINC component versions.\n\n## Previous Versions\nVersions 1.10 and 1.9 added fixes for the KB recipe lookup, and a new report output showing the list of recipes matched, modified or not matchable (use `--report reort.txt` option) as well as updating the list of KB recipes located in the data file.\n\nVersion 1.8 will automatically download a list of all Yocto projects stored in the Black Duck KB and checks the recipes in the local project, remapping recipes to origin layers or revisions to reduce the number of non matched components in the resulting Black Duck project. This functionality can be skipped using the --no_kb_check option, or if the download of the KB data from Github is not possible within the script, the --kb_recipe_file option allows a local copy to be used.\n\nThe DEPLOY_DIR and TMP_DIR values extracted from conf files now support the use of environment variables. Other fixes have been applied especially to the processing of the recipeinfo files and extraction of recipe revisions.\n\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/blackducksoftware/import_yocto_bm",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "import-yocto-bm",
    "package_url": "https://pypi.org/project/import-yocto-bm/",
    "platform": null,
    "project_url": "https://pypi.org/project/import-yocto-bm/",
    "project_urls": {
      "Homepage": "https://github.com/blackducksoftware/import_yocto_bm"
    },
    "release_url": "https://pypi.org/project/import-yocto-bm/2.7/",
    "requires_dist": [
      "blackduck (>=1.0.4)",
      "requests"
    ],
    "requires_python": ">=3.0",
    "summary": "Process a built Yocto project to create a Black Duck project version",
    "version": "2.7",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 13579852,
  "releases": {
    "0.21": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "dfd66686282020a36d5f722cc7c2befff834e96899776e65f8d2322266f7e17b",
          "md5": "f5f104aa9cda818cddd6a69be8236214",
          "sha256": "0b10abe75026c69b1d246cc0b128e1840b59f0f8001ec09a17afa2f04a25ccff"
        },
        "downloads": -1,
        "filename": "import_yocto_bm-0.21-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "f5f104aa9cda818cddd6a69be8236214",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.0",
        "size": 27755,
        "upload_time": "2021-12-20T17:03:47",
        "upload_time_iso_8601": "2021-12-20T17:03:47.483012Z",
        "url": "https://files.pythonhosted.org/packages/df/d6/6686282020a36d5f722cc7c2befff834e96899776e65f8d2322266f7e17b/import_yocto_bm-0.21-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9748c423a87c09f05328acc520475981f50aa0c7ca6e31161b28b5e10116e1c9",
          "md5": "9d8d2c05773f5c7e7a90e2c9f6521df9",
          "sha256": "d6b78226c6ad50a6dd6bb8fb5d827b9d2bc5ee28f9f3c3c6489e97291830abbd"
        },
        "downloads": -1,
        "filename": "import_yocto_bm-0.21.tar.gz",
        "has_sig": false,
        "md5_digest": "9d8d2c05773f5c7e7a90e2c9f6521df9",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.0",
        "size": 32112,
        "upload_time": "2021-12-20T17:03:48",
        "upload_time_iso_8601": "2021-12-20T17:03:48.911781Z",
        "url": "https://files.pythonhosted.org/packages/97/48/c423a87c09f05328acc520475981f50aa0c7ca6e31161b28b5e10116e1c9/import_yocto_bm-0.21.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2ad40517b6099748eb9cb455bc7c436fa253e1861a50921cd379c49f47cebb43",
          "md5": "0e8ff7d4600aa1ee705b9afce1954f39",
          "sha256": "6cff3ec6c80c8522bfc82116419117fad7a6f07a1fee6b6504b19f7bb412c4f8"
        },
        "downloads": -1,
        "filename": "import_yocto_bm-2.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "0e8ff7d4600aa1ee705b9afce1954f39",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.0",
        "size": 27800,
        "upload_time": "2022-01-07T15:59:29",
        "upload_time_iso_8601": "2022-01-07T15:59:29.884074Z",
        "url": "https://files.pythonhosted.org/packages/2a/d4/0517b6099748eb9cb455bc7c436fa253e1861a50921cd379c49f47cebb43/import_yocto_bm-2.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "78ebe35179db875c58fce77dfd65152cb15996e2bc3d9bc144cd999191a6ba4f",
          "md5": "afbc85cdfec14be99912cb70a196a254",
          "sha256": "d18ec1c68b61ce208fdff44f04da0cc93081c5bcc0128de059ccf6bb4fd8c68d"
        },
        "downloads": -1,
        "filename": "import_yocto_bm-2.2.tar.gz",
        "has_sig": false,
        "md5_digest": "afbc85cdfec14be99912cb70a196a254",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.0",
        "size": 32292,
        "upload_time": "2022-01-07T15:59:31",
        "upload_time_iso_8601": "2022-01-07T15:59:31.715818Z",
        "url": "https://files.pythonhosted.org/packages/78/eb/e35179db875c58fce77dfd65152cb15996e2bc3d9bc144cd999191a6ba4f/import_yocto_bm-2.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0389cffd1712e3a3c303c74e6d5d1f5da200e2691ae567c981e11113cf7cc6fe",
          "md5": "53f7509071400bb9b8463d83428a7cc0",
          "sha256": "ca5ca48a4b18f2ba37125ff917ca2e521f87941c7c644d02ef37d263db74be91"
        },
        "downloads": -1,
        "filename": "import_yocto_bm-2.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "53f7509071400bb9b8463d83428a7cc0",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.0",
        "size": 28108,
        "upload_time": "2022-01-19T10:06:54",
        "upload_time_iso_8601": "2022-01-19T10:06:54.347069Z",
        "url": "https://files.pythonhosted.org/packages/03/89/cffd1712e3a3c303c74e6d5d1f5da200e2691ae567c981e11113cf7cc6fe/import_yocto_bm-2.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7d21dd24cfd50ea9d035781d217bd591ed525c5f80c2d67196da9e090c8632ef",
          "md5": "d4e5c8f138c80f168006e88bbbadad19",
          "sha256": "0bfb9b53ede6dd6d1d497225722449401f18c01c9fefce1a33c8d77832d876bc"
        },
        "downloads": -1,
        "filename": "import_yocto_bm-2.3.tar.gz",
        "has_sig": false,
        "md5_digest": "d4e5c8f138c80f168006e88bbbadad19",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.0",
        "size": 32783,
        "upload_time": "2022-01-19T10:06:56",
        "upload_time_iso_8601": "2022-01-19T10:06:56.173536Z",
        "url": "https://files.pythonhosted.org/packages/7d/21/dd24cfd50ea9d035781d217bd591ed525c5f80c2d67196da9e090c8632ef/import_yocto_bm-2.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0bb6731cccd80b52f6b7300d445d7c05d6097ffb9a68ea63a069b0e1a1e67a8a",
          "md5": "cf5e002d1cf56d1589577df3f481bd75",
          "sha256": "ff5b26fe5e1df672927ba88f91bcac462f15690a55a3959df34db429522e0228"
        },
        "downloads": -1,
        "filename": "import_yocto_bm-2.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "cf5e002d1cf56d1589577df3f481bd75",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.0",
        "size": 28409,
        "upload_time": "2022-03-24T06:40:51",
        "upload_time_iso_8601": "2022-03-24T06:40:51.688629Z",
        "url": "https://files.pythonhosted.org/packages/0b/b6/731cccd80b52f6b7300d445d7c05d6097ffb9a68ea63a069b0e1a1e67a8a/import_yocto_bm-2.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "30a108bd1a2080bd944515720f079aa52e30cf0e7e8ef2713c24f2ff57dd5bea",
          "md5": "3df2203dc4323b06452270bf5ba7c6b3",
          "sha256": "647e5b7de4c0d7e88f70d2862cfb38a1b6fbaf4b91cad25aafc67d6f4c005fe5"
        },
        "downloads": -1,
        "filename": "import_yocto_bm-2.4.tar.gz",
        "has_sig": false,
        "md5_digest": "3df2203dc4323b06452270bf5ba7c6b3",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.0",
        "size": 33455,
        "upload_time": "2022-03-24T06:40:53",
        "upload_time_iso_8601": "2022-03-24T06:40:53.054243Z",
        "url": "https://files.pythonhosted.org/packages/30/a1/08bd1a2080bd944515720f079aa52e30cf0e7e8ef2713c24f2ff57dd5bea/import_yocto_bm-2.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f20fdd0cdeb06e11690a91f100f8884137ca711a608988fccde2ce2d4e9c1077",
          "md5": "7cbc18cf42e6d74c3a4115a629030f1e",
          "sha256": "aa7e40dff30dfcd7acf004472e8b0646ea09db60b2123e02b3fca91f161c9160"
        },
        "downloads": -1,
        "filename": "import_yocto_bm-2.5-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "7cbc18cf42e6d74c3a4115a629030f1e",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.0",
        "size": 28527,
        "upload_time": "2022-04-20T17:00:53",
        "upload_time_iso_8601": "2022-04-20T17:00:53.580234Z",
        "url": "https://files.pythonhosted.org/packages/f2/0f/dd0cdeb06e11690a91f100f8884137ca711a608988fccde2ce2d4e9c1077/import_yocto_bm-2.5-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f5a8a63d93b99cd1d017fce100b5f30122ec820bfe361880f816468728682f31",
          "md5": "1688fd8f9dbf4e0570bbdb7948ae499d",
          "sha256": "14a64d2654004b17973fcb4336f4bcd8ddd348545ee0ed91311548c250654011"
        },
        "downloads": -1,
        "filename": "import_yocto_bm-2.5.tar.gz",
        "has_sig": false,
        "md5_digest": "1688fd8f9dbf4e0570bbdb7948ae499d",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.0",
        "size": 32736,
        "upload_time": "2022-04-20T17:00:55",
        "upload_time_iso_8601": "2022-04-20T17:00:55.878182Z",
        "url": "https://files.pythonhosted.org/packages/f5/a8/a63d93b99cd1d017fce100b5f30122ec820bfe361880f816468728682f31/import_yocto_bm-2.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0e398164e1ab3038ca039ce11e0ab127760259f42d4a1d484fc8aa195d69fead",
          "md5": "a6c7cac3d8e395812b91d2cdf3a12b1c",
          "sha256": "964dd7df7282f9ce88f4acd887c7034f84812a8d9a4861776c461f395b5ac237"
        },
        "downloads": -1,
        "filename": "import_yocto_bm-2.6-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "a6c7cac3d8e395812b91d2cdf3a12b1c",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.0",
        "size": 28592,
        "upload_time": "2022-04-21T09:38:24",
        "upload_time_iso_8601": "2022-04-21T09:38:24.823377Z",
        "url": "https://files.pythonhosted.org/packages/0e/39/8164e1ab3038ca039ce11e0ab127760259f42d4a1d484fc8aa195d69fead/import_yocto_bm-2.6-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c1f53e92bb3d77c23a6ea031e8755c02583e760bfb9e16b7b2aec9924c7e2f1b",
          "md5": "878ad132878526fe930240a98c3bdab6",
          "sha256": "2e84f7edaae59bbe6e6b437dce185bda5c0d19882429a3f2a1824ec728597dd7"
        },
        "downloads": -1,
        "filename": "import_yocto_bm-2.6.tar.gz",
        "has_sig": false,
        "md5_digest": "878ad132878526fe930240a98c3bdab6",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.0",
        "size": 32777,
        "upload_time": "2022-04-21T09:38:26",
        "upload_time_iso_8601": "2022-04-21T09:38:26.280050Z",
        "url": "https://files.pythonhosted.org/packages/c1/f5/3e92bb3d77c23a6ea031e8755c02583e760bfb9e16b7b2aec9924c7e2f1b/import_yocto_bm-2.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.7": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c5ffba527a4241d5b12a7bda48cfd6124e90aaeaa06fbbed174a87fabc9a2baf",
          "md5": "fdd60a6cdb31106b750c585dda099449",
          "sha256": "cf41e80141b793a74e875a42b5df40b97282310fb9bf11153a0fba157e373024"
        },
        "downloads": -1,
        "filename": "import_yocto_bm-2.7-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "fdd60a6cdb31106b750c585dda099449",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.0",
        "size": 28635,
        "upload_time": "2022-04-21T14:22:49",
        "upload_time_iso_8601": "2022-04-21T14:22:49.597423Z",
        "url": "https://files.pythonhosted.org/packages/c5/ff/ba527a4241d5b12a7bda48cfd6124e90aaeaa06fbbed174a87fabc9a2baf/import_yocto_bm-2.7-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d33aca91c91c8779ac7ca1ef597847833fbc64c04a021fc94808828cadb20624",
          "md5": "12f021c6665a46117dff06ed2b34bcde",
          "sha256": "7e0aa56fefc7f05c14495331be2fa590122a8c59650ebc1ef4b3b79fac456d10"
        },
        "downloads": -1,
        "filename": "import_yocto_bm-2.7.tar.gz",
        "has_sig": false,
        "md5_digest": "12f021c6665a46117dff06ed2b34bcde",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.0",
        "size": 32843,
        "upload_time": "2022-04-21T14:22:51",
        "upload_time_iso_8601": "2022-04-21T14:22:51.609499Z",
        "url": "https://files.pythonhosted.org/packages/d3/3a/ca91c91c8779ac7ca1ef597847833fbc64c04a021fc94808828cadb20624/import_yocto_bm-2.7.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "c5ffba527a4241d5b12a7bda48cfd6124e90aaeaa06fbbed174a87fabc9a2baf",
        "md5": "fdd60a6cdb31106b750c585dda099449",
        "sha256": "cf41e80141b793a74e875a42b5df40b97282310fb9bf11153a0fba157e373024"
      },
      "downloads": -1,
      "filename": "import_yocto_bm-2.7-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "fdd60a6cdb31106b750c585dda099449",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.0",
      "size": 28635,
      "upload_time": "2022-04-21T14:22:49",
      "upload_time_iso_8601": "2022-04-21T14:22:49.597423Z",
      "url": "https://files.pythonhosted.org/packages/c5/ff/ba527a4241d5b12a7bda48cfd6124e90aaeaa06fbbed174a87fabc9a2baf/import_yocto_bm-2.7-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "d33aca91c91c8779ac7ca1ef597847833fbc64c04a021fc94808828cadb20624",
        "md5": "12f021c6665a46117dff06ed2b34bcde",
        "sha256": "7e0aa56fefc7f05c14495331be2fa590122a8c59650ebc1ef4b3b79fac456d10"
      },
      "downloads": -1,
      "filename": "import_yocto_bm-2.7.tar.gz",
      "has_sig": false,
      "md5_digest": "12f021c6665a46117dff06ed2b34bcde",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.0",
      "size": 32843,
      "upload_time": "2022-04-21T14:22:51",
      "upload_time_iso_8601": "2022-04-21T14:22:51.609499Z",
      "url": "https://files.pythonhosted.org/packages/d3/3a/ca91c91c8779ac7ca1ef597847833fbc64c04a021fc94808828cadb20624/import_yocto_bm-2.7.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}