{
  "info": {
    "author": "Davide Savino Volpicella",
    "author_email": "s.volpicella3@studenti.uniba.it",
    "bugtrack_url": null,
    "classifiers": [
      "Programming Language :: Python :: 3"
    ],
    "description": "<h1>Italian Tweets Analyzer</h1>\r\n\r\nItalian tweets analyzer is a tool created for the thesis work at the University of Bari “Aldo Moro” of the course \r\n“Methods for the information retrieval”. It can perform analysis on Italian tweets and it provides several features. \r\nThis project is an upgraded version of the tool: Hate-Tweet-Map. The main features of the program are described below. \r\n\r\n<h2>Tweets extraction</h2>\r\n\r\nThis program allows to define a query with the information you want to request from Twitter, then the request is sent to \r\nTwitter and the information obtained is saved within the database (MongoDB). To modify the request you want to send to \r\nTwitter, you need to edit the configuration file called “search_tweets.config”. This file contains some fields that \r\nrequire values, while others are optional. The mandatory fields are (at least one of them must be filled): \r\n<ul>\r\n<li><code>Keyword</code>: keyword on which the search for tweets will be based. In fact, those tweets that contain the indicated keyword \r\nwill be found. You can set multiple keywords and use logical operators like AND and OR. \r\nFor example: “Joe Biden”, “Biden OR Trump”, “(Biden OR Trump) whitehouse” \r\n(the last query means “(Biden OR Trump) AND whitehouse”).</li>\r\n</ul>\r\n<ul>\r\n<li><code>User</code>: In this field you can specify the user username or user’s ID. It is possible to insert multiple users. \r\nIf this field and the keyword field are set, then will be find that contains the keyword specified from the user \r\nspecified.</li>\r\n</ul>\r\n<ul>\r\n<li><code>User_mentioned</code>: in this field you can enter the username of a specific user to search for tweets that mention him.</li>\r\n</ul>\r\n<ul>\r\n<li><code>Hashtag</code>: in this field you can enter a specific hashtag for search tweets that contain it.</li>\r\n</ul>\r\n  \r\nThe optional fields are:\r\n<ul>\r\n<li><code>Lang</code>: this field indicates the language of the tweets that you want to retrieve. The values that this field accepts \r\nare those reported by ISO 639-1 code. An example values: it, en, pt, es.</li>\r\n</ul>\r\n<ul>\r\n<li><code>Context_annotations</code>: this field indicates to twitter to include or not the context annotation for the tweet that \r\nhave it. If this field is set to True, the field n_result will be set automatically to 100. \r\nPossible values are True/False.</li>\r\n</ul>\r\n<ul>\r\n<li><code>N_results</code>: this field indicates to twitter to how many tweets the response should contain. Twitter allows to search \r\nfor minimum 10 tweets to maximum 500 tweets for request. So if the value entered in this field is less than 10, this \r\nfield will be automatically set to 10; if the value entered is greater than 500, more requests will be send to Twitter.\r\nPossible values: any int number.</li>\r\n</ul>\r\n<ul>\r\n<li><code>All_tweets</code>: this fields indicates to twitter to find all possible tweets. If this field is True, n_result will be set\r\nto 500. Possible values: True/False.\r\n</li>\r\n</ul>\r\n<ul>\r\n<li><code>Time</code>: this field allows to search tweets in a specific range of time. This field has two sub-fields: <code>start_time</code> and \r\n<code>end_time</code>. The values in this fields must be in the ISO 8601/RFC 3339 format, so like: YYYY-MM-DDTHH:mm:ss+Z. \r\nThe configurations that can be made are: \r\n</li>\r\n&nbsp;\r\n<ul>\r\n<li>Only start_time is specified: end_time will be assumed to be current time (-30 sec).</li>\r\n</ul>\r\n&nbsp;\r\n<ul>\r\n<li>Only end_time is specified: start_time will be assumed 30 days before the end_time specified.</li>\r\n</ul>\r\n&nbsp;\r\n<ul>\r\n<li>Both are specified: the tweets in the range time will be found.</li>\r\n</ul>\r\n&nbsp;\r\n<ul>\r\n<li>None: by default, a request will return tweets from up to 30 days ago.</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<li><code>Geo</code>: in this section is possible to set the geographical parameters, in this way it is possible to filter the tweets \r\nbased on their geographical origin. This field has several sub-fields and only one of them must be set:</li> \r\n<ul>\r\n&nbsp;\r\n<li><code>Place</code>: matches tweets tagged with the specified location on twitter place ID. Multi-word place names (“New York City”,\r\n“Palo Alto”) should be enclosed in quotes. Possible values: any name of city, enclosed in quotes if the place name \r\nconsists of several words.</li>\r\n</ul>\r\n&nbsp;\r\n<ul>\r\n<li><code>Place_country</code>: attaches tweets where the country code associated with a tagged place/location matches the given ISO \r\nalpha-2 character code. Possible values: any name of country in ISO_3166-1_alpha-2 format.</li>\r\n</ul>\r\n&nbsp;\r\n<ul>\r\n<li><code>Bounding_box</code>: matches against the place.geo.coordinates object of the tweet when present, and in Twitter against a \r\nplace geo polygon, where the place polygon is fully contained within the defined region. The coordinate values are \r\nindicated in the following fields: west_long, south_lat, east_long, north_lat.</li>\r\n</ul>\r\n&nbsp;\r\n<ul>\r\n<li><code>Point_radius</code>: matches again the place.geo.coordinates object of the tweet when present, and in twitter, against a \r\nplace geo polygon, where the place polygon is fully contained within the defined region. The coordinate values are \r\nindicated in the following fields: longitude, latitude, radius.</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<li><code>Filter_retweet</code>: this field indicates to Twitter to include or not the retweet in the response. If it is True, Twitter\r\nresponse could contain also retweets; if false not. Possible values: True/False.</li>\r\n</ul>\r\n<ul>\r\n<li><code>Filter_images</code>: this field indicates to find tweets that contain an image URL. For example, entering the hashtag \r\n#covid in the configuration file and setting True to this field, you will get all tweets with that particular hashtag \r\nthat contain an image. Possible values are: True/False.</li>\r\n</ul>\r\n\r\nIn the configuration file you can also edit the name of the database where the tweets will be saved.\r\n\r\n<h2>Find information about Twitter users</h2>\r\n\r\nThe program explores the collection of tweets in the database and goes to find information on users who have published \r\nthese posts. In the configuration file: “search_users.config”, you can edit the fields that indicate where to get the \r\ntweets and where to go to save the information of the users who have published those tweets.\r\n\r\n<h2>Process Tweets</h2>\r\n\r\nThis tool allows you to perform different types of analysis on collected tweets. The possible analyses are described\r\nbelow.\r\n\r\n<h5>Entity Linker</h5>\r\nITA uses the TagMe service to find entities in the text of the tweet and to connect these with the \r\nrespective Wikipedia page.\r\n\r\n<h5>Geo</h5> \r\nITA uses the geographic information in the tweet to find the coordinates of the place where the tweets have been \r\nposted. This process uses Open Street Map service. (This operation could be time expensive cause OSM allows to send only\r\none request per second)\r\n\r\n<h5>Natural Language Processing</h5>\r\nITA uses spacy model to lemmatize the text of the tweet. In addition\r\nsave the POS and the Morphological information and the entities found by spacy in the text.\r\n\r\n<h5>Sentiment Analysis</h5>\r\nITA uses three different services to perform sentiment analysis of the tweets collected in the\r\ndatabase.\r\n\r\n<ul>\r\n\r\n<li>Feel-it: model able to classify italian tweets and annotate them using basic emotions\r\nlike: anger, fear, joy, sadness. It can also perform sentiment analysis, telling if the content of a tweet\r\nis positive, neutral or negative.</li>\r\n&nbsp;\r\n<li>Sent-it: model able to perform sentiment analysis on italian tweets. It can tell if the content of a tweet is:\r\npositive, neutral or negative.</li>\r\n&nbsp;\r\n<li>Hate-speech-it: model that can perform sentiment analysis. The labels used by it are: accettable, inappropriate,\r\noffensive, violent.</li>\r\n\r\n</ul>\r\n\r\n<h5>Genre classification</h5>\r\nITA allows you to perform genre classification: tweets are categorized according to their textual content; for example \r\nit can determine if a text represents a news, a legal document, the text of a song, etc.\r\nThe model used for genre classification is xml-roberta. The table below shows the labels used by the model and their \r\ndescription.\r\n\r\n| Label                   | Description |\r\n|-------------------------|------|\r\n| Information/Explanation | An objective text that describes or presents an event, a person, a thing, a concept etc. |\r\n| Instruction             | An objective text which instructs the readers on how to do something. |\r\n| Legal                   |   An objective formal text that contains legal terms and is clearly structured.    |\r\n| News                    |   An objective or subjective text which reports on an event recent at the time of writing or coming in the near future.   |\r\n| Opinion/Argumentatio    |   A subjective text in which the authors convey their opinion or narrate their experience.   |\r\n| Promotion               |   A subjective text intended to sell or promote an event, product, or service. It addresses the readers, often trying to convince them to participate in something or buy something.   |\r\n| Forum                   |   A text in which people discuss a certain topic in form of comments.   |\r\n| Prose/Lyrical\t          |   A literary text that consists of paragraphs or verses.   |\r\n| Other                   |   A text that which does not fall under any of other genre categories.   |\r\n\r\n\r\n\r\n<h5>Image to text</h5>\r\nIta can capture the semantic meaning of an image and save it as a string, then it is saved within the database.\r\nThe model used for image captioning is vit-gpt2-image-captioningm which bases its operation on the Coco dataset.\r\nCOCO is a large-scale object detection, segmentation, and captioning dataset.\r\n\r\n<h2>Process Tweets: configuration file</h2>\r\n\r\n\r\nFrom the configuration file called “process_tweets.config” you can indicate \r\nwhich analysis perform on tweets. In the configuration file there are the following fields:\r\n<ul>\r\n<li><code>TagMe</code></li>\r\n<ul>\r\n<li><code>Enabled</code>: enable or disable this phase. Possible values are True/False.</li>\r\n</ul>\r\n<ul>\r\n<li><code>Token</code>: the token obtained from TagMe to send the requests. Possible values: a valid TagMe token.</li>\r\n</ul>\r\n<ul>\r\n<li><code>Is_tweet</code>: indicate to TagMe service if the text given is a tweet or not. Possible values are True/False.</li> \r\n</ul>\r\n<ul>\r\n<li><code>Rho_value</code>: estimates the confidence in the annotation. The threshold should be chosen in the interval [0,1].\r\nA reasonable threshold is between 0.1 and 0.3. Possible values: any number between 0 and 1.</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<li><code>Sentiment_analyze</code></li>\r\n<ul>\r\n<li><code>Sent_it</code>: enable or disable sent-it phase (true/false).</li>\r\n<li><code>Feel_it</code>: enable or disable feel-it phase (true/false).</li>\r\n<li><code>Hate_speech_it</code>: enable or disable hate_speech_it phase (true/false).</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<li><code>Geocoding</code>: this section enables or disables the geocoding phase using Open Street Map service. \r\nPossible values are tru/false.</li>\r\n</ul>\r\n<ul>\r\n<li><code>Genre_classification</code></li>\r\n<ul>\r\n<li><code>Roberta</code>: enable or disable the classification of tweets with Roberta (true/false).</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<li><code>Image_to_text</code></li>\r\n<ul>\r\n<li><code>Image_captioning</code>: enable or disable the image captioning with the vit-gpt2-image-captioning</li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<li><code>Analyze_all_tweets</code>: there are two mode to select the tweets to analyze: all the tweets in the collection or only the \r\ntweets that have not yet been passed to the Natural Language Phase. To choose the first mode just set the \r\nanalyze_all_tweets to True, otherwise to False.</li>\r\n</ul>\r\n<h2>Manage Tweets</h2>\r\n\r\nThe program allows you to: \r\n<ul>\r\n<li>extract tweets from the database and save them on .json or .csv file;</li> \r\n<li>delete some tweets.</li>\r\n</ul>\r\nThe criteria to select the tweets to extract/delete are defined in the manage_tweets.config file. Is possible to modify \r\nthat file to set the criteria. The configuration file has the following fields: \r\n<ul>\r\n<li><code>mode</code>: the mode indicates what the script have to do: extract and save the tweets in a file or delete them. \r\nPossible values are: extract/delete. This field is mandatory to set.</li>\r\n</ul>\r\n<ul>\r\n<li><code>Criteria</code></li>\r\n<ul>\r\n<li><code>sentiment</code>: by setting this field it’s possible to retrieve tweets with a specific sentiment, in particular \r\nchoosing between neutral, positive or negative sentiment. Possible values are: negative/positive/neutral.</li>\r\n</ul>\r\n<ul>\r\n<li><code>Keywords</code>: setting this field it’s possible to retrieve tweets that contains specific words.</li>\r\n</ul>\r\n<ul>\r\n<li><code>Words</code>: a list of words to search separated by a comma. Example: sun,sea,island</li>\r\n</ul>\r\n<ul>\r\n<li><code>Path</code>: the path to a .txt file that contains the words to search. The .txt file must contain each word to search in a \r\ndifferent line and just one word in a line. Possible values: a valid path to a .txt file.</li>\r\n</ul>\r\n<ul>\r\n<li><code>Postag</code>: by setting this field it’s possible to retrieve tweets that contains a word with a specific POS tag. \r\nPossible values: any valid POS value.</li>\r\n\r\n<ul>\r\n<li><a href=\"https://spacy.io/usage/linguistic-features\" target=\"_blank\">Here for a generic understanding</a></li>\r\n<li><a href=\"https://spacy.io/models/it#it_core_news_lg-labels\" target=\"_blank\">here for a complete list of italian SpaCy’s POS values (see labels scheme section in it_core_news_lg)</a></li>\r\n<li><a href=\"https://spacy.io/models/en#en_core_web_lg-labels\" target=\"_blank\">here for a complete list of english SpaCy’s POS values (see labels scheme section in en_core_web_lg)</a></li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<li><code>Morph</code>: by setting this field it’s possible to retrieve tweets that contains a word with a specific morphology. \r\nPossible values are any valid morph value.</li>\r\n<ul>\r\n<li><a href=\"https://spacy.io/usage/linguistic-features\" target=\"_blank\">Here for a generic understanding</a></li>\r\n<li><a href=\"https://spacy.io/models/it#it_core_news_lg-labels\" target=\"_blank\">here for a complete list of italian SpaCy’s POS values (see labels scheme section in it_core_news_lg)</a></li>\r\n<li><a href=\"https://spacy.io/models/en#en_core_web_lg-labels\" target=\"_blank\">here for a complete list of english SpaCy’s POS values (see labels scheme section in en_core_web_lg)</a></li>\r\n</ul>\r\n</ul>\r\n<ul>\r\n<li><code>Raw_query</code>: by setting this field it’s possible to write an own query. The query must be a mongodb query and must take\r\nin account the fields of the tweet saved in the collection. Possible values: any valid mongodb query.</li>\r\n</ul>\r\n<ul>\r\n<li><code>Logical_operator</code>: if more than one criteria are set, it’s necessary to define how logically connect the crierias are. \r\nPossible values: or/and</li>\r\n</ul>\r\n</ul>\r\n<h2>Database</h2>\r\n\r\nITA interfaces with a mongodb database where it saves tweets and extracts them in order to perform operations on them.\r\nIn each configuration file you must indicate:\r\n<ul>\r\n<li><code>url</code>: string with which you can connect to the database;</li>\r\n<li><code>database</code>: name of the database;</li>\r\n<li><code>collection</code> name of the database's collection.</li>\r\n</ul>\r\n\r\n<h2>Changelog</h2>\r\n\r\n<ul>\r\n<li><a href=\"https://darioamorosodaragona.gitlab.io/hatemap/index.html#\" target=\"_blank\">Hate-Tweet-Map-1.0</a>, developed by Dario Amoroso d'Aragona</li>\r\n<li><a href=\"https://github.com/swapUniba/Hate-Tweet-Map-2.0#\" target=\"_blank\">Hate-Tweet-Map-2.0</a>, developed by Marco Sallustio</li>\r\n<li>Italian tweets analyzer, developed by Davide Savino Volpicella</li>\r\n</ul>\r\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "Italian-Tweets-Analyzer",
    "package_url": "https://pypi.org/project/Italian-Tweets-Analyzer/",
    "platform": null,
    "project_url": "https://pypi.org/project/Italian-Tweets-Analyzer/",
    "project_urls": null,
    "release_url": "https://pypi.org/project/Italian-Tweets-Analyzer/2.2/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "Italian tweets analyzer is a tool created for the thesis work at the University of Bari \"Aldo Moro\" of the course \"Methods for the information retrieval\". It can perform analysis on Italian tweets and it provides several features. This project is an upgraded version of the tool: Hate-Tweet-Map.",
    "version": "2.2",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17210759,
  "releases": {
    "2.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "04271a40c05b32c32c32a3195250e6fe7d16f7aa1269068ddfb0cbef7abb46d7",
          "md5": "ac6c5738264c585deab6cdd2f7f9a8aa",
          "sha256": "a0078efaaf99e1eb277e04b6279f6d7b43fff43e0caec6fd0da6aea6a63442ee"
        },
        "downloads": -1,
        "filename": "Italian Tweets Analyzer-2.2.tar.gz",
        "has_sig": false,
        "md5_digest": "ac6c5738264c585deab6cdd2f7f9a8aa",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 58840,
        "upload_time": "2023-03-08T18:14:37",
        "upload_time_iso_8601": "2023-03-08T18:14:37.867156Z",
        "url": "https://files.pythonhosted.org/packages/04/27/1a40c05b32c32c32a3195250e6fe7d16f7aa1269068ddfb0cbef7abb46d7/Italian%20Tweets%20Analyzer-2.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "04271a40c05b32c32c32a3195250e6fe7d16f7aa1269068ddfb0cbef7abb46d7",
        "md5": "ac6c5738264c585deab6cdd2f7f9a8aa",
        "sha256": "a0078efaaf99e1eb277e04b6279f6d7b43fff43e0caec6fd0da6aea6a63442ee"
      },
      "downloads": -1,
      "filename": "Italian Tweets Analyzer-2.2.tar.gz",
      "has_sig": false,
      "md5_digest": "ac6c5738264c585deab6cdd2f7f9a8aa",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 58840,
      "upload_time": "2023-03-08T18:14:37",
      "upload_time_iso_8601": "2023-03-08T18:14:37.867156Z",
      "url": "https://files.pythonhosted.org/packages/04/27/1a40c05b32c32c32a3195250e6fe7d16f7aa1269068ddfb0cbef7abb46d7/Italian%20Tweets%20Analyzer-2.2.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}