{
  "info": {
    "author": "Daniel Povey",
    "author_email": "dpovey@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 3 - Alpha",
      "Operating System :: OS Independent",
      "Programming Language :: C++",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: Implementation :: CPython",
      "Topic :: Scientific/Engineering :: Artificial Intelligence"
    ],
    "description": "\n[![GitHub Actions Status](https://github.com/danpovey/k2/workflows/build/badge.svg)](https://github.com/danpovey/k2/actions)\n\n\n# k2\n\nThe vision of k2 is to be able to seamlessly integrate Finite State Automaton\n(FSA) and Finite State Transducer (FST) algorithms into autograd-based machine\nlearning toolkits like PyTorch and TensorFlow.  For speech recognition\napplications, this should make it easy to interpolate and combine various\ntraining objectives such as cross-entropy, CTC and MMI and to jointly optimize a\nspeech recognition system with multiple decoding passes including lattice\nrescoring and confidence estimation.  We hope k2 will have many other\napplications as well.\n\nOne of the key algorithms that we want to make efficient in the short term is\npruned composition of a generic FSA with a \"dense\" FSA (i.e. one that\ncorresponds to log-probs of symbols at the output of a neural network).  This\ncan be used as a fast implementation of decoding for ASR, and for CTC and\nLF-MMI training.  This won't give a direct advantage in terms of Word Error Rate when\ncompared with existing technology; but the point is to do this in a much more\ngeneral and extensible framework to allow further development of ASR technology.\n\n ## Implementation\n\n A few key points on our implementation strategy.\n\n Most of the code is in C++ and CUDA.  We implement a templated class `Ragged`,\n which is quite like TensorFlow's `RaggedTensor` (actually we came up with the\n design independently, and were later told that TensorFlow was using the same\n ideas).  Despite a close similarity at the level of data structures, the\n design is quite different from TensorFlow and PyTorch.  Most of the time we\n don't use composition of simple operations, but rely on C++11 lambdas defined\n directly in the C++ implementations of algorithms.  The code in these lambdas operate\n directly on data pointers and, if the backend is CUDA, they can run in parallel\n for each element of a tensor.  (The C++ and CUDA code is mixed together and the\n CUDA kernels get instantiated via templates).\n\n It is difficult to adequately describe what we are doing with these `Ragged`\n objects without going in detail through the code.  The algorithms look very\n different from the way you would code them on CPU because of the need to avoid\n sequential processing.  We are using coding patterns that make the most\n expensive parts of the computations \"embarrassingly parallelizable\"; the only\n somewhat nontrivial CUDA operations are generally reduction-type operations\n such as exclusive-prefix-sum, for which we use NVidia's `cub` library.  Our\n design is not too specific to the NVidia hardware and the bulk of the code we\n write is fairly normal-looking C++; the nontrivial CUDA programming is mostly\n done via the cub library, parts of which we wrap with our own convenient\n interface.\n\n The Finite State Automaton object is then implemented as a Ragged tensor templated\n on a specific data type (a struct representing an arc in the automaton).\n\n\n ## Autograd\n\n If you look at the code as it exists now, you won't find any references to\n autograd.  The design is quite different to TensorFlow and PyTorch (which is\n why we didn't simply extend one of those toolkits).  Instead of making autograd\n come from the bottom up (by making individual operations differentiable) we are\n implementing it from the top down, which is much more efficient in this case\n (and will tend to have better roundoff properties).\n\n An example: suppose we are finding the best path of an FSA, and we need\n derivatives.  We implement this by keeping track of, for each arc in the output\n best-path, which input arc it corresponds to.  (For more complex algorithms an arc\n in the output might correspond to a sum of probabilities of a list of input arcs).\n We can make this compatible with PyTorch/TensorFlow autograd at the Python level,\n by, for example, defining a Function class in PyTorch that remembers this relationship\n between the arcs and does the appropriate (sparse) operations to propagate back the\n derivatives w.r.t. the weights.\n\n\n ## Current state of the code\n\n A lot of the code is still unfinished (Sep 11, 2020).\n We finished the CPU versions of many algorithms and this code is in `k2/csrc/host/`;\n however, after that we figured out how to implement things on the GPU and decided\n to change the interfaces so the CPU and GPU code had a more unified interface.\n Currently in `k2/csrc/` we have more GPU-oriented implementations (although\n these algorithms will also work on CPU).  We had almost finished the Python\n wrapping for the older code, in the `k2/python/` subdirectory, but we decided not to\n release code with that wrapping because it would have had to be reworked to be compatible\n with our GPU algorithms.  Instead we will use the interfaces drafted in `k2/csrc/`\n e.g. the Context object (which encapsulates things like memory managers from external\n toolkits) and the Tensor object which can be used to wrap tensors from external toolkits;\n and wrap those in Python (using pybind11).  The code in host/ will eventually\n be either deprecated, rewritten or wrapped with newer-style interfaces.\n\n  ## Plans for initial release\n\n We hope to get the first version working in early October.  The current\n short-term aim is to finish the GPU implementation of pruned composition of a\n normal FSA with a dense FSA, which is the same as decoder search in speech\n recognition and can be used to implement CTC training and lattice-free MMI (LF-MMI) training.  The\n proof-of-concept that we will release initially is something that's like CTC\n but allowing more general supervisions (general FSAs rather than linear\n sequences).  This will work on GPU.  The same underlying code will support\n LF-MMI so that would be easy to implement soon after.  We plan to put\n example code in a separate repository.\n\n ## Plans after initial release\n\n We will then gradually implement more algorithms in a way that's compatible\n with the interfaces in `k2/csrc/`.  Some of them will be CPU-only to start\n with.  The idea is to eventually have very rich capabilities for operating on\n collections of sequences, including methods to convert from a lattice to a\n collection of linear sequences and back again (for purposes of neural language\n model rescoring, neural confidence estimation and the like).\n\n\n## Quick start\n\nWant to try it out without installing anything? We have setup a [Google Colab][1].\n\nCaution: k2 is not nearly ready for actual use!  We are still coding the core\nalgorithms, and hope to have an early version working by early October.\n\n[1]: https://colab.research.google.com/drive/1qbHUhNZUX7AYEpqnZyf29Lrz2IPHBGlX?usp=sharing\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/k2-fsa/k2",
    "keywords": "k2,FSA,FST",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "k2-fsa",
    "package_url": "https://pypi.org/project/k2-fsa/",
    "platform": "",
    "project_url": "https://pypi.org/project/k2-fsa/",
    "project_urls": {
      "Homepage": "https://github.com/k2-fsa/k2"
    },
    "release_url": "https://pypi.org/project/k2-fsa/0.0.5/",
    "requires_dist": [
      "torch",
      "graphviz"
    ],
    "requires_python": ">=3.6",
    "summary": "FSA/FST algorithms, intended to (eventually) be interoperable with PyTorch and similar",
    "version": "0.0.5",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 8331998,
  "releases": {
    "0.0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d5f88432f24daaf80abf9c1a3e234a17d5245c00ec941695978cf265265c8f4d",
          "md5": "b1958cd26940ce359850f93f2de818ec",
          "sha256": "b059e2446472a04cce6ba999ea8cfd7fa39e18cfa1db676180d4980117ded9b5"
        },
        "downloads": -1,
        "filename": "k2_fsa-0.0.3-py36-none-any.whl",
        "has_sig": false,
        "md5_digest": "b1958cd26940ce359850f93f2de818ec",
        "packagetype": "bdist_wheel",
        "python_version": "py36",
        "requires_python": ">=3.6",
        "size": 2171577,
        "upload_time": "2020-10-03T09:47:50",
        "upload_time_iso_8601": "2020-10-03T09:47:50.996492Z",
        "url": "https://files.pythonhosted.org/packages/d5/f8/8432f24daaf80abf9c1a3e234a17d5245c00ec941695978cf265265c8f4d/k2_fsa-0.0.3-py36-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "14ec6aa3d8e690cb5e15f517b36f7955d142423cd8e745483a938a2d5aec005e",
          "md5": "53375c730dc0d0603fb929b4fbd736c2",
          "sha256": "bd137743e7b95d33e7e23fffe3333dc7ab5ea66ae2cac004d134ae684cba67de"
        },
        "downloads": -1,
        "filename": "k2_fsa-0.0.5-py36-none-any.whl",
        "has_sig": false,
        "md5_digest": "53375c730dc0d0603fb929b4fbd736c2",
        "packagetype": "bdist_wheel",
        "python_version": "py36",
        "requires_python": ">=3.6",
        "size": 2494106,
        "upload_time": "2020-10-03T11:06:15",
        "upload_time_iso_8601": "2020-10-03T11:06:15.668132Z",
        "url": "https://files.pythonhosted.org/packages/14/ec/6aa3d8e690cb5e15f517b36f7955d142423cd8e745483a938a2d5aec005e/k2_fsa-0.0.5-py36-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "14ec6aa3d8e690cb5e15f517b36f7955d142423cd8e745483a938a2d5aec005e",
        "md5": "53375c730dc0d0603fb929b4fbd736c2",
        "sha256": "bd137743e7b95d33e7e23fffe3333dc7ab5ea66ae2cac004d134ae684cba67de"
      },
      "downloads": -1,
      "filename": "k2_fsa-0.0.5-py36-none-any.whl",
      "has_sig": false,
      "md5_digest": "53375c730dc0d0603fb929b4fbd736c2",
      "packagetype": "bdist_wheel",
      "python_version": "py36",
      "requires_python": ">=3.6",
      "size": 2494106,
      "upload_time": "2020-10-03T11:06:15",
      "upload_time_iso_8601": "2020-10-03T11:06:15.668132Z",
      "url": "https://files.pythonhosted.org/packages/14/ec/6aa3d8e690cb5e15f517b36f7955d142423cd8e745483a938a2d5aec005e/k2_fsa-0.0.5-py36-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}