{
  "info": {
    "author": "Peter Stamps",
    "author_email": "p.j.m.stamps@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "Intended Audience :: Developers",
      "License :: OSI Approved :: European Union Public Licence 1.2 (EUPL 1.2)",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.7",
      "Programming Language :: Python :: 3.8",
      "Topic :: Software Development :: Build Tools"
    ],
    "description": "Introduction\n============\n\nKaptsja is the Dutch \"phonetic pronunciation\" for CaptCha. \nThis Kaptsja software is meant to determine if the online \"user\" is a human and not a (ro)bot or any type of automated program. The acronym CAPTCHA stands for \"Completely Automated Public Turing test to tell Computers and Humans Apart\".  \nWhen a user solves the presented captcha \"puzzle\" continuation to next pages on the site are allowed else the user is refushed further access. In this Kaptsja software it means continuation to respectively a success or failure page depending on the check result. This routing can be easily adapted to the needs.\n\nNOTE 1: The second Readme2.rst describes additional details and features. \n\nNOTE 2: Also the configuration file and the source code offer a wealth of documentation.\n\n**Release notes**\n-----------------\n10.1.2  First release\n\n10.1.3  Added missing randomlist directory with pictures\n\n10.1.4  HTML closing tag correction in modal page\n\n10.1.5  Added time limit to solve Kaptsja within a defined time (in seconds). Deleted some left \"debug\" print statements.\n\n10.1.6  Correction of wrong rotation angle test. The value was always set to 30. Now rotation range 0 - 360 is possible as intended.  Bottle debug and reloader set to False, to prevent double generation of HTML pages (no functional change however). How to run on Android has been added.\n\n10.2.0  Added configuration setting \"redirect_after_captcha\". Setting this to \"True\" will avoid redirection to success or failure page after submission and Kaptsja verification happened. Only a True or False string will be returned allowing JavaScript to handle the continuation in the HTML page itself (similar to Google's reCaptcha).\n\n**Quick Installation of Kaptsja**\n---------------------------------\nImportant: use **--target** or **-t** to specify your desired location \n\n**pip install --target=<your_directory> Kaptsja**\n\n**pip install -t <your_directory> Kaptsja**\n\nExample: pip install -t \\temp\\Kaptsja  Kaptsja\n\nExample: pip install -t /home/Kaptsja  Kaptsja\n\nFeatures and Functions \n----------------------\n* Three (3) different Kaptsja models are supported and are selectable.\n\t1. default -> the Kaptsja is shown direct on a single full HTML page\n\t2. modal   -> the Kaptsja is \"injected\" in a modal window generated by bootstrap.js at top of a full HTML page\n\t3. div     -> the Kaptsja is \"injected\" in a single full HTML page using JQuery \n\nFor models 2 and 3 the user is asked to check a box labeled \"I am not a Robot\"\t\n\n* Two (2) modus of operandi are possible:\n\tA. Each Kaptsja page is 100% unique per user request, as it is generated instantly on-the-fly\n\tB. A configurable set of 100% unique Kaptsja pages is pre-generated and randomly presented per user request\n\n* Numerous of settings are available to change the look and feel, colors, morphing, rotation behavior, number of characters(circles) and so on.\n\n* All relevant displayed text on the Kaptsja and its generated Web pages can be changed or translated in the Configuration file.\n\n* Configuration settings are validated, defaults set when needed and in case of errors a message is displayed in the log file.\n\n* Support instructions and examples for usage in combination with Nginx web server are provided.\n\n* It has been tested on Windows and Ubuntu 20.04 Linux with Python 3.7.4 and 3.8.5. Other versions might work as well.\n\n* It has also been tested for fun on Android (v8.0.0) using Pydroid 3 App (v4.01) with the Pydroid Repository Plugin. See below \"How to run Kaptsja on Android\". \n\n\nSummarized functionality / process overview \n-------------------------------------------\n* The online user is prompted with a picture with randomly positioned circles with characters (default uppercase letters and digits).\n* The user should click in the Right Sorting Order in each circle according to a generated instruction text inside the picture.\n* When correctly sorted, the user will pass the captcha check else a failure page will be shown.\n* For dynamically generated Kaptsja's a maximum number of seconds to solve the \"puzzle\" is set. This avoids resending values of a solved Kaptsja after the defind time.\n* Before submitting the result, the user may Retry (means correcting a wrong sorting order) till the configurable number of retries has been exceeded. \n* The font type and size for characters and instruction text are configurable.\n* The number of circles and the characters to use are both configurable, as well as the transparency percentage of the circle and character.\n* Automatically the instruction text positioning adapts to picture size, the size of the text and used fonts. More/less words, more lines or line breaks, other font types and font points are all leading to a different instruction text size, as well as different sized circles with a character: Kaptsja takes care of that all.\n* The diameters of the circles are randomly generated. Positioning of circles in the picture will automatically adapt to changes in the size of the instruction text.\n* A single picture or a subdirectory with a number of pictures (randomly picked) can be provided to serve as background for the captcha. A copyright notice text can optionally be put on the picture at the left/right upper corner. Copyright text, the color and text size can be configured \n* A full set of nice example pictures is provided for random display. The default files: Kaptsja_bg.jpg and Kaptsja.ico can be (re-)generated at will. \n* Automatically too large background pictures will be resized for their width: the height will resize proprotionally (resizing happens and is needed only once). \n* Pictures can be forced to rescale. For example to get a smaller modal window (see model 2 which create a modal HTML page: popup). The modal window width size will adapt automatically to the new width of the resized picture.\n* For too small background pictures a recommendation message with a minimum required picture size will be generated in the log file: so another input picture can be picked or the font sizes and number of circles can be reduced.\n* The characters are somewhat distorted to make it difficult for (ro)bots and OCR software to recognise them.\n* Chinese and other Unicode characters are supported and they can be used as \"Chinese characters symbols\" in the circles, but keep in mind that not everybody is familiar with their right sorting order. \n* All circles and characters do get random colors. Transparency increase may make it more difficult to detect them on the picture for scan or face recognition software, but also for humans to a lesser extent.\n* The morphing of the characters can be changed making detection even more difficult. In general humans are better in \"reconstructing the missing pieces\" of a character.\n* Also the sorting instructions are somewhat distorted for the same reason as above.\n* For (ro)bots and humans there are no hints inside the generated Kaptsja HTML page to find for example the correct sort order or to determine an algoritme for correct clicking in the circles. Visual interpretation of the picture and instructions is required to solve the captcha.\n* Automated detection software will be very complex as it needs to figure out:\n    * What are the shown sorting instructions telling?  --> instruction changes randomly\n    * Which characters are provided?  --> changes randomly and they are morphed to hinder easy detection\n    * Where are these characters located in the picture?  --> the position changes per new Kaptsja picture\n    * Clicking in the circle is a must, so the software needs to emulate this.\n* A click on a circle picture does not indicate the character itself. The clicks represent just a check number.\n* At the server side the Kaptsja puzzle will be solved by the software following the same process as the user, but with one difference: the check process knows (without server side storage) what the correct order should be, which is not the sorting order itself.\n* The server encrypts the clue to solve the puzzle using a 256 bits AES encryption (subset of the Rijndael-algoritm) and submits it within the Kaptsja page. The user re-submits the hidden encrypted code back together with the code created by the clicks. Both codes are needed to validate the result. The server side software knows how to decrypt the \"clue\".\n\n* The Kaptsja software generates all: picture with circles plus characters and the required Kaptsja HTML pages including the JavaScript and CSS for processing.\n\n* From the HOME page three (3) models are presented. The activated model can be selected to show and test the generated captcha.\n\n* An external Web Server is advised to run this Kaptsja software in production. Nginx and uwsgi has been tested. Configuration instruction and conf and ini file examples are included as well as some hints to solve potential issues.\n* An pre-configured web site module using the Bottle webserver is provided. Installation of the Python Bottle web server is required. \n\n*Dependencies*\n--------------\n - Python 3.7.4 was used to develop this software. \n   It has been tested with Python 3.7.4 on Windows and Python 3.8.5 on Ubuntu 20.04 (other Python 3 versions might work). \n - Most imports of packages are from the standard Python distribution libraries. \n - The indicated versions below are additionally installed and used during development. \n - The additional Python packages can be installed with: **pip install <package>** ; on Ubuntu: **apt get <packages>**\n - When Anaconda is installed use **conda install -c anaconda <package>**. \n\n **Required**:\n  * bottle 0.12.18\n\n  * Pillow  (Python Imaging Library (Fork of PIL)  Version 7.0.0 and 8.0.0 on Windows and Version 8.0.0 on Ubuntu 20.04 are tested\n\n  * pycryptodome 3.9.8 (as alternative: pycrypto 2.6.1 will also work with Python 3.7, with Python 3.8 a small fix is needed)\n\n  * BeautifulSoup4 \n\n **Optional**:\n\n    lxml 4.6.2\n\n  * pytesseract 0.3.6 and Tesseract. They can be installed to read with OCR the generated images to verify if Kaptsja's generated can be recognised with the OCR method.\n\n\nQuick start\n-----------\nThis instruction assumes that Python 3.7.4 is already installed.\nCopy Kaptsja and subdirectories to a directory (any directory will do).\nUnzip into your directory of choice if you have a zipped version of Kaptsja. \n\nThe structure should look like this (the rendering of tree structure might fail here; sorry for that. Please look into readme.rst file itself when it is unreadable here):\n\n::\n\n    ---<your directory>\n    |   |_Kaptsja\n    |   | |_css\n    |   |   |_bootstrap.min-3.3.7.css\n    |   | |_docs\n    |   |   |_Readme2.rst\n    |   | |_html\n    |   |   |_KaptsjaFailurePage.html\n    |   |   |_KaptsjaHome.html\n    |   |   |_KaptsjaSuccessPage.html\n    |   | |_js\n    |   |   |_bootstrap.min-3.3.7.js\n    |   |   |_jquery.min-3.5.1.js\n    |   | |_key\n    |   |   |_Kaptsja_secret_key.txt\n    |   | |_log\n    |   |   |_Kaptsja.log\n    |   | |_media\n    |   |   |_randomlist\n    |   |   | |_ ... A list of example input picture files has been provided (Courtesy of Margrhet Stamps, All Glass works are made by myself ;-)\n    |   |   | |_ ... Various input types may be used like jpg, png, tiff, bmp, ... \n    |   |   | |_ Glass_1.jpg \n    |   |   | |_ Glass_2.jpg\n    |   |   | |_ ...\n    |   |   | |_ Glass_7.jpg\n    |   |   | |_ Glass_8.jpg\n    |   |   | |_ Kaptsja_bg.jpg\n    |   |   |_ Kaptsja.ico     <-- the default favicon.ico file, which is presented in the web browser tab and served by Bottle.py\n    |   |   |_ Kaptsja_bg.jpg  <-- default input picture file plus copies of the files shown under randomlist\n    |   | |_scripts\n    |   | | |_KaptsjaConfiguration.py\n    |   | | |_KaptsjaEncDec.py\n    |   | | |_KaptsjaGenerator.py\n    |   | | |_KaptsjaHTMLpages.py\n    |   | | |_KaptsjaPictureIco.py\n    |   | | |_KaptsjaSite.py\n    |   | | |_secret_key.txt\n    |   | | |_Z__input.txt\n    |   | | |_Z__input_dec.txt\n    |   | | |_Z__input_enc.txt\n    |   | |_work\n    |   | |_ ... generated unique Kaptsja sets (html, png, js, css files) \n    |   | |_ ... See below the examples of generated file names.\n    |   | |_ ... KaptsjaDIV_1607460886.7940052.html, \n    |   | |_ ... KaptsjaDIV_1607460886.7940052.css \n    |   | |_ ... KaptsjaDIV_1607460886.7940052.js\n    |   | |_ ... KaptsjaPage_1607460908.852623   \n    |   | |_ ... KaptsjaPicture_1607460888.4223156.png\n    |   | |_ ... KaptsjaModal_1607461539.9284627.html\n    |   |_Kaptsja Copyright Notice.txt\n    |   |_Kaptsja.zip     <-- Complete zipped Kaptsja directory, download this Zip and unzip. Kaptsja directory plus subdirectories and files will be created\n    |   |_Readme.rst\n    |   |_Start_Kaptsja_website.bat\n    |   |_Start_Kaptsja_website.sh\n\n\nInstallation of the additonal Python packages\n---------------------------------------------\nUse pip for installation. Pip is the package installer for Python packages. \n\n* pip install bottle\n\n* pip install Pillow\n\n* pip install pycryptodome\n\n* on Ubuntu 20.04 use: sudo apt-get install python3-bs4\n\n* on Windows use: pip install BeautifulSoup4\n\n* Optional: install lxml\n\n   * on Ubuntu 20.04 use: sudo apt-get install python-lxml \n   *  on windows use : pip install lxml\n\n   When lxml is installed it will automatically \"replace\" the default html.paser.\n\nIf an Anaconda distribution from anaconda.org has been installed use: **conda install -c conda-forge <package name>**\n\nSome optional configuration changes for a quick customization\n-------------------------------------------------------------\nPlay first with the Kaptsja software, consult Readme2.rst in ./docs and study the comments in the configuration file for more advanced configuration possibilities.\n\nAdapt in file KaptsjaConfiguration.py in the subdirectory ./scripts/ some settings as shown below (when needed). \n\nThese are: the paths to where your Fonts are installed and the default input picture if you want to change that.  Best is to use Linux path notations, but Windows path notation will work as long as you quote them with the letter r or R in front of the path string like: \n\n  r\"<Windows Path here>\" or R\"<Windows Path here>\".  This is a Python raw string notation and all backslashes are left in the string. You do not need to use \\\\ as Windows path separator, unless the letter r is missing!\n\n  Be aware that this is normal Python code! Check these settings to begin with. The values are just examples and may be changed.\n\n    * input_picture =\"Kaptsja_bg.jpg\" \n\n    * font_textzone = 20\n\n    * font_circle   = 45\n\n    * sitehost = \"ubuntu2004.wsl\"   \n\n    * siteport = 9081  \n\n    * siteserver = \"python_server\"  \n\n    * sitedebug = False \n\n    * site_reloader = False                          \n\n**Startup commands**\n--------------------\n\nOpen a command window and cd to <your directory>/Kaptsja/\n\nOn Windows enter command: *Start_Kaptsja_website.bat*  or run python .\\scripts\\KaptsjaSite.py\n\nOn Linux enter command: *Start_Kaptsja_website.sh*.    or run python ./scripts/KaptsjaSite.py\n\nOpen a web browser and enter the URL as shown in the command window: Default: http://localhost:8080/\n\nA Web page opens with tab. Click on the tab for the activated model to start the Kaptsja and try it!\n\nProgram KaptsjaGenerator.py which generates the shown Kaptsja page can be run directly from the command line as follows (needed when max_captcha_sets > 0):\n\nOpen a command window and cd to <your directory>/Kaptsja/\n\nEnter command: *python ./scripts/KaptsjaGenerator.py* and follow the shown instructions. \n\nIf no default picture (KaptsjaPictureIco.py) or default icon (Kaptsja.ico) exists then run KaptsjaPictureIco.py.\n\nEnter command: *python ./scripts/KaptsjaPictureIco.py* and the picture and ico will be created in media_dir.\n\nPut any picture to be used as Kaptsja background in /Kaptsja/media  or in /Kaptsja/media/randomlist.\n\n\n**How to run Kaptsja on Android** \n---------------------------------\nFor fun Kaptsja has also been tested on Android (v8.0.0) using Pydroid 3 App (v4.01) with the Pydroid Repository Plugin. Here is how to do it.\n\n- Install Pydroid 3 and Pydroid Repository plugin Apps (the free versions will be okay).\n\n- Remember to run both Pydroid 3 and your mobile web browser in a **split screen** else Pydroid will close the session.\n\n- This is due to a bug in Pydroid and it needs to be restarted to continue. \n\n- You need to install a font as well. Download the desired font file and when compressed (.zip format) unzip the file. \n\n- Free fonts can be downloaded here https://fonts.google.com/ e.g. https://fonts.google.com/specimen/Ubuntu. Ubuntu-Bold.ttf is a good choice.\n\n- A good place to put the font file in (e.g. Ubuntu-Bold.ttf), is in home Kaptsja folder. Do not forget to adapt the two font paths in KaptsjaConfiguration.py. \n\n- Use a text editor App like QuickEdit (any will do) to change the settings. \n\n- Always install Kaptsja via the Pydroid Terminal option (from Menu). First change to your desired folder location and run there following command \"pip install -t . Kaptsja\". \n\n- Install the dependencies as listed above. Here you can either use the Pydroid pip menu or simply run in the Pydroid Terminal \"pip install bottle Pillow pycryptodome BeautifulSoup4\".\n\n- The whole Kaptsja folder structure as listed above will be installed as subdirectory at your desired location. \n\n- Run Kaptsja via the Pydroid Terminal option. Start the command in the new Kaptsja home folder! Run command \"python ./scripts/KaptsjaSite.py\". \n\n- Open a mobile browser in split screen and enter url: \"http://localhost:8080/\".\n\n- Enjoy solving Kaptsja's!\n\n\n**More details are documented in ./docs/Readme2.rst** \n-----------------------------------------------------\nFor more installation and configuration details look into Readme2.rst file.\nIt is located at \"/Kaptsja/docs/Readme2.rst\".\nFor installation with Ningx and uwsgi refer to \"/Kaptsja/docs/Installation of Kaptsja with Nginx and uwsgi.rst\".\nNote that a combination of various Python versions in a Python virtual environment setup and / or with native Python installtions on Linux can cause quite some headaches; especially when settings and binaries are mixed! Double check!\n\n\n**A Multipurpose AES 256 bits Encryption and Decription module is included**\n----------------------------------------------------------------------------\nModule KaptsjaEncDec.py contains an advanced encyptions/decryption\n\nIn the Kaptsja HTML page it encrypts/decrypts the controlvalue send to and returned from the browser.\n\nThis encryption/ decryption module can be used universally in many projects!\n\n\n\n**Note: a fix when using pycrypto in stead of pycryptodome**\n------------------------------------------------------------\nThe suggestion is to use pycryptodome, but when not possible pycrypto can be used as well, taking into account next remarks.\n::\n\n\tIn stead of using pycryptodome 3.9.8, package pycrypto 2.6.1 may be used as drop-in.\n\tIt has been tested with Python 3.7.4, but when combined with Python 3.8 following error needs to be fixed first! \n\t* Solving: AttributeError: module 'time' has no attribute 'clock' in Python 3.8*\n\n\t\tWhen using Python 3.8 or higher following error will occur:\n\t\t  File \"/usr/local/lib/python3.8/dist-packages/Crypto/Random/_UserFriendlyRNG.py\", line 77, in collect\n\t\t\tt = time.clock()\n\t\tAttributeError: module 'time' has no attribute 'clock'\n\n\t\tIn Python 3.8 the function time.clock() has been removed, after having been deprecated since Python 3.3: \n\t\tuse time.perf_counter() or time.process_time() instead, depending on your requirements, to have a well-defined behavior.\n\t\t(Contributed by Matthias Bussonnier in bpo-36895 https://bugs.python.org/issue36895)\t\n\n\t\tTo Fix this change line 77 in module _UserFriendlyRNG.py as follows:\n\t\t77   t = time.clock()          <-- old\n\t\t77   t = time.process_time()   <-- new\n\n\t\tUbuntu:\n\t\t\tsudo nano /usr/local/lib/python3.8/dist-packages/Crypto/Random/_UserFriendlyRNG.py\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/peterstamps/Kaptsja/",
    "keywords": "Captcha catpcha,recaptcha,re-captcha Encryption Decryption Picture Puzzle Circle Character Generator",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "Kaptsja",
    "package_url": "https://pypi.org/project/Kaptsja/",
    "platform": "",
    "project_url": "https://pypi.org/project/Kaptsja/",
    "project_urls": {
      "Documentation": "https://github.com/peterstamps/Kaptsja",
      "Homepage": "https://github.com/peterstamps/Kaptsja/"
    },
    "release_url": "https://pypi.org/project/Kaptsja/10.2.0/",
    "requires_dist": null,
    "requires_python": ">=3.7.4",
    "summary": "Kaptsja is the Dutch 'phonetic pronunciation' for this CaptCha software with special and complex features.",
    "version": "10.2.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 8905861,
  "releases": {
    "10.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "982d3d63fe73690e105bdd85b1fe198aef545cfdfe2a68f6417e379b175f0348",
          "md5": "cbc1bd2242e1034328e13ffa21ff97bb",
          "sha256": "3e34ffa0a2f1af05958765131a9fa1169a34c50ece3c9afb14dc809ceaf46907"
        },
        "downloads": -1,
        "filename": "Kaptsja-10.1.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "cbc1bd2242e1034328e13ffa21ff97bb",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7.4",
        "size": 946600,
        "upload_time": "2020-12-11T15:30:31",
        "upload_time_iso_8601": "2020-12-11T15:30:31.288531Z",
        "url": "https://files.pythonhosted.org/packages/98/2d/3d63fe73690e105bdd85b1fe198aef545cfdfe2a68f6417e379b175f0348/Kaptsja-10.1.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "11f3f6ae87173fde1a7d4bda902be5e656c51d1d98200f8255e059f50bc25663",
          "md5": "873bf994df366bbfc1d4f665a6b41edd",
          "sha256": "9a2cb7767a3cb0bad8e3f4836f7d7b6c18691a2a0aa8624472c10b0d7e7895f2"
        },
        "downloads": -1,
        "filename": "Kaptsja-10.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "873bf994df366bbfc1d4f665a6b41edd",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7.4",
        "size": 1239128,
        "upload_time": "2020-12-11T15:30:32",
        "upload_time_iso_8601": "2020-12-11T15:30:32.680795Z",
        "url": "https://files.pythonhosted.org/packages/11/f3/f6ae87173fde1a7d4bda902be5e656c51d1d98200f8255e059f50bc25663/Kaptsja-10.1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "10.1.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3b89c3674587aabf320f1468d79e25fe42d582c7ce49ac2300c90451604254df",
          "md5": "e7baf5b3caaef651bc7bed82750745d6",
          "sha256": "10aef3d7a34003e3e959db84257749205725174878c8d189efa906cd02b7e3c4"
        },
        "downloads": -1,
        "filename": "Kaptsja-10.1.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "e7baf5b3caaef651bc7bed82750745d6",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7.4",
        "size": 1389799,
        "upload_time": "2020-12-11T16:21:10",
        "upload_time_iso_8601": "2020-12-11T16:21:10.962629Z",
        "url": "https://files.pythonhosted.org/packages/3b/89/c3674587aabf320f1468d79e25fe42d582c7ce49ac2300c90451604254df/Kaptsja-10.1.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d7d8ee36e3bb172b5f0ac720d439f65a130c461f11862a692a8df310106ee598",
          "md5": "c815f4df7fcd6b652efa24688ebd6574",
          "sha256": "95c5f3e754c6cbfa06948251731d0f15a80c075e17737a28fdda10315b53b0e7"
        },
        "downloads": -1,
        "filename": "Kaptsja-10.1.3.tar.gz",
        "has_sig": false,
        "md5_digest": "c815f4df7fcd6b652efa24688ebd6574",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7.4",
        "size": 1239280,
        "upload_time": "2020-12-11T16:21:12",
        "upload_time_iso_8601": "2020-12-11T16:21:12.152228Z",
        "url": "https://files.pythonhosted.org/packages/d7/d8/ee36e3bb172b5f0ac720d439f65a130c461f11862a692a8df310106ee598/Kaptsja-10.1.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "10.1.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a88ab4f17398d45e1d487da4ee7acd152f6406ffc90c52d8550ef4d1770cee47",
          "md5": "53786f030da288295a09b44c9ef2ecc0",
          "sha256": "f5b495e9a8033455ff0a42885d672ccc464049f06e429b04d7bc5a66f04a1edb"
        },
        "downloads": -1,
        "filename": "Kaptsja-10.1.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "53786f030da288295a09b44c9ef2ecc0",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7.4",
        "size": 1389861,
        "upload_time": "2020-12-11T22:48:53",
        "upload_time_iso_8601": "2020-12-11T22:48:53.888631Z",
        "url": "https://files.pythonhosted.org/packages/a8/8a/b4f17398d45e1d487da4ee7acd152f6406ffc90c52d8550ef4d1770cee47/Kaptsja-10.1.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "10a531e1f8efdcebe5cd64a6f713ef1da5abdcc4699e715b5af48d0c88da4363",
          "md5": "1a7b87b2f3b69dac0279f48921288fa0",
          "sha256": "6fa531fb80855a4b11575b93b9e08bf10a068e9a66a4dd35c33b69b307f78a0d"
        },
        "downloads": -1,
        "filename": "Kaptsja-10.1.4.tar.gz",
        "has_sig": false,
        "md5_digest": "1a7b87b2f3b69dac0279f48921288fa0",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7.4",
        "size": 1239380,
        "upload_time": "2020-12-11T22:48:55",
        "upload_time_iso_8601": "2020-12-11T22:48:55.248686Z",
        "url": "https://files.pythonhosted.org/packages/10/a5/31e1f8efdcebe5cd64a6f713ef1da5abdcc4699e715b5af48d0c88da4363/Kaptsja-10.1.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "10.1.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b98a0880f10389e003d4e9531df61d592b105d1f033d70baec7b6a9ada5788bb",
          "md5": "4de9ffe6b3ab55e95d2f3053459ebeb4",
          "sha256": "6399bdb6bde605310fbbbea8c07a45f2c581b909745467f36c2367c0c45b9f11"
        },
        "downloads": -1,
        "filename": "Kaptsja-10.1.5-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "4de9ffe6b3ab55e95d2f3053459ebeb4",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7.4",
        "size": 1242738,
        "upload_time": "2020-12-12T18:46:03",
        "upload_time_iso_8601": "2020-12-12T18:46:03.087659Z",
        "url": "https://files.pythonhosted.org/packages/b9/8a/0880f10389e003d4e9531df61d592b105d1f033d70baec7b6a9ada5788bb/Kaptsja-10.1.5-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a2b09337051b72ed57949f2e4f0ef171e2c8e0b777ee4856d5639f67455a50e0",
          "md5": "d3383fd1b30802c23ef184e0900192ef",
          "sha256": "98f4c35d60f63ea9bb1e053b33f7b7b9137bcf89bdf1fe515425e90df0b757da"
        },
        "downloads": -1,
        "filename": "Kaptsja-10.1.5.tar.gz",
        "has_sig": false,
        "md5_digest": "d3383fd1b30802c23ef184e0900192ef",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7.4",
        "size": 1232830,
        "upload_time": "2020-12-12T18:46:04",
        "upload_time_iso_8601": "2020-12-12T18:46:04.501936Z",
        "url": "https://files.pythonhosted.org/packages/a2/b0/9337051b72ed57949f2e4f0ef171e2c8e0b777ee4856d5639f67455a50e0/Kaptsja-10.1.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "10.1.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d506b0d6da6ecec8e374e4bbf9aa05d2eb4595d387fac7709fc28475004dd1bf",
          "md5": "ef343f86823a8afb9fbbcb983ceedfce",
          "sha256": "c01cd4189411d39a20c56d236abe5ad5a5789885e45e92cf192f463d4d35087e"
        },
        "downloads": -1,
        "filename": "Kaptsja-10.1.6-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "ef343f86823a8afb9fbbcb983ceedfce",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7.4",
        "size": 1244311,
        "upload_time": "2020-12-13T10:25:51",
        "upload_time_iso_8601": "2020-12-13T10:25:51.591729Z",
        "url": "https://files.pythonhosted.org/packages/d5/06/b0d6da6ecec8e374e4bbf9aa05d2eb4595d387fac7709fc28475004dd1bf/Kaptsja-10.1.6-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "30ebb38f5db5a04f978d0518e6cf2e5bb0bfc333b6c55b49bea8c55690a0c90d",
          "md5": "14794d937716262003ff41e29d469174",
          "sha256": "ddbaafdb68c4d15aa10b4b39da7f08241039216562f7af11f5bf6f28d8b8bb59"
        },
        "downloads": -1,
        "filename": "Kaptsja-10.1.6.tar.gz",
        "has_sig": false,
        "md5_digest": "14794d937716262003ff41e29d469174",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7.4",
        "size": 1234720,
        "upload_time": "2020-12-13T10:25:53",
        "upload_time_iso_8601": "2020-12-13T10:25:53.033684Z",
        "url": "https://files.pythonhosted.org/packages/30/eb/b38f5db5a04f978d0518e6cf2e5bb0bfc333b6c55b49bea8c55690a0c90d/Kaptsja-10.1.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "10.2.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "eca3778b65ccf8600ed4d8cad3fb597520003bef27b99d0f750c957fafa4b93f",
          "md5": "dc647a32db12a1494e475ac4ed8b0983",
          "sha256": "146304aa37da19cd923c04e2fe69576b90232a9608ae9542c5c952298512ec60"
        },
        "downloads": -1,
        "filename": "Kaptsja-10.2.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "dc647a32db12a1494e475ac4ed8b0983",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7.4",
        "size": 1244979,
        "upload_time": "2020-12-15T16:51:40",
        "upload_time_iso_8601": "2020-12-15T16:51:40.634373Z",
        "url": "https://files.pythonhosted.org/packages/ec/a3/778b65ccf8600ed4d8cad3fb597520003bef27b99d0f750c957fafa4b93f/Kaptsja-10.2.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a37855901e418bc3a9f9e413b1da4faf90c317a41ad70ea93dfb9c86533e1b99",
          "md5": "608217c09469b5c7561bb917723273b0",
          "sha256": "7af723e458e5a446c93c26c52633e50d68840b769d024f1a50655c761ceb35d8"
        },
        "downloads": -1,
        "filename": "Kaptsja-10.2.0.tar.gz",
        "has_sig": false,
        "md5_digest": "608217c09469b5c7561bb917723273b0",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7.4",
        "size": 1235407,
        "upload_time": "2020-12-15T16:51:42",
        "upload_time_iso_8601": "2020-12-15T16:51:42.210987Z",
        "url": "https://files.pythonhosted.org/packages/a3/78/55901e418bc3a9f9e413b1da4faf90c317a41ad70ea93dfb9c86533e1b99/Kaptsja-10.2.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "eca3778b65ccf8600ed4d8cad3fb597520003bef27b99d0f750c957fafa4b93f",
        "md5": "dc647a32db12a1494e475ac4ed8b0983",
        "sha256": "146304aa37da19cd923c04e2fe69576b90232a9608ae9542c5c952298512ec60"
      },
      "downloads": -1,
      "filename": "Kaptsja-10.2.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "dc647a32db12a1494e475ac4ed8b0983",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.7.4",
      "size": 1244979,
      "upload_time": "2020-12-15T16:51:40",
      "upload_time_iso_8601": "2020-12-15T16:51:40.634373Z",
      "url": "https://files.pythonhosted.org/packages/ec/a3/778b65ccf8600ed4d8cad3fb597520003bef27b99d0f750c957fafa4b93f/Kaptsja-10.2.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "a37855901e418bc3a9f9e413b1da4faf90c317a41ad70ea93dfb9c86533e1b99",
        "md5": "608217c09469b5c7561bb917723273b0",
        "sha256": "7af723e458e5a446c93c26c52633e50d68840b769d024f1a50655c761ceb35d8"
      },
      "downloads": -1,
      "filename": "Kaptsja-10.2.0.tar.gz",
      "has_sig": false,
      "md5_digest": "608217c09469b5c7561bb917723273b0",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7.4",
      "size": 1235407,
      "upload_time": "2020-12-15T16:51:42",
      "upload_time_iso_8601": "2020-12-15T16:51:42.210987Z",
      "url": "https://files.pythonhosted.org/packages/a3/78/55901e418bc3a9f9e413b1da4faf90c317a41ad70ea93dfb9c86533e1b99/Kaptsja-10.2.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}