{
  "info": {
    "author": "David Lesieur",
    "author_email": "kerko@whiskyechobravo.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "Environment :: Web Environment",
      "Framework :: Flask",
      "Intended Audience :: Developers",
      "Intended Audience :: Education",
      "Intended Audience :: Science/Research",
      "License :: OSI Approved :: GNU General Public License v3 (GPLv3)",
      "Operating System :: OS Independent",
      "Programming Language :: Python",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3 :: Only",
      "Programming Language :: Python :: 3.10",
      "Programming Language :: Python :: 3.11",
      "Programming Language :: Python :: 3.7",
      "Programming Language :: Python :: 3.8",
      "Programming Language :: Python :: 3.9",
      "Topic :: Database :: Front-Ends",
      "Topic :: Education",
      "Topic :: Internet :: WWW/HTTP :: Dynamic Content",
      "Topic :: Internet :: WWW/HTTP :: Indexing/Search",
      "Topic :: Scientific/Engineering",
      "Topic :: Software Development :: Libraries :: Python Modules"
    ],
    "description": "[![License](https://img.shields.io/pypi/l/kerko)][Kerko]\n[![Version](https://img.shields.io/pypi/v/kerko?color=informational)][Kerko_pypi]\n[![Tests status](https://github.com/whiskyechobravo/kerko/workflows/tests/badge.svg)][Kerko_actions]\n\n# Kerko\n\n[Kerko] is a web application component implemented in [Python] for the [Flask]\nframework that provides a user-friendly search and browsing interface for\nsharing a bibliography managed with the [Zotero] reference manager.\n\nThe combination of Kerko and Zotero gives you the best of both worlds: a rich\nbut easy to use web interface for end-users of the bibliography, and a\nwell-established and powerful bibliographic reference management tool for\nindividuals or teams working on the bibliography's content.\n\nContents:\n\n- [Kerko](#kerko)\n  - [How it works](#how-it-works)\n  - [Demo site](#demo-site)\n  - [Features](#features)\n  - [Requirements](#requirements)\n  - [Getting started](#getting-started)\n  - [Configuration variables](#configuration-variables)\n  - [Synchronization process](#synchronization-process)\n  - [Command line interface (CLI)](#command-line-interface-cli)\n  - [Known limitations](#known-limitations)\n  - [Design choices](#design-choices)\n  - [Kerko Recipes](#kerko-recipes)\n    - [Ensuring full-text indexing of your attachments in Zotero](#ensuring-full-text-indexing-of-your-attachments-in-zotero)\n    - [Providing _Cites_ and _Cited by_ relations](#providing-cites-and-cited-by-relations)\n    - [Submitting your sitemap to search engines](#submitting-your-sitemap-to-search-engines)\n  - [Translating Kerko](#translating-kerko)\n  - [Contributing](#contributing)\n    - [Reporting issues](#reporting-issues)\n    - [Making code changes](#making-code-changes)\n    - [Running the tests](#running-the-tests)\n    - [Submitting code changes](#submitting-code-changes)\n    - [Submitting a translation](#submitting-a-translation)\n    - [Supporting the project](#supporting-the-project)\n  - [Changelog](#changelog)\n  - [Project background](#project-background)\n    - [Etymology](#etymology)\n  - [Powered by Kerko](#powered-by-kerko)\n\n\n## How it works\n\nA Kerko-powered bibliography is managed using Zotero, and stored in the cloud on\nzotero.org, while Kerko itself is incorporated into an application which is\ninstalled on a web server. The bibliographic references may reside in a Zotero\ngroup library, where multiple users may collaborate to manage the content, or in\na Zotero private library. On the web server, Kerko maintains a search index,\nwhich is a copy of the Zotero library that is optimized for search. When users\ninteract with the web application, Kerko gets all the required data from that\nsearch index, without ever contacting zotero.org. It is through a scheduled\ntask, which runs at regular intervals, that Kerko automatically brings its\nsearch index up to date by using the [Zotero Web API][Zotero_web_api] to\nretrieve the latest data from zotero.org.\n\nAs a Flask [blueprint][Flask_blueprint] (a \"blueprint\" is Flask's term for an\napplication component, similar to what some other systems might call a plugin or\nan extension), Kerko only works when incorporated into a Flask application.\nHowever, a sample stand-alone application is available, [KerkoApp], which is\npre-built with Kerko and ready to be deployed on a web server. KerkoApp might\nwork for you if you like the default appearance and if the provided\nconfiguration options are sufficient for your needs, otherwise you should\nprobably consider building a custom application. In a custom application, the\nKerko-powered bibliography might be just one section of a larger website.\n\n\n## Demo site\n\nA [KerkoApp]-based [demo site][KerkoApp_demo] is available for you to try. You\nmay also view the [Zotero library][Zotero_demo] that contains the source data\nfor the demo site.\n\n\n## Features\n\nThe following features are implemented in Kerko:\n\n- Faceted search interface: allows exploration of the bibliography both in\n  search mode and in browsing mode, potentially suiting different user needs,\n  behaviors and abilities. For example, users with a prior idea of the topic or\n  expected results are able to enter keywords or a more complex query in a\n  search field, while those who wish to become familiar with the content of the\n  bibliography or discover new topics may choose to navigate along the proposed\n  facets, to narrow or broaden their search. Since both modes are integrated\n  into a single interface, it is possible to combine them.\n- Keyword search features:\n  - Boolean operators:\n    - `AND`: matches items that contain all specified terms. This is the default\n      relation between terms when no operator is specified, e.g., `a b` is the\n      same as `a AND b`.\n    - `OR`: matches items that contain any of the specified terms, e.g., `a OR\n      b`.\n    - `NOT`: excludes items that match the term, e.g., `NOT a`.\n    - Boolean operators must be specified in uppercase and may be translated in\n      other languages.\n  - Logical grouping (with parentheses), e.g., `(a OR b) AND c`.\n  - Sequence of words (with double quotes), e.g., `\"a b c\"`. The default\n    difference between word positions is 1, meaning that an item will match if\n    it contains the words next to each other, but a different maximum distance\n    may be selected (with the tilde character), e.g. `\"web search\"~2` allows up\n    to 1 word between `web` and `search`, meaning it could match `web site\n    search` as well as `web search`.\n  - Term boosting (with the caret), e.g., `faceted^2 search browsing^0.5`\n    specifies that `faceted` is twice as important as `search` when computing\n    the relevance score of results, while `browsing` is half as important.\n    Boosting may be applied to a logical grouping, e.g., `(a b)^3 c`.\n  - Keyword search is case-insensitive, accents are folded, and punctuation is\n    ignored. To further improve recall (albeit at the cost of precision),\n    stemming is also performed on terms from most text fields, e.g., title,\n    abstract, notes. Stemming relieves the user from having to specify all\n    variants of a word when searching, e.g., terms such as `search`, `searches`,\n    and `searching` all return the same results. The [Snowball] algorithm is\n    used for that purpose.\n  - Full-text search: the text content of PDF attachments can be searched.\n  - Scope of search: users may choose to search everywhere, in\n    author/contributor names, in titles, in all fields (i.e., in metadata and\n    notes), or in documents (i.e., in the text content of attachments).\n    Applications may provide additional choices.\n- Faceted browsing: allows filtering by topic (Zotero tag), by resource type\n  (Zotero item type), by publication year. Moreover, an application may define\n  facets modeled on collections and subcollections; in such case, any collection\n  can be represented as a facet, and each subcollection as a value within that\n  facet. By taking advantage of Zotero's ability to assign any given item to\n  multiple collections, a faceted classification scheme can be modeled\n  (including hierarchies within facets).\n- Relevance scoring: provided by the [Whoosh] library and based on the [BM25F]\n  algorithm, which determines how important a term is to a document in the\n  context of the whole collection of documents, while taking into account its\n  relation to document structure (in this regard most fields are neutral, but\n  the score is boosted when a term appears in specific fields, e.g., DOI, ISBN,\n  ISSN, title, author/contributor). Any keyword search asks the question \"how\n  well does this document match this query clause?\", which requires calculating\n  a relevance score for each document. Filtering with facets, on the other hand,\n  has no effect on the score because it asks \"does this document match this\n  query clause?\", which leads to a yes or no answer.\n- Sort options: by relevance score (only applicable with keyword search), by\n  publication date, by author, by title.\n- Citation styles: any from the [Zotero Style Repository][Zotero_styles], or\n  custom stylesheet defined in the [Citation Style Language][CSL] (stylesheet\n  must be accessible by URL).\n- Language support: the default user interface is in English, but [some\n  translations][Kerko_translations] are provided. Additional translations may be\n  created using gettext-compatible tools; see [Translating\n  Kerko](#translating-kerko). Also to consider: locales supported by the [Zotero\n  Data Schema][Zotero_schema] (which provides the names of fields, item types\n  and author types displayed by Kerko); languages supported by Whoosh (which\n  provides the search capabilities), i.e., ar, da, nl, en, fi, fr, de, hu, it,\n  no, pt, ro, ru, es, sv, tr.\n- Responsive design: the simple default implementation works on large monitors\n  as well as on small screens. It is based on [Bootstrap].\n- Customizable front-end: applications may partly or fully replace the default\n  templates, scripts and stylesheets with their own.\n- Semantic markup: pages generated by Kerko embed HTML markup that can be\n  detected by web crawlers (helping the indexing of your records by search\n  engines) or by web browsers (allowing users of reference management tools to\n  easily import metadata in their library). Supported schemes are:\n    - [OpenURL COinS][COinS], in search results pages and individual\n      bibliographic record pages. COinS is recognized by [many reference\n      management tools][COinS_clients], including the [Zotero\n      Connector][Zotero_Connector] browser extension.\n    - Highwire Press tags, in the individual bibliographic record pages of book,\n      conference paper, journal article, report or thesis items. These tags are\n      recommended for indexing by [Google Scholar][HighwirePress_Google], and\n      are recognized by many other databases and reference management tools,\n      including the [Zotero Connector][Zotero_Connector] browser extension.\n- Web feeds: users of news aggregators or feed readers may get updates when new\n  bibliographic records are added. They may subscribe to the main feed, or to\n  one or more custom feeds.\n    - The main feed lists the most recently added bibliographic records.\n    - Any search page has a related custom feed that lists the most recently\n      added bibliographic records that match the search criteria. Thus, a user\n      can obtain a custom feed for a particular area of interest simply by\n      entering keywords to search and/or selecting filters.\n    - Feeds are provided in the [Atom syndication format][Atom].\n    - Basic metadata is provided directly in the feeds, using both Atom and\n      unqualified [Dublin Core][Dublin_Core] elements.\n    - An age limit may be configured to exclude older items from the feeds. This\n      may be useful to bibliographies that are frequently updated and mostly\n      meant to promote recent literature (all resources still remain visible to\n      the search interface regardless of their age).\n- Sitemap: an [XML Sitemap][XML_Sitemap] is automatically generated, and you may\n  use it to help search engines discover your bibliographic records.\n- Exporting: users may export individual records as well as complete\n  bibliographies corresponding to search results. By default, download links are\n  provided for the RIS and BibTeX formats, but applications may be configured to\n  export [any format supported by the Zotero API][Zotero_export].\n- Printing: stylesheets are provided for printing individual bibliographic\n  records as well as lists of search results. When printing search results, all\n  results get printed (not just the current page of results).\n- Notes and attachments: notes, attached files, and attached links to URIs are\n  synchronized from zotero.org and made available to users of the bibliography.\n  Regular expressions may be used to include or exclude such child items from\n  the bibliography, based on their tags.\n- DOI, ISBN and ISSN resolver: items that have such identifier in your library\n  can be referenced by appending their identifier to your Kerko site's base URL.\n- Relations: bibliographic record pages show links to related items, if any. You\n  may define such relations using Zotero's _Related_ field. Moreover, Kerko adds\n  the _Cites_ and _Cited by_ relation types, which can be managed in Zotero\n  through notes (see [Kerko Recipes](#kerko-recipes). Custom applications\n  can add more types of relations if desired.\n- Badges: icons can be displayed next to items, based on custom conditions.\n- Integration: although a [standalone application][KerkoApp] is available, Kerko\n  itself is not an application, but it can be integrated into any Flask\n  application.\n- Command line interface: Kerko provides commands for synchronizing or deleting\n  its data. These can be invoked through the `flask` command (see [Command line\n  interface](#command-line-interface-cli)).\n\n## Requirements\n\nKerko requires Python 3.7 or later.\n\nThe following Python packages will be automatically installed when installing\nKerko:\n\n- [Babel]: utilities for internationalization and localization.\n- [Bootstrap-Flask]: helper for integrating [Bootstrap].\n- [Click]: command line interface creation kit.\n- [Flask]: web application framework.\n- [Flask-Babel]: helps Kerko provide its own translations, at the blueprint level.\n- [Flask-WTF]: simple integration of Flask and WTForms.\n- [Jinja2]: template engine.\n- [Pyzotero]: Python client for the Zotero API.\n- [w3lib]: URL and HTML manipulation utilities.\n- [Werkzeug]: WSGI web application library (also required by Flask).\n- [Whoosh]: pure Python full-text indexing and searching library.\n- [WTForms]: web forms validation and rendering library.\n\nThe following front-end resources are loaded from CDNs by Kerko's default\ntemplates (but could be completely removed or replaced by your application):\n\n- [Bootstrap]: front-end component library for web applications.\n- [FontAwesome]: beautiful open source icons.\n- [jQuery]: JavaScript library (required by Bootstrap).\n- [Popper.js]: JavaScript library for handling tooltips, popovers, etc. (used by Bootstrap).\n\n\n## Getting started\n\nThis section should help you understand the minimal steps required for getting\nKerko to work within a Flask application. For a ready-to-use standalone\napplication, please refer to [KerkoApp's installation instructions][KerkoApp]\ninstead.\n\nSome familiarity with [Flask] should help you make more sense of the\ninstructions, but should not be absolutely necessary for getting them to work.\nLet's now build a minimal app, which we'll call `hello_kerko.py`:\n\n1. The first step is to install Kerko. As with any Python library, it is highly\n   recommended to install Kerko within a [virtual environment][venv].\n\n   Once the virtual environment is set and active, use the following command:\n\n   ```bash\n   pip install kerko\n   ```\n\n2. In `hello_kerko.py`, configure variables required by Kerko and create your\n   `app` object, as in the example below:\n\n   ```python\n   import pathlib\n\n   from flask import Flask\n   from kerko.composer import Composer\n\n   app = Flask(__name__)\n   app.config['SECRET_KEY'] = '_5#y2L\"F4Q8z\\n\\xec]/'  # Replace this value.\n   app.config['KERKO_ZOTERO_API_KEY'] = 'xxxxxxxxxxxxxxxxxxxxxxxx'  # Replace this value.\n   app.config['KERKO_ZOTERO_LIBRARY_ID'] = '9999999'  # Replace this value.\n   app.config['KERKO_ZOTERO_LIBRARY_TYPE'] = 'group'  # Replace this value if necessary.\n   app.config['KERKO_DATA_DIR'] = str(pathlib.Path(__file__).parent / 'data' / 'kerko')\n   app.config['KERKO_COMPOSER'] = Composer()\n   ```\n\n   - `SECRET_KEY`: This variable is required for generating secure tokens in web\n     forms. It should have a secure, random value and it really has to be\n     secret. It is usually set in an environment variable rather than in Python\n     code, to make sure it never ends up in a code repository. But here we're\n     taking the minimal route and thus are cutting some corners!\n   - `KERKO_ZOTERO_API_KEY`, `KERKO_ZOTERO_LIBRARY_ID` and\n     `KERKO_ZOTERO_LIBRARY_TYPE`: These variables are required for Kerko to be\n     able to access your Zotero library. See [Configuration\n     variables](#configuration-variables) for details on how to properly set\n     these variables.\n   - `KERKO_DATA_DIR`: This variable specifies the directory where to store the\n     search index and the file attachments. If the specified directory does not\n     already exists, Kerko will try to create it.\n   - `KERKO_COMPOSER`: This variable specifies key elements needed by Kerko,\n     e.g., fields for display and search, facets for filtering. These are\n     defined by instantiating the `Composer` class. Your application may\n     manipulate the resulting object at configuration time to add, remove or\n     alter fields, facets, sort options, search scopes, record download formats,\n     or badges. See [Kerko Recipes](#kerko-recipes) for some examples.\n\n3. Also configure the Flask-Babel and Bootstrap-Flask extensions:\n\n   ```python\n   from flask_babel import Babel\n   from flask_bootstrap import Bootstrap\n\n   babel = Babel(app)\n   bootstrap = Bootstrap(app)\n   ```\n\n   See the respective docs of [Flask-Babel][Flask-Babel_documentation] and\n   [Bootstrap-Flask][Bootstrap-Flask_documentation] for more details.\n\n4. Instantiate the Kerko blueprint and register it in your app:\n\n   ```python\n   from kerko import blueprint as kerko_blueprint\n\n   app.register_blueprint(kerko_blueprint, url_prefix='/bibliography')\n   ```\n\n   The `url_prefix` argument defines the base path for every URL provided by\n   Kerko.\n\n5. In the same directory as `hello_kerko.py` with your virtual environment\n   active, run the following shell commands:\n\n   ```bash\n   export FLASK_APP=hello_kerko.py\n   flask kerko sync\n   ```\n\n   Kerko will retrieve your bibliographic data from zotero.org. If you have a\n   large bibliography or large attachments, this may take a while (and there is\n   no progress indicator). In production use, that command is usually added to\n   the crontab file for regular execution (with enough time between executions\n   for each to complete before the next one starts).\n\n   To list all commands provided by Kerko:\n\n   ```bash\n   flask kerko --help\n   ```\n\n6. Run your application:\n\n   ```bash\n   flask run\n   ```\n\n7. Open http://127.0.0.1:5000/bibliography/ in your browser and explore the\n   bibliography.\n\nYou have just built a really minimal application for Kerko. This code example is\navailable at [KerkoStart]. However, if you are looking at developing a custom\nKerko application, we recommend that you consider [KerkoApp] as a starting\npoint. While KerkoApp is still quite small, it adds some features and is more\nproduction-ready than the above example.\n\n\n## Configuration variables\n\nThe variables below are required and have no default values:\n\n- `KERKO_COMPOSER`: An instance of the `kerko.composer.Composer` class.\n- `KERKO_DATA_DIR`: The directory where to store the search index and the file\n  attachments. Subdirectories `index` and `attachments` will be created if they\n  do not already exist.\n- `KERKO_ZOTERO_API_KEY`: Your API key, as [created on\n  zotero.org](https://www.zotero.org/settings/keys/new).\n- `KERKO_ZOTERO_LIBRARY_ID`: The identifier of the library to get data from. For\n  your personal library this value should be your _userID_, as found on\n  https://www.zotero.org/settings/keys (you must be logged-in). For a group\n  library this value should be the _groupID_ of the library, as found in the URL\n  of that library (e.g., in https://www.zotero.org/groups/2348869/kerko_demo,\n  the _groupID_ is `2348869`).\n- `KERKO_ZOTERO_LIBRARY_TYPE`: The type of library to get data from, either\n  `'user'` for your personal library, or `'group'` for a group library.\n\nAny of the following variables may be added to your configuration if you wish to\noverride their default value:\n\n- `KERKO_CSL_STYLE`: The citation style to use for formatted references. Can be\n  either the file name (without the `.csl` extension) of one of the styles in the\n  [Zotero Styles Repository][Zotero_styles] (e.g., `apa`) or the URL of a remote\n  CSL file. Defaults to `'apa'`.\n- `KERKO_DOWNLOAD_ATTACHMENT_NEW_WINDOW`: Open attachments in new windows, i.e.,\n  add the `target=\"_blank\"` attribute to attachment links. Defaults to `False`.\n- `KERKO_DOWNLOAD_CITATIONS_LINK`: Provide a record download button on search\n  results pages. Defaults to `True`.\n- `KERKO_DOWNLOAD_CITATIONS_MAX_COUNT`: Limit over which the record download\n  button should be hidden from search results pages. Defaults to `0` (i.e. no\n  limit).\n- `KERKO_FEEDS`: A list of syndication feed formats to publish. Defaults to\n  `['atom']`. If set to an empty list, no web feed will be provided. The only\n  supported format is `'atom'`.\n- `KERKO_FEEDS_FIELDS`: List of fields to retrieve for each feed item (these may\n  be used by the `KERKO_TEMPLATE_ATOM_FEED` template). Values in this list are\n  keys identifying fields defined in the `kerko.composer.Composer` instance. One\n  probably only needs to change the default list when overriding the template to\n  display additional fields. Note that some fields from the default list may be\n  required by other Kerko functions.\n- `KERKO_FEEDS_MAX_DAYS`: The age (in number of days) of the oldest items\n  allowed into web feeds. The Date field of the items are used for that purpose,\n  and when no date is available, the date the item was added to Zotero is used\n  instead. Defaults to `0` (no age limit). Unless your goal is to promote recent\n  literature only, you should probably ignore this setting. Note: Items with\n  missing dates will be considered as very recent, to prevent them from being\n  excluded from feeds. For the same reason, items whose date lack the month\n  and/or the day will be considered as from the 12th month of the year and/or\n  the last day of the month.\n- `KERKO_FULLTEXT_SEARCH`: Allow full-text search of PDF attachments. Defaults\n  to `True`. To get consistent results, see [Ensuring full-text indexing of your\n  attachments in\n  Zotero](#ensuring-full-text-indexing-of-your-attachments-in-zotero).\n- `KERKO_HIGHWIREPRESS_TAGS`: Embed [Highwire Press\n  tags](https://scholar.google.ca/intl/en/scholar/inclusion.html#indexing) into\n  the HTML of item pages. This should help search engines such as Google Scholar\n  index your items, but works only with book, conference paper, journal article,\n  report or thesis items. Defaults to `True` (i.e. enabled).\n- `KERKO_PAGE_LEN`: The number of search results per page. Defaults to `20`.\n- `KERKO_PAGER_LINKS`: Number of pages to show in the pager (not counting the\n  current page). Defaults to `4`.\n- `KERKO_PRINT_ITEM_LINK`: Provide a print button on item pages. Defaults to\n  `False`.\n- `KERKO_PRINT_CITATIONS_LINK`: Provide a print button on search results\n  pages. Defaults to `False`.\n- `KERKO_PRINT_CITATIONS_MAX_COUNT`: Limit over which the print button should\n  be hidden from search results pages. Defaults to `0` (i.e. no limit).\n- `KERKO_RELATIONS_INITIAL_LIMIT`: Number of related items to show above the\n  \"show more\" link. Defaults to `5`.\n- `KERKO_RELATIONS_LINKS`: Show item links in lists of related items. Defaults\n  to `False`. Enabling this only has an effect if at least one of the following\n  variables is also set to `True`: `KERKO_RESULTS_ATTACHMENT_LINKS`,\n  `KERKO_RESULTS_URL_LINKS`).\n- `KERKO_RESULTS_ABSTRACTS`: Show abstracts on search result pages. Defaults to\n  `False` (abstracts are hidden).\n- `KERKO_RESULTS_ABSTRACTS_TOGGLER`: Show a button letting users show or hide\n  abstracts on search results pages. Defaults to `True` (toggle is displayed).\n- `KERKO_RESULTS_ABSTRACTS_MAX_LENGTH`: Truncate abstracts at the given length\n  (in number of characters). If text is to be truncated in the middle of a word,\n  the whole word is discarded instead. Truncated text is appended with an\n  ellipsis sign (\"...\"). Defaults to `0` (abstracts get displayed in their full\n  length, without any truncation).\n- `KERKO_RESULTS_ABSTRACTS_MAX_LENGTH_LEEWAY`: If the length of an abstract only\n  exceeds `KERKO_RESULTS_ABSTRACTS_MAX_LENGTH` by this tolerance margin or less\n  (in number of characters), it will not be truncated. Defaults to `0` (no\n  tolerance margin).\n- `KERKO_RESULTS_ATTACHMENT_LINKS`: Provide links to attachments in search\n  results. Defaults to `True`.\n- `KERKO_RESULTS_URL_LINKS`: Provide links to online resources in search\n  results (for items whose URL field has a value). Defaults to `True`.\n- `KERKO_RESULTS_FIELDS`: List of item fields to retrieve for search results\n  (most notably used by the `KERKO_TEMPLATE_SEARCH_ITEM` template). Values in\n  this list are keys identifying fields defined in the `kerko.composer.Composer`\n  instance. One probably only needs to change the default list when overriding\n  the template to display additional fields. Note that some fields from the\n  default list may be required by other Kerko functions.\n- `KERKO_TEMPLATE_SEARCH`: Name of the Jinja2 template to render for the search\n  page with list of results. Defaults to `kerko/search.html.jinja2`.\n- `KERKO_TEMPLATE_SEARCH_ITEM`: Name of the Jinja2 template to render for the\n  search page with a single bibliographic record. Defaults to\n  `kerko/search-item.html.jinja2`.\n- `KERKO_TEMPLATE_ITEM`: Name of the Jinja2 template to render for the\n  bibliographic record view. Defaults to `kerko/item.html.jinja2`.\n- `KERKO_TEMPLATE_ATOM_FEED`: Name of the Jinja2 template used to render an Atom\n  feed. Defaults to `kerko/atom.xml.jinja2`.\n- `KERKO_TEMPLATE_LAYOUT`: Name of the Jinja2 template that is extended by the\n  search, search-item, and item templates. Defaults to `kerko/layout.html.jinja2`.\n- `KERKO_TEMPLATE_BASE`: Name of the Jinja2 template that is extended by the\n  layout template. Defaults to `kerko/base.html.jinja2`.\n- `KERKO_TITLE`: The title to display in web pages. Defaults to `'Kerko'`.\n- `KERKO_ZOTERO_BATCH_SIZE`: Number of items to request on each call to the\n  Zotero API. Defaults to `100` (which is the maximum currently allowed by the\n  API).\n- `KERKO_ZOTERO_MAX_ATTEMPTS`: Maximum number of tries after the Zotero API\n  has returned an error or not responded during indexing. Defaults to `10`.\n- `KERKO_ZOTERO_WAIT`: Time to wait (in seconds) between failed attempts to\n  call the Zotero API. Defaults to `120`.\n- Localization-related variables:\n  - `BABEL_DEFAULT_LOCALE`: The default language of the user interface. Defaults\n    to `'en'`. Your application may set this variable and/or implement a locale\n    selector function to override it (see the [Flask-Babel\n    documentation][Flask-Babel_documentation]).\n  - `BABEL_DEFAULT_TIMEZONE`: The timezone to use for user facing dates.\n    Defaults to `'UTC'`. Your application may set this variable and/or implement\n    a timezone selector function to override it (see the [Flask-Babel\n    documentation][Flask-Babel_documentation]). Any timezone name supported by\n    the [pytz] package should work.\n  - `KERKO_USE_TRANSLATIONS`: Use translations provided by the Kerko package.\n    Defaults to `True`. When this is set to `False`, translations may be\n    provided by the application's own translation catalog.\n  - `KERKO_WHOOSH_LANGUAGE`: The language of search requests. Defaults to\n    `'en'`. You may refer to Whoosh's source to get the list of supported\n    languages (`whoosh.lang.languages`) and the list of languages that support\n    stemming (`whoosh.lang.has_stemmer()`).\n  - `KERKO_ZOTERO_LOCALE`: The locale to use with Zotero API calls. This\n    dictates the locale of Zotero item types, field names, creator types and\n    citations. Defaults to `'en-US'`. Supported locales are listed at\n    https://api.zotero.org/schema, under \"locales\".\n- `GOOGLE_ANALYTICS_ID`: A Google Analytics property ID, e.g., 'UA-99999-9'.\n  This variable is optional and there is no default value. If set, the Google\n  Analytics tag is inserted into the pages.\n\n**Caution:** Many of the configuration variables cause changes to the structure\nof Kerko's cache or search index. Changing those variables may require that you\nrebuild the cache or the search index, and restart the application. See the\n[command line interface](#command-line-interface-cli) for the cleaning and\nsynchronization commands.\n\n\n## Synchronization process\n\nKerko does one-way data synchronization from zotero.org through a 3-step\nprocess:\n\n1. Synchronize the Zotero library into a local cache.\n2. Update of the search index from the cache.\n3. Download the file attachments from Zotero.\n\nThe first step performs incremental updates of the local cache. After an initial\nfull update, the subsequent synchronization runs will request only new and\nupdated items from Zotero. This greatly reduces the number of Zotero API calls,\nand thus the time required to complete the synchronization process.\n\nThe second step reads data from the cache to update the search index. If the\ncache has changed since the last update, it performs a full update of the search\nindex, otherwise it skips to the next step. Any changes to the search index are\n\"committed\" as a whole at the end of this step, thus up to that point any user\nusing the application sees the data that was available prior to the\nsynchronization run.\n\nThe third and last step reads the list of file attachments from the search\nindex, with their MD5 hashes. It compares those with the available local copies\nof the files, and downloads new or changed files from Zotero. It also deletes\nany local files that may no longer be used.\n\nNormally, all synchronization steps are executed. But under certain\ncircumstances it can be useful to execute a given step individually. For\nexample, after changing some configuration settings, one may clean just the\nsearch index and rebuild it from the cache (see [the command line\ninterface](#command-line-interface-cli) below), which will be much faster than\nre-synchronizing from Zotero.\n\n\n## Command line interface (CLI)\n\nKerko provides an integration with the [Flask command line interface][Flask_CLI].\nThe `flask` command will work with your virtual environment active, and with the\n`FLASK_APP` environment variable set to tell it where to find your application.\n\nSome frequently used commands are:\n\n```bash\n# List all commands provided by Kerko:\nflask kerko --help\n\n# Delete all of Kerko's data: cache, search index, attachments.\nflask kerko clean\n\n# Get help about the clean command:\nflask kerko clean --help\n\n# Synchronize everything: the cache (from Zotero), the search index (from the\n# cache), the attachments (from files in Zotero, based on list in search index).\nflask kerko sync\n\n# Get help about the sync command:\nflask kerko sync --help\n\n# Delete the cache. A subsequent 'flask kerko sync' will perform a full update\n# from Zotero, but it will not re-download all file attachments.\nflask kerko clean cache\n\n# Delete just the search index.\nflask kerko clean index\n\n# Synchronize just the search index (from the cache).\nflask kerko sync index\n```\n\n\n## Known limitations\n\n- The system can probably handle relatively large bibliographies (it has been\n  tested so far with ~15k entries), but the number of distinct facet values has\n  more impact on response times. For the best response times, it is recommended\n  to limit the number of distinct facet values to a few hundreds.\n- Kerko can only manage a single bibliography per application.\n- Although Kerko can be integrated in a multilingual web application were the\n  visitor may select a language, Zotero does not provide a way to manage tags or\n  collections in multiple languages. Thus, there is no easy way for Kerko to\n  provide those names in the user's language.\n- Whoosh does not provide much out-of-the-box support for non-Western languages.\n  Therefore, search might not work very well with such languages.\n- Zotero is the sole reference management tool supported as a back-end to Kerko.\n\n\n## Design choices\n\n- Do not build a back-end. Let Zotero act as the \"content management\" system.\n- Allow Kerko to integrate into richer web applications.\n- Only implement in Kerko features that are related to the exploration of a\n  bibliography. Let other parts of the web application handle all other\n  features that might be needed.\n- Use a lightweight framework (Flask) to avoid carrying many features that are\n  not needed.\n- Use pure Python dependencies to keep installation and deployment simple. Hence\n  the use of Whoosh for search, for example, instead of Elasticsearch or Solr.\n- Use a classic fullstack architecture. Keep it simple and avoid asset\n  management. Some will want to replace the templates and stylesheets anyway.\n\n\n## Kerko Recipes\n\n*TODO: More recipes!*\n\n\n### Ensuring full-text indexing of your attachments in Zotero\n\nKerko's full-text indexing relies on text content extracted from attachments by\nZotero. Consequently, for Kerko's full-text search to work, you must make sure\nthat full-text indexing works in Zotero first; see [Zotero's documentation on\nfull-text\nindexing](https://www.zotero.org/support/searching#pdf_full-text_indexing).\n\nIndividual attachments in Zotero can be indexed, partially indexed, or\nunindexed. Various conditions may cause an attachment to be partially indexed or\nunindexed, e.g., file is large, has not been processed yet, or does not contain\ntext.\n\nZotero shows the indexing status in the attachment's right pane. If it shows\n\"Indexed: Yes\", all is good. If it shows \"Indexed: No\" or \"Indexed: Partial\",\nthen clicking the \"Reindex Item\" button (next to the indexing status) should\nensure that the attachment gets fully indexed, that is if the file actually\ncontains text. If there is no \"Reindex Item\" button, it probably means that\nZotero does not support that file type for full-text indexing (at the moment, it\nonly supports PDF and plain text files).\n\nIt can be tedious to go through hundreds of attachments just to find out whether\nthey are indexed or not. To make things easier, you could create a [saved\nsearch](https://www.zotero.org/support/searching#saved_searches) in your Zotero\nlibrary to get an always up-to-date list of unindexed PDFs. Use the following\nsearch conditions:\n\n- Match *all* of the following:\n    - *Attachment File Type* — *is* — *PDF*\n    - *Attachment Content* — *does not contain* — *.* (that's a period; also\n      select *RegExp* in the small dropdown list, as that will make the period\n      match any character)\n\nThis search might return a long list of unindexed attachments. To reindex them\nall at once, you may select them, then right-click to get the contextual menu,\nand select \"Reindex items\". It may require some time to update your library on\nzotero.org. Note that documents that have no text content, as well as missing\ndocuments, will still be considered as unindexed and appear in the results of\nthe saved search.\n\nControlling the indexing status will not only improve full-text search on your\nKerko site, but also full-text search from within Zotero!\n\n\n### Providing _Cites_ and _Cited by_ relations\n\nZotero allows one to link items together through its _Related_ field. However,\nsuch relations are not typed nor directed, making it impossible (1) to indicate\nthe nature of the relation, or (2) to distinguish which of two related items is\nthe citing entity, and which is the one being cited. Consequently, Kerko has its\nown method for setting up those relations.\n\nTo establish _Cites_ relations in your Zotero library, you must follow the\nprocedure below:\n\n- Install the [Zutilo] plugin for Zotero. Once it is installed, go to _Tools >\n  Zutilo Preferences..._ in Zotero. Then, under _Zotero item menu_, select\n  _Zotero context menu_ next to the _Copy Zotero URIs_ menu item. This\n  configuration step only needs to be done once.\n- Select one or more items from your library that you wish to show as cited by\n  another. Right-click on one of the selected items to open the context menu,\n  and select _Copy Zotero URIs_ from that menu. This copies the references of\n  the selected items items to the clipboard.\n- Right-click the item from your library that cites the items. Select _Add Note_\n  from that item's context menu to add a child note.\n- In the note editor, paste the content of the clipboard. The note should then\n  contain a series of URIs looking like\n  `https://www.zotero.org/groups/9999999/items/ABCDEFGH` or\n  `https://www.zotero.org/users/9999999/items/ABCDEFGH`.\n- At the bottom of the note editor, click into the _Tags_ field and type\n  `_cites`. That tag that will tell Kerko that this particular note is special,\n  that it contains relations.\n\nAt the next synchronization, Kerko will retrieve the references found in notes\ntagged with `_cites`. Afterwards, proper hyperlinked citations will appear in\nthe _Cites_ and _Cited by_ sections of the related bibliographic records.\n\nRemarks:\n\n- Enter only the _Cites_ relations. The reverse _Cited by_ relations will be\n  inferred automatically.\n- You may only relate items that belong to the same Zotero library.\n- You may use Zotero Item Selects (URIs starting with `zotero://select/`) in the\n  notes, if you prefer those to Zotero URIs.\n- If entered as plain text, URIs must be separated by one or more whitespace\n  character(s). Alternatively, URIs may be entered in HTML links, i.e., in the\n  `href` attribute of `<a>` elements.\n- Hopefully, Zotero will provide nicer ways for handling [relation\n  types](https://sparontologies.github.io/cito/current/cito.html) in the future.\n  In the meantime, using child notes is how Kerko handles it. If relation types\n  are important to you, consider describing your use case in the [Zotero\n  forums](https://forums.zotero.org/discussion/1317/semantic-relations/).\n- Custom Kerko applications can provide more types of relations, if desired, in\n  addition to _Cites_ and _Cited by_.\n\n\n### Submitting your sitemap to search engines\n\nKerko generates an [XML Sitemap][XML_Sitemap] that can help search engines\ndiscover your bibliographic records.\n\nThe path of the sitemap depends on the configuration of your application. For\n[KerkoApp] or the [Getting started](#getting-started) example above, its path is\n`/bibliography/sitemap.xml`. The full URL of the sitemap then looks like\n`https://example.com/bibliography/sitemap.xml`.\n\nDifferent search engines may have different procedures for submitting sitemaps\n([Google](https://developers.google.com/search/docs/advanced/sitemaps/build-sitemap#addsitemap),\n[Bing](https://www.bing.com/webmasters/help/Sitemaps-3b5cf6ed),\n[Yandex](https://yandex.com/support/webmaster/indexing-options/sitemap.html)).\n\nHowever, a standard method consists in adding a `Sitemap` directive to a\n`robots.txt` file served at the root of your site, to tell web crawlers where to\nfind your sitemap. For example, you would add the following line to\n`robots.txt`:\n\n```\nSitemap: https://example.com/bibliography/sitemap.xml\n```\n\nA `robots.txt` file can have multiple `Sitemap` directives, thus the Kerko\nsitemap can be specified alongside any other you might already have.\n\n\n## Translating Kerko\n\nKerko can be translated using Babel's [setuptools\nintegration](http://babel.pocoo.org/en/latest/setup.html).\n\nThe following commands should be executed from the directory that contains\n`setup.py`, and the appropriate [virtual environment][venv] must have been\nactivated beforehand.\n\nCreate or update the PO template (POT) file:\n\n```bash\npython setup.py extract_messages\n```\n\nCreate a new PO file (for a new locale) based on the POT file. Replace\n`YOUR_LOCALE` with the appropriate language code, e.g., `de`, `es`, `fr`:\n\n```bash\npython setup.py init_catalog --locale YOUR_LOCALE\n```\n\nUpdate an existing PO file based on the POT file:\n\n```bash\npython setup.py update_catalog --locale YOUR_LOCALE\n```\n\nCompile MO files:\n\n```bash\npython setup.py compile_catalog\n```\n\nYou are welcome to contribute your translation. See [Submitting a\ntranslation](#submitting-a-translation).\n\n\n## Contributing\n\n### Reporting issues\n\nIssues may be submitted on [Kerko's issue tracker][Kerko_issues]. Please\nconsider the following guidelines:\n\n- Make sure that the same issue has not already been reported or fixed in the\n  repository.\n- Describe what you expected to happen.\n- If possible, include a minimal reproducible example to help others identify\n  the issue.\n- Describe what actually happened. Include the full traceback if there was an\n  exception.\n\n\n### Making code changes\n\nClone the [Kerko repository][Kerko] into a local directory. Set up a [virtual\nenvironment][venv], then install this local version of Kerko in the virtual\nenvironment, including development and testing dependencies by running the\nfollowing command from Kerko's root directory, i.e., where `setup.cfg` resides:\n\n```bash\npip install -e .[dev,tests]\n```\n\n\n### Running the tests\n\nTo run basic tests in your current environment:\n\n```bash\npython -m unittest\n```\n\nTo check code coverage as well, use these commands instead:\n\n```bash\ncoverage run -m unittest\ncoverage report\n```\n\nNote: Test coverage is still very low at the moment. You are welcome to\ncontribute new tests!\n\nTo run the full test suite under different environments (using the various\nPython interpreters available on your machine):\n\n```bash\ntox\n```\n\n\n### Submitting code changes\n\nPull requests may be submitted against [Kerko's repository][Kerko]. Please\nconsider the following guidelines:\n\n- Before submitting, run the tests and make sure they pass. Add tests relevant\n  to your change (those should fail if ran without your patch).\n- Use [Yapf](https://github.com/google/yapf) to autoformat your code (with\n  option `--style='{based_on_style: facebook, column_limit: 100}'`). Many\n  editors provide Yapf integration.\n- Include a string like \"Fixes #123\" in your commit message (where 123 is the\n  issue you fixed). See [Closing issues using\n  keywords](https://help.github.com/en/articles/closing-issues-using-keywords).\n- If a Jinja2 template represents a page fragment or a collection of macros,\n  prefix its file name with the underscore character.\n\n\n### Submitting a translation\n\nSome guidelines:\n\n- The PO file encoding must be UTF-8.\n- The header of the PO file must be filled out appropriately.\n- All messages of the PO file must be translated.\n\nPlease submit your translation as a pull request against [Kerko's\nrepository][Kerko], or by [e-mail][Kerko_email], with the PO file included as an\nattachment (**do not** copy the PO file's content into an e-mail's body, since\nthat could introduce formatting or encoding issues).\n\n\n### Supporting the project\n\nNurturing an open source project such as Kerko, following up on issues and\nhelping others in working with the system is a lot of work, but hiring the\noriginal developers of Kerko can do a lot in ensuring continued support and\ndevelopment of the project.\n\nIf you need professional support related to Kerko, have requirements not\ncurrently implemented in Kerko, want to make sure that some Kerko issue\nimportant to you gets resolved, or if you just like our work and would like to\nhire us for an unrelated project, please [e-mail us][Kerko_email].\n\n\n## Changelog\n\nFor a summary of changes by release version, see the [changelog](CHANGELOG.md).\n\n\n## Project background\n\nKerko was inspired by two prior projects:\n\n- [Bibliographie sur l’histoire de\n  Montréal](https://bibliomontreal.uqam.ca/bibliographie/), developed in 2014 by\n  David Lesieur and Patrick Fournier, of Whisky Echo Bravo, for the [Laboratoire\n  d'histoire et de patrimoine de Montréal](https://lhpm.uqam.ca/) (Université du\n  Québec à Montréal, Canada).\n- [Bibliography on English-speaking Quebec](http://quescren.concordia.ca/),\n  developed in 2017 by David Lesieur, for the [Quebec English-Speaking\n  Communities Research Network\n  (QUESCREN)](https://www.concordia.ca/artsci/scpa/quescren.html) (Concordia\n  University, Canada).\n\nLater on, it became clear that other organizations needed a similar solution.\nHowever, software from the prior projects had to be rewritten so it could more\neasily be configured for different bibliographies from organizations with\ndifferent needs. That led to Kerko, whose development was made possible through\nthe following project:\n\n- [Bibliographie francophone sur l'archivistique](https://bibliopiaf.ebsi.umontreal.ca/),\n  funded by the\n  [Association internationale des archives francophones (AIAF)](http://www.aiaf.org/)\n  and hosted by the\n  [École de bibliothéconomie et des sciences de l’information (EBSI)](https://ebsi.umontreal.ca/)\n  (Université de Montréal, Canada).\n\n\n### Etymology\n\nThe name _Zotero_ reportedly derives from the Albanian word _zotëroj_, which\nmeans \"to learn something extremely well, that is to master or acquire a skill\nin learning\" (Source: Mark Dingemanse, 2008, [Etymology of\nZotero](http://ideophone.org/zotero-etymology/)).\n\nThe name _Kerko_ is a nod to Zotero as it takes a similar etymological route: it\nderives from the Albanian word _kërkoj_, which means \"to ask, to request, to\nseek, to look for, to demand, to search\" and seems fit to describe a search\ntool.\n\n\n## Powered by Kerko\n\nThe following online bibliographies are powered by Kerko:\n\n- [Bibliographie francophone sur l'archivistique](https://bibliopiaf.ebsi.umontreal.ca/)\n- [Community Knowledge Open Library on English-Speaking Quebec](https://ckol.quescren.ca/)\n- [Lipedema Foundation LEGATO Lipedema Library](https://library.lipedema.org/)\n- [Open Development & Education Evidence Library](https://docs.opendeved.net/)\n- [The EdTech Hub Evidence Library](http://docs.edtechhub.org/)\n- [University of Saint Joseph Research Output](https://research.usj.edu.mo/)\n\nIf you wish to add your Kerko-powered online bibliography to this list, please\n[e-mail us][Kerko_email] or submit a pull request.\n\n\n[Atom]: https://en.wikipedia.org/wiki/Atom_(web_standard)\n[Babel]: https://pypi.org/project/Babel/\n[BM25F]: https://en.wikipedia.org/wiki/Okapi_BM25\n[Bootstrap]: https://getbootstrap.com/\n[Bootstrap-Flask]: https://pypi.org/project/Bootstrap-Flask/\n[Bootstrap-Flask_documentation]: https://bootstrap-flask.readthedocs.io/en/latest/basic.html\n[Click]: https://pypi.org/project/click/\n[COinS]: https://en.wikipedia.org/wiki/COinS\n[COinS_clients]: https://en.wikipedia.org/wiki/COinS#Client_tools\n[CSL]: https://citationstyles.org/\n[Dublin_Core]: https://en.wikipedia.org/wiki/Dublin_Core\n[Flask]: https://pypi.org/project/Flask/\n[Flask_blueprint]: https://flask.palletsprojects.com/en/latest/blueprints/\n[Flask-Babel]: https://pypi.org/project/Flask-Babel/\n[Flask-Babel_documentation]: https://flask-babel.tkte.ch/\n[Flask_CLI]: https://flask.palletsprojects.com/en/latest/cli/\n[Flask-WTF]: https://pypi.org/project/Flask-WTF/\n[FontAwesome]: https://fontawesome.com/icons\n[HighwirePress_Google]: https://scholar.google.ca/intl/en/scholar/inclusion.html#indexing\n[Jinja2]: https://pypi.org/project/Jinja2/\n[jQuery]: https://jquery.com/\n[Kerko]: https://github.com/whiskyechobravo/kerko\n[Kerko_actions]: https://github.com/whiskyechobravo/kerko/actions\n[Kerko_email]: mailto:kerko@whiskyechobravo.com\n[Kerko_issues]: https://github.com/whiskyechobravo/kerko/issues\n[Kerko_pypi]: https://pypi.org/project/Kerko/\n[Kerko_translations]: https://github.com/whiskyechobravo/kerko/tree/master/kerko/translations\n[KerkoApp]: https://github.com/whiskyechobravo/kerkoapp\n[KerkoApp_demo]: https://demo.kerko.whiskyechobravo.com\n[KerkoStart]: https://github.com/whiskyechobravo/kerkostart\n[Popper.js]: https://popper.js.org/\n[Python]: https://www.python.org/\n[pytz]: https://pypi.org/project/pytz/\n[Pyzotero]: https://pypi.org/project/Pyzotero/\n[Snowball]: https://snowballstem.org/\n[venv]: https://docs.python.org/3.8/tutorial/venv.html\n[w3lib]: https://pypi.org/project/w3lib/\n[Werkzeug]: https://pypi.org/project/Werkzeug/\n[Whisky_Echo_Bravo]: https://whiskyechobravo.com\n[Whoosh]: https://pypi.org/project/Whoosh/\n[WTForms]: https://pypi.org/project/WTForms/\n[XML_Sitemap]: https://www.sitemaps.org/\n[Zotero]: https://www.zotero.org/\n[Zotero_Connector]: https://www.zotero.org/download/connectors\n[Zotero_demo]: https://www.zotero.org/groups/2348869/kerko_demo/items\n[Zotero_export]: https://www.zotero.org/support/dev/web_api/v3/basics#export_formats\n[Zotero_schema]: https://api.zotero.org/schema\n[Zotero_styles]: https://www.zotero.org/styles/\n[Zotero_web_api]: https://www.zotero.org/support/dev/web_api/start\n[Zutilo]: https://github.com/willsALMANJ/Zutilo\n\n# Changelog\n\n## Latest (unreleased)\n\nTBD.\n\n\n## 0.9 (2022-12-29)\n\n*Warning:* Upgrading from version 0.8.x or earlier will require that you rebuild\nyour search index. Use the following commands, then restart the application:\n\n```bash\nflask kerko clean index\nflask kerko sync index\n```\n\nFeatures:\n\n- Add expand/collapse actions on facet values, allowing full exploration of\n  hierarchical facets without changing the current search.\n- Add an optional initial limit on the number of values to show under each\n  facet. When the initial limit is reached, a \"show more\" button allow to user\n  to expand the full list.\n- Add Atom syndication feeds.\n- Allow searching items by their Zotero key.\n- Add XML sitemap.\n- Add the `kerko count` CLI command (mostly meant for development purposes).\n\nBug fixes:\n\n- Fix last sync time not displayed at the bottom of search results when\n  `KERKO_PRINT_CITATIONS_LINK` and `KERKO_DOWNLOAD_CITATIONS_LINK` are both set\n  to `False`.\n- Fix the `kerko sync` CLI command not returning an error code with some types\n  of failures.\n- Fix invalid HTML in help modal.\n\nOther changes:\n\n- Handle new Zotero fields introduced with the new 'preprint' item type.\n- Apply a boost factor to DOI, ISBN and ISSN fields extracted from the Extra\n  field (previously, only the dedicated Zotero fields had a boost factor).\n- Under each facet, always show the facet's active filters first.\n- Make facet values with long labels easier to read (by indenting wrapped lines\n  to the right of the checkbox).\n- Add link to full bibliography from item pages.\n- Add blocks in templates to facilitate theming.\n- Remove `page` parameter from pagination links when `page=1`.\n- Improve documentation.\n- Make sync and schema-related error messages more helpful and user-friendly.\n- Move pydocstyle config to `pyproject.toml`.\n- Remove remnants of code aimed at Python versions older than 3.7.\n- Remove support for configuration variables `KERKO_ZOTERO_START` and\n  `KERKO_ZOTERO_END` (were only used for development and no longer practical).\n- Tag package as compatible with Python 3.10 and 3.11.\n- Remove leftover code related to Python versions older than 3.7\n\nBackwards incompatible changes:\n\n- Remove the `KERKO_FACET_COLLAPSING` option. The new initial limit on facets\n  values made this feature largely redundant.\n- Remove the `collapsible` param from the `FacetSpec` class.\n\nChanges that might break custom themes:\n\n- The HTML markup and CSS styles of expand/collapse buttons have changed.\n- The parameters of the `facet`, `facet_item`, `facet_items`, `facet_fields`\n  template macros have changed.\n- The `facets-container`, `facets`, and `facets-modal-body` element ids are now\n  required in `search.html.jinja2`.\n\nPossibly backwards incompatible changes (more or less internal API changes):\n\n- Rewrote the `criteria` module. `Criteria.keywords` and `Criteria.filters` work\n  pretty much as before, but everything else has changed.\n- Rewrote the `query` module, which had organically grown into an tangled mess,\n  now replaced with the `searcher` module. This new API is completely different.\n- Adapted view code to the above-mentioned `searcher` API.\n- Split the monolithic `views` module into multiple modules under `views`\n  (`item_creators`, `item_facets`, `item_relations`, `routes`, `search`), and\n  moved `breadbox`, `meta` (as `item_meta`), `pager`, and `sorter` under\n  `views`.\n\n\n## 0.8.1 (2021-11-16)\n\nBug fixes:\n\n- Fix missing dependency for package building.\n\n\n## 0.8 (2021-11-16)\n\n*Warning:* Upgrading from version 0.7.x or earlier will require that you clean\nand re-sync your existing search index. Use the following commands, then restart\nthe application:\n\n```bash\nflask kerko clean index\nflask kerko sync\n```\n\nFeatures:\n\n- Allow full-text search of PDF attachments. This can be disabled by setting\n  `KERKO_FULLTEXT_SEARCH` to `False`. Since this feature relies on Zotero's\n  full-text indexing, you must make sure that it works in Zotero first; see\n  [Zotero's\n  documentation](https://www.zotero.org/support/searching#pdf_full-text_indexing).\n- Add new search scopes \"Everywhere\" (to search both metadata fields and the\n  text content of attached documents) and \"In documents\" (to search the text\n  content of attached documents). The scope \"In all fields\" allows to search all\n  metadata fields, but not the text content of attached documents.\n- Display \"View on {hostname}\" links under search result items, for quick access\n  to the items' URLs. These can be disabled by setting `KERKO_RESULTS_URL_LINKS`\n  to `False`.\n- Move the \"Read\" buttons under search result items, as \"Read document\" links.\n  These can now be disabled by setting `KERKO_RESULTS_ATTACHMENT_LINKS` to\n  `False`.\n- Display DOI field values as hyperlinks (both in DOI fields, and in the Extra\n  field when lines are prefixed with 'DOI:').\n- Add support for imported file attachments, e.g., PDF files imported in your\n  Zotero library through the Zotero Connector. Previously, only \"attached copies\n  of files\" were supported.\n- Standalone notes and file attachments are now allowed into the search index.\n  Kerko filters them out of search results, but custom applications could search\n  them. A new view, `standalone_attachment_download`, lets one retrieve a\n  standalone file attachment.\n- Add configuration options for truncating long abstracts in search results\n  (`KERKO_RESULTS_ABSTRACTS_MAX_LENGTH` and\n  `KERKO_RESULTS_ABSTRACTS_MAX_LENGTH_LEEWAY`).\n- Embed Highwire Press tags in item pages. This is enabled by default but can be\n  disabled by setting `KERKO_HIGHWIREPRESS_TAGS` to `False`.\n- Allow tracking with Google Analytics (optional).\n- Allow relations in child notes to be specified as HTML links, i.e., in the\n  `href` attribute of `<a>` elements.\n- Allow inclusion or exclusion of items based on multiple tags (previously, only\n  a single pattern could be checked).\n\nBug fixes:\n\n- Fix irrelevant sync warnings, from extractors running on attachment items.\n- Fix empty prev/next links in search pages metadata.\n\nOther changes:\n\n- Make synchronization from Zotero much more efficient through incremental\n  updates. Instead of performing a full synchronization each time, Kerko now\n  retrieves just the newly added or updated items. This dramatically reduces the\n  number of Zotero API calls (and time) required to update Kerko's search index.\n  Note: **More work is planned** to eliminate some Zotero API calls that Kerko\n  still makes early in the synchronization process and that could be avoided\n  when its cache is already up-to-date.\n- Add a `sync cache` command to the command line interface.\n- On narrow screens, stack search form controls for better usability.\n- Respond with an HTTP 503 (Service Unavailable) when the search index is empty\n  or unreadable.\n- Make sorts more efficient by setting the `sortable` Whoosh flag on relevant\n  fields.\n- Leading and trailing underscore characters (`_`) are now trimmed from facet\n  value labels. This happens _after_ sorting the values, which means that the\n  underscore can still be used as a prefix to alter the alphabetical order.\n- Support more timezone names. Timezone names such as 'US/Eastern' or\n  'Europe/London' previously did not work, and times could not be converted\n  to daylight saving times.\n- Change labels:\n    - \"Print this citation\" → \"Print this record\" (on item pages)\n    - \"Download this citation\" → \"Download this record\" (on item & search pages)\n- Inject blocks in item Jinja2 template to facilitate theming.\n- Slightly increase some top/bottom margins.\n- Add the `type` HTML attribute to record download links.\n- Add the `rel=\"alternate\"` HTML attribute to record download links on item\n  pages. Also add a corresponding `link` element to the page `head`.\n- Added utilities for running automated integration tests. This will allow\n  testing many areas of Kerko that previously could hardly be tested.\n\nBackwards incompatible changes:\n\n- Remove deprecated `kerko index` CLI command (use `kerko sync` instead).\n\nPossibly backwards incompatible changes (more or less internal API changes):\n\n- Upgrade many dependencies, including new major versions of Flask (2.x), Jinja2\n  (3.x), Werkzeug (2.x), Click (8.x).\n- The default list for the `KERKO_RESULTS_FIELDS` setting now includes the\n  `'url'` field. If you have overridden that setting in your application and\n  `KERKO_RESULTS_URL_LINKS` is enabled, you'll probably have to add `'url'` too.\n- The schema field `item_type` has been renamed to `item_type_label`. If you\n  have custom templates, please review any use of `item.item_type`.\n- The structure of the `kerko/_search-result.html.jinja2` template has changed\n  somewhat. If you have overridden it, you'll need to review the changes.\n- The `ItemContext` class has been eliminated. The `Extractor.extract()` method\n  now receives an item's dictionary instead of an `ItemContext` object, and if\n  an item has children these are now available directly in the item (with the\n  `children` key). If you have created custom extractor classes, their\n  `extract()` method will need to be adapted accordingly.\n- Some extractor classes have been renamed:\n    - `BaseAttachmentsExtractor` → `BaseChildAttachmentsExtractor`\n    - `BaseNotesExtractor` → `BaseChildNotesExtractor`\n    - `LinkedURIAttachmentsExtractor` → `ChildLinkedURIAttachmentsExtractor`\n    - `NotesTextExtractor` → `ChildNotesTextExtractor`\n    - `RawNotesExtractor` → `RawChildNotesExtractor`\n    - `RelationsInNotesExtractor` → `RelationsInChildNotesExtractor`\n    - `StoredFileAttachmentsExtractor` → `ChildFileAttachmentsExtractor`\n- A view has been renamed:\n    - `item_attachment_download` → `child_attachment_download`\n- A default field has been renamed:\n    - `alternateId` → `alternate_id`\n\n## 0.7.1 (2021-02-04)\n\nSecurity fixes:\n\n- Fix unescaped date fields, causing a vulnerability to XSS attacks. This\n  vulnerability was introduced in version 0.7.\n\nBug fixes:\n\n- Fix wrong locale separator in the HTML lang attribute.\n\nOther changes:\n\n- Remove unwanted spacing after dropdown labels.\n\nDocumentation changes:\n\n- Fix missing info about library groupID in configuration docs. Thanks\n  [@drmikeuk](https://github.com/drmikeuk) for reporting the issue.\n\n## 0.7 (2021-01-08)\n\n*Warning:* Upgrading from version 0.6 or earlier will require that you clean and\nre-sync your existing search index. Use the following commands, then restart the\napplication:\n\n```bash\nflask kerko clean index\nflask kerko sync\n```\n\nFeatures:\n\n- Allow users to toggle the display of abstracts on search results pages.\n- Allow inclusion or exclusion of items based on their tags\n  ([#4](https://github.com/whiskyechobravo/kerko/issues/4)).\n- Show attached links to URIs on item pages.\n- Show relations on item pages. The relation types provided by default are:\n  - _Related_, based on Zotero's _Related_ field.\n  - _Cites_, managed through child notes containing Zotero URIs and tagged with\n    the `_cites` tag.\n  - _Cited by_, automatically inferred from _Cites_ relations.\n- The Extra field is now searched when searching \"in any fields\".\n- Items that have a DOI, ISBN or ISSN identifier can be referenced by appending\n  their identifier to your Kerko site's base URL.\n- Requests for the older URL of an item whose ID has changed are now\n  automatically redirected to the item's current URL. This relies on the\n  `dc.replaces` relation that's managed internally by Zotero on some operations\n  such as item merges.\n- Help users who might mistakenly bookmark a search result's URL rather than the\n  item's permanent URL: Add an `id` parameter to the search result URLs, and\n  redirect the user to that item's permanent URL if the search result no longer\n  matches because of database changes.\n- Redirect to the parent item's page when the user tries to request an\n  attachment that no longer exists.\n- Improve accessibility based on WCAG recommendations and WAI-ARIA standards:\n  - Add labels to search form elements.\n  - Add landmark role `search` to the search form.\n  - Make the purpose of various links more obvious through improved or added\n    labels.\n  - Add the `aria-label` attribute to many elements.\n  - Add text to indicate the current value of widgets.\n  - Add the `aria-current` attribute to indicate the current value of widgets.\n  - Remove useless link to the current page from the pagination widget.\n\nBug fixes:\n\n- Fix crash when trying to sync a link attachment\n  ([#3](https://github.com/whiskyechobravo/kerko/issues/3)).\n- Fix unhandled exception during sync when an attachment cannot be downloaded.\n- Fix page numbers greater than the page count in search URLs generating wrong\n  page numbers for search result item URLs.\n- Fix secondary keys getting sorted in reverse order with some sort options,\n  e.g., when sorting by newest first, results having the same date were then\n  sorted by creator name in reverse alphabetical order instead of alphabetical\n  order.\n- Fix empty HTML element taking up horizontal space when there are no badges.\n\nOther changes:\n\n- Display ISO 8601 calendar dates in a more readable format, using the\n  formatting style of the locale.\n- Show a timezone abbreviation along with time of last update from Zotero.\n- Add German translation. Thanks [@mmoole](https://github.com/mmoole).\n- Fix broken \"Getting started\" example in README.\n- Migrate most package distribution options and metadata from `setup.py` to\n  `setup.cfg`.\n- Migrate project to a `src` layout.\n- Use Flask-Babel instead of its fork Flask-BabelEx, now that is has merged the\n  translation domain features from Flask-BabelEx.\n\nBackwards incompatible changes:\n\n- Drop support for Python 3.6. Kerko is no longer being tested under Python 3.6.\n  Known issue with 3.6 at this point: some ISO 8601 dates cannot be parsed and\n  reformatted; instead of being displayed in a locale-sensitive manner, these\n  get displayed as is. More issues might arise in the future with Python 3.6 as\n  Kerko continues to evolve.\n- All values of the `pager` dict passed to the `_pager.html.jinja2` template are\n  now lists. Previously, only the values at keys `'before'` and `'after'` were\n  lists; now the values at keys `'previous'`, `'first'`, `'current'`, `'last'`,\n  and `'next'` are lists as well.\n- The words `'blacklist'` and `'whitelist'` in variable names are replaced with\n  `'exclude'` and `'include'`.\n- The `KERKO_RESULTS_ABSTRACT` configuration variable is replaced by two\n  variables, `KERKO_RESULTS_ABSTRACTS` (note the now plural form) and\n  `KERKO_RESULTS_ABSTRACTS_TOGGLER`.\n- Citation download URLs now have the form\n  `{url_prefix}/{itemID}/export/{format}` for individual items (`'export'` has\n  been inserted), and `{url_prefix}/export/{format}/` for search result pages\n  (`'download'` has been replaced by `'export'`).\n- The `Extractor` class' interface has changed, improving consistency and\n  separation of concerns:\n  - All arguments to `__init__()` must now be specified as keyword arguments.\n  - The `extract()` method no longer have a `document` argument, and the `spec`\n    argument is now the last one. The method now returns a value instead of\n    assigning it to the document.\n  - The new `extract_and_store()` method handles extraction, encoding, and\n    assignment to the document, assigning the value only when it is not `None`.\n- The `AttachmentsExtractor` class has been renamed to\n  `StoredFileAttachmentsExtractor`.\n- `InCollectionExtractor` now extends collection membership to subcollections.\n  To preserve the previous behavior, set the `check_subcollections` parameter to\n  `False` when initializing the extractor.\n\nPossibly backwards incompatible changes (more or less internal API changes):\n\n- The `search_results` variable passed to the `search.html.jinja2` template is\n  now an iterator of tuples, where the first element of each tuple is a result,\n  and the second element the URL of the result.\n\n## 0.6 (2020-06-15)\n\nSecurity fixes:\n\n- Fix multiple vulnerabilities to XSS attacks. **All previous versions of Kerko\n  were vulnerable, thus an upgrade is highly recommended.**\n\nBackwards incompatible changes:\n\n- Remove default value for the `KERKO_DATA_DIR` configuration variable. KerkoApp\n  users don't need to worry about this as KerkoApp takes care of it, but custom\n  apps that did not already set this variable now have to.\n\nFeatures:\n\n- Open PDF documents in the browser's built-in PDF viewer (instead of opening\n  the browser's file download popup).\n- Add buttons for opening documents directly from search result pages (these\n  replace the previous paperclip badges).\n- Add button at the top of item pages for opening documents (makes the\n  availability of such documents much more obvious).\n- Add the `KERKO_DOWNLOAD_ATTACHMENT_NEW_WINDOW` configuration variable to\n  control whether to open documents in a new window or in the same window.\n- Display the date and time of the last successful synchronization from Zotero\n  at the bottom of search results.\n\nBug fixes:\n\n- Preserve newlines when displaying the value of the Extra field.\n- Preserve newlines when displaying abstracts in search result pages.\n- Fix filters missing on search pages that have no results.\n- Avoid empty box in print media when there is no search criteria.\n- Avoid empty box when the search index is missing.\n- Fix pluralization in CLI time elapsed messages.\n\nOther changes:\n\n- Refer to attachments as \"documents\" in the interface, and replace the\n  paperclip icon with a file icon.\n- Remove CSRF token from search form. Token expiration can impede legitimate\n  users, and the token is unnecessary as the form does not change the\n  application's state.\n- Add a proper message when none of the filters provided in the URL are\n  recognized.\n- Improve documentation.\n- Add INFO-level log message to report successful synchronization from Zotero.\n- Add blocks in templates to facilitate theming.\n\nPossibly backwards incompatible changes (more or less internal API changes):\n\n- Rename the `content_with_badges` template macro as `badges`, and leave it to\n  the caller to display content.\n- Remove badges that are related to attachments.\n\n## 0.5 (2019-11-19)\n\n*Warning:* Upgrading from version 0.4 or earlier will require that you clean and\nre-sync your existing search index. Use the following commands:\n\n```bash\nflask kerko clean index\nflask kerko sync\n```\n\nFeatures:\n\n- Add support for Zotero attachments.\n- Allow configuration of badges on items. The 'attachment' badge is provided by\n  default, displaying an icon on items that have one or more attachments.\n- Add help modal.\n- Improve customizability:\n  - Add `KERKO_TEMPLATE_*` configuration variables for page template names.\n  - Use configurable, separate templates to render facets and badges (see the\n    `renderer` argument to `kerko.specs.FacetSpec`, `kerko.specs.BadgeSpec`).\n  - Add the `KERKO_RESULTS_FIELDS` configuration variable to specify which\n    fields to retrieve with search queries.\n- Add building blocks for creating boolean facets based on collection membership\n  (new class `kerko.extractors.InCollectionExtractor`, new parameters for\n  `kerko.codecs.BooleanFacetCodec`).\n\nBug fixes:\n\n- Fix facets not ordered by weight on item page.\n- Preserve newlines in abstract display.\n- Fix incorrect use of bookmark link on item pages, set canonical link instead.\n- Prevent text overflow in some browsers on citations containing long URLs.\n\nOther changes:\n\n- Deprecate CLI command `kerko index` in favor of new command `kerko sync`.\n- Change title of the \"Refine\" panel to \"Explore\".\n- Change labels of the \"Print\" and \"Download\" buttons to \"Print this citation\"\n  and \"Download this citation\", to prevent any confusion with attachment\n  downloading.\n- Show the facets in a more robust and accessible Bootstrap modal, on small\n  screens, instead of the home-built drawer.\n- Use compact pagination widget on small screens.\n- Tweak sizing, positioning, and spacing of various UI elements.\n- Improve accessibility of various UI elements.\n- Make citation stand out more in item page.\n- Hide some elements and decorations in print media.\n- Make search query more efficient on item page.\n\nPossibly backwards incompatible changes (more or less internal API changes):\n\n- Force keyword arguments with `kerko.composer.Composer.__init__()`.\n- Rename `kerko.composer.Composer.__init__()` arguments\n  `default_note_whitelist_re` as `default_child_whitelist_re`,\n  `default_note_blacklist_re` as `default_child_blacklist_re`.\n- Rename method `kerko.views.item()` as `kerko.views.item_view()`.\n- Rename template file `_facet.html.jinja2` as `_facets.html.jinja2`.\n- Replace argument `checkboxes` in template macro `field()` with `add_link_icon`\n  and `remove_link_icon`.\n\n## 0.4 (2019-09-28)\n\nFeatures:\n\n- Allow search term boosting in relevance score calculation, e.g. `faceted^2\n  search browsing^0.5`.\n\nSecurity fixes:\n\n- Update minimum Werkzeug version to 0.15.3. See\n  [CVE-2019-14806](https://nvd.nist.gov/vuln/detail/CVE-2019-14806): \"Pallets\n  Werkzeug before 0.15.3, when used with Docker, has insufficient debugger PIN\n  randomness because Docker containers share the same machine id.\"\n\nOther changes:\n\n- Update jQuery version to 3.4.1.\n- Update French translations (translate boolean search operators).\n- Improve search form validation and error display.\n- Disable not-so-intuitive boolean search operators (`AndNot`, `AndMaybe`,\n  `Require` were unwanted but enabled by default by Whoosh's `OperatorsPlugin`).\n- Improve documentation.\n- Code cleanup.\n\n## 0.3 (2019-07-29)\n\nFeatures:\n\n- Exporting: users may export individual citations as well as complete\n  bibliographies corresponding to search results. By default, download links are\n  provided for the RIS and BibTeX formats, but applications may be configured to\n  export any format supported by the Zotero API.\n\nBug fixes:\n\n- Fix bad alignment of field names in print mode.\n- Remove warning when indexing an item with no authors\n  ([#1](https://github.com/whiskyechobravo/kerko/issues/1)).\n\nOther changes:\n\n- Move print button to bottom of search pages (next to the new download\n  dropdown).\n- Improve documentation.\n- Compile message catalog before building sdist and wheel.\n\nPossibly backwards incompatible changes (more or less internal API changes):\n\n- Method `kerko.composer.Composer.get_ordered_specs()` replaces\n  `get_ordered_scopes()`, `get_ordered_facets()` and `get_ordered_sorts()`.\n\n## 0.3alpha1 (2019-07-17)\n\n- Fix broken links in documentation.\n\n## 0.3alpha0 (2019-07-16)\n\n- First PyPI release.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/whiskyechobravo/kerko",
    "keywords": "academia,bibliography,bibliographies,flask,search,zotero",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "Kerko",
    "package_url": "https://pypi.org/project/Kerko/",
    "platform": null,
    "project_url": "https://pypi.org/project/Kerko/",
    "project_urls": {
      "Changes": "https://github.com/whiskyechobravo/kerko/blob/master/CHANGELOG.md",
      "Code": "https://github.com/whiskyechobravo/kerko",
      "Documentation": "https://github.com/whiskyechobravo/kerko",
      "Homepage": "https://github.com/whiskyechobravo/kerko",
      "Issue tracker": "https://github.com/whiskyechobravo/kerko/issues"
    },
    "release_url": "https://pypi.org/project/Kerko/0.9/",
    "requires_dist": [
      "Babel (>=2.6.0)",
      "Bootstrap-Flask (<2.0,>=1.0.10)",
      "click (>=8.0.1)",
      "Flask (<2.3,>=2.0.1)",
      "Flask-Babel (>=2.0.0)",
      "Flask-WTF (>=0.14.2)",
      "Jinja2 (<3.1,>=3.0.1)",
      "Pyzotero (>=1.4.26)",
      "w3lib (>=1.22.0)",
      "Werkzeug (>=2.0.1)",
      "Whoosh (>=2.7.4)",
      "wrapt (>=1.10.0)",
      "WTForms (<3.0,>=2.2)",
      "pip-tools (>=5.5.0) ; extra == 'dev'",
      "pycodestyle ; extra == 'dev'",
      "pydocstyle (>=6.1.0) ; extra == 'dev'",
      "pylint (>=2.5.0) ; extra == 'dev'",
      "rope ; extra == 'dev'",
      "yapf ; extra == 'dev'",
      "coverage (<6.4,>=6.1.2) ; extra == 'tests'",
      "elementpath (<3,>=2.4.0) ; extra == 'tests'",
      "lxml (<5,>=4.6.4) ; extra == 'tests'",
      "responses (<0.18,>=0.15.0) ; extra == 'tests'",
      "tox (<4,>=3.8) ; extra == 'tests'"
    ],
    "requires_python": ">=3.7",
    "summary": "A Flask blueprint that provides a faceted search interface for bibliographies based on Zotero.",
    "version": "0.9",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16253037,
  "releases": {
    "0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5583c9007c3d1bd0ee878c98dfa1964ada08ff4c73dab14b5c999c24d9f859b0",
          "md5": "baae3624f5349f636cdc99e7db0d3a1a",
          "sha256": "7fa9c45d894c597aa347fd27dd515c22a64472ad693d884582999b7ab1922557"
        },
        "downloads": -1,
        "filename": "Kerko-0.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "baae3624f5349f636cdc99e7db0d3a1a",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 74895,
        "upload_time": "2019-07-29T22:10:32",
        "upload_time_iso_8601": "2019-07-29T22:10:32.810782Z",
        "url": "https://files.pythonhosted.org/packages/55/83/c9007c3d1bd0ee878c98dfa1964ada08ff4c73dab14b5c999c24d9f859b0/Kerko-0.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "522b9c328cf83e25e535f27c9d5fa5e6b489c323c202ff8f27ffc550e4e4b8a2",
          "md5": "dfa99dce2c917efc564aeccdb9c57fea",
          "sha256": "f191d0f55cd903122ba2c56dd34f37fa63110aba803760dba83ad82cc240a603"
        },
        "downloads": -1,
        "filename": "Kerko-0.3.tar.gz",
        "has_sig": false,
        "md5_digest": "dfa99dce2c917efc564aeccdb9c57fea",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 72691,
        "upload_time": "2019-07-29T22:10:34",
        "upload_time_iso_8601": "2019-07-29T22:10:34.702299Z",
        "url": "https://files.pythonhosted.org/packages/52/2b/9c328cf83e25e535f27c9d5fa5e6b489c323c202ff8f27ffc550e4e4b8a2/Kerko-0.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3a0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c79af9a892c0a9905fea652ce22ef81bc5919a6ebc9c7ec7d43a48a3537b64df",
          "md5": "f56681ca6707980585d0d1642c25c610",
          "sha256": "520c4ec55433ed248abbf2ca38fffb14f1e3f4024267a1e01beae80a85f5cf2a"
        },
        "downloads": -1,
        "filename": "Kerko-0.3a0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "f56681ca6707980585d0d1642c25c610",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 69266,
        "upload_time": "2019-07-16T22:40:49",
        "upload_time_iso_8601": "2019-07-16T22:40:49.396068Z",
        "url": "https://files.pythonhosted.org/packages/c7/9a/f9a892c0a9905fea652ce22ef81bc5919a6ebc9c7ec7d43a48a3537b64df/Kerko-0.3a0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "58e5b6a009335823a52071679fd9b0e28e8db2d8a9a6af17b70c5794889d62c3",
          "md5": "1f7e215f7e8364e3e9f7ae80e9f0141b",
          "sha256": "9ae0cf48a684d353bb8c2e531bf792ebba49e76b9e1f9c8dc29f63f39f432d51"
        },
        "downloads": -1,
        "filename": "Kerko-0.3a0.tar.gz",
        "has_sig": false,
        "md5_digest": "1f7e215f7e8364e3e9f7ae80e9f0141b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 62781,
        "upload_time": "2019-07-16T22:40:52",
        "upload_time_iso_8601": "2019-07-16T22:40:52.297327Z",
        "url": "https://files.pythonhosted.org/packages/58/e5/b6a009335823a52071679fd9b0e28e8db2d8a9a6af17b70c5794889d62c3/Kerko-0.3a0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3a1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "05853856d1dc608270414b494f513e04771acdc717f0dadcf49d400745d4e166",
          "md5": "364523d81670c2192d841a0704772bcc",
          "sha256": "678605c2a9f361a5c63dcdf2ed9fc31e1d1f1c4c42038d176156405beda88f27"
        },
        "downloads": -1,
        "filename": "Kerko-0.3a1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "364523d81670c2192d841a0704772bcc",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 69549,
        "upload_time": "2019-07-17T19:58:13",
        "upload_time_iso_8601": "2019-07-17T19:58:13.341944Z",
        "url": "https://files.pythonhosted.org/packages/05/85/3856d1dc608270414b494f513e04771acdc717f0dadcf49d400745d4e166/Kerko-0.3a1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6c6325f306599bc950badc82775c84ab725820c5d7b5c529cfa66f561c7e2fe0",
          "md5": "a3131cfd75859aa3fd96038ebb903690",
          "sha256": "56067dec9d4f9dca9ed9a3c29b0c09f5f57da79ea81b9d5df34165bcaa895f28"
        },
        "downloads": -1,
        "filename": "Kerko-0.3a1.tar.gz",
        "has_sig": false,
        "md5_digest": "a3131cfd75859aa3fd96038ebb903690",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 63107,
        "upload_time": "2019-07-17T19:58:14",
        "upload_time_iso_8601": "2019-07-17T19:58:14.983969Z",
        "url": "https://files.pythonhosted.org/packages/6c/63/25f306599bc950badc82775c84ab725820c5d7b5c529cfa66f561c7e2fe0/Kerko-0.3a1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1b39eef237ecc8315cfe00395b851433dee58d01b5b4cf1c1d2d4928ebcd2caf",
          "md5": "64cddc474675c1a52c4805caf35a4abc",
          "sha256": "59e24cd444b050c49c6826f0762b83fc430dd7c8fcc3929f8c1c90d0020978f2"
        },
        "downloads": -1,
        "filename": "Kerko-0.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "64cddc474675c1a52c4805caf35a4abc",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 76014,
        "upload_time": "2019-09-28T19:54:00",
        "upload_time_iso_8601": "2019-09-28T19:54:00.393759Z",
        "url": "https://files.pythonhosted.org/packages/1b/39/eef237ecc8315cfe00395b851433dee58d01b5b4cf1c1d2d4928ebcd2caf/Kerko-0.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "990b9512c36696f9509638b0106a828e0736cd75c06cdf0f2d89d717b6381ee1",
          "md5": "301b717f314dadbb8f38380f6a9189ab",
          "sha256": "cad16fccfc20e87394a45f33f2c689939d99f139baf9c3672bc2775eb8ba3314"
        },
        "downloads": -1,
        "filename": "Kerko-0.4.tar.gz",
        "has_sig": false,
        "md5_digest": "301b717f314dadbb8f38380f6a9189ab",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 78412,
        "upload_time": "2019-09-28T19:54:02",
        "upload_time_iso_8601": "2019-09-28T19:54:02.432962Z",
        "url": "https://files.pythonhosted.org/packages/99/0b/9512c36696f9509638b0106a828e0736cd75c06cdf0f2d89d717b6381ee1/Kerko-0.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "bb805eb403ecd308066d98277d6b5dabea7ec9fa62cfb10c0b002d588008f320",
          "md5": "02d7aeeef6b1e0a7439e51334d9faba9",
          "sha256": "b6296fee7c41d39594a2399ac520286de673e47ea7b50674b368890fa56a4b96"
        },
        "downloads": -1,
        "filename": "Kerko-0.5-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "02d7aeeef6b1e0a7439e51334d9faba9",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 96616,
        "upload_time": "2019-11-19T15:54:20",
        "upload_time_iso_8601": "2019-11-19T15:54:20.697333Z",
        "url": "https://files.pythonhosted.org/packages/bb/80/5eb403ecd308066d98277d6b5dabea7ec9fa62cfb10c0b002d588008f320/Kerko-0.5-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "fab7d230f4e5a8ae00bdc151276380f8ac21ec9abd0a1111fedbb8b25fdb5e31",
          "md5": "c03be111b093c2f9fbc2b728d7f85f6a",
          "sha256": "0175bd6657bc44766721461cd6f62aab441b5638d41fd77b58585817bb4c267e"
        },
        "downloads": -1,
        "filename": "Kerko-0.5.tar.gz",
        "has_sig": false,
        "md5_digest": "c03be111b093c2f9fbc2b728d7f85f6a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 98564,
        "upload_time": "2019-11-19T15:54:22",
        "upload_time_iso_8601": "2019-11-19T15:54:22.592922Z",
        "url": "https://files.pythonhosted.org/packages/fa/b7/d230f4e5a8ae00bdc151276380f8ac21ec9abd0a1111fedbb8b25fdb5e31/Kerko-0.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "cfb62421a1656ea170cf1a2aee27b46e0379b318a771404bf18d46a97fa5f19e",
          "md5": "8dbff6c05a917db5bc822649930430ed",
          "sha256": "1c95e25111c5172a40085a369a608b16693ae52a067646558486628ec99aadf9"
        },
        "downloads": -1,
        "filename": "Kerko-0.6-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "8dbff6c05a917db5bc822649930430ed",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 98208,
        "upload_time": "2020-06-15T19:08:21",
        "upload_time_iso_8601": "2020-06-15T19:08:21.800958Z",
        "url": "https://files.pythonhosted.org/packages/cf/b6/2421a1656ea170cf1a2aee27b46e0379b318a771404bf18d46a97fa5f19e/Kerko-0.6-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4cd5aa98330023dcb6cecdc949a5aa886fdb2a5021d64a2216c006962eb32540",
          "md5": "979508080447cedad2803210c09feaf6",
          "sha256": "b5b34995760c1f7dd7dc842b00390cd9866c20767d783ca1de56af71108375ed"
        },
        "downloads": -1,
        "filename": "Kerko-0.6.tar.gz",
        "has_sig": false,
        "md5_digest": "979508080447cedad2803210c09feaf6",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 102688,
        "upload_time": "2020-06-15T19:08:23",
        "upload_time_iso_8601": "2020-06-15T19:08:23.418208Z",
        "url": "https://files.pythonhosted.org/packages/4c/d5/aa98330023dcb6cecdc949a5aa886fdb2a5021d64a2216c006962eb32540/Kerko-0.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.7": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5fa792ac35aeccdb7920c6f3d53806b7ccc9924950a06fbc692a276d59b8e917",
          "md5": "79ddc15653887ef7e3fcd1a6b2b87e22",
          "sha256": "0ad79ff078ee6b3883e0ca4ce31b687d234c89a063e1e282df22d27caff31800"
        },
        "downloads": -1,
        "filename": "Kerko-0.7-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "79ddc15653887ef7e3fcd1a6b2b87e22",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 134286,
        "upload_time": "2021-01-08T17:44:17",
        "upload_time_iso_8601": "2021-01-08T17:44:17.359531Z",
        "url": "https://files.pythonhosted.org/packages/5f/a7/92ac35aeccdb7920c6f3d53806b7ccc9924950a06fbc692a276d59b8e917/Kerko-0.7-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8b8d470e0173fd940044fc0a4934e79e0c02cf028cd05e3f5347200ece4eb202",
          "md5": "724764225d0650e53458f25dfc464cc0",
          "sha256": "99a02f27d1e52a8d38bc9dd19809fec3d2233cfdf0d69c349b39fcf1615a6c4c"
        },
        "downloads": -1,
        "filename": "Kerko-0.7.tar.gz",
        "has_sig": false,
        "md5_digest": "724764225d0650e53458f25dfc464cc0",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 145968,
        "upload_time": "2021-01-08T17:44:18",
        "upload_time_iso_8601": "2021-01-08T17:44:18.998494Z",
        "url": "https://files.pythonhosted.org/packages/8b/8d/470e0173fd940044fc0a4934e79e0c02cf028cd05e3f5347200ece4eb202/Kerko-0.7.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.7.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ce74b0f9e393f8bbd99a1bc35598b9d649d9bf8844fca2b709e93ce192514198",
          "md5": "d5918ac2a0be40eed89a9d7a37688e2c",
          "sha256": "d7baace605076f5b8a9a7df62183cc873f96f43b816a7ce97b81c441f6d2d7a2"
        },
        "downloads": -1,
        "filename": "Kerko-0.7.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "d5918ac2a0be40eed89a9d7a37688e2c",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 134532,
        "upload_time": "2021-02-05T00:15:55",
        "upload_time_iso_8601": "2021-02-05T00:15:55.270345Z",
        "url": "https://files.pythonhosted.org/packages/ce/74/b0f9e393f8bbd99a1bc35598b9d649d9bf8844fca2b709e93ce192514198/Kerko-0.7.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3c58bd97063f87227def5dabdcfa9e8bbae1fedd7686483fc7ff3c7f393e240b",
          "md5": "f4ebef81bfce9a7e0758e6a62708efe4",
          "sha256": "0cfdf609a18a07bc50f93e13c5eb0ed6fb8a42e8d834bf83fecbb7c5fd4cab26"
        },
        "downloads": -1,
        "filename": "Kerko-0.7.1.tar.gz",
        "has_sig": false,
        "md5_digest": "f4ebef81bfce9a7e0758e6a62708efe4",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 146615,
        "upload_time": "2021-02-05T00:15:57",
        "upload_time_iso_8601": "2021-02-05T00:15:57.092540Z",
        "url": "https://files.pythonhosted.org/packages/3c/58/bd97063f87227def5dabdcfa9e8bbae1fedd7686483fc7ff3c7f393e240b/Kerko-0.7.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.8": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "517e96238dd811d74f8eca9054a18c3adaf0733c55919ee8909a1fddf1ad42bd",
          "md5": "d7c5518f37423f4bd509c4598bf69f93",
          "sha256": "890cc8345c0ea84002600fbdd4e668b77ebfcb11fc35a5e7d0dc9f2847157bf3"
        },
        "downloads": -1,
        "filename": "Kerko-0.8-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "d7c5518f37423f4bd509c4598bf69f93",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 148007,
        "upload_time": "2021-11-16T23:48:08",
        "upload_time_iso_8601": "2021-11-16T23:48:08.085943Z",
        "url": "https://files.pythonhosted.org/packages/51/7e/96238dd811d74f8eca9054a18c3adaf0733c55919ee8909a1fddf1ad42bd/Kerko-0.8-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9645311f6803476b2e1e995373a3dd4f3fa5bb1c80b8cf0d03472b916ce073a8",
          "md5": "5855213872ce3bb842041b4658454dff",
          "sha256": "47efdca24ed0bf4ed3c0ded748202deb930db60520dbd242e08e0aecd9375988"
        },
        "downloads": -1,
        "filename": "Kerko-0.8.tar.gz",
        "has_sig": false,
        "md5_digest": "5855213872ce3bb842041b4658454dff",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 186175,
        "upload_time": "2021-11-16T23:48:09",
        "upload_time_iso_8601": "2021-11-16T23:48:09.862738Z",
        "url": "https://files.pythonhosted.org/packages/96/45/311f6803476b2e1e995373a3dd4f3fa5bb1c80b8cf0d03472b916ce073a8/Kerko-0.8.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.8.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6706a2462d07699f4a0b1cc532ff43f0e1babc352a4b9c74cc499493ac594faf",
          "md5": "1b97d4e12e29a123c151af7119e11b7c",
          "sha256": "920c4fba7100569d3bce7e4d83157480d157d2c663c2dffdca6fb1a032267d94"
        },
        "downloads": -1,
        "filename": "Kerko-0.8.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "1b97d4e12e29a123c151af7119e11b7c",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 148052,
        "upload_time": "2021-11-17T00:34:28",
        "upload_time_iso_8601": "2021-11-17T00:34:28.782785Z",
        "url": "https://files.pythonhosted.org/packages/67/06/a2462d07699f4a0b1cc532ff43f0e1babc352a4b9c74cc499493ac594faf/Kerko-0.8.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d6a8d2d98ccf1f9d69121db7fdcb11f3b2ec42e98c01ba7f6f53775828704b80",
          "md5": "59dfee93a3fe1bf2c95e37991d1ef37c",
          "sha256": "5b82406873bc10d00242a29258773905dcfd414c73704e3b98551f9eb089afce"
        },
        "downloads": -1,
        "filename": "Kerko-0.8.1.tar.gz",
        "has_sig": false,
        "md5_digest": "59dfee93a3fe1bf2c95e37991d1ef37c",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 186230,
        "upload_time": "2021-11-17T00:34:31",
        "upload_time_iso_8601": "2021-11-17T00:34:31.030466Z",
        "url": "https://files.pythonhosted.org/packages/d6/a8/d2d98ccf1f9d69121db7fdcb11f3b2ec42e98c01ba7f6f53775828704b80/Kerko-0.8.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.9": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "84409ee17d89f4e4fbc1e803c8d1b28f2387e5574d9f62218021a854ff0eb3fd",
          "md5": "0674b8c444232bc014bbf74fc3a83917",
          "sha256": "b0dc3e6878e13eb081d82db860ba09c36de147df262b78fe3301472ff9b1f62f"
        },
        "downloads": -1,
        "filename": "Kerko-0.9-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "0674b8c444232bc014bbf74fc3a83917",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 163950,
        "upload_time": "2022-12-30T00:27:52",
        "upload_time_iso_8601": "2022-12-30T00:27:52.797580Z",
        "url": "https://files.pythonhosted.org/packages/84/40/9ee17d89f4e4fbc1e803c8d1b28f2387e5574d9f62218021a854ff0eb3fd/Kerko-0.9-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4ef2e62f8ae14da465024a85652f4c97a58cf2a5599a7ccae4db1c70f92fa16b",
          "md5": "18e6158b8ee7ec51145f67d812482b61",
          "sha256": "a36d8c7ec983f9d6f3bc4fca32cd38142498ca1d73a7f31030b645a831eaf5e9"
        },
        "downloads": -1,
        "filename": "Kerko-0.9.tar.gz",
        "has_sig": false,
        "md5_digest": "18e6158b8ee7ec51145f67d812482b61",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 207672,
        "upload_time": "2022-12-30T00:27:55",
        "upload_time_iso_8601": "2022-12-30T00:27:55.320919Z",
        "url": "https://files.pythonhosted.org/packages/4e/f2/e62f8ae14da465024a85652f4c97a58cf2a5599a7ccae4db1c70f92fa16b/Kerko-0.9.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "84409ee17d89f4e4fbc1e803c8d1b28f2387e5574d9f62218021a854ff0eb3fd",
        "md5": "0674b8c444232bc014bbf74fc3a83917",
        "sha256": "b0dc3e6878e13eb081d82db860ba09c36de147df262b78fe3301472ff9b1f62f"
      },
      "downloads": -1,
      "filename": "Kerko-0.9-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "0674b8c444232bc014bbf74fc3a83917",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.7",
      "size": 163950,
      "upload_time": "2022-12-30T00:27:52",
      "upload_time_iso_8601": "2022-12-30T00:27:52.797580Z",
      "url": "https://files.pythonhosted.org/packages/84/40/9ee17d89f4e4fbc1e803c8d1b28f2387e5574d9f62218021a854ff0eb3fd/Kerko-0.9-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "4ef2e62f8ae14da465024a85652f4c97a58cf2a5599a7ccae4db1c70f92fa16b",
        "md5": "18e6158b8ee7ec51145f67d812482b61",
        "sha256": "a36d8c7ec983f9d6f3bc4fca32cd38142498ca1d73a7f31030b645a831eaf5e9"
      },
      "downloads": -1,
      "filename": "Kerko-0.9.tar.gz",
      "has_sig": false,
      "md5_digest": "18e6158b8ee7ec51145f67d812482b61",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7",
      "size": 207672,
      "upload_time": "2022-12-30T00:27:55",
      "upload_time_iso_8601": "2022-12-30T00:27:55.320919Z",
      "url": "https://files.pythonhosted.org/packages/4e/f2/e62f8ae14da465024a85652f4c97a58cf2a5599a7ccae4db1c70f92fa16b/Kerko-0.9.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}