{
  "info": {
    "author": "Michael Hu",
    "author_email": "prmhu@yahoo.com",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "# Linear Explainable Attention in Parallel (LEAP)\r\n\r\nThis project implements a novel linear attention mechanism based on \"softmax-weighted cumulative sums\" which has surprisingly favorable properties in computational complexity, explainability, and theoretical expressiveness. This project strongly believes that this linear attention mechanism can replace full attention with virtually no tradeoffs, if not actually having even better performance (because it's a more simple attention mechanism). This was originally inspired by adapting [Fastformer: Additive attention can be all you need](https://arxiv.org/abs/2108.09084) by Wu et al. (2021) (where they don't use any kind of cumulative sum)  for causal language modeling which we also implement with documentation and a comprehensive README that can be found in `src/leap/fastformerLM`. \r\n\r\nReasons why LEAP may be able to replace full attention:\r\n\r\n1. The models considered in this project run **faster** than a standard Transformer of the same size even on small sequence lengths (the math allows for *highly parallelizeable* operations which is not always the case with linear attention) which offers high ease of use\r\n\r\n2. **Dot-product rescaling**, we find that the current dot-product attention scaling method can lead to training instability especially in this more simple form of attention. We introduce a new dot product scaling method that should stop dot product similarities from scaling with model size that *may help the training stability of full attention as well* but will allow LEAP to scale to large model sizes stably\r\n\r\n3. **Linear in time local attention**, this concept has not been seen before in the literature as local attention typically has to scale in time complexity with the size of the local window. This project uses some simple mathematics and reuse of computations to get around this (and still be parallelizeable). This gets around the issue that longer sequences will typically need bigger local attention windows, but also builds upon the surprising strength of local + global attention (previously explored in [Longformer](https://arxiv.org/pdf/2004.05150.pdf) and [BigBird](https://arxiv.org/abs/2007.14062) with the addition of random attention).\r\n\r\n4. **Built-in Explainability**, while explainability is not supported yet in this project, each token will be assigned an \"focus weight\" (which is softmaxed over the sequence) that can be used to explain what tokens the model is paying attention to, and which tokens are ignored. This is similar to the explainability offered by the original [Attention is All you Need](https://proceedings.neurips.cc/paper/2017/hash/3f5ee243547dee91fbd053c1c4a845aa-Abstract.html) paper, though more simplified\r\n\r\n5. **O(1) Path Length/Flexibility**, A great strength of full attention Transformers is the flexibility provided by the $O(1)$ path length. An example where many linear attention mechanisms would likely fail (ie. if they only use local/convolutional attention or time-decaying factors or a recurrent vector that will get overloaded with information over time) would be when there is \"*task metadata*\" at the beginning of the sequence. Example: \"Read the following story paying special attention to how Alice treats Bob as you will write an essay on this after: \\<very long story here\\>\". This task information may not make it all the way through the story and writing the essay with the previously mentioned approaches, but with this project's approach, tokens from the beginning of the sequence can directly transfer information to tokens at the end of the sequence with a $O(1)$ path length (like full-attention) through global LEAP\r\n\r\n6. **O(1) Inference**, the math of LEAP can be represented as an RNN (while still maintaining the $O(1)$ path length). Thus, you only need the previous token's embeddings (i.e. $O(1)$ space) to calculate the next token (as per being an RNN) which only takes $O(1)$ computations with no matrix-matrix operations (all with respect to sequence length holding model size/dimension constant). This was originally shown in [Transformers are RNNs](https://arxiv.org/pdf/2006.16236.pdf) by Katharpoulos et al. (2020) to increase inference time performance by thousands of times and could potentially *allow large language models to run on edge devices like mobile phones or consumer laptops!*\r\n\r\n## Usage\r\n\r\nUse the package manager [pip](https://pip.pypa.io/en/stable/) to install (make sure you have [pytorch installed with CUDA](https://pytorch.org/get-started/locally/) as a prerequisite)\r\n\r\n```bash\r\npip install leap-transformer\r\n```\r\n\r\nThen to use in python (setting the config how you want):\r\n```python\r\nfrom leap import LeapForCausalLM, LeapConfig\r\n\r\nconfig = LeapConfig(\r\n    hidden_size = 128, # size of embeddings\r\n    vocab_size = 32100, # number of tokens\r\n    n_positions = 2048, # max number of tokens to process at once\r\n    n_layer = 6, # how many stacked decoder layers to use\r\n    use_local_att = True, # whether to use windowed/local LEAP\r\n    window_sizes = None, # window sizes to use for windowed/local LEAP for each layer (set automatically if None)\r\n    n_head = 4, # number of heads to use in multi-head attention\r\n    initializer_range = None, # variance for weight initialization, defaults to 1 / sqrt(hidden_size)\r\n    hidden_dropout_prob = .1, # dropout value used for embeddings, attention, and feedforward layers\r\n    rescale = 10 # what to rescale the focus values with, set lower if you have unstable/NaN loss\r\n)\r\n\r\nmodel = LeapForCausalLM(config)\r\n\r\n# this model is compatible with huggingface and its \"trainer\" interface\r\nfrom transformers import Trainer\r\ntrainer = Trainer(\r\n    model = model,\r\n    args = <YOUR TRAINING ARGS>,\r\n    train_dataset = <YOUR TOKENIZED DATASET>,\r\n    ...<YOUR OTHER TRAINER ARGS>\r\n)\r\n\r\n\r\ntrainer.train()\r\n```\r\nA more complete training example with a dataset, tokenization, and evaluations can be found at ``FastLM.ipynb`` in this repository which can be run with only 6GB of VRAM (GPU memory).\r\n\r\n### Development and Contributing\r\n\r\nThis project needs your help! If you want to contribute, (optionally) make/address a github issue, or just send in a pull request! There will likely be a paper published for this where all contributors will be named, so please state your interested in this! Use these installation instructions so that you will have the latest repo and your edits will be reflected when you run the code\r\n\r\n```bash\r\ngit clone https://github.com/mtanghu/LEAP.git\r\ncd LEAP\r\npip install -e .\r\n```\r\n\r\n\r\n## Brief LEAP description\r\n\r\nThe math tricky and overly verbose/complicated at the moment but can be found in this repo with a write-up  [here](https://github.com/mtanghu/LEAP/blob/main/src/leap/README.md). As stated the general concept is just to have a cumulative sum of the sequence that is weighted with values that are passed through a softmax over the sequence length (done causally though). What will be described here are just some high level details.\r\n\r\n### Why cumulative sum?\r\n\r\nCumulative sums were used reasonably successfully in previous linear attention mechanisms like [Linear Transformers](https://arxiv.org/pdf/2006.16236.pdf) though they don't use the *parallel* cumulative sum that can be run in logarithmic time (w.r.t. sequence length) as noted by [Performer](https://arxiv.org/abs/2009.14794). This can be seen in the following circuit diagram (from [wikipedia prefix sum page](https://en.wikipedia.org/wiki/Prefix_sum)).\r\n\r\n\r\n![alt text](https://upload.wikimedia.org/wikipedia/commons/8/81/Prefix_sum_16.svg)\r\n\r\nWhere each wire represents an element in the sequence as input (coming from the top) and where the output of each wire the cumulative sum up to that element in the sequence. Luckily this is already implemented by CUDA [as seen here](https://nvlabs.github.io/cub/structcub_1_1_device_scan.html) where they report that the cumulative sum operation runs about as fast as copying! What might set this off as being a good choice for sequence modelling is how the diagram almost shows a kind of \"residual connections through time\" in a way that seems vaguely neural.\r\n\r\nThe concept for LEAP is just to weight each element in the sequence before cumulative summing as a kind of \"attention\" or \"focus\". This implemented in a multihead way with queries, keys, and values and is meant to be something of an analog to full attention.\r\n\r\n### Model Structure\r\n\r\nBecause this is a causal language model the code is structured like one and implements the following to be fair comparison against GPT2 [paper for reference by Radford et al. (2019)](https://life-extension.github.io/2020/05/27/GPT%E6%8A%80%E6%9C%AF%E5%88%9D%E6%8E%A2/language-models.pdf) where LEAP just replaces the scaled-dot product Attention module in a Transformer:\r\n\r\n- Pre-norming with a layernorm before projecting to token logits like GPT2\r\n- GELU activation is used in the feedforward layer like GPT2\r\n- Learned positional embeddings as per [GPT1 paper by Radford et al. (2018)](https://s3-us-west-2.amazonaws.com/openai-assets/research-covers/language-unsupervised/language_understanding_paper.pdf) which carries over to GPT2 (though [Rotary embeddings](https://arxiv.org/abs/2104.09864v2) were considered, but decided against because it would unfairly give an advantage to the model when compared against normal Transformers/gpt2 which uses learned absolute positional embeddings. Just as a note, positional embeddings are still \"needed\" as a cumulative sum would not necessarily encode position information.\r\n- Weight tying ([Press & Wolf 2017](https://arxiv.org/abs/1608.05859v3)) also used by Attention is All you Need, GPT1 and likewise GPT2\r\n- Label smoothing of .1 ([Muller, Kornblith & Hinton 2019](https://proceedings.neurips.cc/paper/2019/hash/f1748d6b0fd9d439f71450117eba2725-Abstract.html), [Viswani et al. 2017](https://arxiv.org/abs/1706.03762) is forgone because huggingface seems to oddly apply label smoothing during validation (so the loss that comes out when exponentiated would not be perplexity)\r\n- Attention masking of pad tokens ([Attention is All you Need by Viswani et al. (2017)](https://arxiv.org/abs/1706.03762)) which is carried over to GPT2\r\n- <div></div>Multihead Attention where LEAP is simply performed on down projected vectors of size $d_{model} \\over n_{heads}$ in parallel with the same number of parameters as a single-head also as per Attention is All you Need by Viswani et al. (2017) which is carried over to GPT2\r\n- The only slight difference is that biases are not used in the attention projection like [PALM](https://arxiv.org/abs/2204.02311) as it fits with the theme of the rescaled dot-product (to keep pre-attention logits low) for increased training stability. This shouldn't affect modeling performance much (if not decreasing performance) in the comparison against GPT2\r\n\r\n## Scaling Experiment\r\n\r\nFollowing landmark papers [Scaling laws for neural language models](https://arxiv.org/pdf/2001.08361.pdf) which has been revisited by [Training Compute-Optimal Large Language Models](https://arxiv.org/pdf/2203.15556.pdf) we hope to show the scaling behavior of LEAP and how it's quite comparable to a vanilla Transformer like GPT2. Note that as found by [Scaling Laws vs Model Architectures](https://arxiv.org/pdf/2207.10551.pdf), few to no models can match the scaling performance of Transformers. The experiment shown are done on much less data and much less compute, but at least preliminarily show LEAP's capabilities. \r\n\r\n![alt text](https://raw.githubusercontent.com/mtanghu/LEAP/main/Experiments/powerlaws.png)\r\n The compute scaling law (left) is in line with [Scaling laws for neural language models](https://arxiv.org/pdf/2001.08361.pdf)  which reported a alpha/exponent of around -.05 which should reasonably validate this experimental setup where FLOPs are estimated the same way. Note that if the FLOPs approximation used was applied to LEAP (where the sequence length quadratic complexity is just ignored) than LEAP would just use the same amount of FLOPs as GPT2 on equivalently sized models and dataset size.\r\n\r\nThe parameters scaling law (right) has a higher alpha that what is reported in [Scaling laws for neural language models](https://arxiv.org/pdf/2001.08361.pdf) of -.076 because data and parameters were scaled in tandem (for speed and also to be closer to compute optimal). Only non-embedding parameters are reported following [Scaling laws for neural language models](https://arxiv.org/pdf/2001.08361.pdf) especially because the embedding parameters were a very significant proportion of the parameters. Following [Scaling Laws vs Model Architectures](https://arxiv.org/pdf/2207.10551.pdf), this test is meant to robustly compare a rather \"exotic\" architecture like LEAP to vanilla Transformers especially as \"exotic\" architectures can often get away with just having their hyperparameters/architectures tuned to match vanilla Transformer performance while not having the highly desirable scaling potential.\r\n\r\n\r\n## Training details\r\n\r\nExact training details and logs can be found in `/Experiments/Scaling.ipynb` of this notebook. \r\n\r\n\r\n- **Dataset:** subsets of Wikitext-103 so that the number of tokens would match the recommendation of  [Training Compute-Optimal Large Language Models](https://arxiv.org/pdf/2203.15556.pdf) where the (# parameters) is directly proportional to the (# tokens). The largest test uses the shown in the figure does use the entirety of Wikitext-103\r\n- **Tokenizer** a word-level tokenizer was used, but due to memory and compute constraints, the vocab size was limited to 8192. This means that the losses shown cannot be directly compared to Wikitext-103 benchmarks, but shouldn't particularly change scaling behavior\r\n- **Hyperparameters:** LEAP uses all the same hyperparameters as GPT2, all of which were chosen to be *advantageous to GPT2 and not LEAP* (likely better hyperparameters can be found for LEAP). We use a layer number ratio according to [Levine 2020](https://proceedings.neurips.cc/paper/2020/file/ff4dfdf5904e920ce52b48c1cef97829-Paper.pdf) that are best for Transformers like GPT2, and head size of 64. LEAP introduces two new hyperparameters, though they were set automatically based on preliminary testing and not tuned (they don't seem to strongly affect performance either)\r\n- **Training:** Training was performed for only 1 epoch on sequence lengths of 1024 (by splitting and concatenating articles) with cosine learning rate schedule with a warmup ratio of .05. This is all in line with [Scaling laws for neural language models](https://arxiv.org/pdf/2001.08361.pdf). The batch sizes were very small of just 2 because of memory constraints\r\n\r\n**Finer details:** [AdamW](https://arxiv.org/abs/1711.05101) optimizer with default configuration and learning rate of 5e-4 (after warmup and is cosine annealed). No dropout was used due to only training for 1 epoch as per the recommendation of [One Epoch Is All You Need](https://arxiv.org/abs/1906.06669)\r\n\r\n\r\n## References\r\nWu, C., Wu, F., Qi, T., Huang, Y., & Xie, X. (2021). Fastformer: Additive attention can be all you need. _arXiv preprint arXiv:2108.09084_.\r\n\r\nWolf, T., Debut, L., Sanh, V., Chaumond, J., Delangue, C., Moi, A., ... & Rush, A. M. (2019). Huggingface's transformers: State-of-the-art natural language processing. _arXiv preprint arXiv:1910.03771_.\r\n\r\nBeltagy, I., Peters, M. E., & Cohan, A. (2020). Longformer: The long-document transformer. _arXiv preprint arXiv:2004.05150_.\r\n\r\nZaheer, M., Guruganesh, G., Dubey, K. A., Ainslie, J., Alberti, C., Ontanon, S., ... & Ahmed, A. (2020). Big bird: Transformers for longer sequences. _Advances in Neural Information Processing Systems_, _33_, 17283-17297.\r\n\r\nChowdhery, A., Narang, S., Devlin, J., Bosma, M., Mishra, G., Roberts, A., ... & Fiedel, N. (2022). Palm: Scaling language modeling with pathways. _arXiv preprint arXiv:2204.02311_.\r\n\r\nDevlin, J., Chang, M. W., Lee, K., & Toutanova, K. (2018). Bert: Pre-training of deep bidirectional transformers for language understanding. _arXiv preprint arXiv:1810.04805_.\r\n\r\nPérez, J., Marinković, J., & Barceló, P. (2019). On the turing completeness of modern neural network architectures. _arXiv preprint arXiv:1901.03429_.\r\n\r\nKatharopoulos, A., Vyas, A., Pappas, N., & Fleuret, F. (2020, November). Transformers are rnns: Fast autoregressive transformers with linear attention. In _International Conference on Machine Learning_ (pp. 5156-5165). PMLR.\r\n\r\nBahdanau, D., Cho, K., & Bengio, Y. (2014). Neural machine translation by jointly learning to align and translate. _arXiv preprint arXiv:1409.0473_.\r\n\r\nRadford, A., Wu, J., Child, R., Luan, D., Amodei, D., & Sutskever, I. (2019). Language models are unsupervised multitask learners. OpenAI blog, 1(8), 9.\r\n\r\nMüller, R., Kornblith, S., & Hinton, G. E. (2019). When does label smoothing help?. _Advances in neural information processing systems, 32_.\r\n\r\nVaswani, A., Shazeer, N., Parmar, N., Uszkoreit, J., Jones, L., Gomez, A. N., ... & Polosukhin, I. (2017). Attention is all you need. _Advances in neural information processing systems, 30_.\r\n\r\nRadford, A., Narasimhan, K., Salimans, T., & Sutskever, I. (2018). Improving language understanding by generative pre-training.\r\n\r\nPress, O., & Wolf, L. (2016). Using the output embedding to improve language models. _arXiv preprint arXiv:1608.05859_.\r\n\r\nKaplan, Jared, et al. \"Scaling laws for neural language models.\" _arXiv preprint arXiv:2001.08361_ (2020).\r\n\r\nChoromanski, Krzysztof, et al. \"Rethinking attention with performers.\" _arXiv preprint arXiv:2009.14794_ (2020).\r\n\r\nKomatsuzaki, A. (2019). One epoch is all you need. _arXiv preprint arXiv:1906.06669_.\r\n\r\nLoshchilov, I., & Hutter, F. (2017). Decoupled weight decay regularization. _arXiv preprint arXiv:1711.05101_.\r\n\r\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/mtanghu/Additive-Attention-Is-Not-All-You-Need-Maybe",
    "keywords": "linear transformer NLP deep learning pytorch",
    "license": "CC0 1.0 Universal",
    "maintainer": "",
    "maintainer_email": "",
    "name": "leap-transformer",
    "package_url": "https://pypi.org/project/leap-transformer/",
    "platform": null,
    "project_url": "https://pypi.org/project/leap-transformer/",
    "project_urls": {
      "Homepage": "https://github.com/mtanghu/Additive-Attention-Is-Not-All-You-Need-Maybe"
    },
    "release_url": "https://pypi.org/project/leap-transformer/1.0.1/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "Linear Explainable Attention in Parallel (LEAP) for causal language modeling (also implements fastformer)",
    "version": "1.0.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 15234861,
  "releases": {
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6ed266b907b88917b94bcdb58f5b3cafb2e468773c1dc3f18e3b951befad5ca8",
          "md5": "461e337d86be292badaf690b7ba816a2",
          "sha256": "cf1b834718578fb21f4336fc19b00bad35d07e917c8a7f005352682c65594b5a"
        },
        "downloads": -1,
        "filename": "leap-transformer-0.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "461e337d86be292badaf690b7ba816a2",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 39365,
        "upload_time": "2022-08-29T08:07:38",
        "upload_time_iso_8601": "2022-08-29T08:07:38.556802Z",
        "url": "https://files.pythonhosted.org/packages/6e/d2/66b907b88917b94bcdb58f5b3cafb2e468773c1dc3f18e3b951befad5ca8/leap-transformer-0.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "278ecf062c182c52a18ed61929f943d4a3a346ca134f22084d2f8465bc1f124d",
          "md5": "4bd520838f0eb8386a668a7b779e40b7",
          "sha256": "978ed08bd8911bd9ccd86b053601cf6fe4101e5ac09dd135ec7c36bbae4d01e2"
        },
        "downloads": -1,
        "filename": "leap-transformer-0.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "4bd520838f0eb8386a668a7b779e40b7",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 40907,
        "upload_time": "2022-08-29T08:22:59",
        "upload_time_iso_8601": "2022-08-29T08:22:59.742069Z",
        "url": "https://files.pythonhosted.org/packages/27/8e/cf062c182c52a18ed61929f943d4a3a346ca134f22084d2f8465bc1f124d/leap-transformer-0.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.10": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "66f138e6826547cbe1570df603611c5cc0b830e45fb036f949aa298d606eeb59",
          "md5": "abdbd3661b2516dfe24566e369e760bd",
          "sha256": "852e7b56ec0aad9945fd055ecf3e7a2f3d930dab2e9ac03416aeed595ee8c7c7"
        },
        "downloads": -1,
        "filename": "leap-transformer-0.1.10.tar.gz",
        "has_sig": false,
        "md5_digest": "abdbd3661b2516dfe24566e369e760bd",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 43375,
        "upload_time": "2022-09-09T07:36:39",
        "upload_time_iso_8601": "2022-09-09T07:36:39.220866Z",
        "url": "https://files.pythonhosted.org/packages/66/f1/38e6826547cbe1570df603611c5cc0b830e45fb036f949aa298d606eeb59/leap-transformer-0.1.10.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b7678865ee4a1682fa6f0e7a7af526f793dfb1f5732e0d7dcf342622b51bdced",
          "md5": "7c3bb82496b86f3a052d3be2746f5ec3",
          "sha256": "85f46fffaf82671d30c0d8926a8faa36ac1b5938746150d3781339a1ea6fd691"
        },
        "downloads": -1,
        "filename": "leap-transformer-0.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "7c3bb82496b86f3a052d3be2746f5ec3",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 47648,
        "upload_time": "2022-09-03T19:56:56",
        "upload_time_iso_8601": "2022-09-03T19:56:56.365388Z",
        "url": "https://files.pythonhosted.org/packages/b7/67/8865ee4a1682fa6f0e7a7af526f793dfb1f5732e0d7dcf342622b51bdced/leap-transformer-0.1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e441fbcb9efed7b3163e064c95d3d056d443f570718fbf8ff7f8a77c38e368e5",
          "md5": "08c89fc4290f494cf40f4ae5cc7253a9",
          "sha256": "547fbd70f9ddae274873016c81bc66cd99756c5f61f7b31cb61c32dce7bfb7d7"
        },
        "downloads": -1,
        "filename": "leap-transformer-0.1.3.tar.gz",
        "has_sig": false,
        "md5_digest": "08c89fc4290f494cf40f4ae5cc7253a9",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 47615,
        "upload_time": "2022-09-03T20:04:47",
        "upload_time_iso_8601": "2022-09-03T20:04:47.406629Z",
        "url": "https://files.pythonhosted.org/packages/e4/41/fbcb9efed7b3163e064c95d3d056d443f570718fbf8ff7f8a77c38e368e5/leap-transformer-0.1.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "905f2469bf1770d9eb154696fb1d2ff648ff2c1ff95f4cf11bd88330ea19ed15",
          "md5": "9205a3e8e014491e28dfc795c2912d1e",
          "sha256": "03226319f3ae06c58b1660a968264c478a4dc425374d01e80a2f89cd125711b1"
        },
        "downloads": -1,
        "filename": "leap-transformer-0.1.4.tar.gz",
        "has_sig": false,
        "md5_digest": "9205a3e8e014491e28dfc795c2912d1e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 47623,
        "upload_time": "2022-09-03T20:07:16",
        "upload_time_iso_8601": "2022-09-03T20:07:16.044246Z",
        "url": "https://files.pythonhosted.org/packages/90/5f/2469bf1770d9eb154696fb1d2ff648ff2c1ff95f4cf11bd88330ea19ed15/leap-transformer-0.1.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4095a07aa6f10ef57ddd7dcc94dbe3e06213d6674d08d96e04211d90b2c53405",
          "md5": "75e65776068682f364e79cadae4936cf",
          "sha256": "e0948cbf57519f68e275744b365a24e908aebcac0bfa1b326e2b3f2641840722"
        },
        "downloads": -1,
        "filename": "leap-transformer-0.1.5.tar.gz",
        "has_sig": false,
        "md5_digest": "75e65776068682f364e79cadae4936cf",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 47631,
        "upload_time": "2022-09-03T20:14:58",
        "upload_time_iso_8601": "2022-09-03T20:14:58.482832Z",
        "url": "https://files.pythonhosted.org/packages/40/95/a07aa6f10ef57ddd7dcc94dbe3e06213d6674d08d96e04211d90b2c53405/leap-transformer-0.1.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "cd1da9f83536c2a573d2133aaf9b8d05049eb1861314b7121894ee0c4f2cce93",
          "md5": "03e9e30ca61a93d7a1ce4433732c35dc",
          "sha256": "0afa77506be47de8a781901e5d70dfb6ed8b13637f3938525d67c0afffe06660"
        },
        "downloads": -1,
        "filename": "leap-transformer-0.1.6.tar.gz",
        "has_sig": false,
        "md5_digest": "03e9e30ca61a93d7a1ce4433732c35dc",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 43616,
        "upload_time": "2022-09-04T08:19:33",
        "upload_time_iso_8601": "2022-09-04T08:19:33.596227Z",
        "url": "https://files.pythonhosted.org/packages/cd/1d/a9f83536c2a573d2133aaf9b8d05049eb1861314b7121894ee0c4f2cce93/leap-transformer-0.1.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.7": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e911bd4ae6340fa06cce9c8fd999f60bf2f8c03b73ef5e925046eeaf086a56b7",
          "md5": "f3336905ca69a36dae3c8a9e4cecbd21",
          "sha256": "cf402dd375889f3e53c717aebf9a62b78c118f9373174240ae7cd751d440ab04"
        },
        "downloads": -1,
        "filename": "leap-transformer-0.1.7.tar.gz",
        "has_sig": false,
        "md5_digest": "f3336905ca69a36dae3c8a9e4cecbd21",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 45760,
        "upload_time": "2022-09-07T20:41:51",
        "upload_time_iso_8601": "2022-09-07T20:41:51.586440Z",
        "url": "https://files.pythonhosted.org/packages/e9/11/bd4ae6340fa06cce9c8fd999f60bf2f8c03b73ef5e925046eeaf086a56b7/leap-transformer-0.1.7.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.8": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0f77bfac52d5de2fce88e388996582c7ae7cfd6e107501a8ff211716b9445a3e",
          "md5": "8cd1d1b571702ff8ffaaf7ea2c8eca3e",
          "sha256": "88099b76f0e8de63c9403853edae1698e75817b6c05b47b35cca34835e668634"
        },
        "downloads": -1,
        "filename": "leap-transformer-0.1.8.tar.gz",
        "has_sig": false,
        "md5_digest": "8cd1d1b571702ff8ffaaf7ea2c8eca3e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 45751,
        "upload_time": "2022-09-08T03:59:22",
        "upload_time_iso_8601": "2022-09-08T03:59:22.000210Z",
        "url": "https://files.pythonhosted.org/packages/0f/77/bfac52d5de2fce88e388996582c7ae7cfd6e107501a8ff211716b9445a3e/leap-transformer-0.1.8.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.9": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "36a864df58b67c911cffae077d04b6b5a60462fbcee349d691ca046e45640c27",
          "md5": "d567a68ac20256db2dfd558bb594708b",
          "sha256": "b94cf4da348ad88a4c631bacc74e984d04e477eb56af8a3425baefe01e5da0b8"
        },
        "downloads": -1,
        "filename": "leap-transformer-0.1.9.tar.gz",
        "has_sig": false,
        "md5_digest": "d567a68ac20256db2dfd558bb594708b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 45738,
        "upload_time": "2022-09-08T04:12:01",
        "upload_time_iso_8601": "2022-09-08T04:12:01.782441Z",
        "url": "https://files.pythonhosted.org/packages/36/a8/64df58b67c911cffae077d04b6b5a60462fbcee349d691ca046e45640c27/leap-transformer-0.1.9.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "95329e050bb617e43572d8fe11a6ad80fdb8f5803e534742a97f7042cf96069b",
          "md5": "48b9d3647d3ad8a84c4649a9749c6287",
          "sha256": "31c347abe846aaa5f889e183174b1cf45cddafe4bd442aa20e5066b9d967d953"
        },
        "downloads": -1,
        "filename": "leap-transformer-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "48b9d3647d3ad8a84c4649a9749c6287",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 23605,
        "upload_time": "2022-09-26T05:31:06",
        "upload_time_iso_8601": "2022-09-26T05:31:06.386382Z",
        "url": "https://files.pythonhosted.org/packages/95/32/9e050bb617e43572d8fe11a6ad80fdb8f5803e534742a97f7042cf96069b/leap-transformer-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "726340468fbe039089c06680648a85bc1b506402db504f9a15ec50205f2911fc",
          "md5": "dbbc88608895340dbb3ebff49aab7645",
          "sha256": "c0fac7b1ae0ff47c3a5c3caad2050dfa0f490b00ed5dde7b26c32bb9b33a6d53"
        },
        "downloads": -1,
        "filename": "leap-transformer-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "dbbc88608895340dbb3ebff49aab7645",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 23758,
        "upload_time": "2022-09-27T23:28:21",
        "upload_time_iso_8601": "2022-09-27T23:28:21.793225Z",
        "url": "https://files.pythonhosted.org/packages/72/63/40468fbe039089c06680648a85bc1b506402db504f9a15ec50205f2911fc/leap-transformer-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "726340468fbe039089c06680648a85bc1b506402db504f9a15ec50205f2911fc",
        "md5": "dbbc88608895340dbb3ebff49aab7645",
        "sha256": "c0fac7b1ae0ff47c3a5c3caad2050dfa0f490b00ed5dde7b26c32bb9b33a6d53"
      },
      "downloads": -1,
      "filename": "leap-transformer-1.0.1.tar.gz",
      "has_sig": false,
      "md5_digest": "dbbc88608895340dbb3ebff49aab7645",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 23758,
      "upload_time": "2022-09-27T23:28:21",
      "upload_time_iso_8601": "2022-09-27T23:28:21.793225Z",
      "url": "https://files.pythonhosted.org/packages/72/63/40468fbe039089c06680648a85bc1b506402db504f9a15ec50205f2911fc/leap-transformer-1.0.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}