{
  "info": {
    "author": "CompassionAI",
    "author_email": "contact@compassion-ai.org",
    "bugtrack_url": null,
    "classifiers": [
      "Intended Audience :: Science/Research",
      "License :: OSI Approved :: GNU General Public License v3 (GPLv3)",
      "Programming Language :: Python :: 3.6",
      "Topic :: Scientific/Engineering :: Artificial Intelligence"
    ],
    "description": "# CompassionAI Lotsawa - tools for translating and understanding classical Tibetan\n\nThis is a collection of end-user tools to help with translation and understanding of long texts in classical Tibetan, especially the Kangyur and Tengyur.\n\nFor example, in your terminal you can:\n\n```bash\n# Bring up an interactive tool for translating individual short Tibetan sections\nlotsawa-translate\n\n# Output a translation of the Heart Sutra into English under ./translations\nlotsawa-translate mode=batch mode.input_glob=heart_sutra.bo\n\n# After translating to English, re-translate the Heart Sutra into simplified Chinese\nlotsawa-retranslate output.target_language_code=zho_Hans\n\n# Bring up an interactive tool for splitting Tibetan sections into words and tagging those words as nouns/verbs/adjectives/etc\nlotsawa-words\n```\n\nA sample set of Tibetan documents to experiment on is available at <https://compassionai.s3.amazonaws.com/public/translation_test_docs.zip>.\n\nLotsawa is backed by our novel models that are the results of a research program into how to convert existing state-of-the-art translation models for short sentences, such as NLLB (No Language Left Behind), into models that are better able to handle the ambiguity of long classical Tibetan texts. The models used in Lotsawa utilize pre-trained, state-of-the-art translation models as a backbone that have had their neural architectures significantly modified to accomodate long texts. In particular, we are not simply serving (fine-tuned) NLLB; we are serving a model with a new neural architecture that's much better than NLLB at handling Tibetan ambiguity. Lotsawa implements a carefully tuned end-to-end translation pipeline for long texts - the result of many experiments on strategies for the preservation of contextual semantic information in the low-resource setting of classical Tibetan. Please see <https://www.compassion-ai.org/> for an explanation of our research.\n\n> We are a tiny team of volunteers on a shoestring budget. The community of people who would benefit from these tools is likewise very small. If we don't work together, these tools will struggle to improve and be useful.\n>\n> **PLEASE** don't immediately give up and walk away if you run into a problem. Without at least a tiny bit of ***your*** help these tools will never evolve to benefit anyone. Please, for the sake of the Tibetan language and the Dharma, contact us before giving up.\n>\n> Contact us if you're using these tools, if something isn't working and you need help, if the tools are performing poorly, just to say hi, or for any other reason.\n>\n> We can be reached at contact@compassion-ai.org or on GitHub issues.\n\n## Installation\n\nWe assume you're on a Mac. The installation should work on Windows and Linux _mutatis mutandis_.\n\n> **IMPORTANT:** There is currently an incompatibility between Hydra and Python 3.11. Furthermore, attempting to install with Python 3.11 will require building Hugging Face libraries from source, since prebuilt wheels are not yet available. This requires gcc, cmake and Rust.\n>\n> We require Python <= 3.10 for Lotsawa until this is fixed upstream. Our provided conda environment file has the correct settings.\n\n### Basic instructions\n\nInstall with pip:\n\n```bash\npip install lotsawa --upgrade\n```\n\nLotsawa requires Python 3.6 or greater. This shouldn't be a problem on almost any modern computer. If you are having issues with this on an older Mac, see the Homebrew documentation here: <https://docs.brew.sh/Homebrew-and-Python>. If you can't make it work or if the Homebrew docs are too much, contact us at <contact@compassion-ai.org> or open a GitHub issue.\n\n### Basic instructions - NVidia GPUs\n\n**This section does not apply to Macs. Newer Macs with M1 chips or better should use the embedded GPU by default.**\n\nIf you have an NVidia GPU and want to use it to massively speed everything up - we strongly recommend doing this if you can - you will need to install CUDA-enabled PyTorch. Begin by installing the NVidia drivers and CUDA:\n\n - Windows: <https://developer.nvidia.com/cuda-downloads?target_os=Windows&target_arch=x86_64&target_version=11&target_type=exe_local>.\n - Linux: There's lots of tutorials for the common distros, as well as the NVidia official document at <https://docs.nvidia.com/cuda/cuda-installation-guide-linux/index.html>.\n - Cloud: start with an image with CUDA pre-installed, or follow the instructions for your specific OS.\n\nThen install CUDA-enabled PyTorch. This is very easy. The following line in your terminal should work:\n\n```bash\npip3 install torch --extra-index-url https://download.pytorch.org/whl/cu116\n```\n\nIf for some reason it doesn't, follow the instructions on <https://pytorch.org/get-started/locally/>:\n\n - Set the PyTorch build to Stable.\n - Set package to pip.\n - Set language to Python.\n - Set compute platform to CUDA 11.6 or greater.\n\nIt will give you a line of code to run, paste it into your terminal and you should be good. If you're not good, start without CUDA and contact us at <contact@compassion-ai.org> or open a GitHub issue.\n\nAs the usage of Lotsawa evolves we may simplify this process as needed.\n\n### Slightly more advanced - conda\n\nIf you're up to it, we recommend using a virtual environment to simplify your installation and management of your installed software. In our experience, conda is the easiest way to do this. Conda will keep the stuff needed to run Lotsawa separate from the rest of your computer. This way, if anything breaks, you can easily uninstall Lotsawa without affecting the rest of your programs.\n\n*Before installing with `pip`*, begin by installing miniconda from here: <https://docs.conda.io/projects/conda/en/latest/user-guide/install/macos.html>, then run the following:\n\n```bash\nconda create -n lotsawa\nconda activate lotsawa\nconda install -c conda-forge python>=3.6 pip\npip install lotsawa\n```\n\nWhenever you want to use Lotsawa, activate your virtual environment:\n\n```bash\nconda activate lotsawa\nlotsawa-translate   # Or whatever you want to do\n```\n\nWhen you're done, either just close the terminal window or run:\n\n```bash\nconda deactivate\n```\n\nTo uninstall Lotsawa and all the associated packages, including PyTorch, all you need to do is:\n\n```bash\n# Delete the virtual environment, including Lotsawa itself\nconda env remove -n lotsawa\n\n# Clear the model cache\necho rm -rf $(python -c \"from torch.hub import get_dir; print(get_dir() + '/champion_models')\") | bash\n```\n\n### Developers - installing from source\n\n**PLEASE** begin by dropping us a line at <contact@compassion-ai.org> so that we can work with you to make you successful. We have no sales team or anything like that, we will not hassle you, we just want to be helpful.\n\nYou will need to clone four CompassionAI repos: common, manas, garland and lotsawa:\n\n```bash\nexport CAI_BASE_DIR=~/workspace/compassionai   # Or wherever you like\nmkdir -p $CAI_BASE_DIR; cd $CAI_BASE_DIR\ngit clone git@github.com:CompassionAI/common.git\ngit clone git@github.com:CompassionAI/manas.git\ngit clone git@github.com:CompassionAI/garland.git\ngit clone git@github.com:CompassionAI/lotsawa.git\n```\n\nWe strongly recommend using conda. In fact, we recommend mamba - it is much faster than conda, with no downside. We provide a minimal environment file for your convenience.\n\n```bash\n# Install conda\nwget https://repo.anaconda.com/miniconda/Miniconda3-latest-Linux-x86_64.sh\nbash Miniconda3-latest-Linux-x86_64.sh\n\n# Install mamba\nconda install mamba -c conda-forge\n\n# Create the Lotsawa virtual environment\ncd $CAI_BASE_DIR/lotsawa      # Or wherever you cloned the repo\nmamba env create -f env.yml\nconda activate lotsawa\n```\n\n### Research\n\n**PLEASE** begin by dropping us a line at <contact@compassion-ai.org> so that we can work with you to make you successful. We have no sales team or anything like that, we will not hassle you, we just want to be helpful.\n\nWe *very strongly* recommend doing research *only* on Linux.\n\nIf you're planning to do research, i.e. tinker with our datasets or tweak the models, you probably want the data registry:\n\n```bash\ngit@github.com:CompassionAI/data-registry.git\ncd data-registry\n./pull.sh   # Warning: large download\n```\n\nFollow the installation instructions in CompassionAI/common for research.\n\n## Usage\n\n### Translation into English\n\nUse the `lotsawa-translate` utility. It has two modes: interactive and batch.\n\n - Interactive mode will prompt you for individual short Tibetan sections and will output English translations. This is intended as a test or a demo.\n - Batch mode will process long Tibetan files (in Unicode with uchen script). This mode will involve segmentation of the long text into shorter sections, followed by sequential translating with context. NB: the segmented sections will not translate the same in batch as in interactive mode due to the use of context during translation.\n\nInteractive is the default mode. An example that uses batch mode is:\n\n```bash\nlotsawa-translate mode=batch mode.input_glob=~/tibetan_texts/*.bo\n```\n\nThis will translate all texts in the directory `~/tibetan_texts` that have the extension `.bo` and output the results to `./translations`. To control the output directory, set `mode.output_dir`.\n\nA sample set of Tibetan documents to experiment on is available at <https://compassionai.s3.amazonaws.com/public/translation_test_docs.zip>.\n\nTo use CUDA, pass in `cuda=true`. For example:\n\n```bash\nlotsawa-translate mode=batch mode.input_glob=~/tibetan_texts/*.bo cuda=true\n```\n\nIf your GPU has less than 8GB of VRAM you may see CUDA OOM errors. We recommend reducing the number of beams during beam search. The easiest way to do this is as follows:\n\n```bash\nlotsawa-translate mode=batch mode.input_glob=~/tibetan_texts/*.bo cuda=true generation=slow     # 50 beams, default\nlotsawa-translate mode=batch mode.input_glob=~/tibetan_texts/*.bo cuda=true generation=medium   # 20 beams\nlotsawa-translate mode=batch mode.input_glob=~/tibetan_texts/*.bo cuda=true generation=fast     # 5 beams\n```\n\nWe recommend trying `cuda=false generation=slow` on some sample text to compare against. If you're unhappy with the results and would benefit from a more complex memory management protocol during beam decoding, please contact us at <contact@compassion-ai.org> or open a GitHub issue.\n\nSee the full help for `lotsawa-translate` for a complete list of options:\n\n```bash\nlotsawa-translate --help\n```\n\nAdvanced options:\n\n - Use `bad-words-list` to create word exclusion lists during translations.\n - You can provide configuration overrides on a per-file basis. In the same folder as the Tibetan file you can provide a YAML configuration file with overrides. For example, see the override file for the Manjusrinamasamgiti in the data registry under `processed_datasets/translation-test-docs`.\n\n### Re-translation into other languages\n\nTo translate into languages other than English, we find that the best results were to translate to English first and then zero-shot translate from English to the target language using NLLB. We provide the simple tool `lotsawa-retranslate` to facilitate this. This strategy works best for translation into other high resource languages such as simplified Chinese.\n\nIf you are trying to use this tool but are still running into issues please contact us at <contact@compassion-ai.org> or on our GitHub issues page. Some issues you may face could be: seeing a lot of English in the target output, toxicity or other bad words, or excessive pronoun/context switching. While we saw quite good results with this tool, we are not professional translators. We are likely to be able to improve the model if we understand your use case, _please_ contact us.\n\nThe tool will translate all English files that match the input glob into the target language. The input glob defaults to `translations/*.en` and the output extension defaults to the language code. For a readable list of the language codes, please see table 1, _204 Languages of No Language Left Behind_, on pages 13-16 in the NLLB model paper at <https://arxiv.org/pdf/2207.04672>. You can also use the argument `list_language_codes=true` to print out all language codes.\n\nPass in `cuda=true` to use an NVidia GPU. You shouldn't run out of memory with the settings used here. If you are, please [contact us](contact@compassion-ai.org).\n\nAs an example, to translate a directory with Tibetan texts in it into simplified Chinese:\n\n```bash\n# First, translate into English\nlotsawa-translate mode=batch mode.input_glob=~/tibetan_texts/*.bo\n\n# Reviewing the English translation here will improve the Chinese\n\n# Finally, re-translate the English into Chinese\nlotsawa-retranslate output.target_language_code=zho_Hans\n```\n\nThe results will be in `./translations` with the extension `.zho_Hans`.\n\nYou do not need to use `lotsawa-translate` to produce the English text. The `lotsawa-retranslate` tool will go through the input files line by line, skip any lines with Tibetan characters in them, and translate each remaining line using NLLB. The most important thing to know is: NLLB works well on _short_ inputs. A simple approach with English would be to split every English sentence into its own line. **PLEASE** contact us at <contact@compassion-ai.org> so that we can help, or open an issue on our GitHub page.\n\nIf you're interested in using the 84,000 XML files, note that the tool will not do any preprocessing, such as unfolding the XML tags. The class `TeiLoader`, found in the CompassionAI/common repo under `cai_common/data/tei_loader.py`, uses BeautifulSoup to extract and clean the translations from the 84,000 XML files. _Please_ contact us if you're interested in using this code.\n\nThe retranslation tool has the generation options configuration group that allows fine-grained control over the text generation algorithm. \n\n  - You can tweak the beam search parameters, such as the number of beams or the repetition penalty.\n  - You can specify a word blacklist here. Can be especially useful to avoid some nonsensical named entity translations or toxic terms, or to stop the model from inserting English terms into non-English translations.\n\n    Note that, for languages that don't have word indicators such as spaces, the word blacklist is unlikely to work well. This is because the NLLB tokenizer is based on SentencePiece, which produces highly contextual tokenizations. The blacklist is converted to tokens. We will implement a way around this if we find one. If you're using the blacklist to exclude English from your generated text, consider using an alphabet restriction.\n\n  - You can constrain the model to generate a specific alphabet. The supported alphabets are, in alphabetical order: \n  Arabic, Armenian, Bengali, Chinese (corresponds to the Unicode alphabet name \"CJK Unified\"), Cyrillic, Devangari, Ethiopic, Georgian, Greek, Gujarati, Gurmukhi, Hangul, Hebrew, Hiragana, Kannada, Katakana, Khmer, Lao, Latin, Malayalam, Myanmar, Ol Chiki, Oriya, Sinhala, Tamil, Telugu, Thai, Tibetan (intended for research, eg back-translation), Tifinagh. All alphabets include the full range of characters in the Unicode alphabet with that name, so for example Cyrillic includes all non-Russian characters from other Slavic languages such as Ukrainian.\n\n    Make sure your alphabet makes sense for your target language! Lotsawa will not warn you if it doesn't.\n\n**NB:** Due to the nature of maximum-likelihood-like neural network training combined with the fact that the NLLB dataset was scraped from the internet, alphabet constraints are very likely to generate text in the language most represented in that alphabet on the internet. In particular, Latin will generate English, Cyrillic will generate Russian, Devangari will generate Hindi, Myanmar will generate Burmese, etc. This is an artifact of the protocol used to train NLLB, it is not a cultural or political statement of some kind by anyone involved. You should get good results when combining alphabet constraints with language target code conditioning. For example, \n\n```bash\nlotsawa-retranslate output.target_language_code=ukr_Cyrl generation.alphabet=cyrillic\n```\n\nshould produce good Ukrainian. Implementing new alphabet constraints is usually straightforward. Feel free to contribute, or _please_ contact us at <contact@compassion-ai.org> or open an issue on our GitHub page.\n\nSee the full help for `lotsawa-retranslate` for a complete list of options:\n\n```bash\nlotsawa-retranslate --help\n```\n\n### Word segmentation and part-of-speech tagging\n\nWe provide interactive and batch segmentation and tagging.\n\n - Interactive mode will prompt you for individual short Tibetan sections and will output word segmentations with part-of-speech tags. This is intended as a test or a demo.\n - Batch mode will process long Tibetan files (in Unicode with uchen script). This mode will involve segmentation of the long text into shorter sections, followed by word segmentation and part-of-speech tagging.\n\nTo run the tool in interactive mode, just activate your conda environment (if any) and use:\n\n```bash\nlotsawa-words\n```\nInteractive is the default mode. An example that uses batch mode is:\n\n```bash\nlotsawa-words mode=batch mode.input_glob=~/tibetan_texts/*.bo\n```\n\nThis will segment and tag all texts in the directory `~/tibetan_texts` that have the extension `.bo` and output the results to `./pos_tags`. To control the output directory, set `mode.output_dir`.\n\nTo use CUDA, pass in `cuda=true`. For example:\n\n```bash\nlotsawa-words mode=batch mode.input_glob=~/tibetan_texts/*.bo cuda=true\n```\n\nWe are working on updating the models underlying this tool, especially the tokenization. If you have a use case for our token classifiers that needs a different delivery of the models, or if you need us to change how the models themselves work, _please_ contact us at <contact@compassion-ai.org> or open an issue on our GitHub page.\n\n### Cleaning the model cache\n\nLotsawa will download the trained CompassionAI language models into the PyTorch Hub cache. The models can get fairly large, for example our current best model for Tibetan-English translation is 1.8GB.\n\nTo clear the cache, simply delete the PyTorch Hub cache. This is safe, if you run Lotsawa again it will re-create the cache and re-download the models. To find the cache directory, run this in your terminal:\n\n```bash\npython -c \"from torch.hub import get_dir; print(get_dir())\"\n```\n\nThis will print the directory, which you can then explore and delete if you like. To delete only the CompassionAI cache with a single terminal command, use:\n\n```bash\necho rm -rf $(python -c \"from torch.hub import get_dir; print(get_dir() + '/champion_models')\") | bash\n```\n\n## For developers\n\n### Hydra\n\nLotsawa uses Hydra for its configuration. Hydra is a tool developed by Facebook to manage complex configuration, especially in the machine learning space. It enables reproducible results, configuration as code, grouping of configuration options, and easy defaults and overrides. See <https://hydra.cc/> for details.\n\n### Embedding Lotsawa's backend into your own applications\n\nThe utilities we provide in the Lotsawa package are simple wrappers around helper classes provided by the Garland and Manas CompassionAI repos. The helper classes encapsulate the loading of the models, the encoding and decoding of the text, and implement any algorithms we layered on top of the model decoding to create our results. For example, the `Translator` class encapsulates the process of maintaing the target language context during batch translation.\n\nThe source code for the provided utilities can be found in:\n\n```bash\nlotsawa/lotsawa/translate.py\nlotsawa/lotsawa/retranslate.py\nlotsawa/lotsawa/part_of_speech.py\n```\n\n### Fine-tuning Lotsawa's models\n\nWe provide the code for this in the Garland and Manas repositories. Documentation may be sparse currently. _Please_ contact us at <contact@compassion-ai.org> or open an issue on our GitHub page. We have no sales team or anything like that, we will not hassle you, we just want to be helpful.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/compassionai/lotsawa",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "lotsawa",
    "package_url": "https://pypi.org/project/lotsawa/",
    "platform": null,
    "project_url": "https://pypi.org/project/lotsawa/",
    "project_urls": {
      "Bug Tracker": "https://github.com/compassionai/issues",
      "Homepage": "https://github.com/compassionai/lotsawa"
    },
    "release_url": "https://pypi.org/project/lotsawa/0.3.4/",
    "requires_dist": [
      "compassionai-common (>=0.1.0)",
      "compassionai-manas (>=0.1.0)",
      "compassionai-garland (>=0.1.0)",
      "tqdm (>=4.64.1)"
    ],
    "requires_python": ">=3.6",
    "summary": "Machine translation and understanding of classical Tibetan",
    "version": "0.3.4",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 15763747,
  "releases": {
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a2123fbadac56c83044b0070bd600917b88097b9c80438ec42dad56c5e978cec",
          "md5": "705be86aa561ba907bbb37440e17d253",
          "sha256": "c6bd48ee5195351a62279167915f27f691662c3bb331ededf114ecbea3757702"
        },
        "downloads": -1,
        "filename": "lotsawa-0.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "705be86aa561ba907bbb37440e17d253",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 42213,
        "upload_time": "2022-10-19T21:40:17",
        "upload_time_iso_8601": "2022-10-19T21:40:17.596012Z",
        "url": "https://files.pythonhosted.org/packages/a2/12/3fbadac56c83044b0070bd600917b88097b9c80438ec42dad56c5e978cec/lotsawa-0.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "47273030a74e84b79586f5fe0814411dc02f75eae0e806486e0fc00686c8bf87",
          "md5": "f1c9485ce7b7f0b69eed0b107d73106a",
          "sha256": "a36a19a74c6f9b4ca158ab22d8abfa796f41285a42bade55305521786654551c"
        },
        "downloads": -1,
        "filename": "lotsawa-0.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "f1c9485ce7b7f0b69eed0b107d73106a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 34546,
        "upload_time": "2022-10-19T21:40:19",
        "upload_time_iso_8601": "2022-10-19T21:40:19.636707Z",
        "url": "https://files.pythonhosted.org/packages/47/27/3030a74e84b79586f5fe0814411dc02f75eae0e806486e0fc00686c8bf87/lotsawa-0.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c7fae65b9b87023e6357fdbe366847b5b1ab1cb536cdf444f0b5a5ed1250d466",
          "md5": "0f8ef92fdef066ef7be42edaf90c35fa",
          "sha256": "e05d0602aba5321776b81a092a647c17740c8c2743d7645932101a641f1d3610"
        },
        "downloads": -1,
        "filename": "lotsawa-0.1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "0f8ef92fdef066ef7be42edaf90c35fa",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 42276,
        "upload_time": "2022-10-20T15:12:45",
        "upload_time_iso_8601": "2022-10-20T15:12:45.842640Z",
        "url": "https://files.pythonhosted.org/packages/c7/fa/e65b9b87023e6357fdbe366847b5b1ab1cb536cdf444f0b5a5ed1250d466/lotsawa-0.1.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "92c1fbaf165edccbd3ddf67827687d55a1ffb1dcfdc1a9dcc00188facda0bf28",
          "md5": "28b1678c3e26f4ea929c21bffac658e6",
          "sha256": "18056388837c9889ac1b8fb831ad25fd36a299ff79360c3ca7eb2e9babde0f35"
        },
        "downloads": -1,
        "filename": "lotsawa-0.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "28b1678c3e26f4ea929c21bffac658e6",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 34655,
        "upload_time": "2022-10-20T15:12:48",
        "upload_time_iso_8601": "2022-10-20T15:12:48.631836Z",
        "url": "https://files.pythonhosted.org/packages/92/c1/fbaf165edccbd3ddf67827687d55a1ffb1dcfdc1a9dcc00188facda0bf28/lotsawa-0.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ebcd190f8d074f8f7e51fe5e1debba20c03e4477940f234e60f535c32b44c741",
          "md5": "11267668aaa2423f6738a7e42d679003",
          "sha256": "c9cfd1e6a9ed598f23fe823e5774ce9f3b77d1017b693ffa6cda025423bdf330"
        },
        "downloads": -1,
        "filename": "lotsawa-0.2.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "11267668aaa2423f6738a7e42d679003",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 42279,
        "upload_time": "2022-10-27T22:10:55",
        "upload_time_iso_8601": "2022-10-27T22:10:55.947524Z",
        "url": "https://files.pythonhosted.org/packages/eb/cd/190f8d074f8f7e51fe5e1debba20c03e4477940f234e60f535c32b44c741/lotsawa-0.2.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c4e776b6c5046eeb49e68f437787e62d3829731b828f8204efcb47fb8e373edc",
          "md5": "fce574599aa4fcd07709c9d111b12f87",
          "sha256": "ba58018ed5da89c57bde83ee86332460f7a7bfd676abef7e52c89bed579ace52"
        },
        "downloads": -1,
        "filename": "lotsawa-0.2.0.tar.gz",
        "has_sig": false,
        "md5_digest": "fce574599aa4fcd07709c9d111b12f87",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 34682,
        "upload_time": "2022-10-27T22:10:57",
        "upload_time_iso_8601": "2022-10-27T22:10:57.951178Z",
        "url": "https://files.pythonhosted.org/packages/c4/e7/76b6c5046eeb49e68f437787e62d3829731b828f8204efcb47fb8e373edc/lotsawa-0.2.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3d97b335cbc847788bf112f6e5d8f195401cfa1b81dd5becc69f8b448602e218",
          "md5": "0fc9434c22fffafe741dc0939b1d53b8",
          "sha256": "4766f8c7b9ff44fe03cda9a0fd1b9c95f9874614c47e80ee375f935ee5e18c01"
        },
        "downloads": -1,
        "filename": "lotsawa-0.3.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "0fc9434c22fffafe741dc0939b1d53b8",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 45575,
        "upload_time": "2022-10-28T18:45:56",
        "upload_time_iso_8601": "2022-10-28T18:45:56.503389Z",
        "url": "https://files.pythonhosted.org/packages/3d/97/b335cbc847788bf112f6e5d8f195401cfa1b81dd5becc69f8b448602e218/lotsawa-0.3.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "cbc72d2bda80da1fd7caf1634c312531c40204213368295e4a28b2e435ebf13f",
          "md5": "96c1b8ad42f0ec5683659fa99f5f1d3d",
          "sha256": "211178596a2184bd6ecce5da41edb3e5436cdbbfe704b6d745e4bf288aed4698"
        },
        "downloads": -1,
        "filename": "lotsawa-0.3.0.tar.gz",
        "has_sig": false,
        "md5_digest": "96c1b8ad42f0ec5683659fa99f5f1d3d",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 38514,
        "upload_time": "2022-10-28T18:45:58",
        "upload_time_iso_8601": "2022-10-28T18:45:58.206383Z",
        "url": "https://files.pythonhosted.org/packages/cb/c7/2d2bda80da1fd7caf1634c312531c40204213368295e4a28b2e435ebf13f/lotsawa-0.3.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d6a4d4e0bc7d1bc09d6ae5de50b319b781c6f038826905f60690f26b303aef13",
          "md5": "904a9111ec84fb68f2f8999c936eec15",
          "sha256": "43dd82dbb67d5447acb375c48c346292ba2e9116ce50548e92da3dd103b01fbd"
        },
        "downloads": -1,
        "filename": "lotsawa-0.3.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "904a9111ec84fb68f2f8999c936eec15",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 45770,
        "upload_time": "2022-10-28T21:04:46",
        "upload_time_iso_8601": "2022-10-28T21:04:46.475698Z",
        "url": "https://files.pythonhosted.org/packages/d6/a4/d4e0bc7d1bc09d6ae5de50b319b781c6f038826905f60690f26b303aef13/lotsawa-0.3.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4049dcedac2edbd9d0ed35c50b21a1998653a439b30d184ce61b1f3141652357",
          "md5": "3e699f27cc5dc7747f50390e44f91c75",
          "sha256": "ebdd43eb233c4c0864dba7582fb220e94a833a351deed1f43098f8d855df5134"
        },
        "downloads": -1,
        "filename": "lotsawa-0.3.1.tar.gz",
        "has_sig": false,
        "md5_digest": "3e699f27cc5dc7747f50390e44f91c75",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 38542,
        "upload_time": "2022-10-28T21:04:48",
        "upload_time_iso_8601": "2022-10-28T21:04:48.376768Z",
        "url": "https://files.pythonhosted.org/packages/40/49/dcedac2edbd9d0ed35c50b21a1998653a439b30d184ce61b1f3141652357/lotsawa-0.3.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1ff62339a5fbb92a64eb4878989b1ca430f287fafea634b959ea0e9cab7abadc",
          "md5": "6b0a4c4b725922ca915570af0ec8fbb7",
          "sha256": "4e50504dcd48d93cd5d41e2d39b349d4de48b0d043d9de8b8a577f296a83de97"
        },
        "downloads": -1,
        "filename": "lotsawa-0.3.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "6b0a4c4b725922ca915570af0ec8fbb7",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 45782,
        "upload_time": "2022-10-28T21:23:33",
        "upload_time_iso_8601": "2022-10-28T21:23:33.100966Z",
        "url": "https://files.pythonhosted.org/packages/1f/f6/2339a5fbb92a64eb4878989b1ca430f287fafea634b959ea0e9cab7abadc/lotsawa-0.3.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ba2b1afe5b9db58266ee96879f99b76a56ee385c0b9c34379e155c1df89f5ce4",
          "md5": "1da76f0aef55af30c2aeae0ffb5f3f0a",
          "sha256": "7dcf079ea2e36d0220b9383687589249f787ca57dec4bc085042fcfc20040acb"
        },
        "downloads": -1,
        "filename": "lotsawa-0.3.2.tar.gz",
        "has_sig": false,
        "md5_digest": "1da76f0aef55af30c2aeae0ffb5f3f0a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 38552,
        "upload_time": "2022-10-28T21:23:36",
        "upload_time_iso_8601": "2022-10-28T21:23:36.683352Z",
        "url": "https://files.pythonhosted.org/packages/ba/2b/1afe5b9db58266ee96879f99b76a56ee385c0b9c34379e155c1df89f5ce4/lotsawa-0.3.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "17983f0234bba275cc2119c6c42a696a6cd3b6e3ff1a192141f770ee86b09ce7",
          "md5": "c8673bd2411d0581c0be410d2e6a6312",
          "sha256": "c994e30284043c14eb37bd5b21ebf4ab891c31e40d0c49eff61b428e43fd74db"
        },
        "downloads": -1,
        "filename": "lotsawa-0.3.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "c8673bd2411d0581c0be410d2e6a6312",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 48238,
        "upload_time": "2022-11-14T15:06:52",
        "upload_time_iso_8601": "2022-11-14T15:06:52.484319Z",
        "url": "https://files.pythonhosted.org/packages/17/98/3f0234bba275cc2119c6c42a696a6cd3b6e3ff1a192141f770ee86b09ce7/lotsawa-0.3.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b961326413f0c9d9e86bdde2f17973f174b6b69ac941b12e87bc7442c11f5cc5",
          "md5": "325aff3fdbfdceab960fe7ecfbf3c17d",
          "sha256": "b89cc196ff7b9217760bf8d10154750f640d407278199de3b46a6d6d9e3d800f"
        },
        "downloads": -1,
        "filename": "lotsawa-0.3.3.tar.gz",
        "has_sig": false,
        "md5_digest": "325aff3fdbfdceab960fe7ecfbf3c17d",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 40117,
        "upload_time": "2022-11-14T15:06:56",
        "upload_time_iso_8601": "2022-11-14T15:06:56.740329Z",
        "url": "https://files.pythonhosted.org/packages/b9/61/326413f0c9d9e86bdde2f17973f174b6b69ac941b12e87bc7442c11f5cc5/lotsawa-0.3.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5babc24e46e72bb0ba25035fbdde633ef38acebde8cfb75653ae78739452bd4e",
          "md5": "1ae6d630920f92bcdf16b9c1e98f6a80",
          "sha256": "7105df49ce40399ae4d75947ceb94471c78c229cb9c69e7c3cb942c585482ed7"
        },
        "downloads": -1,
        "filename": "lotsawa-0.3.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "1ae6d630920f92bcdf16b9c1e98f6a80",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 48462,
        "upload_time": "2022-11-14T15:26:41",
        "upload_time_iso_8601": "2022-11-14T15:26:41.902676Z",
        "url": "https://files.pythonhosted.org/packages/5b/ab/c24e46e72bb0ba25035fbdde633ef38acebde8cfb75653ae78739452bd4e/lotsawa-0.3.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ffce48938c2acf9bce899a41386cc09793fa2e978cf955ff944be326e69bbe6c",
          "md5": "1f7b295cbf119466b781f9ee72231783",
          "sha256": "d77ef9a1b4bdcf3918859d81599f04e7399d0e9bbe4318ae856c6083f36cf1ac"
        },
        "downloads": -1,
        "filename": "lotsawa-0.3.4.tar.gz",
        "has_sig": false,
        "md5_digest": "1f7b295cbf119466b781f9ee72231783",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 40309,
        "upload_time": "2022-11-14T15:26:46",
        "upload_time_iso_8601": "2022-11-14T15:26:46.535288Z",
        "url": "https://files.pythonhosted.org/packages/ff/ce/48938c2acf9bce899a41386cc09793fa2e978cf955ff944be326e69bbe6c/lotsawa-0.3.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "5babc24e46e72bb0ba25035fbdde633ef38acebde8cfb75653ae78739452bd4e",
        "md5": "1ae6d630920f92bcdf16b9c1e98f6a80",
        "sha256": "7105df49ce40399ae4d75947ceb94471c78c229cb9c69e7c3cb942c585482ed7"
      },
      "downloads": -1,
      "filename": "lotsawa-0.3.4-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "1ae6d630920f92bcdf16b9c1e98f6a80",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6",
      "size": 48462,
      "upload_time": "2022-11-14T15:26:41",
      "upload_time_iso_8601": "2022-11-14T15:26:41.902676Z",
      "url": "https://files.pythonhosted.org/packages/5b/ab/c24e46e72bb0ba25035fbdde633ef38acebde8cfb75653ae78739452bd4e/lotsawa-0.3.4-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "ffce48938c2acf9bce899a41386cc09793fa2e978cf955ff944be326e69bbe6c",
        "md5": "1f7b295cbf119466b781f9ee72231783",
        "sha256": "d77ef9a1b4bdcf3918859d81599f04e7399d0e9bbe4318ae856c6083f36cf1ac"
      },
      "downloads": -1,
      "filename": "lotsawa-0.3.4.tar.gz",
      "has_sig": false,
      "md5_digest": "1f7b295cbf119466b781f9ee72231783",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 40309,
      "upload_time": "2022-11-14T15:26:46",
      "upload_time_iso_8601": "2022-11-14T15:26:46.535288Z",
      "url": "https://files.pythonhosted.org/packages/ff/ce/48938c2acf9bce899a41386cc09793fa2e978cf955ff944be326e69bbe6c/lotsawa-0.3.4.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}