{
  "info": {
    "author": "Nyggus",
    "author_email": "nyggus@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# `makepackage`: A Python package for packaging Python code\n\n## Installation\n\nInstall the package from [PyPi](https://pypi.org/project/makepackage/):\n\n```shell\n$ pip install makepackage\n```\n\n\n## TL;DR: How to use `makepackage`\n\nTo create a package that does not need a command-line argument, go to a directory where you want to create the structure of your package and run in shell\n\n```shell\n$ makepackage mypackage\n```\n\nwhere `mypackage` is the name of your package. That's it! You will have a self-standing package that you can now develop. Remember to fill in `[MAKEPACKAGE]` fields in setup.py and LICENSE.\n\nIf you want to create a package with a command-line argument, add a `cli` flag after the name of the package:\n\n```shell\n$ makepackage mypackage cli\n```\n\nand here you are. Your package will get the command-line argument that is the same as the package's name.\n\nNow let's go into detail.\n\n\n## Rationale and background\n\nOrganizing Python code in a package has a lot of advantages and can significantly simplify development — but the first hours can be tricky. To facilitate this process, you can use tools such as [Cookiecutter](https://cookiecutter.readthedocs.io/), but they themselves are quite advanced and offer a lot of functionalities that you need to learn — quite often, this complexity makes development more difficult, sometimes changing the hours spent with the tool into a nightmare. \n\nTo facilitate this step, I created a package template and have been using it for about a year. Life got easier. But the template required some manual work that could be automated. This is when I thought that a script would be better, so I wrote one. It worked fine indeed, and things got even easier. And then I thought, as this is so useful for me, why not make it useful for others? So, I made this package, and now you can use it just like me.\n\n`makepackage` offers only one function, available via shell. The only thing you need to do is to install `makepackage` (preferably in a virtual environment you will use only to create new packages) and run a simple shell command (which works under both Linux and Windows). The command, as you will see below, takes one required argument: a package's name; you can add `--cli` to create a CLI package, as otherwise (without the flag) it will not have command-line interface.\n\nThe use of `makepackage` is very simple, but this does not come without costs: it creates just one type of structure, though you can change it manually:\n* you have to fill in some fields in setup.py\n* setup.py will include `pytest`, `wheel`, `black` and `mypy` in the `dev` mode; you can remove them manually before installing the package in the editable mode\n* the package will use `pytest` for unit testing and `doctest` for documentation testing\n\n> You will find annotated code in `ziuziu` (given the simplicity of the functions, the annotations are very simple), and you can run `mypy` on it, with success.\n\nThe idea behind `makepackage` is to offer a tool that creates a working package with a simple but common structure, which can be then extended and developed. And indeed, you will find in it tests (both `pytest`s and `doctest`s) that pass; you can install the package in the editable mode, and after that you will be able to import it. So, the resulting package is just fine, and you can immediately move to development.\n\n> `makepackage` offers one of many possible structures, and it assumes you will use `pytest` for testing. If you want to use other solutions, you should either create a package manually or use another tool.\n\n\n## Using `makepackage`\n\n> The [tests](tests/) folder contains six shell scripts. Two of them show how to use `makepackage` in Linux, and two others do the same for Windows. One of the scripts shows how to create a package that does not need command-line interface while the other with CLI. Check out these two files for Linux: [`makepackage` without CLI](tests/run_makepackage_no_CLI.sh) and [`makepackage` with CLI](tests/run_makepackage_with_CLI.sh); and for Windows, these two files: [`makepackage` without CLI](tests/run_makepackage_no_CLI.bat) and [`makepackage` with CLI](tests/run_makepackage_with_CLI.bat).\n\nIt's best to install and use `makepackage` in a virtual environment. So, for example,\n\n```shell\n$ python -m venv venv-makepackage\n$ venv-package/bin/activate\n(venv-makepackage) $ python -m pip install makepackage\n```\n\n> Examples show Linux commands, but any Windows user will know how to replace them with the corresponding Windows commands (though most commands will be the same in Linux and Windows; you simply need to change paths when activating a virtual environment in Windows).\n\nNow that we have activated the virtual environment and installed `makepackage` in it, we are ready to create a package of our own. First, navigate to a folder where you want to create the package, and run the following command:\n\n```shell\n(venv-makepackage) $ makepackage ziuziu\n```\n\nThis creates a `ziuziu` package; `ziuziu` will not have command-line interface. You will now see a ziuziu folder:\n\n```shell\n(venv-makepackage) $ ls\nziuziu\n```\n\nIf you want to create a package with command-line interface, use a command-line flag `--cli`, like this:\n\n```shell\n(venv-makepackage) $ makepackage ziuziu --cli\n```\n\n> As we used the same name — `ziuziu` — again, we would get an error; so, you should first remove the previous installation of `ziuziu`, use a different name for the package, or create the package in a different location.\n\nWith this, you will be able to run your package using the `ziuziu` command in shell.\n\nThe only thing you now need to do is to create a virtual environment and install the `ziuziu` package there, in the editable mode:\n\n```shell\n(venv-package) $ deactivate\n$ python -m pip install venv-ziuziu\n(venv-ziuziu) $ cd ziuziu\n(venv-ziuziu) $ python -m pip install -e .[dev]\n```\n\nAnd that's it, you're ready to develop `ziuziu`. Now you can run tests:\n\n```shell\n(venv-ziuziu) $ python -m pytest\n(venv-ziuziu) $ python -m doctest ziuziu/ziuziu.py\n```\n\nYou will see that the package is created with 11 `pytest` tests, and they should all pass (you will see the output from `pytest`). All `doctest`s should pass, too — that means you should see no output from `doctest`.\n\n\n> When you create a package using `makepackage`, you can read the README file of the new package. It contains some essential information about package development, such as building the package, installing it, and uploading to PyPi.\n\n## Structure of a package created using `makepackage`\n\nYou can use various structures to create a Python package. `makepackage` uses one of them, a simple (though not the simplest) but quite common one. You will see the following structure of the ziuziu/ folder (so, of the `ziuziu` package):\n\n```shell\n.\n+-- .gitignore\n+-- LICENSE\n+-- README.md\n+-- pytest.ini\n+-- setup.py\n+-- tests\n|  +-- __init__.py\n|  +-- conftest.py\n|  +-- test_ziuziu.py\n+-- ziuziu/\n|  +-- ziuziu.py\n|  +-- __init__.py\n\n```\n\nWhen you used the `makepackage` command with the `cli` argument, the `ziuziu/ziuziu` folder will also include a `__main__.py` file.\n\nHere are the assumptions `makepackage` makes:\n* the package is developed using `pytest` and `doctest` (you will find both implemented in the code of `ziuziu`)\n* MIT license is used (you can change it to any license you want, but remember also to change the license in setup.py)\n* in the development mode, `pytest`, `wheel`, `black` and `mypy` packages are additionally installed in the virtual environment (used for development); they are *not* installed when one installs the package from PyPi\n* you will need to fill in setup.py in several places (namely, fields `author`, `author_email`, and `description`) and LICENSE in one place; you can easily find those places, as they are indicated with the `\"[MAKEPACKAGE]\"` mark.\n\nOf course, this is a starting point, and you can now extend the package however you want. Once installed, `ziuziu` (or however you name the package) works. It has three functions, `foo()`, `bar()` and `baz()`, which all have tests implemented in the tests/ folder, and you can run them using the `pytest` command as shown above.\n\nThose who tried to create such a package manually know that quite often something does not work — an import does not work, `pytest` does not see the package, and the like. When using `makepackage`, you get a fully working structure of the package. The only thing you need to do is to replace the existing functions with your functions, and of course to adapt the package to this change.\n\n\n> `makepackage` comes with some functionalities that you can get rid of:\n>> * a conftest.py file in the tests/ folder\n>> * simple annotations in the `foo()`, `bar()` and `baz()` functions of the newly created package\n>> * `doctest`s in the above functions\n>> * packages installed in the editable mode\n\n\n# Notes on further development of your package\n\nAs mentioned before, the first step is to fill in several fields in setup.py and author in LICENSE. Then you need to create a virtual environment, in which you install the package in the editable mode. And that's all you need to start development. \n\nFrom now on, you're on your own. However, a package created using `makepackage` comes with some help for inexperienced users. They can see how to write tests (using `pytest`), how to use a conftest.py file (for `pytest`ing), how to write fixtures and parametrized tests (again for `pytest`ing), how to import the package's modules and functions, how to write `doctest`s, and the like. These are just some basic development tools. \n\nThere is one thing I'd like to stress, and it's related to imports. (The truth is, imports sometimes happen to pose some unexpected problems during Python coding). When you add a new module to the source folder (in our example, this is ziuziu/), e.g., ziuziu/another_ziuziu.py, then in the main `ziuziu` module you can import it as `from ziuziu import another_ziuziu` or `from ziuziu.another_ziuziu import another_foo`. Note that the regular approach you would use, that is, `import another_ziuziu`, will not work here.\n\n\n## Testing\n\nTesting of `makepackage` combines shell scripts and `pytest`. Therefore, running tests on Linux and Windows requires running different shell scripts. You will learn more from [here](tests/README.md).\n\n\n## Contribution\n\nEveryone is invited to develop `makepackage`. You can submit an issue or a pull request. Nonetheless, be aware that I will only accept proposals that\n* keep the current API of the package, unless the proposed change is so great that the cost of changing the API is relatively small compared to what the new functionality offers\n* are covered by unit tests\n* are well documented (if needed)\n* are coded in a similar style that the current code uses\n* work under both Windows and Linux\n\nBelow, you can read more about these aspects.\n\n> Do remember to increment `makepackage`'s version. Use [semantic versioning 2.0.0](https://semver.org/).\n\nIn technical terms, to contribute,\n* fork the repository and clone it to your machine\n* create a new branch: `$ git checkout -b new-branch`, where `new-branch` is the name of a branch, so remember to name it in a way that reflects what the branch changes (and please, do not use the name of `new-branch` or similar)\n* once you're done with all the changes and are ready to commit the changes, you can use `git add path` to add each file separately (`path` being a relative path to a file you want to commit); after each such command, do `$ git commit -m \"What I did\"`, the comment explaining what is changed in the committed file. If you want to add all the files at the same time, do `$ git add .`.\n* `$ git push --set-upstream origin new-branch` — this will create the branch in the repo and will push the changes to it.\n* create a pull request to the original repository; when doing so, please explain the changes in detail\n\nIf someone else is developing `makepackage` at the same time, you may have to solve the resulting conflicts. How to say it... be patient and don't break down! Don't break down your computer, either! Keep your nerves in check!\n\nNow, you can sit and wait for a review of your proposal; use this time for thinking about how to improve the package even more :smiley:. \n\n\n#### Keep the current API of the package\n\nThis, for instance, means that `makepackage`'s API does not offer different licences, structures of the root folder, and the like. Also, the API does not offer numerous arguments to enable the user to fill in the required fields of setup.py; the user can do it directly in the file, an approach that is easier than providing this information through command-line arguments. No GUI, too: just a simple shell command.\n\nThe simpler the API, the easier the package is to use. The idea behind `makepackage` was to bring a *really* simple API to create a package. This simplicity cannot come without cost, but the cost does not seem that great. True, if one wants to create a different organization of the package or wants to use `unittest` instead of `pytest`, then one will have to choose a different tool or do it manually. This is the main cost of simplicity we have to pay, but had `makepackage` enabled the user to choose from different options, the package's API would have been far more complicated. This would mean the main purpose behind creating the package — crreating the structure of a Python package in an easy way — would not have been accomplished. \n\nSimply put, `makepackage` has a simple API and does not offer too many choices, and I want to keep it that way.\n\n\n#### Cover all functionality by unit tests\n\nAdd unit tests to every new functionality or change, unless the change does not change the package's functioning whatsoever. Remember that `makepackage` is tested with `pytest` and `doctest`.\n\n\n#### Use readable and sufficient documentation\n\nIf you add a new functionality or change the existing one, you have to document it in documentation: README and docstrings. Of course, don't overdo, but note that this README is long and detailed. It has the [TL;DR: How to use makepackage](#tldr-how-to-use-makepackage) section, which is short and concise. Then, we go deep when explaining the details. Keep this approach.\n\n\n#### Maintain the current coding style\n\nThis is important. Keep the current style, and please use `black` to format code. By coding style I do not only mean what `black` changes; I mean other important things, such as the following:\n\n* Have you noticed that the only classes that are defined in the package are those for custom exceptions? Try not to change that and do not base any new functionality on a class, unless this is a better and more natural approach.\n* `makepackage` uses custom exceptions to handle the user's mistakes. Throwing custom errors inside `makepackage` functions improves traceback, by using well-named exception classes and moving the traceback into the actual location in code where the exception occurred.\n\n\n#### Work under both Windows and Linux\n\n`makepackage` works in both these OSs, so if you want to propose something new, make sure this works under both these OSs. If you have problems with doing so, please contant the repo's maintainer.\n\nHowever, if you can check if `makepackage` works fine under a different OS, please do so and add it to this section.\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/nyggus/makepackage",
    "keywords": "",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "makepackage",
    "package_url": "https://pypi.org/project/makepackage/",
    "platform": null,
    "project_url": "https://pypi.org/project/makepackage/",
    "project_urls": {
      "Homepage": "https://github.com/nyggus/makepackage"
    },
    "release_url": "https://pypi.org/project/makepackage/0.1.8/",
    "requires_dist": [
      "easycheck",
      "black ; extra == 'dev'",
      "mypy ; extra == 'dev'",
      "pytest ; extra == 'dev'",
      "wheel ; extra == 'dev'"
    ],
    "requires_python": ">=3.6",
    "summary": "Creating a structure of a simple Python package",
    "version": "0.1.8",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16220662,
  "releases": {
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "422e556e73d393bf3a78607cda20c1f076f486ff7136857fd4cf101fd75532ec",
          "md5": "edcaff27503b175c320dac90bba0a398",
          "sha256": "c62f405188182c60bcd03f1625b401706d604c237ec9dba5d20fa6ccb6a89eb7"
        },
        "downloads": -1,
        "filename": "makepackage-0.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "edcaff27503b175c320dac90bba0a398",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 14469,
        "upload_time": "2022-06-07T04:00:57",
        "upload_time_iso_8601": "2022-06-07T04:00:57.259615Z",
        "url": "https://files.pythonhosted.org/packages/42/2e/556e73d393bf3a78607cda20c1f076f486ff7136857fd4cf101fd75532ec/makepackage-0.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6897f212e12b09913a641f77dca6d8d5e59f0a74a54c543cf42c36eadd7b46bc",
          "md5": "c2939b2c4f97144322fb286b2218c852",
          "sha256": "28a3928957287857e065110b0ffe73648adca2fddc46a7b0cbc90d3d56785d30"
        },
        "downloads": -1,
        "filename": "makepackage-0.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "c2939b2c4f97144322fb286b2218c852",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 14440,
        "upload_time": "2022-06-07T04:00:59",
        "upload_time_iso_8601": "2022-06-07T04:00:59.107858Z",
        "url": "https://files.pythonhosted.org/packages/68/97/f212e12b09913a641f77dca6d8d5e59f0a74a54c543cf42c36eadd7b46bc/makepackage-0.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8dbf55c61ef711d66a02d4b76f96f4a49413a3ad9163590b375cdadd11d9efed",
          "md5": "b02bcb1b86bb9697101fddca79aabd9d",
          "sha256": "986726ba55bd45e432b77ac9f0a5a989efecbde3506609551d4a7a58f2c5b9ec"
        },
        "downloads": -1,
        "filename": "makepackage-0.1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "b02bcb1b86bb9697101fddca79aabd9d",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 14463,
        "upload_time": "2022-06-09T08:10:04",
        "upload_time_iso_8601": "2022-06-09T08:10:04.367442Z",
        "url": "https://files.pythonhosted.org/packages/8d/bf/55c61ef711d66a02d4b76f96f4a49413a3ad9163590b375cdadd11d9efed/makepackage-0.1.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7a4491bf2e7208532d5f7d99d263a14605f6b835a497a7719327a553092f5f9f",
          "md5": "0f6a76eec1a9baf344a552645c069de7",
          "sha256": "9cf2c1948f877e2cac3fc5cfcb648649795ea54bd99e669bb11016e5a580946a"
        },
        "downloads": -1,
        "filename": "makepackage-0.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "0f6a76eec1a9baf344a552645c069de7",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 14444,
        "upload_time": "2022-06-09T08:10:06",
        "upload_time_iso_8601": "2022-06-09T08:10:06.715161Z",
        "url": "https://files.pythonhosted.org/packages/7a/44/91bf2e7208532d5f7d99d263a14605f6b835a497a7719327a553092f5f9f/makepackage-0.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ac87fc1e7481b580919785aa29af03b54c3e7f3c72fe400b73cf4f04110c1756",
          "md5": "9de735aff0d4eaba47e83aab79dec00b",
          "sha256": "1e521125d7dd76869b765ac942dc2e51cf7f1d9cbcd38a08feba51e71420f352"
        },
        "downloads": -1,
        "filename": "makepackage-0.1.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "9de735aff0d4eaba47e83aab79dec00b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 14803,
        "upload_time": "2022-08-10T06:41:01",
        "upload_time_iso_8601": "2022-08-10T06:41:01.249759Z",
        "url": "https://files.pythonhosted.org/packages/ac/87/fc1e7481b580919785aa29af03b54c3e7f3c72fe400b73cf4f04110c1756/makepackage-0.1.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4df6530d0dbf83ecc564fff1a6d4d146279d88ad9883c4cd85e2dd60400106e3",
          "md5": "b5b238e757fe01a8e1c2345cb88aa9b8",
          "sha256": "d3d99e16a601bb8e795320dc0bd63a232334fcce256cae6251b20a5681721757"
        },
        "downloads": -1,
        "filename": "makepackage-0.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "b5b238e757fe01a8e1c2345cb88aa9b8",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 14414,
        "upload_time": "2022-08-10T06:41:03",
        "upload_time_iso_8601": "2022-08-10T06:41:03.224058Z",
        "url": "https://files.pythonhosted.org/packages/4d/f6/530d0dbf83ecc564fff1a6d4d146279d88ad9883c4cd85e2dd60400106e3/makepackage-0.1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b42352145bc9f1aaa80aa0b9623ad3bace609f86965a3e9f767646b0efa37f3f",
          "md5": "dab2a9ad0fc159cf81df96559c89d401",
          "sha256": "e3f82eaeef3c2b7221bb4e13d012286f239e33b320cfabf2a0b8fe4e509b4907"
        },
        "downloads": -1,
        "filename": "makepackage-0.1.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "dab2a9ad0fc159cf81df96559c89d401",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 14801,
        "upload_time": "2022-08-12T18:10:26",
        "upload_time_iso_8601": "2022-08-12T18:10:26.632381Z",
        "url": "https://files.pythonhosted.org/packages/b4/23/52145bc9f1aaa80aa0b9623ad3bace609f86965a3e9f767646b0efa37f3f/makepackage-0.1.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "30807c29a0a65ddc5b083b6574817b2d41e3809b7e3fd1f0ff201ba50f7e002d",
          "md5": "9e753c63cae4600a57294d1eeba00541",
          "sha256": "5db290d41f0b5390ac14b641f967607c94a308f55a0fd450671996cd4e023ad2"
        },
        "downloads": -1,
        "filename": "makepackage-0.1.4.tar.gz",
        "has_sig": false,
        "md5_digest": "9e753c63cae4600a57294d1eeba00541",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 14449,
        "upload_time": "2022-08-12T18:10:28",
        "upload_time_iso_8601": "2022-08-12T18:10:28.687661Z",
        "url": "https://files.pythonhosted.org/packages/30/80/7c29a0a65ddc5b083b6574817b2d41e3809b7e3fd1f0ff201ba50f7e002d/makepackage-0.1.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d739a90aae3bf426bc14aaddc27284d8312700ffe018766d76aea4914ce952b7",
          "md5": "50f96fe68e418e71216bbe383e13e30b",
          "sha256": "f4e3f3dc88692b62b23fc21407891d87ca4775c3d8a5001450d5919bd6acd530"
        },
        "downloads": -1,
        "filename": "makepackage-0.1.5-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "50f96fe68e418e71216bbe383e13e30b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 16527,
        "upload_time": "2022-08-17T09:23:41",
        "upload_time_iso_8601": "2022-08-17T09:23:41.939508Z",
        "url": "https://files.pythonhosted.org/packages/d7/39/a90aae3bf426bc14aaddc27284d8312700ffe018766d76aea4914ce952b7/makepackage-0.1.5-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "469af739ad974caf9f09af079e413d8c65264eb6da2666daea6240d024a95b87",
          "md5": "f826b256e3e036f1372b063c48f30c66",
          "sha256": "7f7105e8aee2ac62107732e209900d5449130deacb35733b5dbb631391f82458"
        },
        "downloads": -1,
        "filename": "makepackage-0.1.5.tar.gz",
        "has_sig": false,
        "md5_digest": "f826b256e3e036f1372b063c48f30c66",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 18188,
        "upload_time": "2022-08-17T09:23:43",
        "upload_time_iso_8601": "2022-08-17T09:23:43.934051Z",
        "url": "https://files.pythonhosted.org/packages/46/9a/f739ad974caf9f09af079e413d8c65264eb6da2666daea6240d024a95b87/makepackage-0.1.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "81efb66acd1e7a73a33b8aafaa929ddb1d42ac378a92101c8505edf8c6c759f3",
          "md5": "eaf99cc94246e23e0d0e3430496827af",
          "sha256": "40c96b36b9ad5dee74ef6aa39217aebf34b785360adc5629afdc69b587ea5ab9"
        },
        "downloads": -1,
        "filename": "makepackage-0.1.6-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "eaf99cc94246e23e0d0e3430496827af",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 16648,
        "upload_time": "2022-09-09T08:42:49",
        "upload_time_iso_8601": "2022-09-09T08:42:49.242632Z",
        "url": "https://files.pythonhosted.org/packages/81/ef/b66acd1e7a73a33b8aafaa929ddb1d42ac378a92101c8505edf8c6c759f3/makepackage-0.1.6-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5b1dd0fe05c483206430b5e057a1bca5c9312106c176be6f46bdda1035d0547a",
          "md5": "e308d0f978583ab608ee929cd2100203",
          "sha256": "f720187ef8186582be8f2fdc7ae7556e25c7e876afe0ce51b306069d8ad221f7"
        },
        "downloads": -1,
        "filename": "makepackage-0.1.6.tar.gz",
        "has_sig": false,
        "md5_digest": "e308d0f978583ab608ee929cd2100203",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 18468,
        "upload_time": "2022-09-09T08:42:50",
        "upload_time_iso_8601": "2022-09-09T08:42:50.808207Z",
        "url": "https://files.pythonhosted.org/packages/5b/1d/d0fe05c483206430b5e057a1bca5c9312106c176be6f46bdda1035d0547a/makepackage-0.1.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.7": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "eeeb8af7b192b82d0a3ab554901bb8b0d867806fcd351af52a577c2219eba221",
          "md5": "c029f20c2087989ba8d06388c31feb33",
          "sha256": "ddfaa3817a82e4117de58658ce1ce7181540e068fe6e0002d20f43f3344cc042"
        },
        "downloads": -1,
        "filename": "makepackage-0.1.7-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "c029f20c2087989ba8d06388c31feb33",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 16647,
        "upload_time": "2022-09-14T13:56:00",
        "upload_time_iso_8601": "2022-09-14T13:56:00.177967Z",
        "url": "https://files.pythonhosted.org/packages/ee/eb/8af7b192b82d0a3ab554901bb8b0d867806fcd351af52a577c2219eba221/makepackage-0.1.7-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3311047a664ef4264a77572adc72cbf7646c2d48fc5b71998c2385e06dfee3e7",
          "md5": "203d51cb997805359b0f42956df8fad5",
          "sha256": "6ff136e650b6c4c5d29932072e94a9f598cc90c96f277a1ed00913e6920555e7"
        },
        "downloads": -1,
        "filename": "makepackage-0.1.7.tar.gz",
        "has_sig": false,
        "md5_digest": "203d51cb997805359b0f42956df8fad5",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 18482,
        "upload_time": "2022-09-14T13:56:01",
        "upload_time_iso_8601": "2022-09-14T13:56:01.860312Z",
        "url": "https://files.pythonhosted.org/packages/33/11/047a664ef4264a77572adc72cbf7646c2d48fc5b71998c2385e06dfee3e7/makepackage-0.1.7.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.8": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "aa6de37f50541bd6e001bad0d0184c73b23ebd20f0a743bee265b33cbde25eaf",
          "md5": "4dd305af53e5dd073c7bc57e7e8ca45b",
          "sha256": "bcb77a22bc59a1b074d9633ccd865567e537c9e60f65f4d5514055a61ebd1b43"
        },
        "downloads": -1,
        "filename": "makepackage-0.1.8-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "4dd305af53e5dd073c7bc57e7e8ca45b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 16623,
        "upload_time": "2022-12-27T02:44:05",
        "upload_time_iso_8601": "2022-12-27T02:44:05.642441Z",
        "url": "https://files.pythonhosted.org/packages/aa/6d/e37f50541bd6e001bad0d0184c73b23ebd20f0a743bee265b33cbde25eaf/makepackage-0.1.8-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1479654e52c05bd78d1bf308c72ae0f9621b51cddc081ec3e84e0b84df157505",
          "md5": "b82f8b85cbca4699431630a9921ec165",
          "sha256": "adfcbc9e39178446f1a5184bc4c461610960074406676e4b53cf47b0fc0ee9f7"
        },
        "downloads": -1,
        "filename": "makepackage-0.1.8.tar.gz",
        "has_sig": false,
        "md5_digest": "b82f8b85cbca4699431630a9921ec165",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 18461,
        "upload_time": "2022-12-27T02:44:07",
        "upload_time_iso_8601": "2022-12-27T02:44:07.294730Z",
        "url": "https://files.pythonhosted.org/packages/14/79/654e52c05bd78d1bf308c72ae0f9621b51cddc081ec3e84e0b84df157505/makepackage-0.1.8.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "aa6de37f50541bd6e001bad0d0184c73b23ebd20f0a743bee265b33cbde25eaf",
        "md5": "4dd305af53e5dd073c7bc57e7e8ca45b",
        "sha256": "bcb77a22bc59a1b074d9633ccd865567e537c9e60f65f4d5514055a61ebd1b43"
      },
      "downloads": -1,
      "filename": "makepackage-0.1.8-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "4dd305af53e5dd073c7bc57e7e8ca45b",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6",
      "size": 16623,
      "upload_time": "2022-12-27T02:44:05",
      "upload_time_iso_8601": "2022-12-27T02:44:05.642441Z",
      "url": "https://files.pythonhosted.org/packages/aa/6d/e37f50541bd6e001bad0d0184c73b23ebd20f0a743bee265b33cbde25eaf/makepackage-0.1.8-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "1479654e52c05bd78d1bf308c72ae0f9621b51cddc081ec3e84e0b84df157505",
        "md5": "b82f8b85cbca4699431630a9921ec165",
        "sha256": "adfcbc9e39178446f1a5184bc4c461610960074406676e4b53cf47b0fc0ee9f7"
      },
      "downloads": -1,
      "filename": "makepackage-0.1.8.tar.gz",
      "has_sig": false,
      "md5_digest": "b82f8b85cbca4699431630a9921ec165",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 18461,
      "upload_time": "2022-12-27T02:44:07",
      "upload_time_iso_8601": "2022-12-27T02:44:07.294730Z",
      "url": "https://files.pythonhosted.org/packages/14/79/654e52c05bd78d1bf308c72ae0f9621b51cddc081ec3e84e0b84df157505/makepackage-0.1.8.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}