{
  "info": {
    "author": "Sanchit",
    "author_email": "sanchitsharma84@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 1 - Planning",
      "Intended Audience :: Education",
      "License :: OSI Approved :: MIT License",
      "Operating System :: Microsoft :: Windows :: Windows 10",
      "Programming Language :: Python :: 3"
    ],
    "description": "This package contains set of modules for mechanical press design.\nImplementation can be found in test.py file in downloaded package\nDetail of each module is explained below:\n\n\nModule 1: ed\ned is for Eccentric Drive press. It is similar to Slider crank mechanism. Crankshaft is driven by a motor. Connecting rod connects crankpin (connecting rod journal) of Crankshaft at one end (called big end) and Slider at other end through pin. Rotary motion of Crankshaft is converted to linear movement of Slider. Slider motion is used to apply pressing force on a die to shape a component. The maximum force the Slider can apply is called rated force. Number of rotations of Crankshaft in one minute is called RPM (rotations per minute). Number of strokes per minute of Slider is called SPM. As the Slider crank mechanism is symmetrical, the forward motion time of Slider is equal to return time. At a given position (angle) of Crankshaft, Slider position, linear velocity and  acceleration can be of interest. For this, we need to define the position of crakshaft at 0 degree angle. The convention is to define 0 degree angle of Crankshaft when it is at extremely top position (TDC or TOS), similarly, 180 degree is extremely bottom position (BDC or BOS). \nTwo parameters are extremely important in sizing of a press with Slider crank mechanism. One is the maximum pressing force you can take from Slider. Another is the maximum Crankshaft torque. Force is simple to understand and implement in design, but Crankshaft torque is a bit tricky to understand. With higher Crankshaft torque, we can get higher force throughout the storke of Slider. This can be quantified by a parameter named Rated Distance. Rated distance is the distance of Slider from BDC where we can take rated press force from Slider. Higher the rated distance, higher will be the torque required at Crankshaft.\nBecause of the kinematics of Slider crank mechanism, Slider can give theoritically infinite force at 180 degree (BDC) with almost neglegible torque requirement at Crankshaft. This can be a matter of concern for the structure of press because any structure can take finite amount of load only. To prevent overloading of structure, a separare overload prevention device is required. Generally, connecting rod length should be more than or equal to 3 times of the stroke. For large strokes of slide, Eccentric gear is used in place of Crankshaft. The calculations for eccentric gear are same as with Crankshaft.\nThis module can be used to calculate torque required for an eccentric drive press. The torque output is based on the consideration of only 1 eccentric gear. Besides torque, it can also calculate slide position \"from bottom of stroke\" (FBOS) and acceleration at a given angle of Crankshaft.\n\n\nModule 2: ld\nPlease read about ed press before reading further.\nld is for Link Drive press. It is slightly different from Eccentric drive press in construction. To reduce the speed of slider in forming zone, few extra links are provided in this mechanism. Generally, these presses are driven by eccentric gears rather than crankshaft. Eccnetric gear is driven by a pinion which is driven by a  motor. There are 3 links in this system: Ternary link with 3 joints, rocker link with 2 joints and connecting rod with 2 joints. Rocker link is connected to Crown at one end and with ternary link at other. Connecting rod is connected with ternary link at oner end and slide to another. Ternary link is also connected to eccentric gear's eccentric portion. Eccentric gears rotates at constant speed. Due to linkage mechanism, Slide moves slowly in forming zone (bottom 1/3rd zone of forward motion) and fast in return stroke.\nThis module can be used to calculate torque required for link drive press. The torque output is based on the consideration of only 1 eccentric gear. Besides torque, it can also calculate TDC and BDC angle, slide position \"from bottom of stroke\" (FBOS) and velocity at all the angles of Eccentric gear.\n\n\nModule 3: crown\nCrown is one of the main structural component of mechanical press. It houses drive components like gears, shafts links etc. It also transfers press force to tie rods. It acts like a simply supported beam where tie rod acts as supports and eccentric gear pin acts as load points.\nBending and shear stresses are generated in crown when press applies load. Crown also deflects due to bending and shear forces.\nThis module can be used to determine stresses and defelction in crown due to load. The maximum stress and deflection comes in the center of the crown in left to right direction.\nGenerally stresses are limited to 50 N/mm2 and deflection is limited to 0.2mm/m at center. Deflection calculated by this module is the total deflection at center. It should be divided by tie rod center distance to get the value in mm/m. For example, if the tie rod center distance is 5000 mm and deflection at center is 0.8 mm, then deflection in mm/m = 0.8 / 5 = 0.16 mm/m\n\n\nModule 4: bed\nBed (also known as Bottom Head) is one of the main structural component of mechanical press. It is the bottom most part of structure. It takes the vertical load of forming which comes from the bolster plate which is mounted on top of the bed. It also transfers press force to tie rods. It acts like a simply supported beam where tie rod acts as supports and bolster acts as Uniformly distributed load.\nBending and shear stresses are generated in bed when press applies load. Bed also deflects due to bending and shear forces.\nThis module can be used to determine stresses and defelction in bed due to load. The maximum stress and deflection comes in the center of the bed in left to right direction.\nGenerally stresses are limited to 50 N/mm2 and deflection is limited to 0.17mm/m at center. Deflection calculated by this module is the total deflection at center. It should be divided by tie rod center distance to get the value in mm/m. For example, if the tie rod center distance is 6000 mm and deflection at center is 1 mm, then deflection in mm/m = 1 / 6 = 0.167 mm/m\n\n\nModule 5: slide\nSlide is one of the main structural component of mechanical press. It is the moving part of press which applies load on the die. It takes the vertical load of forming which comes from the upper die which is mounted on the slide. It also transfers press force from top die to connecting rods. It acts like a simply supported beam where connecting rod acts as supports and top die acts as Uniformly distributed load.\nBending and shear stresses are generated in slide when press applies load. Slide also deflects due to bending and shear forces.\nThis module can be used to determine stresses and defelction in slide due to load. The maximum stress and deflection comes in the center of the slide in left to right direction. \nGenerally stresses are limited to 50 N/mm2 and deflection is limited to 0.17mm/m at center. Deflection calculated by this module is the total deflection at center. It should be divided by suspension center distance to get the value in mm/m. For example, if the susepnsion center distance is 4000mm and deflection at center is 0.6 mm, then deflection in mm/m = 0.6 / 4 = 0.15 mm/m\n\n\nModule 6: section_mi\nThis module is used to calculate section properties like centroid, second moment of area etc of I beam. I beam consists of 3 main rectangular sections: Top flange, Web and bottom flange. This module also gives provision to include top and bottom reinforced plates. \n\n\nModule 7: polynomial_345\nThis module is used to calculate the distance, velocity and acceleration function of a 3-4-5 polynomial. Input of the function is the travel time, distance to be covered and idle time. Output if the list of distance, velocity and acceleration at each millisecond.\n\n\nModule 8: automation_345\nThis module is used to select the servo motor for a linear axis. It is based on a single axis automation system which is driven by a servo motor. A gearbox is coupled with servo motor. Timing pulley is mounted on the output shaft of gearbox. Timing pulley drives the timing belt which is connected to a actuator bar or arm. This arm moves in linear direction as motor rotates. The arm is guided through Linear guides. The movement of arm is horizontal so servo motor is not oving it against gravity. However, there will be friction force due to arm's weight on Linear guides. Motor must overcome this frictional force if arm is to be moved. Additional resistance force (if any) can also be defined in the module.\nThe output of the module is list of all important parameters like distance, velocity, acceleration, rpm, torque etc. Values of peak velocity, acceleration, torque, rpm can also be takem as output. \n\n\nModule 9: polynomial_345_cv\nThis module is used to calculate the distance, velocity and acceleration function of a 3-4-5 polynomial with constant velocity in between. Distance equation of 345 polynomial is used as velocity equation in this. Input of the function is the travel time, distance to be covered, percentage constant velocity time and idle time. Output if the list of distance, velocity and acceleration at each millisecond.\n\n\nModule 10: automation_345_cv\nThis module is similar to automation_345 but it includes the input for constant velocity according to polynomial_345_cv module explained above\n\n\nModule 11: shaft\nThis is used to calculate shaft diameter which is under torsion and bending moment using ASME Elliptic equation.\n\nModule 12: gear_geometry\nThis is used to calculate gear geometry parameters like pcd, tip circle, root circle etc\n\nModule 13: gear_strength\nThis is used to approximate Gear and pinion torque by interpolation method. This is not very accurate\n\nModule 14: line_equation\nThis is used to find y value in a line when x value is known. Line is generated by giving input of coordinates of 2 points.\n\nModule 15: power_screw\nThis is used to calculate torque required to raise a load using screw jack \n\nModule 16: hydrodynamic_bush\nThis is used to calculate basic hydrodynamic parameters of bush. Calculation is based on short bearing assumption theory\n\nModule 17: key_size\nThis is used to find out key and keyway sizes for a particular diameter of shaft\n\nModule 18: metric_thread\nThis is used to find out minor diameters or external and internal metric threads\n\nModule 19: flywheel_energy\nThis is used to calculate available work energy in flywheel driven mechanical press\n\nChange Log\n==========\n\n0.0.11 (08/03/2023)\n-------------------\nFollowing 7 new modules added:\ngear_strength module added\nline_equation module added\npower_screw module added\nhydrodynamic_bush module added\nkey_size module added\nmetric_thread module added\nflywheel_energy module added\n\n\n0.0.10 (14/12/2022)\n-------------------\ngear geometry module added\n\n\n0.0.9 (31/08/2022)\n-------------------\nsome uploading errors corrected\n\n\n0.0.8 (31/08/2022)\n-------------------\n1. 3 new modules added:\n\na. polynomial_345_cv\nb. automation_345_cv\nc. shaft\n\n\n0.0.7 (29/08/2022)\n-------------------\nsome bug fixes\n\n\n0.0.6 (29/08/2022)\n-------------------\n1. 2 new modules added:\n\na. polynomial_345\nb. automation_345\n\n\n0.0.5 (28/08/2022)\n-------------------\nsome uploading errors corrected\n\n\n0.0.4 (28/08/2022)\n-------------------\nsome uploading errors corrected\n\n\n0.0.3 (28/08/2022)\n-------------------\nsome uploading errors corrected\n\n\n0.0.2 (28/08/2022)\n-------------------\n1. 4 new modules added:\n\na. section_mi\nb. crown\nc. slide\nd. bed\n\n2. Included implemenation example in readme file for all modules.\n\n\n0.0.1 (15/08/2022)\n-------------------\nfirst release",
    "description_content_type": "",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "mechanical press",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "mechpress",
    "package_url": "https://pypi.org/project/mechpress/",
    "platform": null,
    "project_url": "https://pypi.org/project/mechpress/",
    "project_urls": null,
    "release_url": "https://pypi.org/project/mechpress/0.0.11/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "package for mechanical press design",
    "version": "0.0.11",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17210001,
  "releases": {
    "0.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "cb6fa3f69de5e42e1151117188ce42d39c2c910f6327bda9adc9d600d6c848b0",
          "md5": "ee36297e132e87cc85c4858cc1863627",
          "sha256": "08aa90e9694ae12d88ad1a97db7c72dc300926c92cc8d80fc5d8b9fc008ed474"
        },
        "downloads": -1,
        "filename": "mechpress-0.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "ee36297e132e87cc85c4858cc1863627",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 5559,
        "upload_time": "2022-08-15T18:23:27",
        "upload_time_iso_8601": "2022-08-15T18:23:27.471720Z",
        "url": "https://files.pythonhosted.org/packages/cb/6f/a3f69de5e42e1151117188ce42d39c2c910f6327bda9adc9d600d6c848b0/mechpress-0.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.10": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7804c2b12a90477a58b423161fd4d9bfa8911893243899e2de4df57416425c43",
          "md5": "0b8abef3a2a9238612ea609fcb66a770",
          "sha256": "362728e2dced68afe8f7caaac02e89405acfb602eed7ef681deae5cf2a79e8ea"
        },
        "downloads": -1,
        "filename": "mechpress-0.0.10.tar.gz",
        "has_sig": false,
        "md5_digest": "0b8abef3a2a9238612ea609fcb66a770",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 24299,
        "upload_time": "2022-12-13T18:50:56",
        "upload_time_iso_8601": "2022-12-13T18:50:56.117766Z",
        "url": "https://files.pythonhosted.org/packages/78/04/c2b12a90477a58b423161fd4d9bfa8911893243899e2de4df57416425c43/mechpress-0.0.10.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.11": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "59587e031e2febb82e91ed5cbb24f01135cdb11793e3c0c25930436e7143375c",
          "md5": "6eb4b8d93acd08064a66f043da158709",
          "sha256": "ff136762825acb1c34e37ef6e10e21822735807a375c6c4ae0c0050d15b2b9b6"
        },
        "downloads": -1,
        "filename": "mechpress-0.0.11.tar.gz",
        "has_sig": false,
        "md5_digest": "6eb4b8d93acd08064a66f043da158709",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 35519,
        "upload_time": "2023-03-08T17:15:38",
        "upload_time_iso_8601": "2023-03-08T17:15:38.968457Z",
        "url": "https://files.pythonhosted.org/packages/59/58/7e031e2febb82e91ed5cbb24f01135cdb11793e3c0c25930436e7143375c/mechpress-0.0.11.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "37f3f8e8be6f988326bb10c5c8302814d050b29b55af60df7b5d90fa813f02e3",
          "md5": "7aa0fcafc474582d6a59da52b222fde6",
          "sha256": "e1f095fed8c901fd66424a82dc171bf2deb560467e8b9b7566e2d7bd27245143"
        },
        "downloads": -1,
        "filename": "mechpress-0.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "7aa0fcafc474582d6a59da52b222fde6",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 14648,
        "upload_time": "2022-08-28T11:57:39",
        "upload_time_iso_8601": "2022-08-28T11:57:39.109526Z",
        "url": "https://files.pythonhosted.org/packages/37/f3/f8e8be6f988326bb10c5c8302814d050b29b55af60df7b5d90fa813f02e3/mechpress-0.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "badd56695a52f67af028be299fa4d8a2b85dbfa5fe35858956c5b2a57a621ec1",
          "md5": "1c943a5f74de50116f8ff834da8debfb",
          "sha256": "042b7a2d3f5102c18527b5cc50695db4070c6afb7b3a08b73ee8e04894fbe0db"
        },
        "downloads": -1,
        "filename": "mechpress-0.0.3.tar.gz",
        "has_sig": false,
        "md5_digest": "1c943a5f74de50116f8ff834da8debfb",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 14936,
        "upload_time": "2022-08-28T12:20:52",
        "upload_time_iso_8601": "2022-08-28T12:20:52.339981Z",
        "url": "https://files.pythonhosted.org/packages/ba/dd/56695a52f67af028be299fa4d8a2b85dbfa5fe35858956c5b2a57a621ec1/mechpress-0.0.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5b3c653bb987312f0b659e2741a33ed95d18ae9c4685376190ff01a51e61ebf3",
          "md5": "77eecd6da0806ba5447172e90870ea89",
          "sha256": "d042608ae315e6cd6ad88be318e289615a18ceef7bc3d85a103a879061e8f2c3"
        },
        "downloads": -1,
        "filename": "mechpress-0.0.4.tar.gz",
        "has_sig": false,
        "md5_digest": "77eecd6da0806ba5447172e90870ea89",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 14928,
        "upload_time": "2022-08-28T12:31:36",
        "upload_time_iso_8601": "2022-08-28T12:31:36.082091Z",
        "url": "https://files.pythonhosted.org/packages/5b/3c/653bb987312f0b659e2741a33ed95d18ae9c4685376190ff01a51e61ebf3/mechpress-0.0.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a7a9574376d6481b0e06d98b4f7bdef25e95eda24ab6cea0d5b22754887df0d6",
          "md5": "659ed6928524c31543e4715434d958fb",
          "sha256": "3d46a5f0cdb2ed38cc9d761bfcc28cc1b984107960b4feaef8118d938c1a85de"
        },
        "downloads": -1,
        "filename": "mechpress-0.0.5.tar.gz",
        "has_sig": false,
        "md5_digest": "659ed6928524c31543e4715434d958fb",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 14975,
        "upload_time": "2022-08-28T12:37:28",
        "upload_time_iso_8601": "2022-08-28T12:37:28.476899Z",
        "url": "https://files.pythonhosted.org/packages/a7/a9/574376d6481b0e06d98b4f7bdef25e95eda24ab6cea0d5b22754887df0d6/mechpress-0.0.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b5b2b4ff3e4c6531fcfa0fe4d18ede83bdbe05936990dfce5ac0f6540096490c",
          "md5": "255578887265a6fb93adf64434582673",
          "sha256": "c4785054a58b568163c61f174f9720ea711e0ec6d3029302f116900804211733"
        },
        "downloads": -1,
        "filename": "mechpress-0.0.6.tar.gz",
        "has_sig": false,
        "md5_digest": "255578887265a6fb93adf64434582673",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 21072,
        "upload_time": "2022-08-29T17:54:27",
        "upload_time_iso_8601": "2022-08-29T17:54:27.114080Z",
        "url": "https://files.pythonhosted.org/packages/b5/b2/b4ff3e4c6531fcfa0fe4d18ede83bdbe05936990dfce5ac0f6540096490c/mechpress-0.0.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.7": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "43e5f8e1d812a25a27a77e75e3e6ea4da6ca9a4bbf7805fefb2516b42b5c5102",
          "md5": "cff26d096bdff2ae15bd82dc6d482c32",
          "sha256": "4c9cb3ef63135197185bef39a9eef29a741fbd26c278815be2d341f97b9f4803"
        },
        "downloads": -1,
        "filename": "mechpress-0.0.7.tar.gz",
        "has_sig": false,
        "md5_digest": "cff26d096bdff2ae15bd82dc6d482c32",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 21085,
        "upload_time": "2022-08-29T18:10:52",
        "upload_time_iso_8601": "2022-08-29T18:10:52.757934Z",
        "url": "https://files.pythonhosted.org/packages/43/e5/f8e1d812a25a27a77e75e3e6ea4da6ca9a4bbf7805fefb2516b42b5c5102/mechpress-0.0.7.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.8": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "744c8130b3c09d1ac72f91f9ffa78a8f94cbe18c06e9ce12c45db24789292286",
          "md5": "50b33e4520eb8465733cb0100b82a08a",
          "sha256": "b932494c5d14963c1e98ea067ba0faa8eee1c271cce9d4a6eb19b1019843afb4"
        },
        "downloads": -1,
        "filename": "mechpress-0.0.8.tar.gz",
        "has_sig": false,
        "md5_digest": "50b33e4520eb8465733cb0100b82a08a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 22220,
        "upload_time": "2022-08-31T18:10:58",
        "upload_time_iso_8601": "2022-08-31T18:10:58.515745Z",
        "url": "https://files.pythonhosted.org/packages/74/4c/8130b3c09d1ac72f91f9ffa78a8f94cbe18c06e9ce12c45db24789292286/mechpress-0.0.8.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.9": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "19c8a7f555ce77087fbb7e67cb3877bd87828942f7fe715989476b045025e7c9",
          "md5": "3a9fc3209b61e9b631946ee63999d60f",
          "sha256": "8f7d85de6c616ac20da3344bcc4ae22ffb2aef6746ed1bb8e021c31b5f751c28"
        },
        "downloads": -1,
        "filename": "mechpress-0.0.9.tar.gz",
        "has_sig": false,
        "md5_digest": "3a9fc3209b61e9b631946ee63999d60f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 22579,
        "upload_time": "2022-08-31T18:24:11",
        "upload_time_iso_8601": "2022-08-31T18:24:11.372887Z",
        "url": "https://files.pythonhosted.org/packages/19/c8/a7f555ce77087fbb7e67cb3877bd87828942f7fe715989476b045025e7c9/mechpress-0.0.9.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "59587e031e2febb82e91ed5cbb24f01135cdb11793e3c0c25930436e7143375c",
        "md5": "6eb4b8d93acd08064a66f043da158709",
        "sha256": "ff136762825acb1c34e37ef6e10e21822735807a375c6c4ae0c0050d15b2b9b6"
      },
      "downloads": -1,
      "filename": "mechpress-0.0.11.tar.gz",
      "has_sig": false,
      "md5_digest": "6eb4b8d93acd08064a66f043da158709",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 35519,
      "upload_time": "2023-03-08T17:15:38",
      "upload_time_iso_8601": "2023-03-08T17:15:38.968457Z",
      "url": "https://files.pythonhosted.org/packages/59/58/7e031e2febb82e91ed5cbb24f01135cdb11793e3c0c25930436e7143375c/mechpress-0.0.11.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}