{
  "info": {
    "author": "Tom L Kaufmann, Marina Petkovic, Roland F Schwarz",
    "author_email": "tkau93@gmail.com, marina.55kovic@gmail.com, roland.f.schwarz@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# MEDICC2 - Whole-genome doubling-aware copy number phylogenies for cancer evolution\n\n[![PyPI](https://img.shields.io/pypi/v/medicc2?color=green)](https://pypi.org/project/medicc2/)\n[![Conda](https://img.shields.io/conda/v/bioconda/medicc2?color=green)](https://anaconda.org/bioconda/medicc2)\n\nFor more information see the accompanying publication [Whole-genome doubling-aware copy number phylogenies for cancer evolution with MEDICC2](https://genomebiology.biomedcentral.com/articles/10.1186/s13059-022-02794-9).\n\n# Installation\nInstall MEDICC2 via conda (recommended), pip or from source. MEDICC2 was developed and tested on unix-built systems (Linux and MacOS). For Windows users we recommended WSL2.\n\nNote that the notebooks and examples are not included when installing from conda or pip. When installing from pip or source, you need to make sure to have a working version of `gcc` and `gxx` installed.\n\nDue to dependencies we recommend using Python version 3.7-3.9.\n\n## Installation via conda (recommended)\nIt is best to use a dedicated conda environment for your MEDICC2 installation with `conda create -n medicc_env python=3.9`.\n\nAfter activating the environment with `conda activate medicc_env` you can install MEDICC2 via `conda install -c bioconda -c conda-forge medicc2`.\n\n## Installation via pip\nAs MEDICC2 relies on OpenFST version 1.8.1 which is not packaged on PyPi you have to first install it using conda with `conda install -c conda-forge openfst=1.8.1`. Next you can install MEDICC2 via `pip install medicc2`.\n\n## Installation from source\nClone the MEDICC2 repository and its submodules using `git clone --recursive https://bitbucket.org/schwarzlab/medicc2.git`. It is important to use the `--recursive` flag to also download the modified OpenFST submodule.\n\nAll dependencies including OpenFST (v1.8.1) should be directly installable via conda. A yaml file with a suggested MEDICC2 conda environment is provided in 'doc/medicc2.yml'. You can create a new conda environment with all requirements using `conda env create -f doc/medicc2.yml -n medicc_env`.\n\nThen, inside the `medicc2` folder, run `pip install .` to install MEDICC2 to your environment. \n\n# Usage\nAfter installing MEDICC2, you can use MEDICC2 functions in python scripts (through `import medicc`) and from the command line. General usage from the command line is `medicc2 path/to/input/file path/to/output/folder`. Run `medicc2 --help` for information on optional arguments.\n\nLogging settings can be changed using the `medicc/logging_conf.yaml` file with the standard python logging syntax.\n\n## Command line Flags\n\n* `input_file`: path to the input file\n* `output_dir`: path to the output folder\n* `--version`: Print version information\n* `--input-type`, `-i`: Choose the type of input: f for FASTA, t for TSV. Default: 'TSV'\n* `--input-allele-columns`, `-a`: Name of the CN columns (comma separated) if using TSV input format. This also adjusts the number of alleles considered (min. 1, max. 2). Default: 'cn_a, cn_b'\n* `--input-chr-separator`: Character used to separate chromosomes in the input data (condensed FASTA only). Default: 'X'\n* `--tree`: Do not reconstruct tree, use provided tree instead (in newick format) and only perform ancestral reconstruction. Default: None\n* `--topology-only`, `-s`: Output only tree topology, without reconstructing ancestors. Default: False\n* `--normal-name`, `-n`: ID of the sample to be treated as the normal sample. Trees are rooted at this sample for ancestral reconstruction. If the sample ID is not found, an artificial normal sample of the same name is created with CN states = 1 for each allele. Default: 'diploid'\n* `--exclude-samples`, `-x`: Comma separated list of sample IDs to exclude. Default: None\n* `--filter-segment-length`: Removes segments that are smaller than specified length. Default: None\n* `--bootstrap-method`: Bootstrap method. Has to be either 'chr-wise' or 'segment-wise'. Default: 'chr-wise'\n* `--bootstrap-nr`: Number of bootstrap runs to perform. Default: None\n* `--prefix`, '-p': Output prefix to be used. None uses input filename. Default: None\n* `--no-wgd`: Disable whole-genome doubling events. Default: False\n* `--plot`: Type of copy-number plot to save. 'bars' is recommended for <50 samples, heatmap for more samples, 'auto' will decide based on the number of samples, 'both' will plot both and 'none' will plot neither. (default: auto).\n* `--total-copy-numbers`: Run for total copy number data instead of allele-specific data. Default: False\n* `-j`, `--n-cores`: Number of cores to run on. Default: None\n* `--events`: Whether to infer copy-number events. See section \"Event Reconstruction\" below\n* `--chromosomes-bed`: BED file for chromosome regions to compare copy-number events to\n* `--regions-bed`: BED file for regions of interest to compare copy-number events to\n* `-v`, `--verbose`: Enable verbose output. Default: False\n* `-vv`, `--debug`: Enable more verbose output Default: False\n* `--maxcn`: Expert option: maximum CN at which the input is capped. Does not change FST. Default: 8\n* `--prune-weight`: Expert option: Prune weight in ancestor reconstruction. Values >0 might result in more accurate ancestors but will require more time and memory. Default: 0\n* `--fst`: Expert option: path to an alternative FST. Default: None\n* `--fst-chr-separator`: Expert option: character used to separate chromosomes in the FST. Default: 'X'\n* `--wgd_x2`: Expert option: Treat WGD as a x2 operation. Default: False\n\n\n## Input files\nInput files can be either in fasta or tsv format:\n\n* **tsv (recommended):** Files should have the following columns: `sample_id`, `chrom`, `start`, `end` as well as columns for the copy numbers. MEDICC expects the copy number columns to be called `cn_a` and `cn_b`. Using the flag `--input-allele-columns` you can set your own copy number columns. If you want to use total copy numbers, make sure to use the flag `--total-copy-numbers`. Important: MEDICC2 does not create total copy numbers for you. You will have to calculate total copy numbers yourself and then specify the column using the `--input-allele-columns` flag.\n* **fasta:** A description file should be provided to MEDICC. This file should include one line per file with the name of the chromosome and the corresponding file names. If fasta files are provided you have to use the flag `--input-type fasta`.\n\nMEDICC2 follows the BED convention for segment coordinates, i.e. segment start is at 0 and the segment end is non-inclusive.\n\nThe folder `examples/simple_example` contains a simple example input both in fasta and tsv format.\nThe folder `examples/OV03-04` contains a larger example consisting of multiple fasta files. If you want to run MEDICC on this data run `medicc2 examples/OV03-04/OV03-04_descr.txt path/to/output/folder --input-type fasta`.\n\n\n## Output files\nMEDICC creates the following output files:\n\n* `_final_tree.new`, `_final_tree.xml`, `_final_tree.png`: The final phylogenetic tree in Newick and XML format as well as an image\n* `_pairwise_distances.tsv`: A NxN matrix (N being the number of samples) of pairwise distances calculated with the symmetric MEDICC2 distance\n* `_final_cn_profiles.tsv`: Copy-number profiles of the input as well as the newly internal nodes. Also includes additional information such as whether a gain or loss has happened\n* `_cn_profiles.pdf`: Combined plot of the phylogenetic tree as well as the copy-number profiles of all samples (including the internal nodes)\n* `_branch_lengths.tsv`: List of all branches and their corresponding lenghts of the final tree\n\n*optional (see \"Event Reconstruction\" below)*\n\n* `_copynumber_events_df.tsv`: List of all copy-number events detected. The entries for WGD events have non-meaningful values for chrom, cn_child, etc. Note that the events derived are not unambiguous.\n* `_events_overlap.tsv`: Overlap of copy-number events with regions of interest\n\n\n## Output plots\nApart from the file `_tree.pdf` which contains the inferred phylogeny, the main plot created by MEDICC is the copy-number plots named either `_cn_profiles.pdf` or `_cn_profiles_heatmap.pdf`.\nThe left part consists of the inferred phylogenetic tree including the number of events in the branches. The right part is made up of the copy-number profiles of the samples (and potentially the reconstructed ancestral nodes).\n\nThere are two kinds of copy-number plots: the bars and the heatmap version. The bars version is most suitable for fewer samples (<50) as more details are visible while the heatmap version is most suitable many samples expected for example in single-cell experiments.\nYou can toggle the kind of plot MEDICC2 creates with the `--plot` flag (see above).\n\n### Example bars copy-number plot\nExample from patient PTX011 from the Gundem et al. Nature 2015. The data can be found in `example/gundem_et_al_2015/`.\n\n![copy-number bars plot for PTX011 Gundem 2015](doc/MEDICC2_cn_plot_example_bars.png)\n\n**Legend**\n\n![legend of copy-number plot](doc/MEDICC2_cn_plot_legend.png)\n\n### Example heatmap copy-number plot\nExample from patient PTX011 from the Gundem et al. Nature 2015. The data can be found in `example/gundem_et_al_2015/`.\n\n![copy-number heatmap plot for PTX011 Gundem 2015](doc/MEDICC2_cn_plot_example_heatmap.png)\n\n\n## Usage examples\nFor first time users we recommend to have a look at `examples/simple_example` to get an idea of how input data should look like. Then run `medicc2 examples/simple_example/simple_example.tsv path/to/output/folder` as an example of a standard MEDICC run. Finally, the notebook `notebooks/example_workflows.py` shows how the individual functions in the workflow are used.\n\nThe notebook `notebooks/bootstrap_demo.py` demonstrates how to use the bootstrapping routine and `notebooks/plot_demo.py` shows how to use the main plotting functions.\n\n\n## Event Reconstruction\nMEDICC2 can create a list of copy-number events in the file `_copynumber_events_df.tsv` which are also displayed in the final copy-number barplot.\nThese are disabled by default and are enabled using the `--events` flag.\n\nNote, that the inferred events are not unambigous but just one possible solution. In some cases there are multiple possible paths that can result in the same final copy-number state in the same number of steps. Without additional information, MEDICC2 cannot determine which possible path is the right one and thus opts for a path that creates the longest consecutive gains. \nEven though the events inferred by MEDICC2 are not unambigous they are minimal (as in there are no solutions with fewer number of steps) and deterministic (as in multiple runs of MEDICC2 will always return the same events).\n\nMinimal example: *111 -> 232* which can be explained by *gain-gain-gain* + *x-gain-x* or *gain-gain-x* + *x-gain-gain*. MEDICC2 would select the first option.\nIn order to infer the events that  \n\n\n### Regions of interest\nMEDICCC2 can overlap the inferred events with regions of interest such as chromosome arms or oncogenes. \nThis process requires the installation of `pyranges` which might be incompatible with newer version of python and/or numpy.\nThe overlap is turned off by default. You can turn on the overlapping with the ``--chromosomes-bed` and `--regions-bed` flag by providing bed-files with regions of interest. By default MEDICC2 uses hg38 chromosome-arms and a list of genes taken from Davoli et al. Cell 2013. This data is present as BED files in the `medicc/objects` folder. Invoke these using the flags `--chromosomes-bed \"default\"` and/or `--regions-bed \"default\"`.\nUsers can specify regions of interest of their own in BED format by providing the `--chromosomes-bed` or `--regions-bed` flags.\n\n\n## Single sample WGD detection\nIf you are interested in the WGD status of individual samples in your data, have a look at the notebook `notebooks/single_sample_wgd_detection.py`. By replacing the input data with your data you can easily calculate the WGD status of any copy-number input.\n\n\n# Issues\nIf you experience problems with MEDICC2 please [file an issue directly on Bitbucket](https://bitbucket.org/schwarzlab/medicc2/issues/new) or [contact us directly](tom.kaufmann@mdc-berlin.de). \n\n## Known Issues\n\n**Phasing**\nWe do recommend to phase your input data before using MEDICC2. MEDICC2's own phasing algorithm is only to be used when looking at single samples and should not be used in the case of multiple samples! Here we recommend using Refphase ([Bitbucket](https://bitbucket.org/schwarzlab/refphase/)).\nIf phasing is not possible for you, working on major/minor configuration works reasonably well in most cases.\nFor very noisy data, where accurate phasing cannot be guaranteed, you can also try to create total copy numbers and run MEDICC2 with the `--total-copy-numbers` flag.\n\n**long runtime**\nMEDICC2 tries to solve an NP-hard problem by inferring a symmetric distance between samples and therefore has a higher runtime than other tools than only compute the asymmetric (and less accurate) distance between samples.\n\nIn order to improve runtime, you should first run MEDICC2 with multiple cores using the `--n-cores` flag. Using multiple cores will roughly lead to a decrease in runtime linear w.r.t. numbers of cores used (depending on your system architecture).\n\nNext, you can remove duplicate and diploid cells. Especially in the case of 100s to 1000s single-cell samples, there are oftentimes multiple copies of cells with the same copy-number profiles as well as cells that are (almost) purely diploid. Removing those will (in most cases) not alter the results but decrease runtime.\n\nFinally, MEDICC2's runtime scales with the number of segments used. If you use copy-number bins, try to increase the bin-size for decreased runtime as well as merge neighboring bins that are equal in copy-number states across all samples. (For example a chromosome that is purely diploid in all samples should be represented as a single segment rather than multiple bins).\nIf you instead create a minimum consistent segmentation, be aware of individual samples with many breakpoints that will drive up your total number of breakpoints and therefore number of segments. If individual samples have an excessive amount of breakpoints, it is best to remove them before creating a minimum consistent segmentation.\n\n**Noisy segments**\nSmall faulty or noisy segments can have a strong effect on the distances MEDICC2 calculates between samples and therefore the resulting tree.\nThis is because MEDICC2 counts all segments equally in order appropriatlely take focal events into account. \nIf the resulting and the inferred events look strange to you, you can replot the tree and copy-number profiles using the function `plot_cn_profiles` setting `ignore_segment_lengths=True` (see the notebook `notebooks/plot_demo.py` for usage examples) in order to investigate small segments that might not have been visible in the original plot.\nIf you are unsure about the copy-number profiles we recommened to filter small segments.\n\n**Taxon imbalance**\nIf your data contains 100s to 1000s samples with a few distinct subgroups, an imbalance in the number of samples per subgroups might lead to an incorrect tree (e.g. 50 samples of subclone A and 1000 samples each of subclone B and C).\nThis is a known problem in phylogeny called *taxon imbalance* or *taxon sampling*. If you have multiple, clearly separable subgroups in your data we recommoned either subsampling over-represented groups or upsampling under-represented groups to gauge the effect of taxon imbalance.\n\n**Running out of memory / bad_alloc error**\nIf MEDICC2 terminates with the following error `terminate called after throwing an instance of 'std::bad_alloc'` or your machine runs out of memory this hints towards an issue with the FST.\nRerun MEDICC2 with the `-vv` flag to enable extended logging. If the error occurs during the ancestral reconstruction routine, the issue is related to OpenFST which is the FST library employed by MEDICC2 and cannot be easily solved by us.\nThis issue can be related to small bin sizes (and therefore a large number of segments). Increasing the binsize (although decreasing accuracy) solves this issue most of the time.\nYou can also try to remove the sample that led to the error (see the extended logs for this). \n\n**The output plots are not like I expected**\nMaybe you need to set the `--plot` flag. By default, `--plot` is set to auto which means that it plots different figures depending on the number of samples in the data (threshold is 50); see above.\n\n**Faulty event reconstruction**\nSometimes MEDICC2 will pass out the following warning: *Event recreation was faulty*. This means that the events in the\n`_cn_events_df.tsv` file will not be accurate. If you selected total copy number this will mainly be due to multiple WGDs\nin a single node. Please get in contact with us if the problem prevails even without the `--total-copy-numbers` flag.\n\n**missing segments / gaps in the segmentation**\nMEDICC2 will assume that the segmentation is gap-less, i.e. that gaps between neighboring segments are neglible. If your data contains large gaps this might affect the performance of MEDICC2 as it might incorrectly jointly mutate segments that are actually separated.\n\n\n# Bugs, feature requests and contact\nYou can report bugs and request features directly in [Bitbucket](https://bitbucket.org/schwarzlab/medicc2/issues) or contact us via at *tom.kaufmann@mdc-berlin.de*.\n\n\n# License\nMEDICC2 is available under [GPLv3](https://www.gnu.org/licenses/gpl-3.0.en.html). It contains modified code of the *pywrapfst* Python module from [OpenFST](http://www.openfst.org/) as permitted by the [Apache 2](http://www.apache.org/licenses/LICENSE-2.0) license.\n\n\n# Kaufmann et al. 2022 Puplication\nThe MEDICC2 model has been published in 2022 with Genome Biology: [MEDICC2: whole-genome doubling aware copy-number phylogenies for cancer evolution](https://doi.org/10.1186/s13059-022-02794-9).\n\n## Figures\nBoth the required data and the scripts to create all Figures from the publication are stored in the commit version *9b400ef* of the MEDICC2 repository available on [Zenodo](https://zenodo.org/record/7300106) in the folder `Figures_Kaufmann_et_al_2021/`.\n\n## Simulation Validation\nThe simulated copy-number profiles used in the MEDICC2 publication were created using our simulation framework [Simphyni](https://bitbucket.org/schwarzlab/simphyni/src/main/). The Simphyni repository contains a notebook to recreate the exact data used in the publication.\n\n## Please cite\nKaufmann, T.L., Petkovic, M., Watkins, T.B.K. et al.  \n**MEDICC2: whole-genome doubling aware copy-number phylogenies for cancer evolution**.  \nGenome Biol 23, 241 (2022). https://doi.org/10.1186/s13059-022-02794-9\n\nSchwarz RF, Trinh A, Sipos B, Brenton JD, Goldman N, Markowetz F.  \n**Phylogenetic quantification of intra-tumour heterogeneity.**  \nPLoS Comput Biol. 2014 Apr 17;10(4):e1003535. doi: 10.1371/journal.pcbi.1003535.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://bitbucket.org/schwarzlab/medicc2",
    "keywords": "",
    "license": "GPL-3",
    "maintainer": "",
    "maintainer_email": "",
    "name": "medicc2",
    "package_url": "https://pypi.org/project/medicc2/",
    "platform": null,
    "project_url": "https://pypi.org/project/medicc2/",
    "project_urls": {
      "Homepage": "https://bitbucket.org/schwarzlab/medicc2"
    },
    "release_url": "https://pypi.org/project/medicc2/0.9.1/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "Whole-genome doubling-aware copy number phylogenies for cancer evolution",
    "version": "0.9.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17364747,
  "releases": {
    "0.5b3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c1bb4fe6e8fa433e8e095fe67dd42b5d333e01cd69ae2f2073ae26c4c406e79b",
          "md5": "fc223698edf28e81d3567f4adc3f5452",
          "sha256": "fa36a96a0fa4821dc82da87bad0c49868f866fcdc4d7c40f3a0c41f061a1f59d"
        },
        "downloads": -1,
        "filename": "medicc2-0.5b3.tar.gz",
        "has_sig": false,
        "md5_digest": "fc223698edf28e81d3567f4adc3f5452",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 536362,
        "upload_time": "2021-09-17T15:47:51",
        "upload_time_iso_8601": "2021-09-17T15:47:51.163560Z",
        "url": "https://files.pythonhosted.org/packages/c1/bb/4fe6e8fa433e8e095fe67dd42b5d333e01cd69ae2f2073ae26c4c406e79b/medicc2-0.5b3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.5b4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "16b3cd86f08ce8b3f404068ad907e410317de50b80c7e88337e2a949e7c9ba7d",
          "md5": "9c42779fdde5b2d2a18d325d22d3ed13",
          "sha256": "25c49728f3fd4356fd807b61e53151827c68e7b7d45d2f1e8aebfc95014e0a0d"
        },
        "downloads": -1,
        "filename": "medicc2-0.5b4.tar.gz",
        "has_sig": false,
        "md5_digest": "9c42779fdde5b2d2a18d325d22d3ed13",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 537510,
        "upload_time": "2021-10-11T09:36:58",
        "upload_time_iso_8601": "2021-10-11T09:36:58.488543Z",
        "url": "https://files.pythonhosted.org/packages/16/b3/cd86f08ce8b3f404068ad907e410317de50b80c7e88337e2a949e7c9ba7d/medicc2-0.5b4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.6b0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "af7f0d9ab78b9333dc89e229216febb8f0f9a4db2c911f207a623300f8956e23",
          "md5": "f707972bf1a68a276edb27ff77bd3340",
          "sha256": "19acbaabee3cf811ba50cceb2323a56419083735814caa16542b6b2079295dbd"
        },
        "downloads": -1,
        "filename": "medicc2-0.6b0.tar.gz",
        "has_sig": false,
        "md5_digest": "f707972bf1a68a276edb27ff77bd3340",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 481665,
        "upload_time": "2021-12-22T08:53:59",
        "upload_time_iso_8601": "2021-12-22T08:53:59.413910Z",
        "url": "https://files.pythonhosted.org/packages/af/7f/0d9ab78b9333dc89e229216febb8f0f9a4db2c911f207a623300f8956e23/medicc2-0.6b0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.6b1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b170f56e2f14b135e43f86a8dc9c338f8759701b8e4c6d7f08724b43c04f2b7b",
          "md5": "6f5fa859e0f9f9c1d1d9493d28d2f834",
          "sha256": "2658fd25e199e0365cedda74e4d3b46a1b01d6f7f73909ad1fee636052015139"
        },
        "downloads": -1,
        "filename": "medicc2-0.6b1.tar.gz",
        "has_sig": false,
        "md5_digest": "6f5fa859e0f9f9c1d1d9493d28d2f834",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 481757,
        "upload_time": "2021-12-22T13:32:53",
        "upload_time_iso_8601": "2021-12-22T13:32:53.251724Z",
        "url": "https://files.pythonhosted.org/packages/b1/70/f56e2f14b135e43f86a8dc9c338f8759701b8e4c6d7f08724b43c04f2b7b/medicc2-0.6b1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.7.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5f87aab5ca54fc743acbc5897eb011217ece131a789222eaf1547dbccfc510a3",
          "md5": "ffbe10e616a07051c6a2af39bb00e635",
          "sha256": "e13442dca1bebd8ef03f7f20b09e742766c2ed91510156b84c9b493e285b0ee8"
        },
        "downloads": -1,
        "filename": "medicc2-0.7.0.tar.gz",
        "has_sig": false,
        "md5_digest": "ffbe10e616a07051c6a2af39bb00e635",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 481999,
        "upload_time": "2022-02-21T09:25:22",
        "upload_time_iso_8601": "2022-02-21T09:25:22.140953Z",
        "url": "https://files.pythonhosted.org/packages/5f/87/aab5ca54fc743acbc5897eb011217ece131a789222eaf1547dbccfc510a3/medicc2-0.7.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.7.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "36cdf77aad2f671516b357e2d1cfdc728ae87a2e7009f462b37018ef3c4abe3e",
          "md5": "b5d97b458a3cd950589e8cc44c0e170c",
          "sha256": "ba2f139a90558091f0b25eeee6a89198fd60b24a632c4a9c518fc70912e090a5"
        },
        "downloads": -1,
        "filename": "medicc2-0.7.1.tar.gz",
        "has_sig": false,
        "md5_digest": "b5d97b458a3cd950589e8cc44c0e170c",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 655863,
        "upload_time": "2022-04-19T19:03:44",
        "upload_time_iso_8601": "2022-04-19T19:03:44.956597Z",
        "url": "https://files.pythonhosted.org/packages/36/cd/f77aad2f671516b357e2d1cfdc728ae87a2e7009f462b37018ef3c4abe3e/medicc2-0.7.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.8.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1587abea5f53203e677a69a2f65d6f0668d12f28308dba450fdd8bacf1a94b48",
          "md5": "f2f323218defa971fb001028b93fd83c",
          "sha256": "47d232c70dd098597a8c672da0655b8e6dd9908641c075df4aae473eba3d985d"
        },
        "downloads": -1,
        "filename": "medicc2-0.8.0.tar.gz",
        "has_sig": false,
        "md5_digest": "f2f323218defa971fb001028b93fd83c",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 1351879,
        "upload_time": "2022-07-22T14:49:07",
        "upload_time_iso_8601": "2022-07-22T14:49:07.381413Z",
        "url": "https://files.pythonhosted.org/packages/15/87/abea5f53203e677a69a2f65d6f0668d12f28308dba450fdd8bacf1a94b48/medicc2-0.8.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.8.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ae79b6bf31e5294bfa81373ff81c7788a90953ee3f6c01ee14ab95997c717ecd",
          "md5": "8ff7ed75d26850572510a77df54f5605",
          "sha256": "87f2e30ee4b344bfb2e88b73369c7f37780047f1c34aa0fc7353fb3b15d43f9f"
        },
        "downloads": -1,
        "filename": "medicc2-0.8.1.tar.gz",
        "has_sig": false,
        "md5_digest": "8ff7ed75d26850572510a77df54f5605",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 1352160,
        "upload_time": "2022-08-04T15:45:15",
        "upload_time_iso_8601": "2022-08-04T15:45:15.185226Z",
        "url": "https://files.pythonhosted.org/packages/ae/79/b6bf31e5294bfa81373ff81c7788a90953ee3f6c01ee14ab95997c717ecd/medicc2-0.8.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.8.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "90ec81bcfe5b0fe4696d6f20e912ef873953c2182850c6f90a55408397a70f55",
          "md5": "92733628920d472b5e07914d8c586723",
          "sha256": "b8e28c5f9452ea9389f4c68df0ffadbe6d940a7c8911b02d69b1c8a65ab5dfac"
        },
        "downloads": -1,
        "filename": "medicc2-0.8.3.tar.gz",
        "has_sig": false,
        "md5_digest": "92733628920d472b5e07914d8c586723",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 835901,
        "upload_time": "2023-01-13T15:46:11",
        "upload_time_iso_8601": "2023-01-13T15:46:11.343820Z",
        "url": "https://files.pythonhosted.org/packages/90/ec/81bcfe5b0fe4696d6f20e912ef873953c2182850c6f90a55408397a70f55/medicc2-0.8.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.9.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "020ddd104e63a1505bc7482c7736fed5a6395bf44c9659b3e796ae7eafdcb9da",
          "md5": "34b76d93005cfb2abd1f5cb73ba0b84b",
          "sha256": "0741c8807ef6986780dfa886f2bb3ec08864f8d1b65436e4612166e883211a3e"
        },
        "downloads": -1,
        "filename": "medicc2-0.9.0.tar.gz",
        "has_sig": false,
        "md5_digest": "34b76d93005cfb2abd1f5cb73ba0b84b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 666860,
        "upload_time": "2023-03-20T13:40:27",
        "upload_time_iso_8601": "2023-03-20T13:40:27.848414Z",
        "url": "https://files.pythonhosted.org/packages/02/0d/dd104e63a1505bc7482c7736fed5a6395bf44c9659b3e796ae7eafdcb9da/medicc2-0.9.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.9.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "efe2c873d7b32c069a7b94ce352638217de8fcc700f092adbac54538226e8b88",
          "md5": "805b688dce1b97ef2b6d8de9e4078689",
          "sha256": "5c97263b1015b4b177d384518cb401bb34c5e5891523e3857dae77dca598ac98"
        },
        "downloads": -1,
        "filename": "medicc2-0.9.1.tar.gz",
        "has_sig": false,
        "md5_digest": "805b688dce1b97ef2b6d8de9e4078689",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 666897,
        "upload_time": "2023-03-20T14:40:23",
        "upload_time_iso_8601": "2023-03-20T14:40:23.732656Z",
        "url": "https://files.pythonhosted.org/packages/ef/e2/c873d7b32c069a7b94ce352638217de8fcc700f092adbac54538226e8b88/medicc2-0.9.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "efe2c873d7b32c069a7b94ce352638217de8fcc700f092adbac54538226e8b88",
        "md5": "805b688dce1b97ef2b6d8de9e4078689",
        "sha256": "5c97263b1015b4b177d384518cb401bb34c5e5891523e3857dae77dca598ac98"
      },
      "downloads": -1,
      "filename": "medicc2-0.9.1.tar.gz",
      "has_sig": false,
      "md5_digest": "805b688dce1b97ef2b6d8de9e4078689",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 666897,
      "upload_time": "2023-03-20T14:40:23",
      "upload_time_iso_8601": "2023-03-20T14:40:23.732656Z",
      "url": "https://files.pythonhosted.org/packages/ef/e2/c873d7b32c069a7b94ce352638217de8fcc700f092adbac54538226e8b88/medicc2-0.9.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}