{
  "info": {
    "author": "Sander Cohen-Janes",
    "author_email": "scohenjanes@brandeis.edu",
    "bugtrack_url": null,
    "classifiers": [
      "Programming Language :: Python",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.6"
    ],
    "description": "# Polymer Calculation Suite\n\nThis project enables users to perform several calulations on a limitless scope of polymers as long as the primary structure is known.\n\nThe command-line tool `makePol` has a wide range of command-line options that allow fine control over polymer specification and output format. These can be obtained by running `makePol -h`. A large, but non-comprehensive list of examples will be covered in the next section. The utility is also available through a jupyter notebook. An example can be generated with the command `mhpNB`.\n\nSee [here](#installation) for installation instructions.\n\n## Usage and Examples\n\nNote that the following examples all use the `-q` flag. This suppresses the default behavior, which asks the user for confirmation that the polymer they have specified has been interpreted correctly. For example:\n\n<img src=\"images/preview_example.png\">\n\nIs the confirmation image that would appear when [this example](#specifying-multiple-comonomers) is run without the `-q` flag.\n\nThis confirmation process may be more important when using smiles inputs that do not come stock with this program for the first time. Addtional details about adding your own smiles to the included dictionaries can be found [here](#modifying-the-smiles-dictionary). This is the default behavior to protect users from optimizing the geometry for incorrect polymers, which can be a time-consuming process for large values of `n`, but this can be dissabled for use in scripting or batch jobs.\n\nRegardless of the provided value of `n`, the preview will only show one monomer or [block of comonomers](#specifying-multiple-comonomers) for simplicity.\n\nThis prompt will not be shown if both end groups are Hydrogen.\n\n### Specifying Polymer Components\n\nThere are dictionaries of monomers and terminal units in `smiles.py` The composition of a polymer containing units in these dictionaries can be spelled out in the following manner. The `-v` flag increases verbosity.\n\n```bash\n$ makePol -n 3 -m Styrene -v   # -n specifies the number of monomers\nPolymer interpreted as: Hydrogen 3 * Styrene Hydrogen\nThis gives the following SMILES: CC(c1ccccc1)CC(c1ccccc1)CC(c1ccccc1)\nSaving image to polymer.png by default.\nrequested calculations are None\n```\nBecause verbosity was enabled an image of the polymer was saved with a default name. The name of the image can be specified with the `-d` flag.\nThe initiator and terminal groups default to Hydrogen if none are specified.\n\n## Specifying Multiple Comonomers\nHere is another example with a more complex set of arguments:\n```bash\n$ makePol -n 2 -b 2 Butylacrylate \"CC(C)\" -i Benzoyl -t Benzyl -v -q\npolymer smiles is CC(C(=O)OCCCC)CC(C(=O)OCCCC)CC(C)CC(C(=O)OCCCC)CC(C(=O)OCCCC)CC(C) before any end groups\npolymer smiles is c1ccc(cc1)C(=O)OCC(C(=O)OCCCC)CC(C(=O)OCCCC)CC(C)CC(C(=O)OCCCC)CC(C(=O)OCCCC)CC(C) after adding smiles string for initiator\npolymer smiles is c1ccc(cc1)C(=O)OCC(C(=O)OCCCC)CC(C(=O)OCCCC)CC(C)CC(C(=O)OCCCC)CC(C(=O)OCCCC)CC(C)Cc1ccccc1 after adding terminator smiles\nPolymer interpreted as: Benzoyl 2 * ['2', 'CC(C(=O)OCCCC)', 'CC(C)'] Benzyl\nThis gives the following SMILES: c1ccc(cc1)C(=O)OCC(C(=O)OCCCC)CC(C(=O)OCCCC)CC(C)CC(C(=O)OCCCC)CC(C(=O)OCCCC)CC(C)Cc1ccccc1\nSaving image to polymer.png by default.\nrequested calculations are None\n```\nThe `-b` flag defines a sequence of comonomers in a specific repeating pattern. Comonomers can be specified using the monomer dictionary or with a SMILES string in quotation marks (i.e. \"CC(C)\"). When a coefficient is provided in the list of arguments defined by the `-b` flag, this changes the number of monomers per unit defined by the `-n` flag. In the above example, each unit of n refers to 3 monomers. The `-i` and `-t` flags are used to define initiators and terminators from either the dictionary or from SMILES. The number of monomers per n will be used for plots and image labels.\n\n## Performing Calculations\n\nThe `-c` flag is followed by abbreviations for calulations that are desired. Availible options are:\n\nLogP, SA (surface area), MV (Molecular Volume), MHP (LogP/SA; each of which will also be reported. Use XMHP to exclude those constituent calculations) and RG (radius of gyration).\n\nWhen RG is selected, an exponential regression is performed. Polymer RG scales by n^(1/3) with the MMFF94 force field. This gives a sense of how reasonable the optimization steps were.\n\nA run with Styrene to n=10 had the following regression:\n\n<img src=\"images/RG_regression.png\">\n\n#### Modifying The SMILES Dictionary\n\nUse the command line tool `mhpLib -w` to generate `smiles.json` which can be filled with custom key-value pairs. Examples that are ignored will be included, but the format of the SMILES should be as follows: \n   * The tail of the monomer at the left of the SMILES string and the head at the right. For example, propylene would be written `CC(C)`. This allows easy construction of the polymer body by simply repeating this string `n` times.\n\n   * For non-palindromic end groups the atom to which the rest of the polymer should attatch must be denoted with `*`. The use of `*` is inspired by polymergenome.org. Additionally, the SMILES must be written such that the `*` is the first or last character in the string.\n\nThe use of the `-e` or `-m` flag with `mhpLib` will show all the endgroups or monomers recognizable to the program, including those user-specified ones in `smiles.json`.\n\n### Reading a Polymer From A File\n\nYou will notice with the second example the run time is noticable since there are several conformations being compared to make the final mol object in rdkit. Additionally, this process is not perfectly reproducible. If desired, one can load a premade `.sdf`, `.mol` or `.pdb` file instead of spelling out the polymer with the `-m` or `-b` flag. Polymers spelled out with the previously demonstrated methods can be converted to files as well with the `-s` flag. See the following section for details.\n\n```bash\n$ makePol -n 5 -r pol.mol -c SA RG LogP\n           SA    LogP        RG  N                                                smi\n0  370.961866  8.7707  4.076059  5  C[C@H](C[C@H](C[C@H](CCc1ccccc1)c1ccccc1)c1ccc...\n```\nNote that `-n` is required since the smiles is not analyzed to determine the number of monomers.\n\n## Alternative Input Methods\n\n### Custom Input\nIf the methods contained within this program are inadequate for the type of molecule desired, the accessory command line tool `customPol` may be useful. It can read Smiles, Smarts or Inchi strings and produce a `.mol` file that can be read for calculations with the master script.\n\nUse the following to show instructions for this script:\\\n`customPol -h`\n\n### Random Composition\nThe accessory script `-a` option of `makePol` can be used to interpret a ratio of monomers and develop a polymer that satisfy the user's desired monomer ratio. The monomers will be in a random order. Use the `-b` flag to specify the ratio of the comonomers.\n\nFor example, the command `makePol -n 20 -b 2 Styrene Vinylalcohol -a -c MV` will generate a randomly ordered 20 unit-long polymer with a 2:1 ratio of Styrene to Vinylalcohol (rounded if necessry, but the actual ratios used will be shown).\n\n### Saving Polymer to File\n\nThe name or path of the file can be specified with the `-s` flag. Valid extentions are `.mol`, `.pdb` and `.xyz`. Be aware that `.xyz` files cannot be read back into this program.\n\n```bash\n$ makePol -n 4 -m Styrene -c MHP -v -s pol.mol\nPolymer interpreted as: Hydrogen 4 * Styrene Hydrogen\nThis gives the following SMILES: CC(c1ccccc1)CC(c1ccccc1)CC(c1ccccc1)CC(c1ccccc1)\nSaving image to polymer.png by default.\nrequested calculations are ['MHP']\n           SA    LogP   LogP/SA  N                                               smi\n0  370.004894  8.7707  0.023704  4  CC(c1ccccc1)CC(c1ccccc1)CC(c1ccccc1)CC(c1ccccc1)\n```\nIn the next plotting section it is shown that many polymers of different lengths can be generated with the `-p` flag. When the `-s` flag is specified as well, each of those molecules will be saved to its own file with a name based off the one specified as a CLI argument. The number of repeat units will be used as a suffix.\n\n## Plotting Size-Dependent Calculations\n\nThe size-dependent plots of any calculations performed can be generated with the `-p` flag. The sizes plotted will range from 1 repeat unit to the number specified by the `-n` flag. Because the repeat unit needs to be well-defined, this plotting option is unavailable if the polymer is being read from a file. Since the `-v` flag is used, a grid image of all the generated molecules will be created as well.\n\nThe data can be exported to a `.csv` file with the `-e` flag. \n\n```bash\n#XMHP requests that the MHP data be eXclusively returned instead of including the LogP and SA values as well.\n$ makePol -n 2 -m Styrene -c XMHP -p -e data.csv -v\nDone generating SMILES with n = 1 now: CC(c1ccccc1)\nDone generating SMILES with n = 2 now: CC(c1ccccc1)CC(c1ccccc1)\nConverting n=2 to RDkit mol now.\nConverting n=1 to RDkit mol now.\nSaving image to polymer.png by default.\nrequested calculations are ['XMHP']\nSaved plot to Size-dependent-stats.png\n    LogP/SA  N                       smi\n0  0.022390  1              CC(c1ccccc1)\n1  0.023327  2  CC(c1ccccc1)CC(c1ccccc1)\n#popup of plot appears.\nDone exporting data to .csv file.\n```\nNearly all of this output, including the plot popup and the polymer grid image, are excluded if the `-v` flag is excluded, but the image of the plot is still saved to a file. Because the calculation of MHP requires surface area and LogP values, they will always be included when MHP is specified in the list of desired calculations. When in this mode, if a name for an polymer file is specified, each molecule will be saved to a file based off the provided name. However, the number of mers in each molecule will be appended to the filename.\n\nAn example plot of Styrene LogP/SA with n <= 10:\n<img src=\"images/plot_example.png\">\n\nThis plot has a lot of noise at higher n. It is possible to [mitigate this](#reducing-noise-in-plots).\n\n### Improving Data Quality in Plots\n\nA plot generated with this tool may not always show a smooth curve, especially at higher n, where it is more difficult to optimize the polymer geometry. Calculations that depend on geometry like surface area or LogP/SA will be affected by poor geometry optimizations. This can be partially fixed by [changing the default settings](#changing-default-settings) to increase the number of conformations used for calculations or the maximum number of iterations a conformer is allowed to use before it is either accepted or discarded for not converging (i.e. the change in energy between optimization steps is still not yet small enough to be considered 'done'). Both of these in effect increase the population of conformers used to calculate an average of a requested property, which reduces noise on the graph.\n\nThe default settings are meant to find a balance between run time and reasonable results. These parameters are better suited to some monomers than others, so tweaking the parameters may be necessary not only to reduce noise on the plot, but to get the run to complete at all. The following is an example of how changing the default settings may benefit the plots produced by this program:\n\nStyrene | MaxIters 1500 | numConfs 5\n<img src=\"images/Styrene_default.png\">\n\nStyrene | MaxIters 2000 | numConfs 5\n<img src=\"images/Styrene_2000i_5c.png\">\n\nStyrene | MaxIters 1500 | numConfs 10\n<img src=\"images/Styrene_1500i_10c.png\">\n\nStyrene | MaxIters 2000 | numConfs 10\n<img src=\"images/Styrene_2000i_10c.png\">\n\nIn this case, increasing both parameters independently or together improved the quality of the graph. However, each increase in either parameter increased the run time.\n\n## Changing Default Settings\n\nSome settings are not accessible with command-line arguments. Defaults are hardcoded but can be overwritten when a file called `mhpSettings.json` is present in the working directory. The settings uses are explained below. All settings must be present in the file unless. A fresh settings file can be generated with the `mhpSettings -w` command line tool. `mhpSettings -s` shows the settings all mhp tools will use, whether default or custom.\n\n```python\n{\n    \"opt_numConfs\":5, #The number of conformations you would like to generate. Increasing this greatly increases run time.\n    \"opt_numThreads\":0, #The number of threads you would like to use for the optimization and conf generation. 0 means maximum possible.\n    \"opt_maxIters\":1500, #The number of iterations used in optimization. Increase this if a job fails to optimize.\n    \"drawing_subImgSize_edge\":250, #The side length of a subimage when saved. \n    \"drawing_default\":\"polymer.png\", #The name of an image saved by default (verbosity turned on with no image name specified.)\n    \"MV_gridSpacing\":0.2, #Used for molar volume calculation.\n    \"MV_boxMargin\" :2.0, #Used for molar volume calculation.\n    \"plot_dataPoint\":\"o\", #Matplotlib argument to change plot point appearence.\n    \"plot_Filename\":\"Size-dependent-stats.png\" #name of plot.\n}\n```\nSome of the values are used by external functions and others by functions in this program. If it is desired to change the appearence of the plot points from blue circles to red pluses, change `\"plot_dataPoint\":\"o\"` to `\"plot_dataPoint\":\"r+\"`, as per the [matplotlib documentation](https://matplotlib.org/stable/api/_as_gen/matplotlib.pyplot.plot.html).\n\nIf the settings file cannot be found hardcoded defaults will be used instead.\n\n## Running Jobs With Config Files\n\nJson files can be used instead of or in conjunction with any of the above command-line arguments.\nExamples of valid json files are provided, but the most important aspect is the `runs` array:\n\n```json\n{\n    \"runs\":\n    [\n        {\n            \"n\": 4,\n            \"read\": \"pol.mol\",\n            \"calculation\": [\n                \"SA\",\n                \"RG\",\n                \"LogP\"\n            ]\n        }\n    ]\n}\n```\n\nThe list of dictionaries created by importing the paramaters from the json file is filled in with the default values for parameters like `\"plot\"` or `\"export\"`, then each dictonary of inputs is run in succession. The provided command-line arguments are overwritten by the corresponding argument in the json file.\n\n# Installation\n\n## General Steps\nThis project uses conda to manage dependencies. You can install this package through conda or using git.\n\nFirst:\\\nInstall conda using the [official guide](https://conda.io/projects/conda/en/latest/user-guide/install/index.html).\n\nThen, if you are using Windows, follow the additional steps for that operating system. For other Linux or [windows subsystem for linux](https://docs.microsoft.com/en-us/windows/wsl/about), just open a terminal. Windows users should press the Windows Key, then search for and open `Anaconda Prompt`.\n\n## Install with conda\n1. Create the environment and install the dependencies. You may replace the argument after -n with any environment name you wish.\\\n`conda create -c conda-forge -c scohenjanes -n mhp-env mhp`\n\n2. Activate the environment\\\n`conda activate mhp-env`\n\n## Install with Git\n### Extra Step For Windows\n\n0. Install [git for Windows](https://git-scm.com/download/win)\n\n### Steps For All Users\n\n1. Clone the repository\\\n`git clone https://github.com/scohenjanes5/MHP.git`\n\n2. Set up the conda environment\\\n`conda create -c conda-forge -n mhp-env rdkit scipy`\n\n    Allow conda to install the dependencies\n\n3. Activate the environment\\\n`conda activate mhp-env`\n\n4. Install the package locally\\\n`python3 PATH/TO/INSTALL/setup.py install`\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/scohenjanes5/MHP",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "mhp",
    "package_url": "https://pypi.org/project/mhp/",
    "platform": null,
    "project_url": "https://pypi.org/project/mhp/",
    "project_urls": {
      "Homepage": "https://github.com/scohenjanes5/MHP"
    },
    "release_url": "https://pypi.org/project/mhp/0.1.3.3/",
    "requires_dist": [
      "rdkit",
      "scipy",
      "pandas",
      "matplotlib"
    ],
    "requires_python": "",
    "summary": "Facilitates solubility calculations on a wide range of polymers.",
    "version": "0.1.3.3",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 15605894,
  "releases": {
    "0.1.3.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "62b98cf97f8cab4a1b489ad8ac6bb3849df00ed30d5b862709d51a558a11f130",
          "md5": "6667a4fd16f50459b02c52c1ea3339c2",
          "sha256": "99ede4d78d972ffb6b3e9b985468cb2830213a4deac73bd1d5db634a79e010c1"
        },
        "downloads": -1,
        "filename": "mhp-0.1.3.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "6667a4fd16f50459b02c52c1ea3339c2",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 27476,
        "upload_time": "2022-11-01T03:20:42",
        "upload_time_iso_8601": "2022-11-01T03:20:42.752929Z",
        "url": "https://files.pythonhosted.org/packages/62/b9/8cf97f8cab4a1b489ad8ac6bb3849df00ed30d5b862709d51a558a11f130/mhp-0.1.3.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2aefaf847397c7d705d27716206edb7c45dd70e5c86080b31d4dc98b3ac23f5a",
          "md5": "2730b49b900dc42fdc6465d32f805b8a",
          "sha256": "0a49cce0a3f4f8b42b489c6b2786cf0364f9c69729f0abc136fe48371d74831a"
        },
        "downloads": -1,
        "filename": "mhp-0.1.3.3.tar.gz",
        "has_sig": false,
        "md5_digest": "2730b49b900dc42fdc6465d32f805b8a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 31835,
        "upload_time": "2022-11-01T03:20:45",
        "upload_time_iso_8601": "2022-11-01T03:20:45.341637Z",
        "url": "https://files.pythonhosted.org/packages/2a/ef/af847397c7d705d27716206edb7c45dd70e5c86080b31d4dc98b3ac23f5a/mhp-0.1.3.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "62b98cf97f8cab4a1b489ad8ac6bb3849df00ed30d5b862709d51a558a11f130",
        "md5": "6667a4fd16f50459b02c52c1ea3339c2",
        "sha256": "99ede4d78d972ffb6b3e9b985468cb2830213a4deac73bd1d5db634a79e010c1"
      },
      "downloads": -1,
      "filename": "mhp-0.1.3.3-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "6667a4fd16f50459b02c52c1ea3339c2",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 27476,
      "upload_time": "2022-11-01T03:20:42",
      "upload_time_iso_8601": "2022-11-01T03:20:42.752929Z",
      "url": "https://files.pythonhosted.org/packages/62/b9/8cf97f8cab4a1b489ad8ac6bb3849df00ed30d5b862709d51a558a11f130/mhp-0.1.3.3-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "2aefaf847397c7d705d27716206edb7c45dd70e5c86080b31d4dc98b3ac23f5a",
        "md5": "2730b49b900dc42fdc6465d32f805b8a",
        "sha256": "0a49cce0a3f4f8b42b489c6b2786cf0364f9c69729f0abc136fe48371d74831a"
      },
      "downloads": -1,
      "filename": "mhp-0.1.3.3.tar.gz",
      "has_sig": false,
      "md5_digest": "2730b49b900dc42fdc6465d32f805b8a",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 31835,
      "upload_time": "2022-11-01T03:20:45",
      "upload_time_iso_8601": "2022-11-01T03:20:45.341637Z",
      "url": "https://files.pythonhosted.org/packages/2a/ef/af847397c7d705d27716206edb7c45dd70e5c86080b31d4dc98b3ac23f5a/mhp-0.1.3.3.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}