{
  "info": {
    "author": "Arun Wongprommoon",
    "author_email": "arunwpm@mit.edu",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# Welcome to MIT News Classify's documentation!\n\nMIT News Classify is a package containing several natural language processing (NLP) and ML-based models that have been finetuned on the NYT Annotated Corpus and its predefined news tags. It was developed in Summer 2020 as a tool for topic classification using NLP with the Tegmark Group at MIT. Some of its models have been integrated into the Tegmark Group's other projects, such as Improve The News.\n\n## TF-IDF Model\n\nThe TF-IDF model mainly looks for appearance of keywords in an article to classify them into topics. The keywords were compiled by running Naive Bayes on the New York Times Annotated Corpus to get the top unique words pertaining to each label.\n\nOnce a new article is fed into the TF-IDF model, the article gets transformed by TF-IDF (Term Frequency - Inverse Document Frequency) as if it were a new article in the New York Times Annotated Corpus. The output is then run through two layers of neural network (size 2500 and 500 respectively) to produce the predicted tags for the article.\n\n156 MB of model files will be downloaded, M MB of RAM will be used on average to run the model and the classification takes P ms.\n\n### gettags\n\n_class_ **mitnewsclassify.tfidf.gettags**(txt)\n\nGets the predicted tags for a given article text.\n\nParameters\n * txt (`string`) - The article text\n\nReturns\n * tags (`List[str]`) - The predicted tags\n\nExample\n```\n>>> from mitnewsclassify import tfidf\n\n>>> tfidf.gettags(\"Republicans proceeded with the third night of their national convention, but many Americans — particularly those in the path of Hurricane Laura — were focused on more immediate concerns.\")\n['hurricanes and tropical storms']\n\n>>> tfidf.gettags(\"The Milwaukee Bucks chose to boycott their Wednesday matchup against the Orlando Magic in protest of the police shooting of Jacob Blake, a 29-year-old Black man, in Wisconsin.\")\n['boycotts']\n\n>>> tfidf.gettags(\"One superspreading event may be connected to about 20,000 Covid-19 cases in the Boston area, a researcher said on Tuesday. That event, a biotech conference attended by 200 people in late February, is now well known as a source of Covid-19 spread very early on in the pandemic. Here is how a virus spreads Here is how a virus spreads 01:45 'Ultimately, more than 90 cases were diagnosed in people associated with this conference or their contacts, raising suspicion that a superspreading event had occurred there,' the researchers wrote in their study. Superspreading occurs when one or a few infected people cause a cascade of transmissions of an infectious disease. The new study -- which has not yet been peer-reviewed but was posted to the online server medrxiv.org on Tuesday -- involved analyzing the impact of early superspreading events in the Boston area and provided 'direct evidence' that superspreading can profoundly alter the course of an epidemic. 'An unfortunate perfect storm' The researchers -- from the Broad Institute of MIT and Harvard in Cambridge and other various institutions -- conducted genetic analyses of coronavirus specimen samples in Massachusetts. The researchers sequenced and analyzed 772 complete genomes of the virus from the region. They found 80 introductions of the virus into the Boston, predominantly from elsewhere in the United States and Europe, and 'hundreds of cases from major outbreaks' in various settings, including the conference. Coronavirus quickly spread around the world starting late last year, new genetic analysis shows Coronavirus quickly spread around the world starting late last year, new genetic analysis shows The conference, held from February 26 to 27, was a 'perfect storm' and the superspreading there could have been connected to approximately 20,000 cases, Bronwyn MacInnis, a researcher at the Broad Institute who worked on the study, told CNN in an email on Tuesday. 'Many factors made the conference an unfortunate perfect storm as a superspreading event. That the virus was introduced at the conference at all was unlucky,' MacInnis wrote in the email. 'This is not a rigorous estimate but does communicate the scale,' MacInnis added. 'If tens of thousands of individuals seems large, it is important to point out that it is in context of a pandemic that has infected tens of millions of people.' Unseen Covid-19 cases began early, spread fast Unseen Covid-19 cases began early, spread fast 03:00 Timing was crucial. In late February, people were not yet aware of the pandemic risk. 'When it happened was critical: it was scheduled just as we were collectively beginning to appreciate the imminent threat of COVID at home--if it had been a week later the event likely would have been cancelled,' MacInnis wrote in the email. 'Also, because it happened early in the epidemic it had the chance to spread widely before extensive testing capacity, shutdowns, social distancing, and masking were in place,' she wrote. 'The other critical factor was the population the virus landed in: people who had come from many different places (including some where COVID was already circulating), and who then returned home, often unknowingly bringing the virus with them.' 'A much greater understanding of how easily and quickly this virus can be transmitted' While the researchers did not identify the conference in their study, The Boston Globe on Tuesday said it was an international meeting of leaders from the biotechnology company Biogen at the Marriott Long Wharf hotel in Boston. How 53 members of this choir were infected in &#39;super spreader&#39; event How 53 members of this choir were infected in 'super spreader' event 03:03 'February 2020 was nearly a half year ago, and was a period when general knowledge about the coronavirus was limited,' Biogen said in a written statement to CNN on Tuesday. 'We were adhering closely to the prevailing official guidelines. We never would have knowingly put anyone at risk. When we learned a number of our colleagues were ill, we did not know the cause was COVID-19, but we immediately notified public health authorities and took steps to limit the spread.' The company noted in its statement that it joined a collaboration with the Broad Institute in April to share biological and medical data to advance knowledge around Covid-19. 'The world today has a much greater understanding of how easily and quickly this virus can be transmitted, and we are proud to contribute through this collaboration to the global effort to overcome COVID-19,' it said. Who or what is a super spreader? Dr. Sanjay Gupta&#39;s coronavirus podcast for June 18 explains. Who or what is a super spreader? Dr. Sanjay Gupta's coronavirus podcast for June 18 explains. Massachusetts Governor Charlie Baker said in a news conference on Tuesday that he saw the Biogen conference in February as a 'seminal event' in the coronavirus pandemic for the Boston area. 'I was criticized actually for saying a few months ago that the Biogen event was a seminal event with respect to corona here in the Commonwealth and I couldn't put a number on it at that point in time,' Baker said. 'This is no offense to anybody, but at that point in time, nobody was wearing masks, nobody was social distancing, nobody was even behaving with concern about the presence of the virus at all. I mean all rules of the game with respect to that have changed,' Baker said. 'It speaks to the power of that virus to move from one person to another to another.' Get CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team. The new pre-print study also investigated the spread of the coronavirus in other settings across the Boston area, including a skilled nursing facility -- where 85% of residents and 37% of staff tested positive -- and a homeless shelter -- where the coronavirus was introduced seven times, including four that resulted in clusters of cases, according to the study. 'Our findings repeatedly highlight the close relationships between seemingly disconnected groups and populations: viruses from international business travel seeded major outbreaks among individuals experiencing homelessness, spread throughout the Boston area, and were exported to other domestic and international sites,' the researchers wrote in the study.\")\n['medicine and health', 'diseases and conditions', 'acquired immune deficiency syndrome', 'viruses']\n\n>>> tfidf.gettags(\"Two people died and one person was injured as shots were fired late Tuesday in Kenosha during the third night of unrest in Wisconsin following the shooting of a Black man by police, Kenosha police said. The shooting was reported at about 11:45 p.m. in an area where protests have taken place, Kenosha police Lt. Joseph Nosalik said in a news release. Kenosha County Sheriff David Beth said one victim had been shot in the head and another in the chest late Tuesday, just before midnight, according to the Milwaukee Journal Sentinel. Beth didn’t know where the other person was shot, but his or her injuries are not believed to be life threatening. The shooting was under investigation and no other information was released. The victims have not been identified. Jacob Blake, who was shot shot multiple times by police in Wisconsin, is paralyzed, and it would “take a miracle” for him to walk again, his family’s attorney said Tuesday, while calling for the officer who opened fire to be arrested and others involved to lose their jobs. The shooting of Blake on Sunday in Kenosha — apparently in the back while three of his children looked on — was captured on cellphone video and ignited new protests over racial injustice in several cities, coming just three months after the death of George Floyd at the hands of Minneapolis police touched off a wider reckoning on race. Earlier Tuesday, Blake’s father spoke alongside other family members and lawyers, telling reporters that police shot his son “seven times, seven times, like he didn’t matter.” “But my son matters. He’s a human being and he matters,” said Blake’s father, who is also named Jacob Blake. The 29-year-old was in surgery Tuesday, said attorney Ben Crump, adding that the bullets severed Blake’s spinal cord and shattered his vertebrae. Another attorney said there was also severe damage to organs. “It’s going to take a miracle for Jacob Blake Jr. to ever walk again,” Crump said. The legal team plans to file a civil lawsuit against the police department over the shooting. Police have said little about what happened, other than that they were responding to a domestic dispute. The officers involved have not been named. The Wisconsin Department of Justice is investigating. Police fired tear gas for a third night Tuesday to disperse protesters who had gathered outside Kenosha’s courthouse, where some shook a protective fence and threw water bottles and fireworks at officers lined up behind it. Police then used armored vehicles and officers with shields pushed back the crowd when protesters ignored warnings to leave a nearby park. Wisconsin Gov. Tony Evers had called for calm Tuesday, while also declaring a state of emergency under which he doubled the National Guard deployment in Kenosha from 125 to 250. The night before crowds destroyed dozens of buildings and set more than 30 fires in the city’s downtown. “We cannot allow the cycle of systemic racism and injustice to continue,” said Evers, who is facing mounting pressure from Republicans over his handling of the unrest. “We also cannot continue going down this path of damage and destruction.” Blake’s mother, Julia Jackson, said the damage in Kenosha does not reflect what her family wants and that, if her son could see it, he would be “very unpleased.” She said the first thing her son said to her when she saw him was he was sorry. “He said, ‘I don’t want to be a burden on you guys,’” Jackson said. “’I want to be with my children, and I don’t think I’ll walk again.’” Three of the younger Blake’s sons — aged 3, 5 and 8 — were in the car at the time of the shooting, Crump said. It was the 8-year-old’s birthday, he added. The man who said he made the cellphone video of the shooting, 22-year-old Raysean White, said he saw Blake scuffling with three officers and heard them yell, “Drop the knife! Drop the knife!” before the gunfire erupted. He said he didn’t see a knife in Blake’s hands. In the footage, Blake walks from the sidewalk around the front of his SUV to his driver-side door as officers follow him with their guns drawn and shout at him. As Blake opens the door and leans into the SUV, an officer grabs his shirt from behind and opens fire. Seven shots can be heard, though it isn’t clear how many struck Blake or how many officers fired. Blake’s father told the Chicago Sun-Times that his son had eight holes in his body. Anger over the shooting has spilled into the streets of Kenosha and other cities, including Los Angeles, Wisconsin’s capital of Madison and in Minneapolis, the epicenter of the Black Lives Matter movement this summer following Floyd’s death. Hundreds of people again defied curfew Tuesday in Kenosha, where destruction marred protests the previous night as fires were set and businesses vandalized. There were 34 fires associated with that unrest, with 30 businesses destroyed or damaged along with an unknown number of residences, Kenosha Fire Chief Charles Leipzig told the Kenosha News. “Nobody deserves this,” said Pat Oertle, owner of Computer Adventure, surveying the damage on Tuesday. Computers were stolen, and the store was “destroyed,” she said. “This accomplishes nothing,” Oertle said. “This is not justice that they’re looking for.” U.S. Sen. Ron Johnson and U.S. Rep. Bryan Steil, both Republicans, called on the governor to do more to quell the unrest. Steil said he would request federal assistance if necessary. Evers continued to call for protesters to be peaceful. “Please do not allow the actions of a few distract us from the work we must do together to demand justice, equity, and accountability,” he said. Blake’s family also called for calm. “I really ask you and encourage everyone in Wisconsin and abroad to take a moment and examine your hearts,” Blake’s mother said. “Do Jacob justice on this level and examine your hearts. … As I pray for my son’s healing physically, emotionally and spiritually, I also have been praying even before this for the healing of our country.”\")\n['politics and government', 'demonstrations and riots', 'police']\n```\n\n### getfeatures\n\n_class_ **mitnewsclassify.tfidf.getfeatures**(txt)\n\nGets the values of the second layer in the neural network for a given article text.\n\nParameters\n * txt (`string`) - The article text\n\nReturns\n * features (`Tensor[float32]`) - The 500 values\n\nExample\n```\n>>> from mitnewsclassify import tfidf\n\n>>> tfidf.getfeatures(\"A destructive storm is rising from warm waters. Again. America and the world are getting more frequent and bigger multibillion dollar tropical catastrophes like Hurricane Laura, which is menacing the U.S. Gulf Coast, because of a combination of increased coastal development, natural climate cycles, reductions in air pollution and man-made climate change, experts say. The list of recent whoppers keeps growing: Harvey, Irma, Maria, Florence, Michael, Dorian. And hurricane experts have no doubt that Laura will be right there with them. It’s a mess at least partially of our own making, said Susan Cutter, director of the Hazards and Vulnerability Institute at the University of South Carolina. “We are seeing an increase of intensity of these phenomena because we as a society are fundamentally changing the Earth and at the same time we are moving to locations that are more hazardous,” Cutter said Wednesday. In the last three years, the United States has had seven hurricane disasters that each caused at least $1 billion in damage, totaling $335 billion. In all of the 1980s, there were six, and their damage totaled $38.2 billion, according to the National Oceanic and Atmospheric Administration. All those figures are adjusted for the cost of living. The Atlantic is increasingly spawning more major hurricanes, according to an Associated Press analysis of NOAA hurricane data since 1950. That designation refers to storms with at least 111-mile-per-hour (179-kilometer-per-hour) winds that are the ones that do the most damage. The Atlantic now averages three major hurricanes a year, based on a 30-year running average. In the 1980s and 1990s, it was two. The Atlantic’s Accumulated Cyclone Energy — a measurement that takes into account the number of storms, their strength and how long they last — is now 120 on a 30-year running average. Thirty years ago, it was in the 70s or 80s on average. Some people argue the increase is due to unchecked coastal development, while others will point to man-made climate change from the burning of coal, oil and gas. In fact, both are responsible, said former Federal Emergency Management Agency chief Craig Fugate. “There’s a lot of factors going on,” he said. When it comes to hurricane risk, a major factor is “the amount of stuff in the way of natural peril and the vulnerability of the stuff in the way,” said Mark Bove, a meteorologist who works for the insurance firm Munich Re U.S. One factor that increases the possibility that there will be “stuff in the way” of a major storm is that federal disaster policy and flood insurance subsidize and encourage people to rebuild in risky areas, Fugate said. After storms, communities “always say they are going to rise from the ashes,” and, too often, they build the same way in the same place for the same vulnerability and the same outcome, Fugate said. In addition, some places, like Houston, don’t limit development in areas that could serve as flood control zones if left empty and allow development that’s not disaster resilient, said Kathleen Tierney, former director of the Natural Hazards Center at Colorado University. Now add in the meteorology. Scientists agree that waters are warming, and that serves as hurricane fuel, said NOAA climate scientist Jim Kossin. A study by Kossin found that, once a storm formed, the chances of its attaining major storm status globally increased by 8% a decade since 1979. In the Atlantic, chances went up by 49% a decade. But scientists disagree on why waters are warming. They know climate change is a factor — but they say it’s not the biggest driver and disagree on what else may be behind it. Some argue it’s because of a 25- to 30-year natural global cycle that acts like a giant conveyor belt, carrying different levels of salt and temperature around the globe, including into the part of the tropical Atlantic off Africa where the worst hurricanes form, Colorado State University hurricane researcher Phil Klotzbach said. When the water in the northern Atlantic is extra warm, the water in those tropical hurricane breeding grounds is unusually hot, and the hurricane season is abnormally active, Klotzbach said. Such a busy period started in 1995 and might end soon as northern Atlantic waters shift to a cooler regime, he said. Klotzbach acknowledged that one problem with this theory is that the waters in the northern Atlantic have been unusually cool this summer, and still there have been lots of storms. It may have been a blip, he said. But MIT meteorology professor Kerry Emanuel says it’s because another counterintuitive factor is at play: There are more storms because of cleaner air. European air pollution cooled the area over Africa in the 1960s and 1970s and put more dust into the air — both of which tamped down on any hurricanes, he said. When the pollution eased, Africa got warmer, more storms developed, and that’s why it’s such a busy period, Emanuel said. While climate change is not the most important factor in warming waters, it contributes to creating more damaging storms in other ways, by causing a rising sea level that worsens storm surges and making storms move more slowly and produce more rain, scientists say. All of this means that we should get used to more catastrophic storms, according to Munich Re’s Bove. In addition, he said: “Climate change will be a bigger driver of losses in the future.”\")\n<tf.Tensor: shape=(1, 500), dtype=float32, numpy=\narray([[0.        , 2.035066  , 0.        , 1.1831102 , 1.8716689 ,\n        ...\n        2.4259803 , 0.30450952, 0.        , 0.        , 0.5605872 ]],\n      dtype=float32)>\n```\n\n## TF-IDF Bigrams Model\n\nThe TF-IDF Bigrams model mainly looks for appearance of keywords in an article to classify them into topics. In this case, the keywords refer to a phrase of two words occuring adjacent to each other, for instance \"nuclear weapons.\" The keywords were compiled by running Naive Bayes on the New York Times Annotated Corpus to get the top unique phrases pertaining to each label.\n\nOnce a new article is fed into the TF-IDF model, the article gets transformed by TF-IDF (Term Frequency - Inverse Document Frequency) as if it were a new article in the New York Times Annotated Corpus. The output is then run through two layers of neural network (size 2000 and 500 respectively) to produce the predicted tags for the article.\n\n161 MB of model files will be downloaded, M MB of RAM will be used on average to run the model and the classification takes P ms.\n\n### gettags\n\n_class_ **mitnewsclassify.tfidf_bi.gettags**(txt)\n\nGets the predicted tags for a given article text.\n\nParameters\n * txt (`string`) - The article text\n\nReturns\n * tags (`List[str]`) - The predicted tags\n\nExample\n```\n>>> from mitnewsclassify import tfidf_bi\n\n>>> tfidf_bi.gettags(\"Republicans proceeded with the third night of their national convention, but many Americans — particularly those in the path of Hurricane Laura — were focused on more immediate concerns.\")\n['conventions and conferences']\n\n>>> tfidf_bi.gettags(\"The Milwaukee Bucks chose to boycott their Wednesday matchup against the Orlando Magic in protest of the police shooting of Jacob Blake, a 29-year-old Black man, in Wisconsin.\")\n[]\n\n>>> tfidf_bi.gettags(\"One superspreading event may be connected to about 20,000 Covid-19 cases in the Boston area, a researcher said on Tuesday. That event, a biotech conference attended by 200 people in late February, is now well known as a source of Covid-19 spread very early on in the pandemic. Here is how a virus spreads Here is how a virus spreads 01:45 'Ultimately, more than 90 cases were diagnosed in people associated with this conference or their contacts, raising suspicion that a superspreading event had occurred there,' the researchers wrote in their study. Superspreading occurs when one or a few infected people cause a cascade of transmissions of an infectious disease. The new study -- which has not yet been peer-reviewed but was posted to the online server medrxiv.org on Tuesday -- involved analyzing the impact of early superspreading events in the Boston area and provided 'direct evidence' that superspreading can profoundly alter the course of an epidemic. 'An unfortunate perfect storm' The researchers -- from the Broad Institute of MIT and Harvard in Cambridge and other various institutions -- conducted genetic analyses of coronavirus specimen samples in Massachusetts. The researchers sequenced and analyzed 772 complete genomes of the virus from the region. They found 80 introductions of the virus into the Boston, predominantly from elsewhere in the United States and Europe, and 'hundreds of cases from major outbreaks' in various settings, including the conference. Coronavirus quickly spread around the world starting late last year, new genetic analysis shows Coronavirus quickly spread around the world starting late last year, new genetic analysis shows The conference, held from February 26 to 27, was a 'perfect storm' and the superspreading there could have been connected to approximately 20,000 cases, Bronwyn MacInnis, a researcher at the Broad Institute who worked on the study, told CNN in an email on Tuesday. 'Many factors made the conference an unfortunate perfect storm as a superspreading event. That the virus was introduced at the conference at all was unlucky,' MacInnis wrote in the email. 'This is not a rigorous estimate but does communicate the scale,' MacInnis added. 'If tens of thousands of individuals seems large, it is important to point out that it is in context of a pandemic that has infected tens of millions of people.' Unseen Covid-19 cases began early, spread fast Unseen Covid-19 cases began early, spread fast 03:00 Timing was crucial. In late February, people were not yet aware of the pandemic risk. 'When it happened was critical: it was scheduled just as we were collectively beginning to appreciate the imminent threat of COVID at home--if it had been a week later the event likely would have been cancelled,' MacInnis wrote in the email. 'Also, because it happened early in the epidemic it had the chance to spread widely before extensive testing capacity, shutdowns, social distancing, and masking were in place,' she wrote. 'The other critical factor was the population the virus landed in: people who had come from many different places (including some where COVID was already circulating), and who then returned home, often unknowingly bringing the virus with them.' 'A much greater understanding of how easily and quickly this virus can be transmitted' While the researchers did not identify the conference in their study, The Boston Globe on Tuesday said it was an international meeting of leaders from the biotechnology company Biogen at the Marriott Long Wharf hotel in Boston. How 53 members of this choir were infected in &#39;super spreader&#39; event How 53 members of this choir were infected in 'super spreader' event 03:03 'February 2020 was nearly a half year ago, and was a period when general knowledge about the coronavirus was limited,' Biogen said in a written statement to CNN on Tuesday. 'We were adhering closely to the prevailing official guidelines. We never would have knowingly put anyone at risk. When we learned a number of our colleagues were ill, we did not know the cause was COVID-19, but we immediately notified public health authorities and took steps to limit the spread.' The company noted in its statement that it joined a collaboration with the Broad Institute in April to share biological and medical data to advance knowledge around Covid-19. 'The world today has a much greater understanding of how easily and quickly this virus can be transmitted, and we are proud to contribute through this collaboration to the global effort to overcome COVID-19,' it said. Who or what is a super spreader? Dr. Sanjay Gupta&#39;s coronavirus podcast for June 18 explains. Who or what is a super spreader? Dr. Sanjay Gupta's coronavirus podcast for June 18 explains. Massachusetts Governor Charlie Baker said in a news conference on Tuesday that he saw the Biogen conference in February as a 'seminal event' in the coronavirus pandemic for the Boston area. 'I was criticized actually for saying a few months ago that the Biogen event was a seminal event with respect to corona here in the Commonwealth and I couldn't put a number on it at that point in time,' Baker said. 'This is no offense to anybody, but at that point in time, nobody was wearing masks, nobody was social distancing, nobody was even behaving with concern about the presence of the virus at all. I mean all rules of the game with respect to that have changed,' Baker said. 'It speaks to the power of that virus to move from one person to another to another.' Get CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team. The new pre-print study also investigated the spread of the coronavirus in other settings across the Boston area, including a skilled nursing facility -- where 85% of residents and 37% of staff tested positive -- and a homeless shelter -- where the coronavirus was introduced seven times, including four that resulted in clusters of cases, according to the study. 'Our findings repeatedly highlight the close relationships between seemingly disconnected groups and populations: viruses from international business travel seeded major outbreaks among individuals experiencing homelessness, spread throughout the Boston area, and were exported to other domestic and international sites,' the researchers wrote in the study.\")\n['medicine and health', 'diseases and conditions']\n\n>>> tfidf_bi.gettags(\"Two people died and one person was injured as shots were fired late Tuesday in Kenosha during the third night of unrest in Wisconsin following the shooting of a Black man by police, Kenosha police said. The shooting was reported at about 11:45 p.m. in an area where protests have taken place, Kenosha police Lt. Joseph Nosalik said in a news release. Kenosha County Sheriff David Beth said one victim had been shot in the head and another in the chest late Tuesday, just before midnight, according to the Milwaukee Journal Sentinel. Beth didn’t know where the other person was shot, but his or her injuries are not believed to be life threatening. The shooting was under investigation and no other information was released. The victims have not been identified. Jacob Blake, who was shot shot multiple times by police in Wisconsin, is paralyzed, and it would “take a miracle” for him to walk again, his family’s attorney said Tuesday, while calling for the officer who opened fire to be arrested and others involved to lose their jobs. The shooting of Blake on Sunday in Kenosha — apparently in the back while three of his children looked on — was captured on cellphone video and ignited new protests over racial injustice in several cities, coming just three months after the death of George Floyd at the hands of Minneapolis police touched off a wider reckoning on race. Earlier Tuesday, Blake’s father spoke alongside other family members and lawyers, telling reporters that police shot his son “seven times, seven times, like he didn’t matter.” “But my son matters. He’s a human being and he matters,” said Blake’s father, who is also named Jacob Blake. The 29-year-old was in surgery Tuesday, said attorney Ben Crump, adding that the bullets severed Blake’s spinal cord and shattered his vertebrae. Another attorney said there was also severe damage to organs. “It’s going to take a miracle for Jacob Blake Jr. to ever walk again,” Crump said. The legal team plans to file a civil lawsuit against the police department over the shooting. Police have said little about what happened, other than that they were responding to a domestic dispute. The officers involved have not been named. The Wisconsin Department of Justice is investigating. Police fired tear gas for a third night Tuesday to disperse protesters who had gathered outside Kenosha’s courthouse, where some shook a protective fence and threw water bottles and fireworks at officers lined up behind it. Police then used armored vehicles and officers with shields pushed back the crowd when protesters ignored warnings to leave a nearby park. Wisconsin Gov. Tony Evers had called for calm Tuesday, while also declaring a state of emergency under which he doubled the National Guard deployment in Kenosha from 125 to 250. The night before crowds destroyed dozens of buildings and set more than 30 fires in the city’s downtown. “We cannot allow the cycle of systemic racism and injustice to continue,” said Evers, who is facing mounting pressure from Republicans over his handling of the unrest. “We also cannot continue going down this path of damage and destruction.” Blake’s mother, Julia Jackson, said the damage in Kenosha does not reflect what her family wants and that, if her son could see it, he would be “very unpleased.” She said the first thing her son said to her when she saw him was he was sorry. “He said, ‘I don’t want to be a burden on you guys,’” Jackson said. “’I want to be with my children, and I don’t think I’ll walk again.’” Three of the younger Blake’s sons — aged 3, 5 and 8 — were in the car at the time of the shooting, Crump said. It was the 8-year-old’s birthday, he added. The man who said he made the cellphone video of the shooting, 22-year-old Raysean White, said he saw Blake scuffling with three officers and heard them yell, “Drop the knife! Drop the knife!” before the gunfire erupted. He said he didn’t see a knife in Blake’s hands. In the footage, Blake walks from the sidewalk around the front of his SUV to his driver-side door as officers follow him with their guns drawn and shout at him. As Blake opens the door and leans into the SUV, an officer grabs his shirt from behind and opens fire. Seven shots can be heard, though it isn’t clear how many struck Blake or how many officers fired. Blake’s father told the Chicago Sun-Times that his son had eight holes in his body. Anger over the shooting has spilled into the streets of Kenosha and other cities, including Los Angeles, Wisconsin’s capital of Madison and in Minneapolis, the epicenter of the Black Lives Matter movement this summer following Floyd’s death. Hundreds of people again defied curfew Tuesday in Kenosha, where destruction marred protests the previous night as fires were set and businesses vandalized. There were 34 fires associated with that unrest, with 30 businesses destroyed or damaged along with an unknown number of residences, Kenosha Fire Chief Charles Leipzig told the Kenosha News. “Nobody deserves this,” said Pat Oertle, owner of Computer Adventure, surveying the damage on Tuesday. Computers were stolen, and the store was “destroyed,” she said. “This accomplishes nothing,” Oertle said. “This is not justice that they’re looking for.” U.S. Sen. Ron Johnson and U.S. Rep. Bryan Steil, both Republicans, called on the governor to do more to quell the unrest. Steil said he would request federal assistance if necessary. Evers continued to call for protesters to be peaceful. “Please do not allow the actions of a few distract us from the work we must do together to demand justice, equity, and accountability,” he said. Blake’s family also called for calm. “I really ask you and encourage everyone in Wisconsin and abroad to take a moment and examine your hearts,” Blake’s mother said. “Do Jacob justice on this level and examine your hearts. … As I pray for my son’s healing physically, emotionally and spiritually, I also have been praying even before this for the healing of our country.”\")\n['demonstrations and riots']\n```\n\n### getfeatures\n\n_class_ **mitnewsclassify.tfidf_bi.getfeatures**(txt)\n\nGets the values of the second layer in the neural network for a given article text.\n\nParameters\n * txt (`string`) - The article text\n\nReturns\n * features (`Tensor[float32]`) - The 500 values\n\nExample\n```\n>>> from mitnewsclassify import tfidf_bi\n\n>>> tfidf_bi.getfeatures(\"A destructive storm is rising from warm waters. Again. America and the world are getting more frequent and bigger multibillion dollar tropical catastrophes like Hurricane Laura, which is menacing the U.S. Gulf Coast, because of a combination of increased coastal development, natural climate cycles, reductions in air pollution and man-made climate change, experts say. The list of recent whoppers keeps growing: Harvey, Irma, Maria, Florence, Michael, Dorian. And hurricane experts have no doubt that Laura will be right there with them. It’s a mess at least partially of our own making, said Susan Cutter, director of the Hazards and Vulnerability Institute at the University of South Carolina. “We are seeing an increase of intensity of these phenomena because we as a society are fundamentally changing the Earth and at the same time we are moving to locations that are more hazardous,” Cutter said Wednesday. In the last three years, the United States has had seven hurricane disasters that each caused at least $1 billion in damage, totaling $335 billion. In all of the 1980s, there were six, and their damage totaled $38.2 billion, according to the National Oceanic and Atmospheric Administration. All those figures are adjusted for the cost of living. The Atlantic is increasingly spawning more major hurricanes, according to an Associated Press analysis of NOAA hurricane data since 1950. That designation refers to storms with at least 111-mile-per-hour (179-kilometer-per-hour) winds that are the ones that do the most damage. The Atlantic now averages three major hurricanes a year, based on a 30-year running average. In the 1980s and 1990s, it was two. The Atlantic’s Accumulated Cyclone Energy — a measurement that takes into account the number of storms, their strength and how long they last — is now 120 on a 30-year running average. Thirty years ago, it was in the 70s or 80s on average. Some people argue the increase is due to unchecked coastal development, while others will point to man-made climate change from the burning of coal, oil and gas. In fact, both are responsible, said former Federal Emergency Management Agency chief Craig Fugate. “There’s a lot of factors going on,” he said. When it comes to hurricane risk, a major factor is “the amount of stuff in the way of natural peril and the vulnerability of the stuff in the way,” said Mark Bove, a meteorologist who works for the insurance firm Munich Re U.S. One factor that increases the possibility that there will be “stuff in the way” of a major storm is that federal disaster policy and flood insurance subsidize and encourage people to rebuild in risky areas, Fugate said. After storms, communities “always say they are going to rise from the ashes,” and, too often, they build the same way in the same place for the same vulnerability and the same outcome, Fugate said. In addition, some places, like Houston, don’t limit development in areas that could serve as flood control zones if left empty and allow development that’s not disaster resilient, said Kathleen Tierney, former director of the Natural Hazards Center at Colorado University. Now add in the meteorology. Scientists agree that waters are warming, and that serves as hurricane fuel, said NOAA climate scientist Jim Kossin. A study by Kossin found that, once a storm formed, the chances of its attaining major storm status globally increased by 8% a decade since 1979. In the Atlantic, chances went up by 49% a decade. But scientists disagree on why waters are warming. They know climate change is a factor — but they say it’s not the biggest driver and disagree on what else may be behind it. Some argue it’s because of a 25- to 30-year natural global cycle that acts like a giant conveyor belt, carrying different levels of salt and temperature around the globe, including into the part of the tropical Atlantic off Africa where the worst hurricanes form, Colorado State University hurricane researcher Phil Klotzbach said. When the water in the northern Atlantic is extra warm, the water in those tropical hurricane breeding grounds is unusually hot, and the hurricane season is abnormally active, Klotzbach said. Such a busy period started in 1995 and might end soon as northern Atlantic waters shift to a cooler regime, he said. Klotzbach acknowledged that one problem with this theory is that the waters in the northern Atlantic have been unusually cool this summer, and still there have been lots of storms. It may have been a blip, he said. But MIT meteorology professor Kerry Emanuel says it’s because another counterintuitive factor is at play: There are more storms because of cleaner air. European air pollution cooled the area over Africa in the 1960s and 1970s and put more dust into the air — both of which tamped down on any hurricanes, he said. When the pollution eased, Africa got warmer, more storms developed, and that’s why it’s such a busy period, Emanuel said. While climate change is not the most important factor in warming waters, it contributes to creating more damaging storms in other ways, by causing a rising sea level that worsens storm surges and making storms move more slowly and produce more rain, scientists say. All of this means that we should get used to more catastrophic storms, according to Munich Re’s Bove. In addition, he said: “Climate change will be a bigger driver of losses in the future.”\")\n<tf.Tensor: shape=(1, 500), dtype=float32, numpy=\narray([[1.4679118e+00, 7.8771174e-01, 6.4926636e-01, 5.0401473e-01,\n        ...\n        1.0278748e+00, 9.7658831e-01, 9.7091949e-01, 1.3398045e-01]],\n      dtype=float32)>\n```\n\n## Doc2Vec Model\n\nThe Doc2Vec model applies [gensim's](https://radimrehurek.com/gensim/models/doc2vec.html) implementation of [Quoc Le and Tomas Mikolov: “Distributed Representations of Sentences and Documents”](https://arxiv.org/pdf/1405.4053v2.pdf), which embeds an entire document into a vector based on the pattens of words that occur next to one another. The model is trained using 5 neighbors, 10 epochs and vectors of size 2000, and is saved on our server.\n\nOnce a new article is fed into the Doc2Vec model, the article gets embedded through the saved model as if it were a new article in the New York Times Annotated Corpus. The output is then run through two layers of neural network (size 1200 and 800 respectively) to produce the predicted tags for the article.\n\nDue to the nature of the model, outputs on the same input are not guaranteed to be the same in each run.\n\n7.93 GB of model files will be downloaded, M MB of RAM will be used on average to run the model and the classification takes P ms.\n\n### gettags\n\n_class_ **mitnewsclassify.doc2vec.gettags**(txt)\n\nGets the predicted tags for a given article text.\n\nParameters\n * txt (`string`) - The article text\n\nReturns\n * tags (`List[str]`) - The predicted tags\n\nExample\n```\n>>> from mitnewsclassify import doc2vec\n\n>>> doc2vec.gettags(\"Republicans proceeded with the third night of their national convention, but many Americans — particularly those in the path of Hurricane Laura — were focused on more immediate concerns.\")\n[]\n\n>>> doc2vec.gettags(\"The Milwaukee Bucks chose to boycott their Wednesday matchup against the Orlando Magic in protest of the police shooting of Jacob Blake, a 29-year-old Black man, in Wisconsin.\")\n['demonstrations and riots']\n\n>>> doc2vec.gettags(\"One superspreading event may be connected to about 20,000 Covid-19 cases in the Boston area, a researcher said on Tuesday. That event, a biotech conference attended by 200 people in late February, is now well known as a source of Covid-19 spread very early on in the pandemic. Here is how a virus spreads Here is how a virus spreads 01:45 'Ultimately, more than 90 cases were diagnosed in people associated with this conference or their contacts, raising suspicion that a superspreading event had occurred there,' the researchers wrote in their study. Superspreading occurs when one or a few infected people cause a cascade of transmissions of an infectious disease. The new study -- which has not yet been peer-reviewed but was posted to the online server medrxiv.org on Tuesday -- involved analyzing the impact of early superspreading events in the Boston area and provided 'direct evidence' that superspreading can profoundly alter the course of an epidemic. 'An unfortunate perfect storm' The researchers -- from the Broad Institute of MIT and Harvard in Cambridge and other various institutions -- conducted genetic analyses of coronavirus specimen samples in Massachusetts. The researchers sequenced and analyzed 772 complete genomes of the virus from the region. They found 80 introductions of the virus into the Boston, predominantly from elsewhere in the United States and Europe, and 'hundreds of cases from major outbreaks' in various settings, including the conference. Coronavirus quickly spread around the world starting late last year, new genetic analysis shows Coronavirus quickly spread around the world starting late last year, new genetic analysis shows The conference, held from February 26 to 27, was a 'perfect storm' and the superspreading there could have been connected to approximately 20,000 cases, Bronwyn MacInnis, a researcher at the Broad Institute who worked on the study, told CNN in an email on Tuesday. 'Many factors made the conference an unfortunate perfect storm as a superspreading event. That the virus was introduced at the conference at all was unlucky,' MacInnis wrote in the email. 'This is not a rigorous estimate but does communicate the scale,' MacInnis added. 'If tens of thousands of individuals seems large, it is important to point out that it is in context of a pandemic that has infected tens of millions of people.' Unseen Covid-19 cases began early, spread fast Unseen Covid-19 cases began early, spread fast 03:00 Timing was crucial. In late February, people were not yet aware of the pandemic risk. 'When it happened was critical: it was scheduled just as we were collectively beginning to appreciate the imminent threat of COVID at home--if it had been a week later the event likely would have been cancelled,' MacInnis wrote in the email. 'Also, because it happened early in the epidemic it had the chance to spread widely before extensive testing capacity, shutdowns, social distancing, and masking were in place,' she wrote. 'The other critical factor was the population the virus landed in: people who had come from many different places (including some where COVID was already circulating), and who then returned home, often unknowingly bringing the virus with them.' 'A much greater understanding of how easily and quickly this virus can be transmitted' While the researchers did not identify the conference in their study, The Boston Globe on Tuesday said it was an international meeting of leaders from the biotechnology company Biogen at the Marriott Long Wharf hotel in Boston. How 53 members of this choir were infected in &#39;super spreader&#39; event How 53 members of this choir were infected in 'super spreader' event 03:03 'February 2020 was nearly a half year ago, and was a period when general knowledge about the coronavirus was limited,' Biogen said in a written statement to CNN on Tuesday. 'We were adhering closely to the prevailing official guidelines. We never would have knowingly put anyone at risk. When we learned a number of our colleagues were ill, we did not know the cause was COVID-19, but we immediately notified public health authorities and took steps to limit the spread.' The company noted in its statement that it joined a collaboration with the Broad Institute in April to share biological and medical data to advance knowledge around Covid-19. 'The world today has a much greater understanding of how easily and quickly this virus can be transmitted, and we are proud to contribute through this collaboration to the global effort to overcome COVID-19,' it said. Who or what is a super spreader? Dr. Sanjay Gupta&#39;s coronavirus podcast for June 18 explains. Who or what is a super spreader? Dr. Sanjay Gupta's coronavirus podcast for June 18 explains. Massachusetts Governor Charlie Baker said in a news conference on Tuesday that he saw the Biogen conference in February as a 'seminal event' in the coronavirus pandemic for the Boston area. 'I was criticized actually for saying a few months ago that the Biogen event was a seminal event with respect to corona here in the Commonwealth and I couldn't put a number on it at that point in time,' Baker said. 'This is no offense to anybody, but at that point in time, nobody was wearing masks, nobody was social distancing, nobody was even behaving with concern about the presence of the virus at all. I mean all rules of the game with respect to that have changed,' Baker said. 'It speaks to the power of that virus to move from one person to another to another.' Get CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team. The new pre-print study also investigated the spread of the coronavirus in other settings across the Boston area, including a skilled nursing facility -- where 85% of residents and 37% of staff tested positive -- and a homeless shelter -- where the coronavirus was introduced seven times, including four that resulted in clusters of cases, according to the study. 'Our findings repeatedly highlight the close relationships between seemingly disconnected groups and populations: viruses from international business travel seeded major outbreaks among individuals experiencing homelessness, spread throughout the Boston area, and were exported to other domestic and international sites,' the researchers wrote in the study.\")\n['medicine and health', 'diseases and conditions', 'acquired immune deficiency syndrome', 'viruses']\n\n>>> doc2vec.gettags(\"Two people died and one person was injured as shots were fired late Tuesday in Kenosha during the third night of unrest in Wisconsin following the shooting of a Black man by police, Kenosha police said. The shooting was reported at about 11:45 p.m. in an area where protests have taken place, Kenosha police Lt. Joseph Nosalik said in a news release. Kenosha County Sheriff David Beth said one victim had been shot in the head and another in the chest late Tuesday, just before midnight, according to the Milwaukee Journal Sentinel. Beth didn’t know where the other person was shot, but his or her injuries are not believed to be life threatening. The shooting was under investigation and no other information was released. The victims have not been identified. Jacob Blake, who was shot shot multiple times by police in Wisconsin, is paralyzed, and it would “take a miracle” for him to walk again, his family’s attorney said Tuesday, while calling for the officer who opened fire to be arrested and others involved to lose their jobs. The shooting of Blake on Sunday in Kenosha — apparently in the back while three of his children looked on — was captured on cellphone video and ignited new protests over racial injustice in several cities, coming just three months after the death of George Floyd at the hands of Minneapolis police touched off a wider reckoning on race. Earlier Tuesday, Blake’s father spoke alongside other family members and lawyers, telling reporters that police shot his son “seven times, seven times, like he didn’t matter.” “But my son matters. He’s a human being and he matters,” said Blake’s father, who is also named Jacob Blake. The 29-year-old was in surgery Tuesday, said attorney Ben Crump, adding that the bullets severed Blake’s spinal cord and shattered his vertebrae. Another attorney said there was also severe damage to organs. “It’s going to take a miracle for Jacob Blake Jr. to ever walk again,” Crump said. The legal team plans to file a civil lawsuit against the police department over the shooting. Police have said little about what happened, other than that they were responding to a domestic dispute. The officers involved have not been named. The Wisconsin Department of Justice is investigating. Police fired tear gas for a third night Tuesday to disperse protesters who had gathered outside Kenosha’s courthouse, where some shook a protective fence and threw water bottles and fireworks at officers lined up behind it. Police then used armored vehicles and officers with shields pushed back the crowd when protesters ignored warnings to leave a nearby park. Wisconsin Gov. Tony Evers had called for calm Tuesday, while also declaring a state of emergency under which he doubled the National Guard deployment in Kenosha from 125 to 250. The night before crowds destroyed dozens of buildings and set more than 30 fires in the city’s downtown. “We cannot allow the cycle of systemic racism and injustice to continue,” said Evers, who is facing mounting pressure from Republicans over his handling of the unrest. “We also cannot continue going down this path of damage and destruction.” Blake’s mother, Julia Jackson, said the damage in Kenosha does not reflect what her family wants and that, if her son could see it, he would be “very unpleased.” She said the first thing her son said to her when she saw him was he was sorry. “He said, ‘I don’t want to be a burden on you guys,’” Jackson said. “’I want to be with my children, and I don’t think I’ll walk again.’” Three of the younger Blake’s sons — aged 3, 5 and 8 — were in the car at the time of the shooting, Crump said. It was the 8-year-old’s birthday, he added. The man who said he made the cellphone video of the shooting, 22-year-old Raysean White, said he saw Blake scuffling with three officers and heard them yell, “Drop the knife! Drop the knife!” before the gunfire erupted. He said he didn’t see a knife in Blake’s hands. In the footage, Blake walks from the sidewalk around the front of his SUV to his driver-side door as officers follow him with their guns drawn and shout at him. As Blake opens the door and leans into the SUV, an officer grabs his shirt from behind and opens fire. Seven shots can be heard, though it isn’t clear how many struck Blake or how many officers fired. Blake’s father told the Chicago Sun-Times that his son had eight holes in his body. Anger over the shooting has spilled into the streets of Kenosha and other cities, including Los Angeles, Wisconsin’s capital of Madison and in Minneapolis, the epicenter of the Black Lives Matter movement this summer following Floyd’s death. Hundreds of people again defied curfew Tuesday in Kenosha, where destruction marred protests the previous night as fires were set and businesses vandalized. There were 34 fires associated with that unrest, with 30 businesses destroyed or damaged along with an unknown number of residences, Kenosha Fire Chief Charles Leipzig told the Kenosha News. “Nobody deserves this,” said Pat Oertle, owner of Computer Adventure, surveying the damage on Tuesday. Computers were stolen, and the store was “destroyed,” she said. “This accomplishes nothing,” Oertle said. “This is not justice that they’re looking for.” U.S. Sen. Ron Johnson and U.S. Rep. Bryan Steil, both Republicans, called on the governor to do more to quell the unrest. Steil said he would request federal assistance if necessary. Evers continued to call for protesters to be peaceful. “Please do not allow the actions of a few distract us from the work we must do together to demand justice, equity, and accountability,” he said. Blake’s family also called for calm. “I really ask you and encourage everyone in Wisconsin and abroad to take a moment and examine your hearts,” Blake’s mother said. “Do Jacob justice on this level and examine your hearts. … As I pray for my son’s healing physically, emotionally and spiritually, I also have been praying even before this for the healing of our country.”\")\n['politics and government', 'elections', 'presidents and presidency (us)', 'presidential elections (us)', 'demonstrations and riots', 'police', 'blacks', 'police brutality and misconduct']\n```\n\n### getfeatures\n\n_class_ **mitnewsclassify.doc2vec.getfeatures**(txt)\n\nGets the values of the second layer in the neural network for a given article text.\n\nParameters\n * txt (`string`) - The article text\n\nReturns\n * features (`Tensor[float32]`) - The 800 values\n\nExample\n```\n>>> from mitnewsclassify import doc2vec\n\n>>> doc2vec.getfeatures(\"A destructive storm is rising from warm waters. Again. America and the world are getting more frequent and bigger multibillion dollar tropical catastrophes like Hurricane Laura, which is menacing the U.S. Gulf Coast, because of a combination of increased coastal development, natural climate cycles, reductions in air pollution and man-made climate change, experts say. The list of recent whoppers keeps growing: Harvey, Irma, Maria, Florence, Michael, Dorian. And hurricane experts have no doubt that Laura will be right there with them. It’s a mess at least partially of our own making, said Susan Cutter, director of the Hazards and Vulnerability Institute at the University of South Carolina. “We are seeing an increase of intensity of these phenomena because we as a society are fundamentally changing the Earth and at the same time we are moving to locations that are more hazardous,” Cutter said Wednesday. In the last three years, the United States has had seven hurricane disasters that each caused at least $1 billion in damage, totaling $335 billion. In all of the 1980s, there were six, and their damage totaled $38.2 billion, according to the National Oceanic and Atmospheric Administration. All those figures are adjusted for the cost of living. The Atlantic is increasingly spawning more major hurricanes, according to an Associated Press analysis of NOAA hurricane data since 1950. That designation refers to storms with at least 111-mile-per-hour (179-kilometer-per-hour) winds that are the ones that do the most damage. The Atlantic now averages three major hurricanes a year, based on a 30-year running average. In the 1980s and 1990s, it was two. The Atlantic’s Accumulated Cyclone Energy — a measurement that takes into account the number of storms, their strength and how long they last — is now 120 on a 30-year running average. Thirty years ago, it was in the 70s or 80s on average. Some people argue the increase is due to unchecked coastal development, while others will point to man-made climate change from the burning of coal, oil and gas. In fact, both are responsible, said former Federal Emergency Management Agency chief Craig Fugate. “There’s a lot of factors going on,” he said. When it comes to hurricane risk, a major factor is “the amount of stuff in the way of natural peril and the vulnerability of the stuff in the way,” said Mark Bove, a meteorologist who works for the insurance firm Munich Re U.S. One factor that increases the possibility that there will be “stuff in the way” of a major storm is that federal disaster policy and flood insurance subsidize and encourage people to rebuild in risky areas, Fugate said. After storms, communities “always say they are going to rise from the ashes,” and, too often, they build the same way in the same place for the same vulnerability and the same outcome, Fugate said. In addition, some places, like Houston, don’t limit development in areas that could serve as flood control zones if left empty and allow development that’s not disaster resilient, said Kathleen Tierney, former director of the Natural Hazards Center at Colorado University. Now add in the meteorology. Scientists agree that waters are warming, and that serves as hurricane fuel, said NOAA climate scientist Jim Kossin. A study by Kossin found that, once a storm formed, the chances of its attaining major storm status globally increased by 8% a decade since 1979. In the Atlantic, chances went up by 49% a decade. But scientists disagree on why waters are warming. They know climate change is a factor — but they say it’s not the biggest driver and disagree on what else may be behind it. Some argue it’s because of a 25- to 30-year natural global cycle that acts like a giant conveyor belt, carrying different levels of salt and temperature around the globe, including into the part of the tropical Atlantic off Africa where the worst hurricanes form, Colorado State University hurricane researcher Phil Klotzbach said. When the water in the northern Atlantic is extra warm, the water in those tropical hurricane breeding grounds is unusually hot, and the hurricane season is abnormally active, Klotzbach said. Such a busy period started in 1995 and might end soon as northern Atlantic waters shift to a cooler regime, he said. Klotzbach acknowledged that one problem with this theory is that the waters in the northern Atlantic have been unusually cool this summer, and still there have been lots of storms. It may have been a blip, he said. But MIT meteorology professor Kerry Emanuel says it’s because another counterintuitive factor is at play: There are more storms because of cleaner air. European air pollution cooled the area over Africa in the 1960s and 1970s and put more dust into the air — both of which tamped down on any hurricanes, he said. When the pollution eased, Africa got warmer, more storms developed, and that’s why it’s such a busy period, Emanuel said. While climate change is not the most important factor in warming waters, it contributes to creating more damaging storms in other ways, by causing a rising sea level that worsens storm surges and making storms move more slowly and produce more rain, scientists say. All of this means that we should get used to more catastrophic storms, according to Munich Re’s Bove. In addition, he said: “Climate change will be a bigger driver of losses in the future.”\")\n<tf.Tensor: shape=(1, 800), dtype=float32, numpy=\narray([[ 0.67777956,  1.9491149 ,  0.3388513 ,  2.0435412 ,  4.2271314 ,\n         ...\n         1.8406105 ,  2.0213082 ,  0.        ,  0.29909152,  0.        ]],\n      dtype=float32)>\n```\n\n## GPT2 Model\n\nThe GPT2 model applies [huggingface's](https://huggingface.co/transformers/model_doc/gpt2.html) implementation of [Alec Radford, Jeffrey Wu, Rewon Child, David Luan, Dario Amodei and Ilya Sutskever: \"Language Models are Unsupervised Multitask Learners\"](https://cdn.openai.com/better-language-models/language_models_are_unsupervised_multitask_learners.pdf), a large transformer-based language model which embeds an entire document into a vector, usually to perform various natural language processing tasks. The model is trained using \\[HYPERPARAMETERS\\], and is saved on our server.\n\nOnce a new article is fed into the GPT2 model, the article gets embedded through the saved model. The output is then run through a deep neural network to produce the predicted tags for the article.\n\n2.95 MB of model files will be downloaded (not including huggingface's pretrained model), M MB of RAM will be used on average to run the model and the classification takes P ms.\n\n### gettags\n\n_class_ **mitnewsclassify.gpt2.gettags**(txt)\n\nGets the predicted tags for a given article text.\n\nParameters\n * txt (`string`) - The article text\n\nReturns\n * tags (`List[str]`) - The predicted tags\n\nExample\n```\n>>> from mitnewsclassify import gpt2\n\n>>> gpt2.gettags(\"Republicans proceeded with the third night of their national convention, but many Americans — particularly those in the path of Hurricane Laura — were focused on more immediate concerns.\")\n['politics and government', 'motion pictures', 'budgets and budgeting', 'medicine and health', 'presidents and presidency (us)', 'immigration and refugees']\n\n>>> gpt2.gettags(\"The Milwaukee Bucks chose to boycott their Wednesday matchup against the Orlando Magic in protest of the police shooting of Jacob Blake, a 29-year-old Black man, in Wisconsin.\")\n['recordings (video)', 'hurricanes and tropical storms']\n\n>>> gpt2.gettags(\"One superspreading event may be connected to about 20,000 Covid-19 cases in the Boston area, a researcher said on Tuesday. That event, a biotech conference attended by 200 people in late February, is now well known as a source of Covid-19 spread very early on in the pandemic. Here is how a virus spreads Here is how a virus spreads 01:45 'Ultimately, more than 90 cases were diagnosed in people associated with this conference or their contacts, raising suspicion that a superspreading event had occurred there,' the researchers wrote in their study. Superspreading occurs when one or a few infected people cause a cascade of transmissions of an infectious disease. The new study -- which has not yet been peer-reviewed but was posted to the online server medrxiv.org on Tuesday -- involved analyzing the impact of early superspreading events in the Boston area and provided 'direct evidence' that superspreading can profoundly alter the course of an epidemic. 'An unfortunate perfect storm' The researchers -- from the Broad Institute of MIT and Harvard in Cambridge and other various institutions -- conducted genetic analyses of coronavirus specimen samples in Massachusetts. The researchers sequenced and analyzed 772 complete genomes of the virus from the region. They found 80 introductions of the virus into the Boston, predominantly from elsewhere in the United States and Europe, and 'hundreds of cases from major outbreaks' in various settings, including the conference. Coronavirus quickly spread around the world starting late last year, new genetic analysis shows Coronavirus quickly spread around the world starting late last year, new genetic analysis shows The conference, held from February 26 to 27, was a 'perfect storm' and the superspreading there could have been connected to approximately 20,000 cases, Bronwyn MacInnis, a researcher at the Broad Institute who worked on the study, told CNN in an email on Tuesday. 'Many factors made the conference an unfortunate perfect storm as a superspreading event. That the virus was introduced at the conference at all was unlucky,' MacInnis wrote in the email. 'This is not a rigorous estimate but does communicate the scale,' MacInnis added. 'If tens of thousands of individuals seems large, it is important to point out that it is in context of a pandemic that has infected tens of millions of people.' Unseen Covid-19 cases began early, spread fast Unseen Covid-19 cases began early, spread fast 03:00 Timing was crucial. In late February, people were not yet aware of the pandemic risk. 'When it happened was critical: it was scheduled just as we were collectively beginning to appreciate the imminent threat of COVID at home--if it had been a week later the event likely would have been cancelled,' MacInnis wrote in the email. 'Also, because it happened early in the epidemic it had the chance to spread widely before extensive testing capacity, shutdowns, social distancing, and masking were in place,' she wrote. 'The other critical factor was the population the virus landed in: people who had come from many different places (including some where COVID was already circulating), and who then returned home, often unknowingly bringing the virus with them.' 'A much greater understanding of how easily and quickly this virus can be transmitted' While the researchers did not identify the conference in their study, The Boston Globe on Tuesday said it was an international meeting of leaders from the biotechnology company Biogen at the Marriott Long Wharf hotel in Boston. How 53 members of this choir were infected in &#39;super spreader&#39; event How 53 members of this choir were infected in 'super spreader' event 03:03 'February 2020 was nearly a half year ago, and was a period when general knowledge about the coronavirus was limited,' Biogen said in a written statement to CNN on Tuesday. 'We were adhering closely to the prevailing official guidelines. We never would have knowingly put anyone at risk. When we learned a number of our colleagues were ill, we did not know the cause was COVID-19, but we immediately notified public health authorities and took steps to limit the spread.' The company noted in its statement that it joined a collaboration with the Broad Institute in April to share biological and medical data to advance knowledge around Covid-19. 'The world today has a much greater understanding of how easily and quickly this virus can be transmitted, and we are proud to contribute through this collaboration to the global effort to overcome COVID-19,' it said. Who or what is a super spreader? Dr. Sanjay Gupta&#39;s coronavirus podcast for June 18 explains. Who or what is a super spreader? Dr. Sanjay Gupta's coronavirus podcast for June 18 explains. Massachusetts Governor Charlie Baker said in a news conference on Tuesday that he saw the Biogen conference in February as a 'seminal event' in the coronavirus pandemic for the Boston area. 'I was criticized actually for saying a few months ago that the Biogen event was a seminal event with respect to corona here in the Commonwealth and I couldn't put a number on it at that point in time,' Baker said. 'This is no offense to anybody, but at that point in time, nobody was wearing masks, nobody was social distancing, nobody was even behaving with concern about the presence of the virus at all. I mean all rules of the game with respect to that have changed,' Baker said. 'It speaks to the power of that virus to move from one person to another to another.' Get CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team. The new pre-print study also investigated the spread of the coronavirus in other settings across the Boston area, including a skilled nursing facility -- where 85% of residents and 37% of staff tested positive -- and a homeless shelter -- where the coronavirus was introduced seven times, including four that resulted in clusters of cases, according to the study. 'Our findings repeatedly highlight the close relationships between seemingly disconnected groups and populations: viruses from international business travel seeded major outbreaks among individuals experiencing homelessness, spread throughout the Boston area, and were exported to other domestic and international sites,' the researchers wrote in the study.\")\n['elections', 'firearms']\n\n>>> gpt2.gettags(\"Two people died and one person was injured as shots were fired late Tuesday in Kenosha during the third night of unrest in Wisconsin following the shooting of a Black man by police, Kenosha police said. The shooting was reported at about 11:45 p.m. in an area where protests have taken place, Kenosha police Lt. Joseph Nosalik said in a news release. Kenosha County Sheriff David Beth said one victim had been shot in the head and another in the chest late Tuesday, just before midnight, according to the Milwaukee Journal Sentinel. Beth didn’t know where the other person was shot, but his or her injuries are not believed to be life threatening. The shooting was under investigation and no other information was released. The victims have not been identified. Jacob Blake, who was shot shot multiple times by police in Wisconsin, is paralyzed, and it would “take a miracle” for him to walk again, his family’s attorney said Tuesday, while calling for the officer who opened fire to be arrested and others involved to lose their jobs. The shooting of Blake on Sunday in Kenosha — apparently in the back while three of his children looked on — was captured on cellphone video and ignited new protests over racial injustice in several cities, coming just three months after the death of George Floyd at the hands of Minneapolis police touched off a wider reckoning on race. Earlier Tuesday, Blake’s father spoke alongside other family members and lawyers, telling reporters that police shot his son “seven times, seven times, like he didn’t matter.” “But my son matters. He’s a human being and he matters,” said Blake’s father, who is also named Jacob Blake. The 29-year-old was in surgery Tuesday, said attorney Ben Crump, adding that the bullets severed Blake’s spinal cord and shattered his vertebrae. Another attorney said there was also severe damage to organs. “It’s going to take a miracle for Jacob Blake Jr. to ever walk again,” Crump said. The legal team plans to file a civil lawsuit against the police department over the shooting. Police have said little about what happened, other than that they were responding to a domestic dispute. The officers involved have not been named. The Wisconsin Department of Justice is investigating. Police fired tear gas for a third night Tuesday to disperse protesters who had gathered outside Kenosha’s courthouse, where some shook a protective fence and threw water bottles and fireworks at officers lined up behind it. Police then used armored vehicles and officers with shields pushed back the crowd when protesters ignored warnings to leave a nearby park. Wisconsin Gov. Tony Evers had called for calm Tuesday, while also declaring a state of emergency under which he doubled the National Guard deployment in Kenosha from 125 to 250. The night before crowds destroyed dozens of buildings and set more than 30 fires in the city’s downtown. “We cannot allow the cycle of systemic racism and injustice to continue,” said Evers, who is facing mounting pressure from Republicans over his handling of the unrest. “We also cannot continue going down this path of damage and destruction.” Blake’s mother, Julia Jackson, said the damage in Kenosha does not reflect what her family wants and that, if her son could see it, he would be “very unpleased.” She said the first thing her son said to her when she saw him was he was sorry. “He said, ‘I don’t want to be a burden on you guys,’” Jackson said. “’I want to be with my children, and I don’t think I’ll walk again.’” Three of the younger Blake’s sons — aged 3, 5 and 8 — were in the car at the time of the shooting, Crump said. It was the 8-year-old’s birthday, he added. The man who said he made the cellphone video of the shooting, 22-year-old Raysean White, said he saw Blake scuffling with three officers and heard them yell, “Drop the knife! Drop the knife!” before the gunfire erupted. He said he didn’t see a knife in Blake’s hands. In the footage, Blake walks from the sidewalk around the front of his SUV to his driver-side door as officers follow him with their guns drawn and shout at him. As Blake opens the door and leans into the SUV, an officer grabs his shirt from behind and opens fire. Seven shots can be heard, though it isn’t clear how many struck Blake or how many officers fired. Blake’s father told the Chicago Sun-Times that his son had eight holes in his body. Anger over the shooting has spilled into the streets of Kenosha and other cities, including Los Angeles, Wisconsin’s capital of Madison and in Minneapolis, the epicenter of the Black Lives Matter movement this summer following Floyd’s death. Hundreds of people again defied curfew Tuesday in Kenosha, where destruction marred protests the previous night as fires were set and businesses vandalized. There were 34 fires associated with that unrest, with 30 businesses destroyed or damaged along with an unknown number of residences, Kenosha Fire Chief Charles Leipzig told the Kenosha News. “Nobody deserves this,” said Pat Oertle, owner of Computer Adventure, surveying the damage on Tuesday. Computers were stolen, and the store was “destroyed,” she said. “This accomplishes nothing,” Oertle said. “This is not justice that they’re looking for.” U.S. Sen. Ron Johnson and U.S. Rep. Bryan Steil, both Republicans, called on the governor to do more to quell the unrest. Steil said he would request federal assistance if necessary. Evers continued to call for protesters to be peaceful. “Please do not allow the actions of a few distract us from the work we must do together to demand justice, equity, and accountability,” he said. Blake’s family also called for calm. “I really ask you and encourage everyone in Wisconsin and abroad to take a moment and examine your hearts,” Blake’s mother said. “Do Jacob justice on this level and examine your hearts. … As I pray for my son’s healing physically, emotionally and spiritually, I also have been praying even before this for the healing of our country.”\")\n['homosexuality', 'computer software', 'decisions and verdicts', 'libraries and librarians', 'presidential election of 2004', 'computer and video games', 'serial murders']\n```\n\n### getfeatures\n\n_class_ **mitnewsclassify.gpt2.getfeatures**(txt)\n\nGets the output from the saved GPT2 model before it gets fed into the neural network to obtain a classification for a given article text.\n\nParameters\n * txt (`string`) - The article text\n\nReturns\n * features (`Tensor[float32]`) - The 768 values\n\nExample\n```\n>>> from mitnewsclassify import gpt2\n\n>>> gpt2.getfeatures(\"A destructive storm is rising from warm waters. Again. America and the world are getting more frequent and bigger multibillion dollar tropical catastrophes like Hurricane Laura, which is menacing the U.S. Gulf Coast, because of a combination of increased coastal development, natural climate cycles, reductions in air pollution and man-made climate change, experts say. The list of recent whoppers keeps growing: Harvey, Irma, Maria, Florence, Michael, Dorian. And hurricane experts have no doubt that Laura will be right there with them. It’s a mess at least partially of our own making, said Susan Cutter, director of the Hazards and Vulnerability Institute at the University of South Carolina. “We are seeing an increase of intensity of these phenomena because we as a society are fundamentally changing the Earth and at the same time we are moving to locations that are more hazardous,” Cutter said Wednesday. In the last three years, the United States has had seven hurricane disasters that each caused at least $1 billion in damage, totaling $335 billion. In all of the 1980s, there were six, and their damage totaled $38.2 billion, according to the National Oceanic and Atmospheric Administration. All those figures are adjusted for the cost of living. The Atlantic is increasingly spawning more major hurricanes, according to an Associated Press analysis of NOAA hurricane data since 1950. That designation refers to storms with at least 111-mile-per-hour (179-kilometer-per-hour) winds that are the ones that do the most damage. The Atlantic now averages three major hurricanes a year, based on a 30-year running average. In the 1980s and 1990s, it was two. The Atlantic’s Accumulated Cyclone Energy — a measurement that takes into account the number of storms, their strength and how long they last — is now 120 on a 30-year running average. Thirty years ago, it was in the 70s or 80s on average. Some people argue the increase is due to unchecked coastal development, while others will point to man-made climate change from the burning of coal, oil and gas. In fact, both are responsible, said former Federal Emergency Management Agency chief Craig Fugate. “There’s a lot of factors going on,” he said. When it comes to hurricane risk, a major factor is “the amount of stuff in the way of natural peril and the vulnerability of the stuff in the way,” said Mark Bove, a meteorologist who works for the insurance firm Munich Re U.S. One factor that increases the possibility that there will be “stuff in the way” of a major storm is that federal disaster policy and flood insurance subsidize and encourage people to rebuild in risky areas, Fugate said. After storms, communities “always say they are going to rise from the ashes,” and, too often, they build the same way in the same place for the same vulnerability and the same outcome, Fugate said. In addition, some places, like Houston, don’t limit development in areas that could serve as flood control zones if left empty and allow development that’s not disaster resilient, said Kathleen Tierney, former director of the Natural Hazards Center at Colorado University. Now add in the meteorology. Scientists agree that waters are warming, and that serves as hurricane fuel, said NOAA climate scientist Jim Kossin. A study by Kossin found that, once a storm formed, the chances of its attaining major storm status globally increased by 8% a decade since 1979. In the Atlantic, chances went up by 49% a decade. But scientists disagree on why waters are warming. They know climate change is a factor — but they say it’s not the biggest driver and disagree on what else may be behind it. Some argue it’s because of a 25- to 30-year natural global cycle that acts like a giant conveyor belt, carrying different levels of salt and temperature around the globe, including into the part of the tropical Atlantic off Africa where the worst hurricanes form, Colorado State University hurricane researcher Phil Klotzbach said. When the water in the northern Atlantic is extra warm, the water in those tropical hurricane breeding grounds is unusually hot, and the hurricane season is abnormally active, Klotzbach said. Such a busy period started in 1995 and might end soon as northern Atlantic waters shift to a cooler regime, he said. Klotzbach acknowledged that one problem with this theory is that the waters in the northern Atlantic have been unusually cool this summer, and still there have been lots of storms. It may have been a blip, he said. But MIT meteorology professor Kerry Emanuel says it’s because another counterintuitive factor is at play: There are more storms because of cleaner air. European air pollution cooled the area over Africa in the 1960s and 1970s and put more dust into the air — both of which tamped down on any hurricanes, he said. When the pollution eased, Africa got warmer, more storms developed, and that’s why it’s such a busy period, Emanuel said. While climate change is not the most important factor in warming waters, it contributes to creating more damaging storms in other ways, by causing a rising sea level that worsens storm surges and making storms move more slowly and produce more rain, scientists say. All of this means that we should get used to more catastrophic storms, according to Munich Re’s Bove. In addition, he said: “Climate change will be a bigger driver of losses in the future.”\")\ntensor([[ 1.2303e-01,  4.3685e-01,  2.6451e-01, -3.6422e-01, -4.5769e-01,\n          ...\n          6.5585e-01,  6.0992e-01, -1.5914e-01]])\n\n```\n\n## DistilBERT Model\n\nThe DistilBERT model applies [huggingface's](https://huggingface.co/transformers/model_doc/distilbert.html) implementation of [Victor Sanh, Lysandre Debut, Julien Chaumond and Thomas Wolf: “DistilBERT, a distilled version of BERT: smaller, faster, cheaper and lighter”](https://arxiv.org/pdf/1910.01108.pdf), a large transformer-based language model which embeds an entire document into a vector, usually to perform various natural language processing tasks. The model is trained using \\[HYPERPARAMETERS\\], and is saved on our server.\n\nOnce a new article is fed into the DistilBERT model, the article gets embedded through the saved model. The output is then run through a deep neural network to produce the predicted tags for the article. Due to the limits of time, our package does not support gettags at the moment.\n\n32.8 KB of model files will be downloaded (not including huggingface's pretrained model), M MB of RAM will be used on average to run the model and the classification takes P ms.\n\n### getfeatures\n\n_class_ **mitnewsclassify.distilbert.getfeatures**(txt)\n\nGets the values of the second layer in the neural network for a given article text.\n\nParameters\n * txt (`string`) - The article text\n\nReturns\n * features (`Tensor[float32]`) - The 768 values\n\nExample\n```\n>>> from mitnewsclassify import distilbert\n\n>>> distilbert.getfeatures(\"A destructive storm is rising from warm waters. Again. America and the world are getting more frequent and bigger multibillion dollar tropical catastrophes like Hurricane Laura, which is menacing the U.S. Gulf Coast, because of a combination of increased coastal development, natural climate cycles, reductions in air pollution and man-made climate change, experts say. The list of recent whoppers keeps growing: Harvey, Irma, Maria, Florence, Michael, Dorian. And hurricane experts have no doubt that Laura will be right there with them. It’s a mess at least partially of our own making, said Susan Cutter, director of the Hazards and Vulnerability Institute at the University of South Carolina. “We are seeing an increase of intensity of these phenomena because we as a society are fundamentally changing the Earth and at the same time we are moving to locations that are more hazardous,” Cutter said Wednesday. In the last three years, the United States has had seven hurricane disasters that each caused at least $1 billion in damage, totaling $335 billion. In all of the 1980s, there were six, and their damage totaled $38.2 billion, according to the National Oceanic and Atmospheric Administration. All those figures are adjusted for the cost of living. The Atlantic is increasingly spawning more major hurricanes, according to an Associated Press analysis of NOAA hurricane data since 1950. That designation refers to storms with at least 111-mile-per-hour (179-kilometer-per-hour) winds that are the ones that do the most damage. The Atlantic now averages three major hurricanes a year, based on a 30-year running average. In the 1980s and 1990s, it was two. The Atlantic’s Accumulated Cyclone Energy — a measurement that takes into account the number of storms, their strength and how long they last — is now 120 on a 30-year running average. Thirty years ago, it was in the 70s or 80s on average. Some people argue the increase is due to unchecked coastal development, while others will point to man-made climate change from the burning of coal, oil and gas. In fact, both are responsible, said former Federal Emergency Management Agency chief Craig Fugate. “There’s a lot of factors going on,” he said. When it comes to hurricane risk, a major factor is “the amount of stuff in the way of natural peril and the vulnerability of the stuff in the way,” said Mark Bove, a meteorologist who works for the insurance firm Munich Re U.S. One factor that increases the possibility that there will be “stuff in the way” of a major storm is that federal disaster policy and flood insurance subsidize and encourage people to rebuild in risky areas, Fugate said. After storms, communities “always say they are going to rise from the ashes,” and, too often, they build the same way in the same place for the same vulnerability and the same outcome, Fugate said. In addition, some places, like Houston, don’t limit development in areas that could serve as flood control zones if left empty and allow development that’s not disaster resilient, said Kathleen Tierney, former director of the Natural Hazards Center at Colorado University. Now add in the meteorology. Scientists agree that waters are warming, and that serves as hurricane fuel, said NOAA climate scientist Jim Kossin. A study by Kossin found that, once a storm formed, the chances of its attaining major storm status globally increased by 8% a decade since 1979. In the Atlantic, chances went up by 49% a decade. But scientists disagree on why waters are warming. They know climate change is a factor — but they say it’s not the biggest driver and disagree on what else may be behind it. Some argue it’s because of a 25- to 30-year natural global cycle that acts like a giant conveyor belt, carrying different levels of salt and temperature around the globe, including into the part of the tropical Atlantic off Africa where the worst hurricanes form, Colorado State University hurricane researcher Phil Klotzbach said. When the water in the northern Atlantic is extra warm, the water in those tropical hurricane breeding grounds is unusually hot, and the hurricane season is abnormally active, Klotzbach said. Such a busy period started in 1995 and might end soon as northern Atlantic waters shift to a cooler regime, he said. Klotzbach acknowledged that one problem with this theory is that the waters in the northern Atlantic have been unusually cool this summer, and still there have been lots of storms. It may have been a blip, he said. But MIT meteorology professor Kerry Emanuel says it’s because another counterintuitive factor is at play: There are more storms because of cleaner air. European air pollution cooled the area over Africa in the 1960s and 1970s and put more dust into the air — both of which tamped down on any hurricanes, he said. When the pollution eased, Africa got warmer, more storms developed, and that’s why it’s such a busy period, Emanuel said. While climate change is not the most important factor in warming waters, it contributes to creating more damaging storms in other ways, by causing a rising sea level that worsens storm surges and making storms move more slowly and produce more rain, scientists say. All of this means that we should get used to more catastrophic storms, according to Munich Re’s Bove. In addition, he said: “Climate change will be a bigger driver of losses in the future.”\")\ntensor([[ 1.3516e-02, -6.6536e-02, -1.2586e-01,  7.8865e-02,  1.5436e-01,\n          ...\n          4.4400e-02,  1.0047e-01, -8.2776e-02]])\n```\n\n## Ensemble Model (TF-IDF + TF-IDF Bigrams)\n\nThe Ensemble model combines the feature values outputted from two other models, the TF-IDF model and the TF-IDF Bigrams model, in order to obtain a more accurate classification better than each model by itself.\n\nOnce a new article is fed into the Ensemble model, the article gets run through both models, and their outputs are concatenated and then run through two layers of neural network (size 1600 and 800 respectively) to produce the predicted tags for the article.\n\n19.3 MB of model files will be downloaded (not including the two other models), M MB of RAM will be used on average to run the model and the classification takes P ms.\n\n### gettags\n\n_class_ **mitnewsclassify.ensemble.gettags**(txt)\n\nGets the predicted tags for a given article text.\n\nParameters\n * txt (`string`) - The article text\n\nReturns\n * tags (`List[str]`) - The predicted tags\n\nExample\n```\n>>> from mitnewsclassify import ensemble\n\n>>> ensemble.gettags(\"Republicans proceeded with the third night of their national convention, but many Americans — particularly those in the path of Hurricane Laura — were focused on more immediate concerns.\")\n[]\n\n>>> ensemble.gettags(\"The Milwaukee Bucks chose to boycott their Wednesday matchup against the Orlando Magic in protest of the police shooting of Jacob Blake, a 29-year-old Black man, in Wisconsin.\")\n['blacks', 'boycotts']\n\n>>> ensemble.gettags(\"One superspreading event may be connected to about 20,000 Covid-19 cases in the Boston area, a researcher said on Tuesday. That event, a biotech conference attended by 200 people in late February, is now well known as a source of Covid-19 spread very early on in the pandemic. Here is how a virus spreads Here is how a virus spreads 01:45 'Ultimately, more than 90 cases were diagnosed in people associated with this conference or their contacts, raising suspicion that a superspreading event had occurred there,' the researchers wrote in their study. Superspreading occurs when one or a few infected people cause a cascade of transmissions of an infectious disease. The new study -- which has not yet been peer-reviewed but was posted to the online server medrxiv.org on Tuesday -- involved analyzing the impact of early superspreading events in the Boston area and provided 'direct evidence' that superspreading can profoundly alter the course of an epidemic. 'An unfortunate perfect storm' The researchers -- from the Broad Institute of MIT and Harvard in Cambridge and other various institutions -- conducted genetic analyses of coronavirus specimen samples in Massachusetts. The researchers sequenced and analyzed 772 complete genomes of the virus from the region. They found 80 introductions of the virus into the Boston, predominantly from elsewhere in the United States and Europe, and 'hundreds of cases from major outbreaks' in various settings, including the conference. Coronavirus quickly spread around the world starting late last year, new genetic analysis shows Coronavirus quickly spread around the world starting late last year, new genetic analysis shows The conference, held from February 26 to 27, was a 'perfect storm' and the superspreading there could have been connected to approximately 20,000 cases, Bronwyn MacInnis, a researcher at the Broad Institute who worked on the study, told CNN in an email on Tuesday. 'Many factors made the conference an unfortunate perfect storm as a superspreading event. That the virus was introduced at the conference at all was unlucky,' MacInnis wrote in the email. 'This is not a rigorous estimate but does communicate the scale,' MacInnis added. 'If tens of thousands of individuals seems large, it is important to point out that it is in context of a pandemic that has infected tens of millions of people.' Unseen Covid-19 cases began early, spread fast Unseen Covid-19 cases began early, spread fast 03:00 Timing was crucial. In late February, people were not yet aware of the pandemic risk. 'When it happened was critical: it was scheduled just as we were collectively beginning to appreciate the imminent threat of COVID at home--if it had been a week later the event likely would have been cancelled,' MacInnis wrote in the email. 'Also, because it happened early in the epidemic it had the chance to spread widely before extensive testing capacity, shutdowns, social distancing, and masking were in place,' she wrote. 'The other critical factor was the population the virus landed in: people who had come from many different places (including some where COVID was already circulating), and who then returned home, often unknowingly bringing the virus with them.' 'A much greater understanding of how easily and quickly this virus can be transmitted' While the researchers did not identify the conference in their study, The Boston Globe on Tuesday said it was an international meeting of leaders from the biotechnology company Biogen at the Marriott Long Wharf hotel in Boston. How 53 members of this choir were infected in &#39;super spreader&#39; event How 53 members of this choir were infected in 'super spreader' event 03:03 'February 2020 was nearly a half year ago, and was a period when general knowledge about the coronavirus was limited,' Biogen said in a written statement to CNN on Tuesday. 'We were adhering closely to the prevailing official guidelines. We never would have knowingly put anyone at risk. When we learned a number of our colleagues were ill, we did not know the cause was COVID-19, but we immediately notified public health authorities and took steps to limit the spread.' The company noted in its statement that it joined a collaboration with the Broad Institute in April to share biological and medical data to advance knowledge around Covid-19. 'The world today has a much greater understanding of how easily and quickly this virus can be transmitted, and we are proud to contribute through this collaboration to the global effort to overcome COVID-19,' it said. Who or what is a super spreader? Dr. Sanjay Gupta&#39;s coronavirus podcast for June 18 explains. Who or what is a super spreader? Dr. Sanjay Gupta's coronavirus podcast for June 18 explains. Massachusetts Governor Charlie Baker said in a news conference on Tuesday that he saw the Biogen conference in February as a 'seminal event' in the coronavirus pandemic for the Boston area. 'I was criticized actually for saying a few months ago that the Biogen event was a seminal event with respect to corona here in the Commonwealth and I couldn't put a number on it at that point in time,' Baker said. 'This is no offense to anybody, but at that point in time, nobody was wearing masks, nobody was social distancing, nobody was even behaving with concern about the presence of the virus at all. I mean all rules of the game with respect to that have changed,' Baker said. 'It speaks to the power of that virus to move from one person to another to another.' Get CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team. The new pre-print study also investigated the spread of the coronavirus in other settings across the Boston area, including a skilled nursing facility -- where 85% of residents and 37% of staff tested positive -- and a homeless shelter -- where the coronavirus was introduced seven times, including four that resulted in clusters of cases, according to the study. 'Our findings repeatedly highlight the close relationships between seemingly disconnected groups and populations: viruses from international business travel seeded major outbreaks among individuals experiencing homelessness, spread throughout the Boston area, and were exported to other domestic and international sites,' the researchers wrote in the study.\")\n['medicine and health', 'diseases and conditions', 'viruses']\n\n>>> ensemble.gettags(\"Two people died and one person was injured as shots were fired late Tuesday in Kenosha during the third night of unrest in Wisconsin following the shooting of a Black man by police, Kenosha police said. The shooting was reported at about 11:45 p.m. in an area where protests have taken place, Kenosha police Lt. Joseph Nosalik said in a news release. Kenosha County Sheriff David Beth said one victim had been shot in the head and another in the chest late Tuesday, just before midnight, according to the Milwaukee Journal Sentinel. Beth didn’t know where the other person was shot, but his or her injuries are not believed to be life threatening. The shooting was under investigation and no other information was released. The victims have not been identified. Jacob Blake, who was shot shot multiple times by police in Wisconsin, is paralyzed, and it would “take a miracle” for him to walk again, his family’s attorney said Tuesday, while calling for the officer who opened fire to be arrested and others involved to lose their jobs. The shooting of Blake on Sunday in Kenosha — apparently in the back while three of his children looked on — was captured on cellphone video and ignited new protests over racial injustice in several cities, coming just three months after the death of George Floyd at the hands of Minneapolis police touched off a wider reckoning on race. Earlier Tuesday, Blake’s father spoke alongside other family members and lawyers, telling reporters that police shot his son “seven times, seven times, like he didn’t matter.” “But my son matters. He’s a human being and he matters,” said Blake’s father, who is also named Jacob Blake. The 29-year-old was in surgery Tuesday, said attorney Ben Crump, adding that the bullets severed Blake’s spinal cord and shattered his vertebrae. Another attorney said there was also severe damage to organs. “It’s going to take a miracle for Jacob Blake Jr. to ever walk again,” Crump said. The legal team plans to file a civil lawsuit against the police department over the shooting. Police have said little about what happened, other than that they were responding to a domestic dispute. The officers involved have not been named. The Wisconsin Department of Justice is investigating. Police fired tear gas for a third night Tuesday to disperse protesters who had gathered outside Kenosha’s courthouse, where some shook a protective fence and threw water bottles and fireworks at officers lined up behind it. Police then used armored vehicles and officers with shields pushed back the crowd when protesters ignored warnings to leave a nearby park. Wisconsin Gov. Tony Evers had called for calm Tuesday, while also declaring a state of emergency under which he doubled the National Guard deployment in Kenosha from 125 to 250. The night before crowds destroyed dozens of buildings and set more than 30 fires in the city’s downtown. “We cannot allow the cycle of systemic racism and injustice to continue,” said Evers, who is facing mounting pressure from Republicans over his handling of the unrest. “We also cannot continue going down this path of damage and destruction.” Blake’s mother, Julia Jackson, said the damage in Kenosha does not reflect what her family wants and that, if her son could see it, he would be “very unpleased.” She said the first thing her son said to her when she saw him was he was sorry. “He said, ‘I don’t want to be a burden on you guys,’” Jackson said. “’I want to be with my children, and I don’t think I’ll walk again.’” Three of the younger Blake’s sons — aged 3, 5 and 8 — were in the car at the time of the shooting, Crump said. It was the 8-year-old’s birthday, he added. The man who said he made the cellphone video of the shooting, 22-year-old Raysean White, said he saw Blake scuffling with three officers and heard them yell, “Drop the knife! Drop the knife!” before the gunfire erupted. He said he didn’t see a knife in Blake’s hands. In the footage, Blake walks from the sidewalk around the front of his SUV to his driver-side door as officers follow him with their guns drawn and shout at him. As Blake opens the door and leans into the SUV, an officer grabs his shirt from behind and opens fire. Seven shots can be heard, though it isn’t clear how many struck Blake or how many officers fired. Blake’s father told the Chicago Sun-Times that his son had eight holes in his body. Anger over the shooting has spilled into the streets of Kenosha and other cities, including Los Angeles, Wisconsin’s capital of Madison and in Minneapolis, the epicenter of the Black Lives Matter movement this summer following Floyd’s death. Hundreds of people again defied curfew Tuesday in Kenosha, where destruction marred protests the previous night as fires were set and businesses vandalized. There were 34 fires associated with that unrest, with 30 businesses destroyed or damaged along with an unknown number of residences, Kenosha Fire Chief Charles Leipzig told the Kenosha News. “Nobody deserves this,” said Pat Oertle, owner of Computer Adventure, surveying the damage on Tuesday. Computers were stolen, and the store was “destroyed,” she said. “This accomplishes nothing,” Oertle said. “This is not justice that they’re looking for.” U.S. Sen. Ron Johnson and U.S. Rep. Bryan Steil, both Republicans, called on the governor to do more to quell the unrest. Steil said he would request federal assistance if necessary. Evers continued to call for protesters to be peaceful. “Please do not allow the actions of a few distract us from the work we must do together to demand justice, equity, and accountability,” he said. Blake’s family also called for calm. “I really ask you and encourage everyone in Wisconsin and abroad to take a moment and examine your hearts,” Blake’s mother said. “Do Jacob justice on this level and examine your hearts. … As I pray for my son’s healing physically, emotionally and spiritually, I also have been praying even before this for the healing of our country.”\")\n['politics and government', 'demonstrations and riots', 'police', 'violence']\n```\n\n## Trisemble Model (TF-IDF + TF-IDF Bigrams + Doc2Vec)\n\nThe Trisemble model combines the feature values outputted from three other models, the TF-IDF model, the TF-IDF Bigrams model and the Doc2Vec model, in order to obtain a more accurate classification better than each model by itself.\n\nOnce a new article is fed into the Trisemble model, the article gets run through all three models, and their outputs are concatenated and then run through two layers of neural network (size 1600 and 800 respectively) to produce the predicted tags for the article.\n\n55.2 MB of model files will be downloaded (not including the three other models), M MB of RAM will be used on average to run the model and the classification takes P ms.\n\n### gettags\n\n_class_ **mitnewsclassify.trisemble.gettags**(txt)\n\nGets the predicted tags for a given article text.\n\nParameters\n * txt (`string`) - The article text\n\nReturns\n * tags (`List[str]`) - The predicted tags\n\nExample\n```\n>>> from mitnewsclassify import trisemble\n\n>>> trisemble.gettags(\"Republicans proceeded with the third night of their national convention, but many Americans — particularly those in the path of Hurricane Laura — were focused on more immediate concerns.\")\n['conventions and conferences', 'elections', 'presidential elections (us)', 'hurricanes and tropical storms']\n\n>>> trisemble.gettags(\"The Milwaukee Bucks chose to boycott their Wednesday matchup against the Orlando Magic in protest of the police shooting of Jacob Blake, a 29-year-old Black man, in Wisconsin.\")\n['blacks', 'boycotts']\n\n>>> trisemble.gettags(\"One superspreading event may be connected to about 20,000 Covid-19 cases in the Boston area, a researcher said on Tuesday. That event, a biotech conference attended by 200 people in late February, is now well known as a source of Covid-19 spread very early on in the pandemic. Here is how a virus spreads Here is how a virus spreads 01:45 'Ultimately, more than 90 cases were diagnosed in people associated with this conference or their contacts, raising suspicion that a superspreading event had occurred there,' the researchers wrote in their study. Superspreading occurs when one or a few infected people cause a cascade of transmissions of an infectious disease. The new study -- which has not yet been peer-reviewed but was posted to the online server medrxiv.org on Tuesday -- involved analyzing the impact of early superspreading events in the Boston area and provided 'direct evidence' that superspreading can profoundly alter the course of an epidemic. 'An unfortunate perfect storm' The researchers -- from the Broad Institute of MIT and Harvard in Cambridge and other various institutions -- conducted genetic analyses of coronavirus specimen samples in Massachusetts. The researchers sequenced and analyzed 772 complete genomes of the virus from the region. They found 80 introductions of the virus into the Boston, predominantly from elsewhere in the United States and Europe, and 'hundreds of cases from major outbreaks' in various settings, including the conference. Coronavirus quickly spread around the world starting late last year, new genetic analysis shows Coronavirus quickly spread around the world starting late last year, new genetic analysis shows The conference, held from February 26 to 27, was a 'perfect storm' and the superspreading there could have been connected to approximately 20,000 cases, Bronwyn MacInnis, a researcher at the Broad Institute who worked on the study, told CNN in an email on Tuesday. 'Many factors made the conference an unfortunate perfect storm as a superspreading event. That the virus was introduced at the conference at all was unlucky,' MacInnis wrote in the email. 'This is not a rigorous estimate but does communicate the scale,' MacInnis added. 'If tens of thousands of individuals seems large, it is important to point out that it is in context of a pandemic that has infected tens of millions of people.' Unseen Covid-19 cases began early, spread fast Unseen Covid-19 cases began early, spread fast 03:00 Timing was crucial. In late February, people were not yet aware of the pandemic risk. 'When it happened was critical: it was scheduled just as we were collectively beginning to appreciate the imminent threat of COVID at home--if it had been a week later the event likely would have been cancelled,' MacInnis wrote in the email. 'Also, because it happened early in the epidemic it had the chance to spread widely before extensive testing capacity, shutdowns, social distancing, and masking were in place,' she wrote. 'The other critical factor was the population the virus landed in: people who had come from many different places (including some where COVID was already circulating), and who then returned home, often unknowingly bringing the virus with them.' 'A much greater understanding of how easily and quickly this virus can be transmitted' While the researchers did not identify the conference in their study, The Boston Globe on Tuesday said it was an international meeting of leaders from the biotechnology company Biogen at the Marriott Long Wharf hotel in Boston. How 53 members of this choir were infected in &#39;super spreader&#39; event How 53 members of this choir were infected in 'super spreader' event 03:03 'February 2020 was nearly a half year ago, and was a period when general knowledge about the coronavirus was limited,' Biogen said in a written statement to CNN on Tuesday. 'We were adhering closely to the prevailing official guidelines. We never would have knowingly put anyone at risk. When we learned a number of our colleagues were ill, we did not know the cause was COVID-19, but we immediately notified public health authorities and took steps to limit the spread.' The company noted in its statement that it joined a collaboration with the Broad Institute in April to share biological and medical data to advance knowledge around Covid-19. 'The world today has a much greater understanding of how easily and quickly this virus can be transmitted, and we are proud to contribute through this collaboration to the global effort to overcome COVID-19,' it said. Who or what is a super spreader? Dr. Sanjay Gupta&#39;s coronavirus podcast for June 18 explains. Who or what is a super spreader? Dr. Sanjay Gupta's coronavirus podcast for June 18 explains. Massachusetts Governor Charlie Baker said in a news conference on Tuesday that he saw the Biogen conference in February as a 'seminal event' in the coronavirus pandemic for the Boston area. 'I was criticized actually for saying a few months ago that the Biogen event was a seminal event with respect to corona here in the Commonwealth and I couldn't put a number on it at that point in time,' Baker said. 'This is no offense to anybody, but at that point in time, nobody was wearing masks, nobody was social distancing, nobody was even behaving with concern about the presence of the virus at all. I mean all rules of the game with respect to that have changed,' Baker said. 'It speaks to the power of that virus to move from one person to another to another.' Get CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team. The new pre-print study also investigated the spread of the coronavirus in other settings across the Boston area, including a skilled nursing facility -- where 85% of residents and 37% of staff tested positive -- and a homeless shelter -- where the coronavirus was introduced seven times, including four that resulted in clusters of cases, according to the study. 'Our findings repeatedly highlight the close relationships between seemingly disconnected groups and populations: viruses from international business travel seeded major outbreaks among individuals experiencing homelessness, spread throughout the Boston area, and were exported to other domestic and international sites,' the researchers wrote in the study.\")\n['medicine and health', 'diseases and conditions', 'viruses']\n\n>>> trisemble.gettags(\"Two people died and one person was injured as shots were fired late Tuesday in Kenosha during the third night of unrest in Wisconsin following the shooting of a Black man by police, Kenosha police said. The shooting was reported at about 11:45 p.m. in an area where protests have taken place, Kenosha police Lt. Joseph Nosalik said in a news release. Kenosha County Sheriff David Beth said one victim had been shot in the head and another in the chest late Tuesday, just before midnight, according to the Milwaukee Journal Sentinel. Beth didn’t know where the other person was shot, but his or her injuries are not believed to be life threatening. The shooting was under investigation and no other information was released. The victims have not been identified. Jacob Blake, who was shot shot multiple times by police in Wisconsin, is paralyzed, and it would “take a miracle” for him to walk again, his family’s attorney said Tuesday, while calling for the officer who opened fire to be arrested and others involved to lose their jobs. The shooting of Blake on Sunday in Kenosha — apparently in the back while three of his children looked on — was captured on cellphone video and ignited new protests over racial injustice in several cities, coming just three months after the death of George Floyd at the hands of Minneapolis police touched off a wider reckoning on race. Earlier Tuesday, Blake’s father spoke alongside other family members and lawyers, telling reporters that police shot his son “seven times, seven times, like he didn’t matter.” “But my son matters. He’s a human being and he matters,” said Blake’s father, who is also named Jacob Blake. The 29-year-old was in surgery Tuesday, said attorney Ben Crump, adding that the bullets severed Blake’s spinal cord and shattered his vertebrae. Another attorney said there was also severe damage to organs. “It’s going to take a miracle for Jacob Blake Jr. to ever walk again,” Crump said. The legal team plans to file a civil lawsuit against the police department over the shooting. Police have said little about what happened, other than that they were responding to a domestic dispute. The officers involved have not been named. The Wisconsin Department of Justice is investigating. Police fired tear gas for a third night Tuesday to disperse protesters who had gathered outside Kenosha’s courthouse, where some shook a protective fence and threw water bottles and fireworks at officers lined up behind it. Police then used armored vehicles and officers with shields pushed back the crowd when protesters ignored warnings to leave a nearby park. Wisconsin Gov. Tony Evers had called for calm Tuesday, while also declaring a state of emergency under which he doubled the National Guard deployment in Kenosha from 125 to 250. The night before crowds destroyed dozens of buildings and set more than 30 fires in the city’s downtown. “We cannot allow the cycle of systemic racism and injustice to continue,” said Evers, who is facing mounting pressure from Republicans over his handling of the unrest. “We also cannot continue going down this path of damage and destruction.” Blake’s mother, Julia Jackson, said the damage in Kenosha does not reflect what her family wants and that, if her son could see it, he would be “very unpleased.” She said the first thing her son said to her when she saw him was he was sorry. “He said, ‘I don’t want to be a burden on you guys,’” Jackson said. “’I want to be with my children, and I don’t think I’ll walk again.’” Three of the younger Blake’s sons — aged 3, 5 and 8 — were in the car at the time of the shooting, Crump said. It was the 8-year-old’s birthday, he added. The man who said he made the cellphone video of the shooting, 22-year-old Raysean White, said he saw Blake scuffling with three officers and heard them yell, “Drop the knife! Drop the knife!” before the gunfire erupted. He said he didn’t see a knife in Blake’s hands. In the footage, Blake walks from the sidewalk around the front of his SUV to his driver-side door as officers follow him with their guns drawn and shout at him. As Blake opens the door and leans into the SUV, an officer grabs his shirt from behind and opens fire. Seven shots can be heard, though it isn’t clear how many struck Blake or how many officers fired. Blake’s father told the Chicago Sun-Times that his son had eight holes in his body. Anger over the shooting has spilled into the streets of Kenosha and other cities, including Los Angeles, Wisconsin’s capital of Madison and in Minneapolis, the epicenter of the Black Lives Matter movement this summer following Floyd’s death. Hundreds of people again defied curfew Tuesday in Kenosha, where destruction marred protests the previous night as fires were set and businesses vandalized. There were 34 fires associated with that unrest, with 30 businesses destroyed or damaged along with an unknown number of residences, Kenosha Fire Chief Charles Leipzig told the Kenosha News. “Nobody deserves this,” said Pat Oertle, owner of Computer Adventure, surveying the damage on Tuesday. Computers were stolen, and the store was “destroyed,” she said. “This accomplishes nothing,” Oertle said. “This is not justice that they’re looking for.” U.S. Sen. Ron Johnson and U.S. Rep. Bryan Steil, both Republicans, called on the governor to do more to quell the unrest. Steil said he would request federal assistance if necessary. Evers continued to call for protesters to be peaceful. “Please do not allow the actions of a few distract us from the work we must do together to demand justice, equity, and accountability,” he said. Blake’s family also called for calm. “I really ask you and encourage everyone in Wisconsin and abroad to take a moment and examine your hearts,” Blake’s mother said. “Do Jacob justice on this level and examine your hearts. … As I pray for my son’s healing physically, emotionally and spiritually, I also have been praying even before this for the healing of our country.”\")\n['politics and government', 'elections', 'demonstrations and riots', 'police', 'blacks']\n```\n\n## Quadsemble Model (TF-IDF + TF-IDF Bigrams + Doc2Vec + DistilBERT)\n\nThe Quadsemble model combines the feature values outputted from two other models, the TF-IDF model, the TF-IDF Bigrams model, the Doc2Vec model and the DistilBERT model, in order to obtain a more accurate classification better than each model by itself.\n\nOnce a new article is fed into the Ensemble model, the article gets run through all four models, and their outputs are concatenated and then run through two layers of neural network (size 1600 and 800 respectively) to produce the predicted tags for the article.\n\n94.2 MB of model files will be downloaded (not including the two other models), M MB of RAM will be used on average to run the model and the classification takes P ms.\n\n### gettags\n\n_class_ **mitnewsclassify.quadsemble.gettags**(txt)\n\nGets the predicted tags for a given article text.\n\nParameters\n * txt (`string`) - The article text\n\nReturns\n * tags (`List[str]`) - The predicted tags\n\nExample\n```\n>>> from mitnewsclassify import quadsemble\n\n>>> quadsemble.gettags(\"Republicans proceeded with the third night of their national convention, but many Americans — particularly those in the path of Hurricane Laura — were focused on more immediate concerns.\")\n['elections', 'presidents and presidency (us)', 'presidential elections (us)', 'hurricanes and tropical storms', 'presidential election of 2004']\n\n>>> quadsemble.gettags(\"The Milwaukee Bucks chose to boycott their Wednesday matchup against the Orlando Magic in protest of the police shooting of Jacob Blake, a 29-year-old Black man, in Wisconsin.\")\n['blacks', 'boycotts']\n\n>>> quadsemble.gettags(\"One superspreading event may be connected to about 20,000 Covid-19 cases in the Boston area, a researcher said on Tuesday. That event, a biotech conference attended by 200 people in late February, is now well known as a source of Covid-19 spread very early on in the pandemic. Here is how a virus spreads Here is how a virus spreads 01:45 'Ultimately, more than 90 cases were diagnosed in people associated with this conference or their contacts, raising suspicion that a superspreading event had occurred there,' the researchers wrote in their study. Superspreading occurs when one or a few infected people cause a cascade of transmissions of an infectious disease. The new study -- which has not yet been peer-reviewed but was posted to the online server medrxiv.org on Tuesday -- involved analyzing the impact of early superspreading events in the Boston area and provided 'direct evidence' that superspreading can profoundly alter the course of an epidemic. 'An unfortunate perfect storm' The researchers -- from the Broad Institute of MIT and Harvard in Cambridge and other various institutions -- conducted genetic analyses of coronavirus specimen samples in Massachusetts. The researchers sequenced and analyzed 772 complete genomes of the virus from the region. They found 80 introductions of the virus into the Boston, predominantly from elsewhere in the United States and Europe, and 'hundreds of cases from major outbreaks' in various settings, including the conference. Coronavirus quickly spread around the world starting late last year, new genetic analysis shows Coronavirus quickly spread around the world starting late last year, new genetic analysis shows The conference, held from February 26 to 27, was a 'perfect storm' and the superspreading there could have been connected to approximately 20,000 cases, Bronwyn MacInnis, a researcher at the Broad Institute who worked on the study, told CNN in an email on Tuesday. 'Many factors made the conference an unfortunate perfect storm as a superspreading event. That the virus was introduced at the conference at all was unlucky,' MacInnis wrote in the email. 'This is not a rigorous estimate but does communicate the scale,' MacInnis added. 'If tens of thousands of individuals seems large, it is important to point out that it is in context of a pandemic that has infected tens of millions of people.' Unseen Covid-19 cases began early, spread fast Unseen Covid-19 cases began early, spread fast 03:00 Timing was crucial. In late February, people were not yet aware of the pandemic risk. 'When it happened was critical: it was scheduled just as we were collectively beginning to appreciate the imminent threat of COVID at home--if it had been a week later the event likely would have been cancelled,' MacInnis wrote in the email. 'Also, because it happened early in the epidemic it had the chance to spread widely before extensive testing capacity, shutdowns, social distancing, and masking were in place,' she wrote. 'The other critical factor was the population the virus landed in: people who had come from many different places (including some where COVID was already circulating), and who then returned home, often unknowingly bringing the virus with them.' 'A much greater understanding of how easily and quickly this virus can be transmitted' While the researchers did not identify the conference in their study, The Boston Globe on Tuesday said it was an international meeting of leaders from the biotechnology company Biogen at the Marriott Long Wharf hotel in Boston. How 53 members of this choir were infected in &#39;super spreader&#39; event How 53 members of this choir were infected in 'super spreader' event 03:03 'February 2020 was nearly a half year ago, and was a period when general knowledge about the coronavirus was limited,' Biogen said in a written statement to CNN on Tuesday. 'We were adhering closely to the prevailing official guidelines. We never would have knowingly put anyone at risk. When we learned a number of our colleagues were ill, we did not know the cause was COVID-19, but we immediately notified public health authorities and took steps to limit the spread.' The company noted in its statement that it joined a collaboration with the Broad Institute in April to share biological and medical data to advance knowledge around Covid-19. 'The world today has a much greater understanding of how easily and quickly this virus can be transmitted, and we are proud to contribute through this collaboration to the global effort to overcome COVID-19,' it said. Who or what is a super spreader? Dr. Sanjay Gupta&#39;s coronavirus podcast for June 18 explains. Who or what is a super spreader? Dr. Sanjay Gupta's coronavirus podcast for June 18 explains. Massachusetts Governor Charlie Baker said in a news conference on Tuesday that he saw the Biogen conference in February as a 'seminal event' in the coronavirus pandemic for the Boston area. 'I was criticized actually for saying a few months ago that the Biogen event was a seminal event with respect to corona here in the Commonwealth and I couldn't put a number on it at that point in time,' Baker said. 'This is no offense to anybody, but at that point in time, nobody was wearing masks, nobody was social distancing, nobody was even behaving with concern about the presence of the virus at all. I mean all rules of the game with respect to that have changed,' Baker said. 'It speaks to the power of that virus to move from one person to another to another.' Get CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team. The new pre-print study also investigated the spread of the coronavirus in other settings across the Boston area, including a skilled nursing facility -- where 85% of residents and 37% of staff tested positive -- and a homeless shelter -- where the coronavirus was introduced seven times, including four that resulted in clusters of cases, according to the study. 'Our findings repeatedly highlight the close relationships between seemingly disconnected groups and populations: viruses from international business travel seeded major outbreaks among individuals experiencing homelessness, spread throughout the Boston area, and were exported to other domestic and international sites,' the researchers wrote in the study.\")\n['medicine and health', 'diseases and conditions', 'viruses']\n\n>>> quadsemble.gettags(\"Two people died and one person was injured as shots were fired late Tuesday in Kenosha during the third night of unrest in Wisconsin following the shooting of a Black man by police, Kenosha police said. The shooting was reported at about 11:45 p.m. in an area where protests have taken place, Kenosha police Lt. Joseph Nosalik said in a news release. Kenosha County Sheriff David Beth said one victim had been shot in the head and another in the chest late Tuesday, just before midnight, according to the Milwaukee Journal Sentinel. Beth didn’t know where the other person was shot, but his or her injuries are not believed to be life threatening. The shooting was under investigation and no other information was released. The victims have not been identified. Jacob Blake, who was shot shot multiple times by police in Wisconsin, is paralyzed, and it would “take a miracle” for him to walk again, his family’s attorney said Tuesday, while calling for the officer who opened fire to be arrested and others involved to lose their jobs. The shooting of Blake on Sunday in Kenosha — apparently in the back while three of his children looked on — was captured on cellphone video and ignited new protests over racial injustice in several cities, coming just three months after the death of George Floyd at the hands of Minneapolis police touched off a wider reckoning on race. Earlier Tuesday, Blake’s father spoke alongside other family members and lawyers, telling reporters that police shot his son “seven times, seven times, like he didn’t matter.” “But my son matters. He’s a human being and he matters,” said Blake’s father, who is also named Jacob Blake. The 29-year-old was in surgery Tuesday, said attorney Ben Crump, adding that the bullets severed Blake’s spinal cord and shattered his vertebrae. Another attorney said there was also severe damage to organs. “It’s going to take a miracle for Jacob Blake Jr. to ever walk again,” Crump said. The legal team plans to file a civil lawsuit against the police department over the shooting. Police have said little about what happened, other than that they were responding to a domestic dispute. The officers involved have not been named. The Wisconsin Department of Justice is investigating. Police fired tear gas for a third night Tuesday to disperse protesters who had gathered outside Kenosha’s courthouse, where some shook a protective fence and threw water bottles and fireworks at officers lined up behind it. Police then used armored vehicles and officers with shields pushed back the crowd when protesters ignored warnings to leave a nearby park. Wisconsin Gov. Tony Evers had called for calm Tuesday, while also declaring a state of emergency under which he doubled the National Guard deployment in Kenosha from 125 to 250. The night before crowds destroyed dozens of buildings and set more than 30 fires in the city’s downtown. “We cannot allow the cycle of systemic racism and injustice to continue,” said Evers, who is facing mounting pressure from Republicans over his handling of the unrest. “We also cannot continue going down this path of damage and destruction.” Blake’s mother, Julia Jackson, said the damage in Kenosha does not reflect what her family wants and that, if her son could see it, he would be “very unpleased.” She said the first thing her son said to her when she saw him was he was sorry. “He said, ‘I don’t want to be a burden on you guys,’” Jackson said. “’I want to be with my children, and I don’t think I’ll walk again.’” Three of the younger Blake’s sons — aged 3, 5 and 8 — were in the car at the time of the shooting, Crump said. It was the 8-year-old’s birthday, he added. The man who said he made the cellphone video of the shooting, 22-year-old Raysean White, said he saw Blake scuffling with three officers and heard them yell, “Drop the knife! Drop the knife!” before the gunfire erupted. He said he didn’t see a knife in Blake’s hands. In the footage, Blake walks from the sidewalk around the front of his SUV to his driver-side door as officers follow him with their guns drawn and shout at him. As Blake opens the door and leans into the SUV, an officer grabs his shirt from behind and opens fire. Seven shots can be heard, though it isn’t clear how many struck Blake or how many officers fired. Blake’s father told the Chicago Sun-Times that his son had eight holes in his body. Anger over the shooting has spilled into the streets of Kenosha and other cities, including Los Angeles, Wisconsin’s capital of Madison and in Minneapolis, the epicenter of the Black Lives Matter movement this summer following Floyd’s death. Hundreds of people again defied curfew Tuesday in Kenosha, where destruction marred protests the previous night as fires were set and businesses vandalized. There were 34 fires associated with that unrest, with 30 businesses destroyed or damaged along with an unknown number of residences, Kenosha Fire Chief Charles Leipzig told the Kenosha News. “Nobody deserves this,” said Pat Oertle, owner of Computer Adventure, surveying the damage on Tuesday. Computers were stolen, and the store was “destroyed,” she said. “This accomplishes nothing,” Oertle said. “This is not justice that they’re looking for.” U.S. Sen. Ron Johnson and U.S. Rep. Bryan Steil, both Republicans, called on the governor to do more to quell the unrest. Steil said he would request federal assistance if necessary. Evers continued to call for protesters to be peaceful. “Please do not allow the actions of a few distract us from the work we must do together to demand justice, equity, and accountability,” he said. Blake’s family also called for calm. “I really ask you and encourage everyone in Wisconsin and abroad to take a moment and examine your hearts,” Blake’s mother said. “Do Jacob justice on this level and examine your hearts. … As I pray for my son’s healing physically, emotionally and spiritually, I also have been praying even before this for the healing of our country.”\")\n['politics and government', 'elections', 'demonstrations and riots', 'police', 'blacks', 'police brutality and misconduct']\n\n>>> quadsemble.gettags(\"A destructive storm is rising from warm waters. Again. America and the world are getting more frequent and bigger multibillion dollar tropical catastrophes like Hurricane Laura, which is menacing the U.S. Gulf Coast, because of a combination of increased coastal development, natural climate cycles, reductions in air pollution and man-made climate change, experts say. The list of recent whoppers keeps growing: Harvey, Irma, Maria, Florence, Michael, Dorian. And hurricane experts have no doubt that Laura will be right there with them. It’s a mess at least partially of our own making, said Susan Cutter, director of the Hazards and Vulnerability Institute at the University of South Carolina. “We are seeing an increase of intensity of these phenomena because we as a society are fundamentally changing the Earth and at the same time we are moving to locations that are more hazardous,” Cutter said Wednesday. In the last three years, the United States has had seven hurricane disasters that each caused at least $1 billion in damage, totaling $335 billion. In all of the 1980s, there were six, and their damage totaled $38.2 billion, according to the National Oceanic and Atmospheric Administration. All those figures are adjusted for the cost of living. The Atlantic is increasingly spawning more major hurricanes, according to an Associated Press analysis of NOAA hurricane data since 1950. That designation refers to storms with at least 111-mile-per-hour (179-kilometer-per-hour) winds that are the ones that do the most damage. The Atlantic now averages three major hurricanes a year, based on a 30-year running average. In the 1980s and 1990s, it was two. The Atlantic’s Accumulated Cyclone Energy — a measurement that takes into account the number of storms, their strength and how long they last — is now 120 on a 30-year running average. Thirty years ago, it was in the 70s or 80s on average. Some people argue the increase is due to unchecked coastal development, while others will point to man-made climate change from the burning of coal, oil and gas. In fact, both are responsible, said former Federal Emergency Management Agency chief Craig Fugate. “There’s a lot of factors going on,” he said. When it comes to hurricane risk, a major factor is “the amount of stuff in the way of natural peril and the vulnerability of the stuff in the way,” said Mark Bove, a meteorologist who works for the insurance firm Munich Re U.S. One factor that increases the possibility that there will be “stuff in the way” of a major storm is that federal disaster policy and flood insurance subsidize and encourage people to rebuild in risky areas, Fugate said. After storms, communities “always say they are going to rise from the ashes,” and, too often, they build the same way in the same place for the same vulnerability and the same outcome, Fugate said. In addition, some places, like Houston, don’t limit development in areas that could serve as flood control zones if left empty and allow development that’s not disaster resilient, said Kathleen Tierney, former director of the Natural Hazards Center at Colorado University. Now add in the meteorology. Scientists agree that waters are warming, and that serves as hurricane fuel, said NOAA climate scientist Jim Kossin. A study by Kossin found that, once a storm formed, the chances of its attaining major storm status globally increased by 8% a decade since 1979. In the Atlantic, chances went up by 49% a decade. But scientists disagree on why waters are warming. They know climate change is a factor — but they say it’s not the biggest driver and disagree on what else may be behind it. Some argue it’s because of a 25- to 30-year natural global cycle that acts like a giant conveyor belt, carrying different levels of salt and temperature around the globe, including into the part of the tropical Atlantic off Africa where the worst hurricanes form, Colorado State University hurricane researcher Phil Klotzbach said. When the water in the northern Atlantic is extra warm, the water in those tropical hurricane breeding grounds is unusually hot, and the hurricane season is abnormally active, Klotzbach said. Such a busy period started in 1995 and might end soon as northern Atlantic waters shift to a cooler regime, he said. Klotzbach acknowledged that one problem with this theory is that the waters in the northern Atlantic have been unusually cool this summer, and still there have been lots of storms. It may have been a blip, he said. But MIT meteorology professor Kerry Emanuel says it’s because another counterintuitive factor is at play: There are more storms because of cleaner air. European air pollution cooled the area over Africa in the 1960s and 1970s and put more dust into the air — both of which tamped down on any hurricanes, he said. When the pollution eased, Africa got warmer, more storms developed, and that’s why it’s such a busy period, Emanuel said. While climate change is not the most important factor in warming waters, it contributes to creating more damaging storms in other ways, by causing a rising sea level that worsens storm surges and making storms move more slowly and produce more rain, scientists say. All of this means that we should get used to more catastrophic storms, according to Munich Re’s Bove. In addition, he said: “Climate change will be a bigger driver of losses in the future.”\")\n['weather', 'hurricanes and tropical storms', 'global warming']\n```\n\n## Download Class\n\nThe Download class is a supplement to all the models, and is intrinsically called upon by each model if the model files have not been downloaded onto the user's storage. Should there be any problems during the intrinsic calls, the user can call the download class explicitly to get the same desired outcome.\n\n### download\n\n_class_ **mitnewsclassify.download.download**(model=None)\n\nDownloads the model files for a given model.\n\nParameters\n * model (`string`) - The model to be downloaded onto the user's storage. Default value is None and all models will be downloaded. Use `tfidf` for the TF-IDF model, `tfidf_bi` for the TF-IDF Bigrams model, `doc2vec` for the Doc2Vec model, `gpt2` for the GPT2 model, `distilbert` for the DistilBERT model, `ensemble` for the Ensemble model, `trisemble` for the trisemble model and `quadsemble` for the quadsemble model.\n\nExample\n```\n>>> from mitnewsclassify import download\n\n>>> download.download('tfidf')\n```\n\n## Aliases\n\nFor ease of use, the user can also call on models by their aliases. This part was suggested by Prof. Max Tegmark.\n\n### lite\n\n_class_ **mitnewsclassify.lite**(txt)\n\nCalls `mitnewsclassify.ensemble.gettags`.\n\nParameters\n * txt (`string`) - The article text\n\nReturns\n * tags (`List[str]`) - The predicted tags\n\n### medium\n\n_class_ **mitnewsclassify.medium**(txt)\n\nCalls `mitnewsclassify.trisemble.gettags`.\n\nParameters\n * txt (`string`) - The article text\n\nReturns\n * tags (`List[str]`) - The predicted tags\n\n### badass\n\n_class_ **mitnewsclassify.badass**(txt)\n\nCalls `mitnewsclassify.quadsemble.gettags`.\n\nParameters\n * txt (`string`) - The article text\n\nReturns\n * tags (`List[str]`) - The predicted tags\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://www.improvethenews.org/",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "mit-news-classify",
    "package_url": "https://pypi.org/project/mit-news-classify/",
    "platform": "",
    "project_url": "https://pypi.org/project/mit-news-classify/",
    "project_urls": {
      "Homepage": "https://www.improvethenews.org/"
    },
    "release_url": "https://pypi.org/project/mit-news-classify/0.10.1.3/",
    "requires_dist": [
      "tensorflow (>=2.1)",
      "sklearn",
      "gensim (==3.8.3)",
      "transformers",
      "torch",
      "numpy",
      "tqdm"
    ],
    "requires_python": ">=3.6",
    "summary": "A news classification tool developed for Improve the News, a project by Max Tegmark",
    "version": "0.10.1.3",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 11367803,
  "releases": {
    "0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "228bed9b422fdc097eb733bd1a753d7fb4c2ba2ecc6aa7fb5b81f9497b1fbd64",
          "md5": "30c340064e1233f0b19599e4cc4d4c18",
          "sha256": "59469e78e8d489e50b533a66e6b337e3d2ec45f8ae5ba68cd731ea5bbd3cb8cc"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "30c340064e1233f0b19599e4cc4d4c18",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 3863,
        "upload_time": "2020-08-14T14:37:58",
        "upload_time_iso_8601": "2020-08-14T14:37:58.105742Z",
        "url": "https://files.pythonhosted.org/packages/22/8b/ed9b422fdc097eb733bd1a753d7fb4c2ba2ecc6aa7fb5b81f9497b1fbd64/mit_news_classify-0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a8d8c9de60e4befc9a1e09c7a0574d46c3412ee48082fa17aa95f3b44cb75efc",
          "md5": "70d9b38c53ff8bbace615f42758726c0",
          "sha256": "5076ab22bc820b39f4db99cd26202a0f8713f52379bb71c8b741559f0cc5664e"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "70d9b38c53ff8bbace615f42758726c0",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 2242,
        "upload_time": "2020-08-14T14:38:00",
        "upload_time_iso_8601": "2020-08-14T14:38:00.844145Z",
        "url": "https://files.pythonhosted.org/packages/a8/d8/c9de60e4befc9a1e09c7a0574d46c3412ee48082fa17aa95f3b44cb75efc/mit-news-classify-0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6961604ced210129b4f24fb519fd06918a633895f4efafb0b6df45889491b9c0",
          "md5": "481477bcc5f0b1036c260b0dcdb7bd73",
          "sha256": "92926a0f9d5a4c94c6c721103fbf07fd47c13a62e71b1bc0b610184ec36f162c"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "481477bcc5f0b1036c260b0dcdb7bd73",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 3899,
        "upload_time": "2020-08-17T10:18:37",
        "upload_time_iso_8601": "2020-08-17T10:18:37.340033Z",
        "url": "https://files.pythonhosted.org/packages/69/61/604ced210129b4f24fb519fd06918a633895f4efafb0b6df45889491b9c0/mit_news_classify-0.1.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "069cad0f033019fe9a533085395f799e0fdfb4cf8194b494d91e4ede8c826bea",
          "md5": "4675f34bbe35f25ea0adf3792dfa3bf0",
          "sha256": "e0d2ee52d9b21a93fd7083ed6840e41e96024bdbfd6e5c85b457a5e448c09312"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "4675f34bbe35f25ea0adf3792dfa3bf0",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 2554,
        "upload_time": "2020-08-17T10:18:38",
        "upload_time_iso_8601": "2020-08-17T10:18:38.822868Z",
        "url": "https://files.pythonhosted.org/packages/06/9c/ad0f033019fe9a533085395f799e0fdfb4cf8194b494d91e4ede8c826bea/mit-news-classify-0.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7a180aabd089d6375db580becf0f82a8020f52e7b529dc3dee9fc26733e9e18c",
          "md5": "42f794167163888b0ab9eaa38b1bc461",
          "sha256": "9ecec7589546610a3d020d131196ee6350e62cba73204a0d2cf765b305d18343"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.1.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "42f794167163888b0ab9eaa38b1bc461",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 3909,
        "upload_time": "2020-08-17T10:39:33",
        "upload_time_iso_8601": "2020-08-17T10:39:33.807367Z",
        "url": "https://files.pythonhosted.org/packages/7a/18/0aabd089d6375db580becf0f82a8020f52e7b529dc3dee9fc26733e9e18c/mit_news_classify-0.1.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "294287881985ab255f2bbcb1a577ce83d55926b67e9a71a3aca1d0f1c13c5134",
          "md5": "f9708959db6ee527d0b6afdd382de150",
          "sha256": "72906d00c2ab8bbbc8bb4f6731e50c2e297932078252c41e685340e42639edf0"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "f9708959db6ee527d0b6afdd382de150",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 2569,
        "upload_time": "2020-08-17T10:39:35",
        "upload_time_iso_8601": "2020-08-17T10:39:35.247583Z",
        "url": "https://files.pythonhosted.org/packages/29/42/87881985ab255f2bbcb1a577ce83d55926b67e9a71a3aca1d0f1c13c5134/mit-news-classify-0.1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.10": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2402fa777566b471d8c67703c23febcee461a8f5c281c9a1f8a2fcd737f39ae3",
          "md5": "661c14d992bf18517e70516acf4c068f",
          "sha256": "f03f271b1709c07dfeb5f513afbafa3ff134819887a9992569f72e79ddb0b405"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.10-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "661c14d992bf18517e70516acf4c068f",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 33694,
        "upload_time": "2021-05-12T15:53:46",
        "upload_time_iso_8601": "2021-05-12T15:53:46.558995Z",
        "url": "https://files.pythonhosted.org/packages/24/02/fa777566b471d8c67703c23febcee461a8f5c281c9a1f8a2fcd737f39ae3/mit_news_classify-0.10-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "bbae77beb83d4ddb6163e2c92366ce4603990d735c24c6152ce6af843a054638",
          "md5": "bfe91fda8a18a4efc169f37d70544fd8",
          "sha256": "3fb3668629bc2062ed34c164574b8a07df61bf5ce4d469ebaf88279f06f2b1b4"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.10.tar.gz",
        "has_sig": false,
        "md5_digest": "bfe91fda8a18a4efc169f37d70544fd8",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 37749,
        "upload_time": "2021-05-12T15:53:47",
        "upload_time_iso_8601": "2021-05-12T15:53:47.869209Z",
        "url": "https://files.pythonhosted.org/packages/bb/ae/77beb83d4ddb6163e2c92366ce4603990d735c24c6152ce6af843a054638/mit-news-classify-0.10.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.10.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "be8b270ae906208bc6e3d26097694bccae64ba4940a49e1b2fd061485a787485",
          "md5": "72360d2f6143a35661e4de087891eef6",
          "sha256": "d764fab2a653b24d45f11c5c939bb2a38e5ee742796e3e481b69747541a58b25"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.10.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "72360d2f6143a35661e4de087891eef6",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 33729,
        "upload_time": "2021-05-12T16:30:28",
        "upload_time_iso_8601": "2021-05-12T16:30:28.088279Z",
        "url": "https://files.pythonhosted.org/packages/be/8b/270ae906208bc6e3d26097694bccae64ba4940a49e1b2fd061485a787485/mit_news_classify-0.10.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3d53a20477ffdae3b0f51bb51774709005b63828c8447f459c070401a04c16ef",
          "md5": "17bae00aae38e2c961d77255d6f2e432",
          "sha256": "e7efa28af2cb30d7f0e14cc7a61aa7f30b4a54ca8984a98cbef0897237839eab"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.10.1.tar.gz",
        "has_sig": false,
        "md5_digest": "17bae00aae38e2c961d77255d6f2e432",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 37762,
        "upload_time": "2021-05-12T16:30:29",
        "upload_time_iso_8601": "2021-05-12T16:30:29.525697Z",
        "url": "https://files.pythonhosted.org/packages/3d/53/a20477ffdae3b0f51bb51774709005b63828c8447f459c070401a04c16ef/mit-news-classify-0.10.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.10.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "37e0f98e668da4e2bdaa8a8f2c1540216b73cf31a3176f184f5657c82d2befa7",
          "md5": "2417bec697c3d718b5c8bb992013ca3b",
          "sha256": "bbd56537ad7b84c46215d274d405590e9532f73b1dee0000287f769a5420b406"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.10.1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "2417bec697c3d718b5c8bb992013ca3b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 33769,
        "upload_time": "2021-05-12T16:33:59",
        "upload_time_iso_8601": "2021-05-12T16:33:59.936315Z",
        "url": "https://files.pythonhosted.org/packages/37/e0/f98e668da4e2bdaa8a8f2c1540216b73cf31a3176f184f5657c82d2befa7/mit_news_classify-0.10.1.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f408f07f396e1fe9592364262865b18147342356f5e369b048d5af8ffac235ee",
          "md5": "4620d87763f168f7dceb28e6a1ffe935",
          "sha256": "f0765551cbbffe547265f76a7df9ef7c496628361bf40f39a88b1e69e01843b5"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.10.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "4620d87763f168f7dceb28e6a1ffe935",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 37793,
        "upload_time": "2021-05-12T16:34:01",
        "upload_time_iso_8601": "2021-05-12T16:34:01.188731Z",
        "url": "https://files.pythonhosted.org/packages/f4/08/f07f396e1fe9592364262865b18147342356f5e369b048d5af8ffac235ee/mit-news-classify-0.10.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.10.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1ce39450d714525559e82867b70ea6cff08301450ded0dd1e2b3568100129836",
          "md5": "2bfa54ce2306e23c44402eef84b1b5fd",
          "sha256": "67cb425a39084bbc12fc7a648d16c25cc90b1f1f2a69cc923afbeaa61a384bb4"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.10.1.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "2bfa54ce2306e23c44402eef84b1b5fd",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 33882,
        "upload_time": "2021-05-12T16:37:09",
        "upload_time_iso_8601": "2021-05-12T16:37:09.244919Z",
        "url": "https://files.pythonhosted.org/packages/1c/e3/9450d714525559e82867b70ea6cff08301450ded0dd1e2b3568100129836/mit_news_classify-0.10.1.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d325700808eca0582f210296015bbf36dbece153735a29f168203e1e17bdfa8b",
          "md5": "eb5cfdf559de2e9a6d3509529d326441",
          "sha256": "155c756d20c05c5a0b2253856f793de62020dbbee90c58a16ef768c43fd8ae62"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.10.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "eb5cfdf559de2e9a6d3509529d326441",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 37886,
        "upload_time": "2021-05-12T16:37:10",
        "upload_time_iso_8601": "2021-05-12T16:37:10.728017Z",
        "url": "https://files.pythonhosted.org/packages/d3/25/700808eca0582f210296015bbf36dbece153735a29f168203e1e17bdfa8b/mit-news-classify-0.10.1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.10.1.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6ad9839668d0d834dad9ec0c717d051ccbcf324d1df132e21fa1f7e26e81fe74",
          "md5": "484cd21a8b1ddbbb8b7c954bf1edf2de",
          "sha256": "ebdb6aa06a510c415d723cc1acb03c051d722d4f372a3d03de6bbff8874e435c"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.10.1.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "484cd21a8b1ddbbb8b7c954bf1edf2de",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 33879,
        "upload_time": "2021-05-12T17:04:54",
        "upload_time_iso_8601": "2021-05-12T17:04:54.657116Z",
        "url": "https://files.pythonhosted.org/packages/6a/d9/839668d0d834dad9ec0c717d051ccbcf324d1df132e21fa1f7e26e81fe74/mit_news_classify-0.10.1.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "26386d825b8ee121c707d40be5eb3d9d38af38e4c833f145799068098fc0a821",
          "md5": "e10971d02cd9451d3b5a5a5b84ad9ab5",
          "sha256": "91df2f2616dcc9b8128dcbe964003b9abdc4e104552654f6ef6f8e0195d89fa7"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.10.1.3.tar.gz",
        "has_sig": false,
        "md5_digest": "e10971d02cd9451d3b5a5a5b84ad9ab5",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 37889,
        "upload_time": "2021-05-12T17:04:56",
        "upload_time_iso_8601": "2021-05-12T17:04:56.288144Z",
        "url": "https://files.pythonhosted.org/packages/26/38/6d825b8ee121c707d40be5eb3d9d38af38e4c833f145799068098fc0a821/mit-news-classify-0.10.1.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a64f1d120fcf33aad075fc83bafff23ca88519329e8ee68a01d4fb535cb3058c",
          "md5": "ea16884464642e63379ba7b87745b869",
          "sha256": "97733a8df84c83d2e963c23f9e71c138c1f114f858f45008e5050851cb62b884"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "ea16884464642e63379ba7b87745b869",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 9467,
        "upload_time": "2020-08-20T10:34:18",
        "upload_time_iso_8601": "2020-08-20T10:34:18.522279Z",
        "url": "https://files.pythonhosted.org/packages/a6/4f/1d120fcf33aad075fc83bafff23ca88519329e8ee68a01d4fb535cb3058c/mit_news_classify-0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "205fb6016c370bd87c7aee0c1331281edfc60045840ea4a8085c993149ce6b96",
          "md5": "aafe288bfbbdb3639f11042c78e07ca9",
          "sha256": "14e5e2684969836c031df63c9fece02d24cbdbf41f4473ff4ac54a22bb5f93b2"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "aafe288bfbbdb3639f11042c78e07ca9",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 4798,
        "upload_time": "2020-08-20T10:34:20",
        "upload_time_iso_8601": "2020-08-20T10:34:20.305276Z",
        "url": "https://files.pythonhosted.org/packages/20/5f/b6016c370bd87c7aee0c1331281edfc60045840ea4a8085c993149ce6b96/mit-news-classify-0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ae00b15d71664c723a42685f54c8ac2d76522038bb0a66decd7726a48cb15b9f",
          "md5": "9d85d0ca16b5e06642a6b0983457c477",
          "sha256": "168f617c6f55869998901f99a90bc1d6e462a11f98eac509d1e1ab883486cbb7"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.2.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "9d85d0ca16b5e06642a6b0983457c477",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 9496,
        "upload_time": "2020-08-20T10:43:55",
        "upload_time_iso_8601": "2020-08-20T10:43:55.098224Z",
        "url": "https://files.pythonhosted.org/packages/ae/00/b15d71664c723a42685f54c8ac2d76522038bb0a66decd7726a48cb15b9f/mit_news_classify-0.2.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9d93f1823ce5f9b409dd54e2ee0b44a7cd2757554c0d4ca5ba2605d107cd71f3",
          "md5": "da5dfdcc5d782a177d310d2250f59447",
          "sha256": "faeed40145707fb5da7d63a21c9681703b2fab184f4746513f78dc04965b84a6"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.2.1.tar.gz",
        "has_sig": false,
        "md5_digest": "da5dfdcc5d782a177d310d2250f59447",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 4790,
        "upload_time": "2020-08-20T10:43:56",
        "upload_time_iso_8601": "2020-08-20T10:43:56.441504Z",
        "url": "https://files.pythonhosted.org/packages/9d/93/f1823ce5f9b409dd54e2ee0b44a7cd2757554c0d4ca5ba2605d107cd71f3/mit-news-classify-0.2.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.10": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "cc0be15b7ec52a32f260537afdd8d73c291898079e622af6b90cfaeae4c8d59d",
          "md5": "b74e3e1ea3e2d16e40ea1021a0c470da",
          "sha256": "d9b280e35aa4f133da4fea1fd15fb5f32604f6fea2359c235c596155788d2062"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.2.10-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "b74e3e1ea3e2d16e40ea1021a0c470da",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 10705,
        "upload_time": "2020-08-21T10:39:52",
        "upload_time_iso_8601": "2020-08-21T10:39:52.421224Z",
        "url": "https://files.pythonhosted.org/packages/cc/0b/e15b7ec52a32f260537afdd8d73c291898079e622af6b90cfaeae4c8d59d/mit_news_classify-0.2.10-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d432c0345479811ce52c5d3d1a65bd23c7c89e53e9820a827e791f1d3e6940c3",
          "md5": "1835684ecb5239e79dc44b127cf24a7f",
          "sha256": "cb30d92835981828f030d75778647be45321091180b794f1493d1d926b3b9da5"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.2.10.tar.gz",
        "has_sig": false,
        "md5_digest": "1835684ecb5239e79dc44b127cf24a7f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 5870,
        "upload_time": "2020-08-21T10:39:53",
        "upload_time_iso_8601": "2020-08-21T10:39:53.907136Z",
        "url": "https://files.pythonhosted.org/packages/d4/32/c0345479811ce52c5d3d1a65bd23c7c89e53e9820a827e791f1d3e6940c3/mit-news-classify-0.2.10.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3b4204f19f51ca706d2465aee45651082031db5ee6150fd6153cb28b11139dee",
          "md5": "f62e8da8c31e262f1070b22901509fbc",
          "sha256": "cac8fcad0a5a6b11d1719656b74d5ea9895c18ea013f2bc828b387ad2c69e623"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.2.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "f62e8da8c31e262f1070b22901509fbc",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 9546,
        "upload_time": "2020-08-20T11:00:02",
        "upload_time_iso_8601": "2020-08-20T11:00:02.915173Z",
        "url": "https://files.pythonhosted.org/packages/3b/42/04f19f51ca706d2465aee45651082031db5ee6150fd6153cb28b11139dee/mit_news_classify-0.2.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8e6541548c32e16ae494b09f4e87917b9031113b0b40d438ad80b86d5ca932f5",
          "md5": "b0e8cb7acad01fb594d22e80fea818e2",
          "sha256": "8de03538488d3a8dd2a0247fccdfb08ce721c320b5566e355355f5d1c14ddcfc"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.2.2.tar.gz",
        "has_sig": false,
        "md5_digest": "b0e8cb7acad01fb594d22e80fea818e2",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 4813,
        "upload_time": "2020-08-20T11:00:04",
        "upload_time_iso_8601": "2020-08-20T11:00:04.540973Z",
        "url": "https://files.pythonhosted.org/packages/8e/65/41548c32e16ae494b09f4e87917b9031113b0b40d438ad80b86d5ca932f5/mit-news-classify-0.2.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "73a0659f4ebbca6c7e811761b991cbaff985077f9586c42e050177d9a61254ff",
          "md5": "0f9cc7cec6c66dd59e64a353657bdc41",
          "sha256": "3001ceab3a142e9dabd08e49aeb791872a92347b6a73e87928891f005180ae24"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.2.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "0f9cc7cec6c66dd59e64a353657bdc41",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 9551,
        "upload_time": "2020-08-20T11:24:54",
        "upload_time_iso_8601": "2020-08-20T11:24:54.173467Z",
        "url": "https://files.pythonhosted.org/packages/73/a0/659f4ebbca6c7e811761b991cbaff985077f9586c42e050177d9a61254ff/mit_news_classify-0.2.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "172be22bf65eb6631864dbc845b4c3345462458017b28aa84330985a8b0c1122",
          "md5": "c619b9c09acb8226cffb137537677b41",
          "sha256": "60444addca03da768b765ae639190d81829391f515d77698c784eb9382ff6b77"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.2.3.tar.gz",
        "has_sig": false,
        "md5_digest": "c619b9c09acb8226cffb137537677b41",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 4806,
        "upload_time": "2020-08-20T11:24:55",
        "upload_time_iso_8601": "2020-08-20T11:24:55.516083Z",
        "url": "https://files.pythonhosted.org/packages/17/2b/e22bf65eb6631864dbc845b4c3345462458017b28aa84330985a8b0c1122/mit-news-classify-0.2.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "fdefe90e777ee152466c9a51d2519aeb7e0e98a96752706a8e25e2e4fe9eefd1",
          "md5": "0be5e27844f6e815fbbee18b3f5927be",
          "sha256": "4df16f0e52275d251aa085c4e2b23943470e075e6ed73bc1d306fe5fec2e195a"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.2.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "0be5e27844f6e815fbbee18b3f5927be",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 9983,
        "upload_time": "2020-08-20T11:39:08",
        "upload_time_iso_8601": "2020-08-20T11:39:08.630130Z",
        "url": "https://files.pythonhosted.org/packages/fd/ef/e90e777ee152466c9a51d2519aeb7e0e98a96752706a8e25e2e4fe9eefd1/mit_news_classify-0.2.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2da870674a7d7cc78dbd8f8802206e6853085490a0a06698d4ec9bbad41c57c9",
          "md5": "46c69e6764db9b68381591d55166abf4",
          "sha256": "69b86b461534b4f0af7ec3493600716a733025bb94d04d046b754deb12c1c942"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.2.4.tar.gz",
        "has_sig": false,
        "md5_digest": "46c69e6764db9b68381591d55166abf4",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 5242,
        "upload_time": "2020-08-20T11:39:10",
        "upload_time_iso_8601": "2020-08-20T11:39:10.325500Z",
        "url": "https://files.pythonhosted.org/packages/2d/a8/70674a7d7cc78dbd8f8802206e6853085490a0a06698d4ec9bbad41c57c9/mit-news-classify-0.2.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "37187dd0cb54445910a07955c60831024b0fab2df62568a7e9a6173fc0091ac6",
          "md5": "b6aa47d22ba5ff35dc507a995caed711",
          "sha256": "3e305768bb4aa2603245e53ca3d7b6521f21aa007698d14e3426c59a8a19c7b9"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.2.5-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "b6aa47d22ba5ff35dc507a995caed711",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 9983,
        "upload_time": "2020-08-20T11:43:45",
        "upload_time_iso_8601": "2020-08-20T11:43:45.086920Z",
        "url": "https://files.pythonhosted.org/packages/37/18/7dd0cb54445910a07955c60831024b0fab2df62568a7e9a6173fc0091ac6/mit_news_classify-0.2.5-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5a223d951ef860702a06f287153297ef79fa3788f634a089416a5e98049439d6",
          "md5": "320bef899baceb6b4a4238762c3646e5",
          "sha256": "e7fb7daf26de2c5f9d9823154cc46703d0a6e102a1ba20af89e9df0a3f3b0286"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.2.5.tar.gz",
        "has_sig": false,
        "md5_digest": "320bef899baceb6b4a4238762c3646e5",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 5227,
        "upload_time": "2020-08-20T11:43:46",
        "upload_time_iso_8601": "2020-08-20T11:43:46.255314Z",
        "url": "https://files.pythonhosted.org/packages/5a/22/3d951ef860702a06f287153297ef79fa3788f634a089416a5e98049439d6/mit-news-classify-0.2.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7b77329b59d8d0d78d0853afd98da06bf3ec35d12dacbcea72e5852d9fd52f29",
          "md5": "763af8042a9232fb945292244961ba23",
          "sha256": "9420463324c6ef4fb4e4c0f67b70520019277c4d9b8703313cd6755ffa6e345b"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.2.6-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "763af8042a9232fb945292244961ba23",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 10665,
        "upload_time": "2020-08-20T14:36:38",
        "upload_time_iso_8601": "2020-08-20T14:36:38.273376Z",
        "url": "https://files.pythonhosted.org/packages/7b/77/329b59d8d0d78d0853afd98da06bf3ec35d12dacbcea72e5852d9fd52f29/mit_news_classify-0.2.6-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "dfa2197c0a11508eb60cc69266aa3ef26f079ef1b997375327728f944c018e73",
          "md5": "65e06a7af94c7dc270b5200827539713",
          "sha256": "3e3402cce2cc335ce5f84a0adee5ae6545fac37b6fd0e3ea288425aaaa8dd130"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.2.6.tar.gz",
        "has_sig": false,
        "md5_digest": "65e06a7af94c7dc270b5200827539713",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 5776,
        "upload_time": "2020-08-20T14:36:39",
        "upload_time_iso_8601": "2020-08-20T14:36:39.850635Z",
        "url": "https://files.pythonhosted.org/packages/df/a2/197c0a11508eb60cc69266aa3ef26f079ef1b997375327728f944c018e73/mit-news-classify-0.2.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.7": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "bde9ccaa087d298d53fe4c7d9bfe2f1f68e940d7e7ddde3253a6f38bc71f733f",
          "md5": "209961993d39389e7227b6189a405fa1",
          "sha256": "d2b26fd8417672cde93e73b0d6806bc3e09eaf2f599dd794eb32357f2a0ccef9"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.2.7-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "209961993d39389e7227b6189a405fa1",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 10664,
        "upload_time": "2020-08-20T14:40:49",
        "upload_time_iso_8601": "2020-08-20T14:40:49.538467Z",
        "url": "https://files.pythonhosted.org/packages/bd/e9/ccaa087d298d53fe4c7d9bfe2f1f68e940d7e7ddde3253a6f38bc71f733f/mit_news_classify-0.2.7-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "fe7b921c8c2f2b62e65e5152abac47c178095e610ae298bb88158bd6edc3e654",
          "md5": "f0b47ec486586cf00ed22b800dfd206c",
          "sha256": "7a03dd8342cfcb014446810eb83499e3625095f2fd797dbbbd9876477c5200a2"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.2.7.tar.gz",
        "has_sig": false,
        "md5_digest": "f0b47ec486586cf00ed22b800dfd206c",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 5766,
        "upload_time": "2020-08-20T14:40:51",
        "upload_time_iso_8601": "2020-08-20T14:40:51.255172Z",
        "url": "https://files.pythonhosted.org/packages/fe/7b/921c8c2f2b62e65e5152abac47c178095e610ae298bb88158bd6edc3e654/mit-news-classify-0.2.7.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.8": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "67935e203454950d8e6153f190b9a6463b66f7fa5553b2cf1b1ade86b99f1eb3",
          "md5": "7bea972a37dfed604bc67c9ca4c4c793",
          "sha256": "c30aab570c2b464d443703098be62a4c5ad6a6a1f23bb5fa6b095d2d52a550d6"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.2.8-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "7bea972a37dfed604bc67c9ca4c4c793",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 10712,
        "upload_time": "2020-08-20T15:22:03",
        "upload_time_iso_8601": "2020-08-20T15:22:03.368339Z",
        "url": "https://files.pythonhosted.org/packages/67/93/5e203454950d8e6153f190b9a6463b66f7fa5553b2cf1b1ade86b99f1eb3/mit_news_classify-0.2.8-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "afa27740e63f307e66b40e7eca32354dd5631c777ec4c2bdda58494981a3ab33",
          "md5": "c1153446a9bef0521a4db258ce10fdf0",
          "sha256": "8a4da506e0f13abb808cb61d89227607c2311122938e52f781a11bb19ad271b6"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.2.8.tar.gz",
        "has_sig": false,
        "md5_digest": "c1153446a9bef0521a4db258ce10fdf0",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 5822,
        "upload_time": "2020-08-20T15:22:05",
        "upload_time_iso_8601": "2020-08-20T15:22:05.160727Z",
        "url": "https://files.pythonhosted.org/packages/af/a2/7740e63f307e66b40e7eca32354dd5631c777ec4c2bdda58494981a3ab33/mit-news-classify-0.2.8.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.9": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7f4967ec3b3aea3d241acc9b9cef897b29b54fcf9cd2272a0c783cd11a892bae",
          "md5": "bfc1ce3c30a5886c4f9b029cf6892706",
          "sha256": "4c786a3ea7691603dc66d86ca71097e07697bffc279b2d83d4c3016456fb55b4"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.2.9-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "bfc1ce3c30a5886c4f9b029cf6892706",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 10675,
        "upload_time": "2020-08-21T10:30:39",
        "upload_time_iso_8601": "2020-08-21T10:30:39.645993Z",
        "url": "https://files.pythonhosted.org/packages/7f/49/67ec3b3aea3d241acc9b9cef897b29b54fcf9cd2272a0c783cd11a892bae/mit_news_classify-0.2.9-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a3d9b997da494b95158a2942cffccf2a26060947891746d37701aeaeb32bbe9d",
          "md5": "568adb76108f7df0ea39201f59b1df0e",
          "sha256": "020d3cdce4fbd2d5d3e1f2f6e2717e6e7dab5edf78899a611ca63fa8f56326cd"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.2.9.tar.gz",
        "has_sig": false,
        "md5_digest": "568adb76108f7df0ea39201f59b1df0e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 5843,
        "upload_time": "2020-08-21T10:30:41",
        "upload_time_iso_8601": "2020-08-21T10:30:41.047423Z",
        "url": "https://files.pythonhosted.org/packages/a3/d9/b997da494b95158a2942cffccf2a26060947891746d37701aeaeb32bbe9d/mit-news-classify-0.2.9.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0d9ef1a811a2fc7f59723abe9a10641e7b781a3ee966f8dda67a09253afa5fb6",
          "md5": "2932d1e813ed0d1622ec4fb1ccbb5af9",
          "sha256": "e12615f03fa344ba0772464b4edec70b758ab8b99248a1f30d973b2dd361cdfe"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "2932d1e813ed0d1622ec4fb1ccbb5af9",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 13702,
        "upload_time": "2020-08-21T15:34:44",
        "upload_time_iso_8601": "2020-08-21T15:34:44.221314Z",
        "url": "https://files.pythonhosted.org/packages/0d/9e/f1a811a2fc7f59723abe9a10641e7b781a3ee966f8dda67a09253afa5fb6/mit_news_classify-0.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6ccc1a0458f34f0aaeabda8fd11e0f331ffafd2ee54b6072b6282041d4a8cea0",
          "md5": "5a74161053e716ce60c221ba6fb52bca",
          "sha256": "a24be6a583bf5bb837d05e6fc0c0adba38823beee89251d73eeb4ac30e1f7ae5"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.3.tar.gz",
        "has_sig": false,
        "md5_digest": "5a74161053e716ce60c221ba6fb52bca",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 6343,
        "upload_time": "2020-08-21T15:34:45",
        "upload_time_iso_8601": "2020-08-21T15:34:45.878182Z",
        "url": "https://files.pythonhosted.org/packages/6c/cc/1a0458f34f0aaeabda8fd11e0f331ffafd2ee54b6072b6282041d4a8cea0/mit-news-classify-0.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9e98d2c2fac1b57040e564ef9dc9807ad4106dafcfcf3af7ec5206aba283df53",
          "md5": "77bb82f8f5077c975c91c26d9e6a1b4a",
          "sha256": "cd18bf275de9cf357b0fefaf5aa480768a258a76df439a1636eaa2f6100e1dbf"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "77bb82f8f5077c975c91c26d9e6a1b4a",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 13688,
        "upload_time": "2020-08-26T07:56:40",
        "upload_time_iso_8601": "2020-08-26T07:56:40.296706Z",
        "url": "https://files.pythonhosted.org/packages/9e/98/d2c2fac1b57040e564ef9dc9807ad4106dafcfcf3af7ec5206aba283df53/mit_news_classify-0.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a0f4f09a1f98ce74d86e6ae7602ecf9f56784e2c3ce69536d77523a501f4468f",
          "md5": "968eb5a5384c1dcf0f678e04c848571e",
          "sha256": "254317c9931b71c9787aacfb08b8de5c9b4b351414ae17f160e2a4a27ba2673f"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.4.tar.gz",
        "has_sig": false,
        "md5_digest": "968eb5a5384c1dcf0f678e04c848571e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 6004,
        "upload_time": "2020-08-26T07:56:42",
        "upload_time_iso_8601": "2020-08-26T07:56:42.034817Z",
        "url": "https://files.pythonhosted.org/packages/a0/f4/f09a1f98ce74d86e6ae7602ecf9f56784e2c3ce69536d77523a501f4468f/mit-news-classify-0.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "fd57e7bbb273eda586aea5413dc85b31406c93baa6c3086bbeee855febb06df2",
          "md5": "fae7990955195475df3ab8cbcc0659fe",
          "sha256": "31e83e7fae0325c863e32ba5ad5251f47c7709abcfca3e54c201410d8c57636b"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.5-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "fae7990955195475df3ab8cbcc0659fe",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 13465,
        "upload_time": "2020-08-26T12:32:15",
        "upload_time_iso_8601": "2020-08-26T12:32:15.666144Z",
        "url": "https://files.pythonhosted.org/packages/fd/57/e7bbb273eda586aea5413dc85b31406c93baa6c3086bbeee855febb06df2/mit_news_classify-0.5-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "40ed0de1bed39f296df02eff1aed11eb7b316f547919b73b2f848f378ef837cb",
          "md5": "380bb281f5c2099bdaad30de7916ebb4",
          "sha256": "f05267f85acc8367647ee497f52a7dcdef7145b8229be10bf5417acae09e2ad1"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.5.tar.gz",
        "has_sig": false,
        "md5_digest": "380bb281f5c2099bdaad30de7916ebb4",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 5972,
        "upload_time": "2020-08-26T12:32:17",
        "upload_time_iso_8601": "2020-08-26T12:32:17.014913Z",
        "url": "https://files.pythonhosted.org/packages/40/ed/0de1bed39f296df02eff1aed11eb7b316f547919b73b2f848f378ef837cb/mit-news-classify-0.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.5.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6a1eba1e1fe428aee2907a9e27f33bda6e24a0dae09635263b5f46b935ce9a4c",
          "md5": "242b40460ccae55a2212f8d78356bf6b",
          "sha256": "3e4bf79833c187d8fe54af5ae672a305d471455288cc1a4bf749a2438ddf5bbb"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.5.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "242b40460ccae55a2212f8d78356bf6b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 13520,
        "upload_time": "2020-08-26T12:40:36",
        "upload_time_iso_8601": "2020-08-26T12:40:36.228508Z",
        "url": "https://files.pythonhosted.org/packages/6a/1e/ba1e1fe428aee2907a9e27f33bda6e24a0dae09635263b5f46b935ce9a4c/mit_news_classify-0.5.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9e0b168587fc35c391c37a3345f23370bf72b64ff8f32d24ec5f8a7ed655df70",
          "md5": "c074edac9194044eb15949db63d35839",
          "sha256": "34f9fbe473ef1a37b6da279a077cf07fc7597b233c3770e289d7c1370ef2b391"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.5.1.tar.gz",
        "has_sig": false,
        "md5_digest": "c074edac9194044eb15949db63d35839",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 6040,
        "upload_time": "2020-08-26T12:40:37",
        "upload_time_iso_8601": "2020-08-26T12:40:37.590197Z",
        "url": "https://files.pythonhosted.org/packages/9e/0b/168587fc35c391c37a3345f23370bf72b64ff8f32d24ec5f8a7ed655df70/mit-news-classify-0.5.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "29dbd0706ad08778e744496f31ae6fb6c5487652ea0e5d5ecf15a686de8153e7",
          "md5": "bc2c4bdb4345da66d8bd0a1aee42b19d",
          "sha256": "6d5941f4b1101410623f54614fba940cf3bd67e344b400dec79dda5d3eda30ec"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.6-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "bc2c4bdb4345da66d8bd0a1aee42b19d",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 14787,
        "upload_time": "2020-08-26T13:59:35",
        "upload_time_iso_8601": "2020-08-26T13:59:35.492160Z",
        "url": "https://files.pythonhosted.org/packages/29/db/d0706ad08778e744496f31ae6fb6c5487652ea0e5d5ecf15a686de8153e7/mit_news_classify-0.6-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "02f5e18eaa389e14858968d757cfcfd816f4c60c9312ec1a7f72726b8a36db28",
          "md5": "7e807d6fe3ca718f3079ae53cee252fe",
          "sha256": "daba1ce54773b32efbffa4f94fbc4561a4de20be76d7eb3c022c8f98b4e10b18"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.6.tar.gz",
        "has_sig": false,
        "md5_digest": "7e807d6fe3ca718f3079ae53cee252fe",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 6142,
        "upload_time": "2020-08-26T13:59:36",
        "upload_time_iso_8601": "2020-08-26T13:59:36.808868Z",
        "url": "https://files.pythonhosted.org/packages/02/f5/e18eaa389e14858968d757cfcfd816f4c60c9312ec1a7f72726b8a36db28/mit-news-classify-0.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.8": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "fa856d0925a240b854e7be26e9dd4037d22b230077410ce4c559951d9639c6c3",
          "md5": "c4b695fb05a310755a88f3ce0be6bbd5",
          "sha256": "ad723daba5d3b3b549e2dd29fd52c3ccce5fbaf90ec5ff20bc100a2445d2ba38"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.8-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "c4b695fb05a310755a88f3ce0be6bbd5",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 16308,
        "upload_time": "2020-08-26T14:21:30",
        "upload_time_iso_8601": "2020-08-26T14:21:30.977728Z",
        "url": "https://files.pythonhosted.org/packages/fa/85/6d0925a240b854e7be26e9dd4037d22b230077410ce4c559951d9639c6c3/mit_news_classify-0.8-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3e63a464b9c6c4e46fb254657086033a2bffe8bf45d61475d72b24778ed5abbc",
          "md5": "8cdfe290e4f9aa9f30b2dd73dd3cb5f7",
          "sha256": "f20865c3da75cc100ce9557ca835885e866c4ff4a5bc68329ed47b480a0203bc"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.8.tar.gz",
        "has_sig": false,
        "md5_digest": "8cdfe290e4f9aa9f30b2dd73dd3cb5f7",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 6339,
        "upload_time": "2020-08-26T14:21:32",
        "upload_time_iso_8601": "2020-08-26T14:21:32.487696Z",
        "url": "https://files.pythonhosted.org/packages/3e/63/a464b9c6c4e46fb254657086033a2bffe8bf45d61475d72b24778ed5abbc/mit-news-classify-0.8.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.8.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "15f59b6c0bebf2116d410d3e467b30dfeb9f48e9d4c29a178418e95792ac5803",
          "md5": "f28976f98b9456c05b86ba753f50af5a",
          "sha256": "4a218b36981f9b0dfbc1a0f96d3853e5b64902c91c1709811467b9f74c9afc6c"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.8.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "f28976f98b9456c05b86ba753f50af5a",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 16414,
        "upload_time": "2020-08-27T06:13:16",
        "upload_time_iso_8601": "2020-08-27T06:13:16.342470Z",
        "url": "https://files.pythonhosted.org/packages/15/f5/9b6c0bebf2116d410d3e467b30dfeb9f48e9d4c29a178418e95792ac5803/mit_news_classify-0.8.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e3083d2abfd50b3aa0f8dac9366e728328011caf4874e5edee3fae763b89e18b",
          "md5": "a56cb72657177e94eeb3255479bdc2a1",
          "sha256": "76af3973b43afea8ac49e2a57fff40265f445f666f7e16ee78421d7897d60418"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.8.1.tar.gz",
        "has_sig": false,
        "md5_digest": "a56cb72657177e94eeb3255479bdc2a1",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 6351,
        "upload_time": "2020-08-27T06:13:17",
        "upload_time_iso_8601": "2020-08-27T06:13:17.830983Z",
        "url": "https://files.pythonhosted.org/packages/e3/08/3d2abfd50b3aa0f8dac9366e728328011caf4874e5edee3fae763b89e18b/mit-news-classify-0.8.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.8.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "414d66fbbb13f8b80a5c283d3e0408fbfc114a48b81b5777ef4b5d63b6580dde",
          "md5": "c31cff9e4213ea6f89b4c628d4edbcf0",
          "sha256": "c670c59a203f46b809b4232f354ebf5ab46ebe1f045dc375e6aa72cf7f9d0f63"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.8.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "c31cff9e4213ea6f89b4c628d4edbcf0",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 28082,
        "upload_time": "2020-08-27T09:41:20",
        "upload_time_iso_8601": "2020-08-27T09:41:20.903835Z",
        "url": "https://files.pythonhosted.org/packages/41/4d/66fbbb13f8b80a5c283d3e0408fbfc114a48b81b5777ef4b5d63b6580dde/mit_news_classify-0.8.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "478f66b0198921df9941ab333a233796d0e86567df5db5bb86950b4582746573",
          "md5": "054e9584c3e1a43a9381160a2d663fbe",
          "sha256": "7e892450373886decab7bc7c50a7e65ba4a8798c8f672a9576f1f9ea538b79c5"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.8.2.tar.gz",
        "has_sig": false,
        "md5_digest": "054e9584c3e1a43a9381160a2d663fbe",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 35767,
        "upload_time": "2020-08-27T09:41:22",
        "upload_time_iso_8601": "2020-08-27T09:41:22.743132Z",
        "url": "https://files.pythonhosted.org/packages/47/8f/66b0198921df9941ab333a233796d0e86567df5db5bb86950b4582746573/mit-news-classify-0.8.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.8.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "dbcf8741a605fedeb6b458cce56239475c36621867d64bb29dc8911d9072c84c",
          "md5": "1383daa0ed9f7e1ff4a1a35d3b0be851",
          "sha256": "b3242347d053dea6a4c9c0e19972ebae133e6367984b8f565d35b57a96dcd1d7"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.8.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "1383daa0ed9f7e1ff4a1a35d3b0be851",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 31086,
        "upload_time": "2020-08-27T10:28:16",
        "upload_time_iso_8601": "2020-08-27T10:28:16.204473Z",
        "url": "https://files.pythonhosted.org/packages/db/cf/8741a605fedeb6b458cce56239475c36621867d64bb29dc8911d9072c84c/mit_news_classify-0.8.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "da998981817c06a6eb44fa265fd1b9eb03c8308e94960f05181751533893645c",
          "md5": "9e0f725e54388f33de75e9425a28dd73",
          "sha256": "2c3574b4d951652c2b8365860dc5fc264e96a17218645289d1d2db14419194b1"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.8.3.tar.gz",
        "has_sig": false,
        "md5_digest": "9e0f725e54388f33de75e9425a28dd73",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 35096,
        "upload_time": "2020-08-27T10:28:17",
        "upload_time_iso_8601": "2020-08-27T10:28:17.790780Z",
        "url": "https://files.pythonhosted.org/packages/da/99/8981817c06a6eb44fa265fd1b9eb03c8308e94960f05181751533893645c/mit-news-classify-0.8.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.9": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e1e329a43506f8c88dc5f949abac1c6d4878c517d25f3167632d573a3b7d656d",
          "md5": "c4f92e052e026f09a1d7d352b56a0b11",
          "sha256": "2f5ff8625b200fee037aa9b27d630ce70b937f05345824b5db37027883174072"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.9-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "c4f92e052e026f09a1d7d352b56a0b11",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 32473,
        "upload_time": "2020-10-07T08:29:57",
        "upload_time_iso_8601": "2020-10-07T08:29:57.474786Z",
        "url": "https://files.pythonhosted.org/packages/e1/e3/29a43506f8c88dc5f949abac1c6d4878c517d25f3167632d573a3b7d656d/mit_news_classify-0.9-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "bd148012f3c6f14b8f0364038f92474d0d55e94e05616f5269e58ab8dbc9d04b",
          "md5": "e3e4752224b5bdcaec22003f86c9b595",
          "sha256": "1247290e3f3fe7c10b840e52a6caceea8c5af2670d7224efd7d12279f48bf8ce"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.9.tar.gz",
        "has_sig": false,
        "md5_digest": "e3e4752224b5bdcaec22003f86c9b595",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 35933,
        "upload_time": "2020-10-07T08:29:59",
        "upload_time_iso_8601": "2020-10-07T08:29:59.498780Z",
        "url": "https://files.pythonhosted.org/packages/bd/14/8012f3c6f14b8f0364038f92474d0d55e94e05616f5269e58ab8dbc9d04b/mit-news-classify-0.9.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.9.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b97c2b71f90679d89b74f4c52b441403e1cda03b8907a0aa2502b7c38a6b5dbb",
          "md5": "c245f369187ec04d066466c2dd6cc594",
          "sha256": "6ebc684da1cb23acc33c826d79f6c607cd2b04b339686acf4aac95ab09fa97a8"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.9.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "c245f369187ec04d066466c2dd6cc594",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 32549,
        "upload_time": "2020-10-12T09:23:53",
        "upload_time_iso_8601": "2020-10-12T09:23:53.962541Z",
        "url": "https://files.pythonhosted.org/packages/b9/7c/2b71f90679d89b74f4c52b441403e1cda03b8907a0aa2502b7c38a6b5dbb/mit_news_classify-0.9.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d01bc3e9527b75344e845270751f9a509d87da024eec9628e971a30e2febefc0",
          "md5": "1882e50d0d649ac3903862fafb4aca02",
          "sha256": "3607385ef26562db11cbbcf9a20b3bff1c47b08acb883d2adbf80e2c61600c7e"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.9.1.tar.gz",
        "has_sig": false,
        "md5_digest": "1882e50d0d649ac3903862fafb4aca02",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 36217,
        "upload_time": "2020-10-12T09:23:55",
        "upload_time_iso_8601": "2020-10-12T09:23:55.339211Z",
        "url": "https://files.pythonhosted.org/packages/d0/1b/c3e9527b75344e845270751f9a509d87da024eec9628e971a30e2febefc0/mit-news-classify-0.9.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.9.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c78f5c2866a51346d1975931def21c8889098f1a6db2dc498c7bf0c4e0b9b91b",
          "md5": "737f38618019cd8a47ad77ffea4f3871",
          "sha256": "8160f1face43f173b7c504dd9cfafdeefd55c071eaf4d930eca734bcee696dca"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.9.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "737f38618019cd8a47ad77ffea4f3871",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 32478,
        "upload_time": "2021-04-09T22:03:57",
        "upload_time_iso_8601": "2021-04-09T22:03:57.052035Z",
        "url": "https://files.pythonhosted.org/packages/c7/8f/5c2866a51346d1975931def21c8889098f1a6db2dc498c7bf0c4e0b9b91b/mit_news_classify-0.9.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "362a126d943dd456c40c51b47b033fb0286d7fc9d1dfd56778b8779fe96585b3",
          "md5": "243ec725285a79bb8076c6b5cd13cbd1",
          "sha256": "d4ca4168d4d3dc36786e8c7856491e1b885c6d90b2db26ab009e30574467013b"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.9.2.tar.gz",
        "has_sig": false,
        "md5_digest": "243ec725285a79bb8076c6b5cd13cbd1",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 36974,
        "upload_time": "2021-04-09T22:04:08",
        "upload_time_iso_8601": "2021-04-09T22:04:08.892642Z",
        "url": "https://files.pythonhosted.org/packages/36/2a/126d943dd456c40c51b47b033fb0286d7fc9d1dfd56778b8779fe96585b3/mit-news-classify-0.9.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.9.2.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e322b890a98852fc98d29951207b315d2dbf904427715f40e39f98ec53f1754e",
          "md5": "b2b68b9e67652b8b44d043f9a14eaa32",
          "sha256": "d701493afc27d1bcd465eb9d88971d62f61e3dd13b042820d438d605a77f34a1"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.9.2.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "b2b68b9e67652b8b44d043f9a14eaa32",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 32534,
        "upload_time": "2021-04-11T15:55:22",
        "upload_time_iso_8601": "2021-04-11T15:55:22.733100Z",
        "url": "https://files.pythonhosted.org/packages/e3/22/b890a98852fc98d29951207b315d2dbf904427715f40e39f98ec53f1754e/mit_news_classify-0.9.2.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "67a2dadb81683209ee8452c676a93761ef18302036b4aeee8c7e91d505551fd9",
          "md5": "ca429fef813f814acb88676c6524407e",
          "sha256": "1a62301f26dca883d1254c0bda4ed275a3f4f117553706d046f6391afe5f73ef"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.9.2.1.tar.gz",
        "has_sig": false,
        "md5_digest": "ca429fef813f814acb88676c6524407e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 36992,
        "upload_time": "2021-04-11T15:55:23",
        "upload_time_iso_8601": "2021-04-11T15:55:23.922268Z",
        "url": "https://files.pythonhosted.org/packages/67/a2/dadb81683209ee8452c676a93761ef18302036b4aeee8c7e91d505551fd9/mit-news-classify-0.9.2.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.9.2.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "682318a21ed2c522332b2061f641b758d7c4286acbf0f87836c3411de9f7444d",
          "md5": "3f3eec3f0b663c7a2c12f577fcd697e8",
          "sha256": "17da9a8a182841dafc4cd9d8e34cb01bacc6266def9e8bd76a81589d8bc1a753"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.9.2.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "3f3eec3f0b663c7a2c12f577fcd697e8",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 32544,
        "upload_time": "2021-04-12T05:28:08",
        "upload_time_iso_8601": "2021-04-12T05:28:08.871828Z",
        "url": "https://files.pythonhosted.org/packages/68/23/18a21ed2c522332b2061f641b758d7c4286acbf0f87836c3411de9f7444d/mit_news_classify-0.9.2.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f150e18b8ea9d157fe8fe42e080dfe623703189567c2036845b5372237764f8c",
          "md5": "75c4e27dabc0cf7ad1ed24f9666e6a4b",
          "sha256": "48ac6d712e229ba968f405036874eed6e29a02d4a79f9ad222c43c63116b0d55"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.9.2.2.tar.gz",
        "has_sig": false,
        "md5_digest": "75c4e27dabc0cf7ad1ed24f9666e6a4b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 37011,
        "upload_time": "2021-04-12T05:28:10",
        "upload_time_iso_8601": "2021-04-12T05:28:10.472940Z",
        "url": "https://files.pythonhosted.org/packages/f1/50/e18b8ea9d157fe8fe42e080dfe623703189567c2036845b5372237764f8c/mit-news-classify-0.9.2.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.9.2.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4265a948fe6b1b164c09257146b0c1bae861a0210ef888dfa74c892753c17ae7",
          "md5": "5ed053375cb635d6f47f3f4eb4fe055d",
          "sha256": "93edc645b951579235f586308106ccacaae23998e640263df506f7753510612a"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.9.2.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "5ed053375cb635d6f47f3f4eb4fe055d",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 32541,
        "upload_time": "2021-05-02T18:27:54",
        "upload_time_iso_8601": "2021-05-02T18:27:54.356443Z",
        "url": "https://files.pythonhosted.org/packages/42/65/a948fe6b1b164c09257146b0c1bae861a0210ef888dfa74c892753c17ae7/mit_news_classify-0.9.2.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c881ff27bfe7e3522da3a0e730b5d5df49e485149d9cfd55207fca5d9550b434",
          "md5": "1d3facb3284f6281ddb75e8b803dfb47",
          "sha256": "87618d419c9ec624887d5a731132caef3e3d0609f4de3474406de9d895c80a17"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.9.2.3.tar.gz",
        "has_sig": false,
        "md5_digest": "1d3facb3284f6281ddb75e8b803dfb47",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 37010,
        "upload_time": "2021-05-02T18:27:55",
        "upload_time_iso_8601": "2021-05-02T18:27:55.815178Z",
        "url": "https://files.pythonhosted.org/packages/c8/81/ff27bfe7e3522da3a0e730b5d5df49e485149d9cfd55207fca5d9550b434/mit-news-classify-0.9.2.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.9.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a3c57c6726a51d172fdb8dbbea76175a564713f2f134f8b5cd1b6d13aaeb0108",
          "md5": "bf04aa61bc29a82bb7a629f531791c6b",
          "sha256": "63ac77064b89994265d0bd26d99a58e5e3f366affaa434d6bb9c8b89181787ae"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.9.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "bf04aa61bc29a82bb7a629f531791c6b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 32588,
        "upload_time": "2021-05-07T04:49:32",
        "upload_time_iso_8601": "2021-05-07T04:49:32.731457Z",
        "url": "https://files.pythonhosted.org/packages/a3/c5/7c6726a51d172fdb8dbbea76175a564713f2f134f8b5cd1b6d13aaeb0108/mit_news_classify-0.9.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e576577995d7636425ad1024f44c80b4133ca6363e881219fe0bd83dce7ffc23",
          "md5": "e2568af701679c937f8ec682fc1d82b5",
          "sha256": "403d90efbc2fb068c48b3c34c4a245c27e220ce38aca0ccf7e2d08f11a8bfbc2"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.9.3.tar.gz",
        "has_sig": false,
        "md5_digest": "e2568af701679c937f8ec682fc1d82b5",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 37039,
        "upload_time": "2021-05-07T04:49:35",
        "upload_time_iso_8601": "2021-05-07T04:49:35.453553Z",
        "url": "https://files.pythonhosted.org/packages/e5/76/577995d7636425ad1024f44c80b4133ca6363e881219fe0bd83dce7ffc23/mit-news-classify-0.9.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.9.3.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8790accca90ac3bb83154ee38dc1b61a9b39aca96818708cbe5bf792a426a29e",
          "md5": "4a49652234f2eeab8944f910f2f445f4",
          "sha256": "c941660889df304da5a1f1444daf4b03e86f062b97f21c856036ca8ab3005257"
        },
        "downloads": -1,
        "filename": "mit_news_classify-0.9.3.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "4a49652234f2eeab8944f910f2f445f4",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 32613,
        "upload_time": "2021-05-07T05:53:39",
        "upload_time_iso_8601": "2021-05-07T05:53:39.326420Z",
        "url": "https://files.pythonhosted.org/packages/87/90/accca90ac3bb83154ee38dc1b61a9b39aca96818708cbe5bf792a426a29e/mit_news_classify-0.9.3.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d44c3d092454b6fdd942109047aa17ac9032dbf5811a8a326c5fb5afb0709d91",
          "md5": "055e922577f1483d961ad1e119311afc",
          "sha256": "e375f97e7ce1b75469412e61ccb9659455f857f99adb17f7913f8536b97ea41e"
        },
        "downloads": -1,
        "filename": "mit-news-classify-0.9.3.1.tar.gz",
        "has_sig": false,
        "md5_digest": "055e922577f1483d961ad1e119311afc",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 37069,
        "upload_time": "2021-05-07T05:53:41",
        "upload_time_iso_8601": "2021-05-07T05:53:41.846566Z",
        "url": "https://files.pythonhosted.org/packages/d4/4c/3d092454b6fdd942109047aa17ac9032dbf5811a8a326c5fb5afb0709d91/mit-news-classify-0.9.3.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "6ad9839668d0d834dad9ec0c717d051ccbcf324d1df132e21fa1f7e26e81fe74",
        "md5": "484cd21a8b1ddbbb8b7c954bf1edf2de",
        "sha256": "ebdb6aa06a510c415d723cc1acb03c051d722d4f372a3d03de6bbff8874e435c"
      },
      "downloads": -1,
      "filename": "mit_news_classify-0.10.1.3-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "484cd21a8b1ddbbb8b7c954bf1edf2de",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6",
      "size": 33879,
      "upload_time": "2021-05-12T17:04:54",
      "upload_time_iso_8601": "2021-05-12T17:04:54.657116Z",
      "url": "https://files.pythonhosted.org/packages/6a/d9/839668d0d834dad9ec0c717d051ccbcf324d1df132e21fa1f7e26e81fe74/mit_news_classify-0.10.1.3-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "26386d825b8ee121c707d40be5eb3d9d38af38e4c833f145799068098fc0a821",
        "md5": "e10971d02cd9451d3b5a5a5b84ad9ab5",
        "sha256": "91df2f2616dcc9b8128dcbe964003b9abdc4e104552654f6ef6f8e0195d89fa7"
      },
      "downloads": -1,
      "filename": "mit-news-classify-0.10.1.3.tar.gz",
      "has_sig": false,
      "md5_digest": "e10971d02cd9451d3b5a5a5b84ad9ab5",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 37889,
      "upload_time": "2021-05-12T17:04:56",
      "upload_time_iso_8601": "2021-05-12T17:04:56.288144Z",
      "url": "https://files.pythonhosted.org/packages/26/38/6d825b8ee121c707d40be5eb3d9d38af38e4c833f145799068098fc0a821/mit-news-classify-0.10.1.3.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}