{
  "info": {
    "author": "Rick Moyer",
    "author_email": "rickmoyer.sd@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3",
      "Topic :: Games/Entertainment"
    ],
    "description": "# What is namemaker?\nNamemaker is a random name generator.  Use it to procedurally create names for places and characters in a game, or to break through writer's block while trying to come up with handcrafted names.  Input your own training data to make any kind of names you want.\n\n# Useful features\n* Several built-in training data sets to get different \"sounds\" to your names.\n* Ability to use your own training data.\n* Control over the realism and length of generated names.\n* Full control of the RNG to make name generation repeatable.\n* Ability to ban profanity or other words from appearing in generated names.\n* Ability to place arbitrary restrictions on the generated names.\n* Avoidance of repeated names by default.\n\n# How to install\nUse pip in your command line.\n\n```\npip install namemaker\n```\n\n# Quick start\nNamemaker uses a class called a NameSet to store training data and make fake names from it.  Training data can be loaded from a text file.\n\n```python\n>>> import namemaker\n>>> female_names = namemaker.make_name_set('female first names.txt')\n>>> female_names.make_name()\n'Lyricia'\n```\n\nYou can also use the `sample` function to quickly get an idea of what kind of names your inputs will produce.  Any keyword arguments accepted by `make_name_set` or `NameSet.make_name` are accepted by `sample`.  It also takes an argument `n` that determines how many sample names to print.\n\n```python\n>>> namemaker.sample(female_names, n = 10)\nNayah\nSamandry\nGraci\nKenne\nMalanna\nJulina\nCarlie\nAlondon\nElene\nClarai\n```\n\n# How does it work?\nThe name generator uses Markov chains to make fake names based on a training set of real names.  When a NameSet is initialized, it looks through all the training data and maps out which letters can follow each combination of other letters.  The `order` parameter determines the order of the Markov chain, i.e. how many letters are used for matching.  For example, when you call `make_name_set(['John', 'Joey', 'Joseph'], order = 2)`, the NameSet knows that the letter combination `'Jo'` can be followed by `'h'`, `'e'`, or `'s'`.  If you're curious, you can see all the letter combinations by looking at the NameSet's `_markov_dict`.\n\n```python\n>>> j_names = namemaker.make_name_set(['John', 'Joey', 'Joseph'], order = 2)\n>>> j_names._markov_dict\n{'': ['J', 'J', 'J'], 'J': ['o', 'o', 'o'], 'Jo': ['h', 'e', 's'], 'oh': ['n'], 'hn': [None], 'oe': ['y'], 'ey': [None], 'os': ['e'], 'se': ['p'], 'ep': ['h'], 'ph': [None]}\n```\n\nNote that the `_markov_dict` shouldn't be accessed directly in your program, though, as the leading underscore denotes it as a private attribute.\n\n# Making NameSets\nThe preferred way to make a NameSet is with the `make_name_set` function:\n\n```python\nmake_name_set(names, order = 3, name_len_func = len, clean_up = True)\n```\n\nThe input `names` is the training data for the NameSet.  It can be a container of names (such as a list, set, tuple, or another NameSet), or a string specifying a file where names are stored.  Namemaker comes with some starter files of training data, listed below:\n\n* `male first names.txt` [1]\n* `female first names.txt` [2]\n* `last names.txt` [3]\n* `England towns.txt` [4]\n* `PA towns.txt` [5]\n* `Greek mythology.txt` [6]\n\nModifying the `order` parameter affects how realistic the generated names sound.  At `order = 1`, they are mostly gibberish, and sometimes unpronounceable.\n\n```python\n>>> namemaker.sample('male first names.txt', n = 10, order = 1)\nRhacam\nMin\nMana\nBrich\nAlamid\nJanen\nRestthan\nCannd\nCaxt\nChulks\n```\n\nAt `order = 2` or `order = 3` (the default), they still tend to sound fantastical or futuristic, but they should now avoid any unusual letter combinations.\n\n```python\n>>> sample('male first names', n = 10, order = 2)\nGrius\nDwarc\nFis\nNik\nAlannox\nMosel\nJuar\nLukaid\nAhmano\nCarick\n```\n\n```python\n>>> sample('male first names', n = 10, order = 3)\nDylark\nKayder\nDomington\nRonny\nDonard\nRemiah\nEugendry\nSilan\nLeonan\nBaylon\n```\n\nAt `order = 4`, they tend to sound like realistic but somewhat unusual names.\n\n```python\n>>> sample('male first names', n = 10, order = 4)\nJamien\nDyland\nHendrick\nPhilles\nLando\nKillie\nDeckett\nMarlos\nWillip\nElises\n```\n\nThe default is `order = 3` because it strikes a good balance between randomness and realism for a variety of training data.  It avoids unnatural letter combinations while not appearing as a misspelling of a common real name.  Of course, this “sweet spot” may vary depending on your training data and what you want your names to look like.\n\nThe `name_len_func` is a function that measures some property of a name (length, by default).  See the “Making names” section for details on how the `name_len_func` is used.\n\nThe final argument in `make_name_set` is `clean_up`.  This determines if the training data will be cleaned up using `namemaker.clean`, described in the “Finding and processing training data” section.\n\nSince making a NameSet involves lots of pre-calculation and (possibly) reading data from the disk, it's recommended that you only do it once as a setup step.\n\n# Making names\nNow that you've used `make_name_set` to make a NameSet out of your training data, it's time to make some random names.  The `NameSet.make_name` method has a lot of inputs, but most of them are set to “just work” by default.  The possible inputs to `make_name` and their default values are shown below:\n\n```python\nexclude_real_names = True\nexclude_history = True\nadd_to_history = True\nn_candidates = 2\npref_candidate = AVG\nmax_attempts = 1000\nvalidation_func = None\n```\n\nStarting simple, `exclude_real_names` will keep `make_name` from outputting any name that's already in your training data.  For instance, a NameSet made with the included `male first names.txt` file won't make the name “John” if `exclude_real_names = True`.\n\nThe next two inputs, `exclude_history` and `add_to_history`, are closely related.  By default, each NameSet keeps track of the names it's already made to avoid repeats.  When using `add_to_history = True`, the NameSet will remember the name returned by`make_name`.  If `exclude_history` is True, `make_name` won't make any name that's already remembered in the NameSet's history.\n\nInternally, `make_name` actually generates a few names and picks what it thinks is the best one.  By default, it chooses the name closest to the average length of the training data, as measured by the NameSet's `name_len_func`.  The number of name candidates it chooses from is specified by `n_candidates`.  The default is 2 because it allows a variety of name lengths to get through, while still weeding out the extremely long or short outliers.  Increasing `n_candidates` reduces the variance in name length (or whatever property is checked by `name_len_func`).\n\n`pref_candidate` is the method used to select the best name candidate.  Possible values are `namemaker.MIN`, `namemaker.MAX`, and `namemaker.AVG` (0, 1, and 2, respectively).  The default is `AVG`, which picks the name candidate that best matches the average length of the training data (as determined by `name_len_func`).  `MIN` and `MAX` will choose the shortest and longest name, respectively, as determined by `name_len_func`.\n\nUnder extreme circumstances, it is possible for `make_name` to fail to make a valid name, in which case it returns an empty string.  `max_attempts` is the number of times it tries (per name candidate) before giving up.  See below for some reasons that `make_name` might fail.\n\nThere may be a number of limits you want to impose on the names created by `make_name`, and the `validation_func` provides an easy way to do it.  If present, it must be a function that takes in a single name as a string, and returns `True` if that name is acceptable and `False` if not.  A few possible uses:\n\n* Provide a minimum or maximum allowable length.  Ex:  `validation_func = lambda name: len(name) <= 16`\n* Exclude a common misspelling.  Ex:  `validation_func = lambda name: not name.endswith('vill')` excludes any town names ending in “vill” instead of “ville”.\n* Exclude two-word names:  `validation_func = lambda name: ' ' not in name`\n\n## Banning words\nYou can ban certain words from appearing in your names.  The namemaker module has a global set of banned words, which is empty by default.  You can set the banned words or add words to the banned word set with the `set_banned_words` or `add_banned_words` functions.  `get_banned_words` lets you check your banned words.  Banned words are not case sensitive, and `NameSet.make_name` will not return a name that contains a banned word.\n\n## Reasons make_name might fail\n\n* There are too few names in the training data, and `exclude_real_names = True`.  If there isn't enough variety in the possible letter combinations, a Markov chain may only be able to make names that are already in the training data.\n* Your `validation_func` is too restrictive.\n* Your set of banned words is too restrictive.\n* There are a lot of names in the NameSet's history, and `exclude_history = True`.  This is not very likely, as a NameSet with a reasonable amount of training data can generate over 10 unique names per training name.  Example: At 277 names, `Greek mythology.txt` is the shortest built-in training data file, and it can generate about 3800 names (with default settings) before failing from a full history.\n\n# Finding and processing training data\nThe main advantage of namemaker is its ability to emulate the “sound” of its training data, and, by extension, its customizability by providing your own training data.  The internet is full of lists of things.  A helpful trick is to copy an entire list or table of names into a spreadsheet program like Excel, delete unwanted columns and rows, then save as a tab-delimited text file.  Namemaker expects text files to contain one name per row.\n\nWhen importing this data into namemaker, there are several options for cleaning it of unwanted junk.  The default behavior used by `make_name_set` is to first strip off any non-alphanumeric symbols from the beginning and end of each name, then remove any empty names.  There may be cases when you want to avoid this behavior.  For instance, in a training set of band names, “Wham!” would be reduced to “Wham”, robbing you of the opportunity to generate names that end in an exclamation point.  In a case like this, you can call `make_name_set` with `clean = False`.  You can also do the clean-up step manually for greater control, as shown below:\n\n```python\nmy_names = get_names_from_file('my name file')\nmy_names = clean_blanks(my_names, blank_names = ['N/A', 'null'])\nmy_name_set = make_name_set(my_names, clean_up = False)\n```\n\nIn this example, you're not removing any symbols from the ends of your names, but are still removing any empty names and names that were saved in your file as 'N/A' or 'null'.  The ability to specify names that count as “blank” allows you to copy from messy or incomplete data sources without having to do too much manual cleanup.\n\n## Functions for importing and cleaning data:\n\n* `get_names_from_file(file_name)`:  Loads names from a file and returns them in a list.\n* `clean(names)`:  First strips non-alphanumeric characters from the beginning and end of the names, then removes any blank names from the list.  Returns a new list.\n* `clean_blanks(names, blank_names = [])`:  Gets rid of any names that consist solely of non-alphanumeric characters, as well as any names specified in `blank_names`.  Returns a new list.\n* `clean_extra_symbols(names)`:  Strips non-alphanumeric characters from the beginning and end of the names.  Returns a new list.\n* `strip_non_alnum(name)`:  Strips non-alphanumeric characters from the beginning and end of a single name.  Returns a string.\n\n# Manipulating NameSets\nWhile a typical usage of namemaker involves loading up some training data into a NameSet and using it as-is, NameSets can also be combined and altered in a variety of ways.\n\nAddition with the `+` and `+=` operators:  This combines two NameSets, or a NameSet and any other collection of names, while preserving duplicate names.  That is, any name in both NameSets will end up in the resulting NameSet twice.  Compare to list addition.  Duplicate names will be twice as likely to have their letter combinations show up in the results of `make_name`.\n\nSubtraction with the `-` and `-=` operators:  This removes any names in one NameSet (or other collection of names) from another NameSet.  If the original NameSet had duplicate names in it, only the amount present in the subtracted NameSet will be removed.  Pseudocode example:  `NameSet(['Jack', 'John', 'John']) - NameSet(['John', 'Jacob']) = NameSet(['Jack', 'John'])`.\n\nUnion with the `|` and `|=` operators:  This combines two NameSets, or a NameSet and any other collection of names, but only counts duplicate names once.  Compare to set union.  The result will have no duplicate names.\n\nIntersection with the `&` and `&=` operators:  This keeps only the overlapping parts of two NameSets, or a NameSet and any other collection of names.  It's not a direct analog to set intersection because it allows for duplicate names as long as they are present in both original NameSets.  Pseudocode example:  `NameSet(['Jack', 'John', 'John']) & NameSet(['John', 'John', 'John']) = NameSet(['John', 'John'])`.\n\nAny of the above operators can be used with a NameSet and any collection of names, like a list, set, tuple, or other NameSet.  For the in-place operators, the NameSet must come first.  In the case of two NameSets of different `order` or different `name_len_func`, the attributes of the NameSet on the left side of the operator are preserved in the result, and a warning is raised.  For the in-place operators, the modified NameSet will retain its original history.  For the normal operators, the resultant NameSet will have no history.\n\nNameSets have some other methods to modify themselves, too:\n\n`append(name)`:  Appends a single name to the NameSet, regardless of if the name is already in the NameSet.  Compare list.append.\n\n`add(name)`:  Adds a single name to the NameSet if it's not in it already.  Compare set.add.\n\n`remove(name)`:  Removes a single name from the NameSet if it's in it, or raises a ValueError if not.  Only removes the name once if it's duplicated in the NameSet.  Compare list.remove.\n\n`remove_duplicates()`:  Reduces the NameSet so that each of its names is present exactly once.\n\n`copy()`:  Returns a deep copy of the NameSet.\n\n`change_order(order)`:  Changes the order of the Markov chains used to make names.\n\n`change_name_len_func(name_len_func)`:  Changes the function used to calculate name length.\n\n`clear_history()`:  Deletes the history of names made by `make_name`.\n\n`add_to_history(name_s)`:  Adds the input name or collection of names to the NameSet’s history.\n\n`link_histories(*other_name_sets)`:  (New in version 1.1) Links the history of the NameSet to the histories of all the other_name_sets.  Adding a name to the history of one will add it to all the linked histories.  This is useful if you have several NameSets that might generate similar names, but don't want any repeated names within the group.  This method breaks any existing linked histories in the NameSet and the other_name_sets.\n\n`unlink_history()`:  (New in version 1.1) Breaks any linked histories that the NameSet might have, without breaking the links among other NameSets in the linked group.\n\nExample of history linking:\n\n```python\nmale_names = namemaker.make_name_set('male first names', order = 2)\nfemale_names = namemaker.make_name_set('female first names', order = 2)\nmale_names.link_histories(female_names)\n```\n\nIn this case, you might want to generate male or female names, without repeating a previous male name as a female name or vice versa.\n\n# Warnings\nNamemaker uses a few custom warnings to avoid interfering with any warning filters you've set up in your own code.\n\n`OrderWarning`:  This is raised when an operation is performed on two NameSets of different order.  A warning filter ensures that it gets shown every time such an operation is performed.  Example:\n\n```python\n>>> a = namemaker.make_name_set(['John', 'Jack', 'Jake'], order = 2)\n>>> b = namemaker.make_name_set(['Fred', 'Frank', 'Francis'], order = 3)\n>>> c = a + b\n\nWarning (from warnings module):\n  File \"<pyshell#6>\", line 1\nOrderWarning: Adding NameSet of order 3 to NameSet of order 2. Result will be of order 2.\n```\n\n`NameLenWarning`:  This is raised when an operation is performed on two NameSets using different `name_len_func`s.  A warning filter ensures that it gets shown every time such an operation is performed.\n\n`CopyWarning`:  This is raised when calling `copy.copy` on a NameSet, because NameSets do not support shallow copying.\n\n# Managing the Random Number Generator\nNamemaker uses Python's built-in `random` module, but uses its own instance of `random.Random` to avoid interfering with the state of the `random` module.  You can access the RNG with the `namemaker.get_rng` function.  Being an instance of `random.Random`, it supports all the same methods as the `random` module itself, like `getstate`, `setstate`, and `seed`.  You can also replace the default RNG with your own RNG, using `namemaker.set_rng(my_rng)`.  The only requirement on `my_rng` is that it has a `choice` method that takes in a list and returns a single element from that list.\n\n# Misc. functions\n`estimate_syllables(name)`:  Returns an estimate of how many syllables are in a string.  It's only an estimate, but gets pretty close for most strings.  It can be used as a `name_len_func`.\n\n`stress_test(names, **kwargs)`:  Similar to sample, but instead of printing names, it runs NameSet.make_name until it fails to make a name, then prints info about how many names were made compared to the number of names in the training data.  It probably isn't of much practical use, as most NameSets will generate thousands of names before failing.  Its main purpose is to show that most training data can generate more than enough names for practical purposes, even when avoiding repeats.\n\n# Cookbook\nHere are some different uses of namemaker to provide an idea of how the inputs can be varied for different results.\n\nPlanet names using the built-in Greek mythology data:\n\n```python\n>>> sample('Greek mythology', n = 10, order = 2)\nHypnonus\nDaritracus\nElegon\nAncalias\nAmphous\nPriama\nHestes\nIacis\nIphimerope\nEndis\n```\n\nShort and punchy town names:\n\n```python\n>>> namemaker.sample('PA towns', n = 10,\n         n_candidates = 20,\n         pref_candidate = namemaker.MIN,\n         name_len_func = namemaker.estimate_syllables)\nHall\nSlights\nCree\nTreek\nSmeth\nBroads\nFair\nChest\nGlen\nGreath\n```\n\nAbsurd town names.  The `validation_func` is preventing odd combinations of prepositions.  You may find it necessary to add others if you use this recipe for real:\n\n```python\n>>> preposition_combos = ['on-upon', 'upon-on', 'on-by', 'by-on', 'in-on', 'on-in']\n>>> namemaker.sample('England towns', n = 10,\n       n_candidates = 20,  # Make lots of candidates and choose the longest one\n       pref_candidate = namemaker.MAX,\n       validation_func = lambda name: not any(x in name for x in preposition_combos)\n                                      and not name.endswith(' and'))\nEastleby-in-Furntworthwellingham\nWhitnes-upon-Cleobury\nRoyal Leamingdenham\nSnaith-Wolsingden Aycliffield\nChing Carlborouch witherley\nIngleby-in-Furnham Streesallington upon-Humbergh-in-Arden\nBark-on-West Gringham\nLeominsteland Castleby Welwyn Garst\nNew Minsterton Spa\nMadebroughbridge\n```\n\nFantastical or evil-sounding item names (e.g. “The Sword of ...”):\n\n```python\n>>> namemaker.sample('PA towns', n = 10,\n         order = 1,\n         name_len_func = lambda name: sum(letter not in 'AEIOUaeiou' for letter in 'name'), # don't count vowels toward name length\n         pref_candidate = namemaker.MAX,                                       # maximize consonants\n         validation_func = lambda name: 4 < len(name) <= 8\n                                        and any(n in 'aeiou' for n in name)) # make sure there's a vowel in there somewhere\nFildron\nSootostz\nCilllch\nCoielty\nSudtenhf\nBellen\nS. Hing\nJalllan\nStilal\nLes Mee\n```\n\n# Sources of built-in training data\n[1] BABY NAMES IN AMERICA: Most Popular Baby Names for Boys in America, *NameCensus.com*, accessed at https://namecensus.com/baby_names/boys250.html\n\n[2] BABY NAMES IN AMERICA: Most Popular Baby Names for Girls in America, *NameCensus.com*, accessed at https://namecensus.com/baby_names/girls250.html\n\n[3] What is the most common last name in the United States?, *NameCensus.com*, accessed at https://namecensus.com/data/1000.html\n\n[4] List of towns in England, *Wikipedia*, accessed at https://en.wikipedia.org/wiki/List_of_towns_in_England\n\n[5] List of towns and boroughs in Pennsylvania, *Wikipedia*, accessed at https://en.wikipedia.org/wiki/List_of_towns_and_boroughs_in_Pennsylvania\n\n[6] List of Greek mythological figures, *Encyclopedia Britannica*, accessed at https://www.britannica.com/topic/list-of-Greek-mythological-figures-2027488\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/Rickmsd/namemaker",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "namemaker",
    "package_url": "https://pypi.org/project/namemaker/",
    "platform": "",
    "project_url": "https://pypi.org/project/namemaker/",
    "project_urls": {
      "Homepage": "https://github.com/Rickmsd/namemaker"
    },
    "release_url": "https://pypi.org/project/namemaker/1.1.2/",
    "requires_dist": null,
    "requires_python": ">=3.6",
    "summary": "A random name generator using Markov chains.",
    "version": "1.1.2",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 11547446,
  "releases": {
    "1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "cf9c718c9d589944e1159368cb9cddceea559b9387bbf7287d47170e32bf3632",
          "md5": "0fd17d0a24a05a826822041bdc41be7c",
          "sha256": "5c2edfae4403f3ac870f11ff4c3b3cdf00b83f7057f1cf9bd60c51e70cc7feac"
        },
        "downloads": -1,
        "filename": "namemaker-1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "0fd17d0a24a05a826822041bdc41be7c",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 40312,
        "upload_time": "2021-03-16T00:34:12",
        "upload_time_iso_8601": "2021-03-16T00:34:12.038505Z",
        "url": "https://files.pythonhosted.org/packages/cf/9c/718c9d589944e1159368cb9cddceea559b9387bbf7287d47170e32bf3632/namemaker-1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b5f7f0b03dc29bc5fbf3bba76f060884e2737a461b87f60f2f5d022805375461",
          "md5": "5a2f012f3eb18aa4ae205b59de2e64eb",
          "sha256": "1bc67101a553db98e205da000ee032b9505027964f3ee15bad63eca264308c9b"
        },
        "downloads": -1,
        "filename": "namemaker-1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "5a2f012f3eb18aa4ae205b59de2e64eb",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 46956,
        "upload_time": "2021-03-16T00:34:14",
        "upload_time_iso_8601": "2021-03-16T00:34:14.009148Z",
        "url": "https://files.pythonhosted.org/packages/b5/f7/f0b03dc29bc5fbf3bba76f060884e2737a461b87f60f2f5d022805375461/namemaker-1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "30cecccaa301e4b06306b7f473115d317edc14df894f204e1b2ab809286a2270",
          "md5": "630657e765c9eba7fcb2778b3d9663e4",
          "sha256": "74f7df8abb4998a6e274735111ece2904d016bfdc14fcca035b7f5b5788b8629"
        },
        "downloads": -1,
        "filename": "namemaker-1.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "630657e765c9eba7fcb2778b3d9663e4",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 40528,
        "upload_time": "2021-03-18T02:51:57",
        "upload_time_iso_8601": "2021-03-18T02:51:57.789343Z",
        "url": "https://files.pythonhosted.org/packages/30/ce/cccaa301e4b06306b7f473115d317edc14df894f204e1b2ab809286a2270/namemaker-1.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a0daa29cccdf685a7ef9dc6cad1b6af6b7978ee344386734d5b75c1929962e59",
          "md5": "f81570edc717437276ef8496b92581cb",
          "sha256": "65237cee6250dd3e0a3b138251e4073a98ce196bd8933b5f2424b344f60f2332"
        },
        "downloads": -1,
        "filename": "namemaker-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "f81570edc717437276ef8496b92581cb",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 47171,
        "upload_time": "2021-03-18T02:51:59",
        "upload_time_iso_8601": "2021-03-18T02:51:59.365651Z",
        "url": "https://files.pythonhosted.org/packages/a0/da/a29cccdf685a7ef9dc6cad1b6af6b7978ee344386734d5b75c1929962e59/namemaker-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "90b58cdf16f08b6a7c4900431531ab0ab2da4c14c2d66f148f7a78284037c008",
          "md5": "e1b21246eb5d957ada8d34a906a39476",
          "sha256": "d58a9890f73350edac7b2334fc8a56d05680b4503c54fb98fceca7cdf8f86bf0"
        },
        "downloads": -1,
        "filename": "namemaker-1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "e1b21246eb5d957ada8d34a906a39476",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 42039,
        "upload_time": "2021-03-30T00:24:35",
        "upload_time_iso_8601": "2021-03-30T00:24:35.374288Z",
        "url": "https://files.pythonhosted.org/packages/90/b5/8cdf16f08b6a7c4900431531ab0ab2da4c14c2d66f148f7a78284037c008/namemaker-1.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6b21cca75905bce432c0c00cbb2281031353e60c7a3547ca708a41ab09398d6a",
          "md5": "b57e5f10465498447715891fee76301e",
          "sha256": "c13326c4ca1c98f7b4d88f4e1e5b30892cd985c4ab19bac67dd2ce44c3a924fb"
        },
        "downloads": -1,
        "filename": "namemaker-1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "b57e5f10465498447715891fee76301e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 49415,
        "upload_time": "2021-03-30T00:24:37",
        "upload_time_iso_8601": "2021-03-30T00:24:37.174622Z",
        "url": "https://files.pythonhosted.org/packages/6b/21/cca75905bce432c0c00cbb2281031353e60c7a3547ca708a41ab09398d6a/namemaker-1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a6481283e7b36e22808ee17ab9ba5dc06505ed4cf0450f160092f1879de7c12c",
          "md5": "7f34ffff489afed0c5ea7dfbb439beb0",
          "sha256": "721465e40020e8513c94420712eaa6bfc2a06fc47d97598d837c25640ee7e732"
        },
        "downloads": -1,
        "filename": "namemaker-1.1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "7f34ffff489afed0c5ea7dfbb439beb0",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 42158,
        "upload_time": "2021-04-03T01:30:44",
        "upload_time_iso_8601": "2021-04-03T01:30:44.803970Z",
        "url": "https://files.pythonhosted.org/packages/a6/48/1283e7b36e22808ee17ab9ba5dc06505ed4cf0450f160092f1879de7c12c/namemaker-1.1.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "de842f61f5db7c9347514fd4105f8bdf3742a325a82fb503b23dab95774fdc6b",
          "md5": "5d1b61d0747e64b17940058174789427",
          "sha256": "bd275e8784691da22e34cac8b8afbf0afac1d5cb41cd1dcd6fab9bf770cda098"
        },
        "downloads": -1,
        "filename": "namemaker-1.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "5d1b61d0747e64b17940058174789427",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 49613,
        "upload_time": "2021-04-03T01:30:46",
        "upload_time_iso_8601": "2021-04-03T01:30:46.286784Z",
        "url": "https://files.pythonhosted.org/packages/de/84/2f61f5db7c9347514fd4105f8bdf3742a325a82fb503b23dab95774fdc6b/namemaker-1.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6ea063af0f8e31548688a00048a9505ac3fbcc1c67f272dbadd89e0118174048",
          "md5": "350288cc735c5b6cb1c08c65e661bc94",
          "sha256": "aa003bd75de08a5e24ee746a9bb917a13391beb39f6b9b109898be31e87b908a"
        },
        "downloads": -1,
        "filename": "namemaker-1.1.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "350288cc735c5b6cb1c08c65e661bc94",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 42093,
        "upload_time": "2021-09-25T14:53:59",
        "upload_time_iso_8601": "2021-09-25T14:53:59.436561Z",
        "url": "https://files.pythonhosted.org/packages/6e/a0/63af0f8e31548688a00048a9505ac3fbcc1c67f272dbadd89e0118174048/namemaker-1.1.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c81daec79207cd71a91996251173ed0e6f2bdbf9adaf74080d2ee1c771134323",
          "md5": "7986825dedc87fb87f00323e5d53996d",
          "sha256": "a03803ce357bb71473d3ddf54782a9bbf646590ea9df7ce5470b91b4e1aa062d"
        },
        "downloads": -1,
        "filename": "namemaker-1.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "7986825dedc87fb87f00323e5d53996d",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 49137,
        "upload_time": "2021-09-25T14:54:00",
        "upload_time_iso_8601": "2021-09-25T14:54:00.987406Z",
        "url": "https://files.pythonhosted.org/packages/c8/1d/aec79207cd71a91996251173ed0e6f2bdbf9adaf74080d2ee1c771134323/namemaker-1.1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "6ea063af0f8e31548688a00048a9505ac3fbcc1c67f272dbadd89e0118174048",
        "md5": "350288cc735c5b6cb1c08c65e661bc94",
        "sha256": "aa003bd75de08a5e24ee746a9bb917a13391beb39f6b9b109898be31e87b908a"
      },
      "downloads": -1,
      "filename": "namemaker-1.1.2-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "350288cc735c5b6cb1c08c65e661bc94",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6",
      "size": 42093,
      "upload_time": "2021-09-25T14:53:59",
      "upload_time_iso_8601": "2021-09-25T14:53:59.436561Z",
      "url": "https://files.pythonhosted.org/packages/6e/a0/63af0f8e31548688a00048a9505ac3fbcc1c67f272dbadd89e0118174048/namemaker-1.1.2-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "c81daec79207cd71a91996251173ed0e6f2bdbf9adaf74080d2ee1c771134323",
        "md5": "7986825dedc87fb87f00323e5d53996d",
        "sha256": "a03803ce357bb71473d3ddf54782a9bbf646590ea9df7ce5470b91b4e1aa062d"
      },
      "downloads": -1,
      "filename": "namemaker-1.1.2.tar.gz",
      "has_sig": false,
      "md5_digest": "7986825dedc87fb87f00323e5d53996d",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 49137,
      "upload_time": "2021-09-25T14:54:00",
      "upload_time_iso_8601": "2021-09-25T14:54:00.987406Z",
      "url": "https://files.pythonhosted.org/packages/c8/1d/aec79207cd71a91996251173ed0e6f2bdbf9adaf74080d2ee1c771134323/namemaker-1.1.2.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}