{
  "info": {
    "author": "Network to Code, LLC",
    "author_email": "opensource@networktocode.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: Apache Software License",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.10",
      "Programming Language :: Python :: 3.7",
      "Programming Language :: Python :: 3.8",
      "Programming Language :: Python :: 3.9"
    ],
    "description": "# Nautobot Device Onboarding plugin\n\n<!-- Build status with linky to the builds for ease of access. -->\n[![Build Status](https://travis-ci.com/nautobot/nautobot-device-onboarding.svg?token=29s5AiDXdkDPwzSmDpxg&branch=master)](https://travis-ci.com/nautobot/nautobot-device-onboarding)\n\nA plugin for [Nautobot](https://github.com/nautobot/nautobot) to easily onboard new devices.\n\n`nautobot-device-onboarding` is using [Netmiko](https://github.com/ktbyers/netmiko) and \n[NAPALM](https://napalm.readthedocs.io/en/latest/) to simplify the onboarding \nprocess of a new device into Nautobot down to, in many cases, an IP Address and a site. In some cases, the user may also\nhave to specify a specific Device Platform and Device Port. Regardless, the Onboarding Plugin greatly simplifies the onboarding process\nby allowing the user to specify a small amount of info and having the plugin populate a much larger amount of device data in Nautobot.\n\nIn most cases, the user would specify:\n* Device Name \n* Site\n* Platform **\n* Transport Port **\n\n> ** Necessary for onboarding NXOS API, Arista EOS, or any other platform not using SSH as a transport\n\nAnd the Onboarding Plugin would populate the following:\n* Device Type (Model) - Creates if it does not exist\n* Device Role - defaults to `network` \n* Platform - Creates Cisco IOS, Cisco NXOS (ssh), and Junos Platforms if they do not exist\n* Manufacturer - Creates Cisco/Juniper/Arista if it does not exist\n* Management Interface\n* Management Interface IP\n* Serial Number (when available)\n\nThe goal of this plugin is not to import everything about a device into Nautobot. Rather, the goal is to quickly build an \ninventory of basic device data in Nautobot that provides basic info on how to access the devices. \nFor example, getting the Management IP and Platform data into Nautobot allows a follow-on tool that uses the \nbasic info to access each device, retrieve data, and then populate Nautobot with that data.\n\nOne example of a solution that can retrieve that additional device data and import it into Nautobot is the [Network Importer](https://github.com/networktocode/network-importer).\nOther options would include an Ansible playbook or a Python script.\n\n\n## Installation\n\nIf using the installation pattern from the Nautobot Documentation, you will need sudo to the `nautobot` user before installing so that you install the package into the Nautobot virtual environment.\n\n```no-highlight\n$ sudo -iu nautobot\n```\n\nThe plugin is available as a Python package in PyPI and can be installed with `pip3`.\n\n```no-highlight\n$ pip3 install nautobot-device-onboarding\n```\n\n### Compatibility Matrix\n\n|                              | Nautobot 1.0 |\n| ---------------------------- | ------------ |\n| Device Onboarding plugin 1.0 | X            |\n\nTo ensure Device Onboarding plugin is automatically re-installed during future upgrades, create a file named\n`local_requirements.txt` (or append if it already exists) in the\n[`NAUTOBOT_ROOT`](https://nautobot.readthedocs.io/en/latest/configuration/optional-settings/#nautobot_root) directory and list the `nautobot-device-onboarding` package:\n\n```no-highlight\n$ echo nautobot-device-onboarding >> $NAUTOBOT_ROOT/local_requirements.txt\n```\n\n### Nautobot Configuration\n\n#### Enabling Plugin\n\nOnce installed, the plugin needs to be enabled in your `nautobot_config.py`\n```python\n# In your nautobot_config.py\nPLUGINS = [\"nautobot_device_onboarding\"]\n```\n\n#### Plugin Configuration Options\n\nAlthough plugin can run without providing any settings, the plugin behavior can be controlled with the following list of settings defined in `nautobot_config.py`\n\n- `create_platform_if_missing` boolean (default True), If True, a new platform object will be created if the platform discovered by netmiko do not already exist and is in the list of supported platforms (`cisco_ios`, `cisco_nxos`, `arista_eos`, `juniper_junos`, `cisco_xr`)\n- `create_device_type_if_missing` boolean (default True), If True, a new device type object will be created if the model discovered by Napalm do not match an existing device type.\n- `create_manufacturer_if_missing` boolean (default True), If True, a new manufacturer object will be created if the manufacturer discovered by Napalm is do not match an existing manufacturer, this option is only valid if `create_device_type_if_missing` is True as well.\n- `create_device_role_if_missing` boolean (default True), If True, a new device role object will be created if the device role provided was not provided as part of the onboarding and if the `default_device_role` do not already exist.\n- `create_management_interface_if_missing` boolean (default True), If True, add management interface and IP address to the device. If False no management interfaces will be created, nor will the IP address be added to Nautobot, while the device will still get added.\n- `default_device_status` string (default \"Active\"), status assigned to a new device by default.\n- `default_ip_status` string (default \"Active\"), status assigned to a new device management IP.\n- `default_device_role` string (default \"network\")\n- `default_device_role_color` string (default FF0000), color assigned to the device role if it needs to be created.\n- `default_management_interface` string (default \"PLACEHOLDER\"), name of the management interface that will be created, if one can't be identified on the device.\n- `default_management_prefix_length` integer ( default 0), length of the prefix that will be used for the management IP address, if the IP can't be found.\n- `skip_device_type_on_update` boolean (default False), If True, an existing Nautobot device will not get its device type updated. If False, device type will be updated with one discovered on a device.\n- `skip_manufacturer_on_update` boolean (default False), If True, an existing Nautobot device will not get its manufacturer updated. If False, manufacturer will be updated with one discovered on a device.\n- `platform_map` (dictionary), mapping of an **auto-detected** Netmiko platform to the **Nautobot slug** name of your Platform. The dictionary should be in the format:\n    ```python\n    {\n      <Netmiko Platform>: <Nautobot Slug>\n    }\n    ```\n- `onboarding_extensions_map` (dictionary), mapping of a NAPALM driver name to the loadable Python module used as an onboarding extension. The dictionary should be in the format:\n    ```python\n    {\n      <Napalm Driver Name>: <Loadable Python Module>\n    }\n    ```\n- `object_match_strategy` (string), defines the method for searching models. There are\ncurrently two strategies, strict and loose. Strict has to be a direct match, normally \nusing a slug. Loose allows a range of search criteria to match a single object. If multiple\nobjects are returned an error is raised. \n\nModify `nautobot_config.py` with settings of your choice. Example settings are shown below:\n\n```python\n# Example settings In your nautobot_config.py\nPLUGINS_CONFIG = {\n  \"nautobot_device_onboarding\": {\n    \"default_ip_status\": \"Active\",\n    \"default_device_role\": \"leaf\",\n    \"skip_device_type_on_update\": True,\n  }\n}\n```\n\n\n#### NAPALM Credentials\n\nThe Onboarding Plugin uses NAPALM. You can configure a default NAPALM username and password in `nautobot_config.py`.\n\nWhen `NAPALM_USERNAME` and `NAPALM_PASSWORD` are configured in `nautobot_config.py`, the user does not have to \nspecify the `Username` and `Password` fields in the Device Onboarding Task, unless they wish to override the values in \n`nautobot_config.py`:\n\n```python\n# Credentials that Nautobot will uses to authenticate to devices when connecting via NAPALM.\nNAPALM_USERNAME = \"<napalm username>\"\nNAPALM_PASSWORD = \"<napalm pwd>\"\n```\n\n### Final Configuration Steps\n\nAfter installing the plugin and modifying `nautobot_config.py`, as the `nautobot` user, run the server migration:\n\n```no-highlight\n$ nautobot-server migrate\n```\n\nFinally, as root, restart Nautobot and the Nautobot worker.\n\n```no-highlight\n$ sudo systemctl restart nautobot nautobot-worker\n```\n\n## Upgrades\n\nWhen a new release comes out it may be necessary to run a migration of the database to account for any changes in the data models used by this plugin. Execute the command `nautobot-server migrate` from the Nautobot install `nautobot/` directory after updating the package.\n\n## Usage\n\n### Preparation\n\nTo properly onboard a device, user needs to provide, at a minimum:\n1. The Device's Site \n2. The Device's primary IP address or DNS Name\n\n> For DNS Name Resolution to work, the instance of Nautobot must be able to resolve the name of the\n> device to IP address.\n\nIf other attributes (`Platform`, `Device Type`, `Device Role`) are provided in the onboarding task, the plugin will use provided value for the onboarded device.\nIf `Platform`, `Device Type` and/or `Device Role` are not provided, the plugin will try to identify these information automatically and, based on the settings, it can create them in Nautobot as needed.\n> If the Platform is provided, it must point to an existing Nautobot Platform. NAPALM driver of this platform will be used only if it is defined for the platform in Nautobot.\n> To use a preferred NAPALM driver, either define it in Nautobot per platform or in the plugins settings under `platform_map`\n\n#### SSH Autodetect\n\nPlugin recognizes platform types with a Netmiko SSH Autodetect mechanism. The user will need to specify additional information for platforms where Netmiko's `ssh_autodetect` feature does not work. \n[Here is the list](https://github.com/ktbyers/netmiko/blob/v3.4.0/netmiko/ssh_autodetect.py#L50) of platforms supported by `ssh_autodetect`.\n\nThe `nautobot-device-onboarding` plugin can be used with any devices that are supported by NAPALM. Even custom NAPALM driver plugins can be used with a bit of effort.\n\nDevices that are supported by NAPALM but are not running SSH or don't have support for `ssh_autodetect` will still work with this plugin, but will require some additional information in the onboarding task.\n\nThe table below shows which common platforms will be SSH auto-detected by default.\n\n|Platform     |Platform Autodetect|\n--------------|--------------------\nJuniper/Junos | Yes (when running Netconf over SSH)|\nCisco IOS-XE  |Yes|\nCisco NXOS (ssh) | Yes|\nCisco NXOS (nxapi)| No|\nArista EOS | No|\n\nFor the platforms where SSH auto-detection does not work, the user will need to:\n1. Manually define a Platform in Nautobot (this will be a one-time task in order to support any number of devices using this Platform)\n2. During onboarding, a Port and Platform must explicitly be specified (in addition to the IP and Site)\n\n## IOS and Junos Auto-Created Platforms\n\nThe Onboarding Plugin will automatically create Platforms for vendor operating systems where platform auto-detection works.\nThe picture below shows the details of auto-created Platforms for `cisco_ios` and `juniper_junos`.\n\n![cisco_ios_platform](https://github.com/nautobot/nautobot-plugin-device-onboarding/raw/main/docs/images/platform_cisco_ios.png)\n![juniper_junos_platform](https://github.com/nautobot/nautobot-plugin-device-onboarding/raw/main/docs/images/platform_juniper_junos.png)\n\n## Creating a Platform\n\nThis section will demonstrate how to create a new Platform in the Nautobot UI. Specifically, it will offer examples for\ncreating Cisco `nxapi` and Arista `eos` Platforms, but the concepts are applicable to any Platform that is manually created.\n\nIn the Nautobot dropdown menu, go to Devices--> Platforms--> Add/+.\n\nDefine the attributes for the Platform on this screen and click on the 'Create' button. \n\nThe Slug value will be auto-populated based on the Platform Name, but you can overwrite that auto-populated value. For the platform to work correctly with this plugin, in many cases you will need to set a specific Slug value for it to work properly.\n\n'Manufacturer' and 'NAPALM arguments' are optional.\n\n### Cisco NXOS Platform\n\nA Platform that will work with NXOS devices running the `nxapi` feature must have specific values for these attributes:\n* `Slug` **SHOULD** be `cisco_nxos` (you may have to overwrite the auto-populated Slug value)\n* `NAPALM driver` **MUST** be `nxos`\n\n\n### Arista EOS Platform\n\nA Platform that will work with Arista EOS devices must have specific values for these attributes:\n* `Slug` **SHOULD** be `arista_eos` (you may have to overwrite the auto-populated Slug value)\n* `NAPALM driver` **MUST** be `eos`\n\n\n## Device Onboarding\n\n### Onboard a new device\n\nA new device can be onboarded via :\n- A web form  `/plugins/device-onboarding/add/`\n- A CSV form to import multiple devices in bulk. `/plugins/device-onboarding/import/`\n- An API, `POST /api/plugins​/device-onboarding​/onboarding​/`\n\nDuring a successful onboarding process, a new device will be created in Nautobot with its management interface and its primary IP assigned. The management interface will be discovered on the device based on the IP address provided.\n\n> By default, the plugin is using the credentials defined in the main `configuration.py` for Napalm (`NAPALM_USERNAME`/`NAPALM_PASSWORD`). It's possible to define specific credentials for each onboarding task.\n\n\n### Onboarding a Cisco NXOS Device Running the `nxapi` Feature\n\nWhen onboarding an NXOS device with the `nxapi` feature, there are a few requirements:\n* The `Port` must be the same value configured for `nxapi https port` on the Cisco Nexus device\n* The `Platform` must be explicitly set to be one with the specific parameters in the [Cisco NXOS Platform](#cisco-nxos-platform) section\n\n### Onboarding an Arista EOS Device \n\nWhen onboarding an Arista EOS device, there are a few requirements:\n* The `Port` must be the same value configured for HTTPS on the Arista device\n* The `Platform` must be explicitly set to be the one with the specific parameters in the [Arista EOS Platform](#arista-eos-platform) section\n\n\n## Consult the Status of Onboarding Tasks\n\nThe status of the onboarding process for each device is maintained is a dedicated table in Nautobot and can be retrived :\n- Via the UI `/plugins/device-onboarding/`\n- Via the API `GET /api/plugins​/device-onboarding​/onboarding​/`\n\n## API\n\nThe plugin includes 4 API endpoints to manage the onboarding tasks:\n\n```shell\nGET        /api/plugins​/device-onboarding​/onboarding​/       Check status of all onboarding tasks.\nPOST    ​   /api/plugins​/device-onboarding​/onboarding​/       Onboard a new device\nGET     ​   /api/plugins​/device-onboarding​/onboarding​/{id}​/  Check the status of a specific onboarding task\nDELETE    ​ /api/plugins​/device-onboarding​/onboarding​/{id}​/  Delete a specific onboarding task\n```\n\n## Customizing Onboarding Behaviour With Onboarding Extensions\n\nThis plugin provides methods to customize onboarding behaviour. By creating onboarding extensions, it is possible to onboard switch stacks, HA pairs and perform other customizations. Please see the dedicated FAQ for [device onboarding](https://github.com/nautobot/nautobot-plugin-device-onboarding/blob/develop/docs/onboarding-extensions/onboarding_extensions.md).\n\n\n## Contributing\n\nPull requests are welcomed and automatically built and tested against multiple version of Python and multiple version of Nautobot through TravisCI.\n\nThe project is packaged with a light development environment based on `docker-compose` to help with the local development of the project and to run the tests within TravisCI.\n\nThe project is following Network to Code software development guideline and is leveraging:\n- Black, Pylint, Bandit and pydocstyle for Python linting and formatting.\n- Django unit test to ensure the plugin is working properly.\n\n### CLI Helper Commands\n\nThe project is coming with a CLI helper based on [invoke](http://www.pyinvoke.org/) to help setup the development environment. The commands are listed below in 3 categories `dev environment`, `utility` and `testing`. \n\nEach command can be executed with `invoke <command>`. All commands support the arguments `--nautobot-ver` and `--python-ver` if you want to manually define the version of Python and Nautobot to use. Each command also has its own help `invoke <command> --help`\n\n#### Local dev Environment\n```\n  build            Build all docker images.\n  debug            Start Nautobot and its dependencies in debug mode.\n  destroy          Destroy all containers and volumes.\n  start            Start Nautobot and its dependencies in detached mode.\n  stop             Stop Nautobot and its dependencies.\n```\n\n#### Utility \n```\n  cli              Launch a bash shell inside the running Nautobot container.\n  create-user      Create a new user in django (default: admin), will prompt for password.\n  makemigrations   Run Make Migration in Django.\n  nbshell          Launch a nbshell session.\n```\n#### Testing \n\n```\n  tests            Run all tests for this plugin.\n  pylint           Run pylint code analysis.\n  pydocstyle       Run pydocstyle to validate docstring formatting adheres to NTC defined standards.\n  bandit           Run bandit to validate basic static code security analysis.\n  black            Run black to check that Python files adhere to its style standards.\n  unittest         Run Django unit tests for the plugin.\n```\n\n## Questions\n\nFor any questions or comments, please check the [FAQ](FAQ.md) first and feel free to swing by the [Network to Code slack channel](https://networktocode.slack.com/) (channel #networktocode).\nSign up [here](http://slack.networktocode.com/)\n\n## Screenshots\n\nList of Onboarding Tasks\n![Onboarding Tasks](https://github.com/nautobot/nautobot-plugin-device-onboarding/raw/main/docs/images/onboarding_tasks_view.png)\n\nCSV form to import multiple devices\n![CSV Form](https://github.com/nautobot/nautobot-plugin-device-onboarding/raw/main/docs/images/csv_import_view.png)\n\nOnboard a single device\n![Single Device Form](https://github.com/nautobot/nautobot-plugin-device-onboarding/raw/main/docs/images/single_device_form.png)\n\nMenu \n![Menu](https://github.com/nautobot/nautobot-plugin-device-onboarding/raw/main/docs/images/menu.png)\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/nautobot/nautobot-plugin-device-onboarding",
    "keywords": "nautobot,network,onboarding,django",
    "license": "Apache-2.0",
    "maintainer": "",
    "maintainer_email": "",
    "name": "nautobot-device-onboarding",
    "package_url": "https://pypi.org/project/nautobot-device-onboarding/",
    "platform": null,
    "project_url": "https://pypi.org/project/nautobot-device-onboarding/",
    "project_urls": {
      "Homepage": "https://github.com/nautobot/nautobot-plugin-device-onboarding",
      "Repository": "https://github.com/nautobot/nautobot-plugin-device-onboarding"
    },
    "release_url": "https://pypi.org/project/nautobot-device-onboarding/1.1.2/",
    "requires_dist": [
      "napalm (>=2.5.0,<5)",
      "nautobot (>=1.0.0)",
      "zipp (>=3.4.0,<4.0.0)"
    ],
    "requires_python": ">=3.7,<4.0",
    "summary": "A plugin for Nautobot to easily onboard new devices.",
    "version": "1.1.2",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 14612960,
  "releases": {
    "0.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b8196b4272bbe99441fdf7f240c9ea060f9f31447db60f158ace1c731a679014",
          "md5": "fcb6cd78afa60094ede8dcf9a7db5063",
          "sha256": "e94e92486f240184d1b67b08eab33c0ef211e8ca841fc82bc4597f2554580613"
        },
        "downloads": -1,
        "filename": "nautobot-device-onboarding-0.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "fcb6cd78afa60094ede8dcf9a7db5063",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 518,
        "upload_time": "2021-02-24T01:21:47",
        "upload_time_iso_8601": "2021-02-24T01:21:47.134781Z",
        "url": "https://files.pythonhosted.org/packages/b8/19/6b4272bbe99441fdf7f240c9ea060f9f31447db60f158ace1c731a679014/nautobot-device-onboarding-0.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7d49fbf7878bf128acc64b517ceaef4f348e8b661559e81e7b5601ddd59b0ed4",
          "md5": "711cb5554710744a2c168a04eba431dc",
          "sha256": "c7ee1a2bbfc1d576c675d28d8ada871ea8818590a9f12400a895ada47e4c5b6c"
        },
        "downloads": -1,
        "filename": "nautobot_device_onboarding-1.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "711cb5554710744a2c168a04eba431dc",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6,<4.0",
        "size": 594978,
        "upload_time": "2021-02-26T10:41:05",
        "upload_time_iso_8601": "2021-02-26T10:41:05.016756Z",
        "url": "https://files.pythonhosted.org/packages/7d/49/fbf7878bf128acc64b517ceaef4f348e8b661559e81e7b5601ddd59b0ed4/nautobot_device_onboarding-1.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1cbf4b0763bf316a2e346fab3c4a41a3b9fd71243efb07cfbb9a47ac72fcda99",
          "md5": "69237f5c7674879e364df1f5ba99247f",
          "sha256": "3bf658571e610bc15940f93d588dfcbc6d7843e289462d2d96c50559e8888990"
        },
        "downloads": -1,
        "filename": "nautobot-device-onboarding-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "69237f5c7674879e364df1f5ba99247f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6,<4.0",
        "size": 572693,
        "upload_time": "2021-02-26T10:41:03",
        "upload_time_iso_8601": "2021-02-26T10:41:03.488443Z",
        "url": "https://files.pythonhosted.org/packages/1c/bf/4b0763bf316a2e346fab3c4a41a3b9fd71243efb07cfbb9a47ac72fcda99/nautobot-device-onboarding-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f1b92f74c17c4c7ad59860d1ba58f2f08df97ac55994dece94a1d52f1ad2c606",
          "md5": "81f53a9047be81428c71dacaee0d8f56",
          "sha256": "504fd7d00681cf73a0f2199cd8fd798ae858e8fafa2ac491678b19676bad3b59"
        },
        "downloads": -1,
        "filename": "nautobot_device_onboarding-1.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "81f53a9047be81428c71dacaee0d8f56",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6,<4.0",
        "size": 595702,
        "upload_time": "2021-04-27T11:29:03",
        "upload_time_iso_8601": "2021-04-27T11:29:03.124195Z",
        "url": "https://files.pythonhosted.org/packages/f1/b9/2f74c17c4c7ad59860d1ba58f2f08df97ac55994dece94a1d52f1ad2c606/nautobot_device_onboarding-1.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "bb33f0fa52c5d48c4dbae18799befb43060593a3757adf6fb40b5c879386dae1",
          "md5": "8444d403bb930ec063a3f34724460d16",
          "sha256": "103a8b75af39aa0a58cae7414c481c06a23c401d12154aada46c88df8a2b8fb7"
        },
        "downloads": -1,
        "filename": "nautobot-device-onboarding-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "8444d403bb930ec063a3f34724460d16",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6,<4.0",
        "size": 573182,
        "upload_time": "2021-04-27T11:29:01",
        "upload_time_iso_8601": "2021-04-27T11:29:01.330423Z",
        "url": "https://files.pythonhosted.org/packages/bb/33/f0fa52c5d48c4dbae18799befb43060593a3757adf6fb40b5c879386dae1/nautobot-device-onboarding-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "49a932a3a8570416ac66011ef02bb2f625531a93eb8575081dad783f7b6296a5",
          "md5": "698812d9980967a5a38fd233fc2cdc5d",
          "sha256": "63b21f0c6f7d6485733be9fb1df92cc6b0332c759c6a5394295acaf7c158d758"
        },
        "downloads": -1,
        "filename": "nautobot_device_onboarding-1.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "698812d9980967a5a38fd233fc2cdc5d",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6,<4.0",
        "size": 776611,
        "upload_time": "2021-08-03T18:22:42",
        "upload_time_iso_8601": "2021-08-03T18:22:42.020213Z",
        "url": "https://files.pythonhosted.org/packages/49/a9/32a3a8570416ac66011ef02bb2f625531a93eb8575081dad783f7b6296a5/nautobot_device_onboarding-1.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "fdfdc47700cb16d11a1b460bd9b5b17c02296cc602cfbdac157d3cf3cd6d3b82",
          "md5": "eec09f3bc3d203081d0dc58293d20b54",
          "sha256": "1a607872154b06ef68297242daa4a44f9298071d6dfebcc2eeeca3b38cfe8a3b"
        },
        "downloads": -1,
        "filename": "nautobot-device-onboarding-1.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "eec09f3bc3d203081d0dc58293d20b54",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6,<4.0",
        "size": 754521,
        "upload_time": "2021-08-03T18:22:40",
        "upload_time_iso_8601": "2021-08-03T18:22:40.756604Z",
        "url": "https://files.pythonhosted.org/packages/fd/fd/c47700cb16d11a1b460bd9b5b17c02296cc602cfbdac157d3cf3cd6d3b82/nautobot-device-onboarding-1.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "604dcd0a3ff0a60f98e2ece8d4ae99918967de5a9d3250d0b2a407dd16bddeec",
          "md5": "3e8a66c96cbc26273743f3ab61bc7086",
          "sha256": "e041a50030ded41541b4609fb15fae59ef6b657bab9bd94c3ef3321dc9334acb"
        },
        "downloads": -1,
        "filename": "nautobot_device_onboarding-1.1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "3e8a66c96cbc26273743f3ab61bc7086",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6,<4.0",
        "size": 777507,
        "upload_time": "2021-09-08T08:48:37",
        "upload_time_iso_8601": "2021-09-08T08:48:37.587715Z",
        "url": "https://files.pythonhosted.org/packages/60/4d/cd0a3ff0a60f98e2ece8d4ae99918967de5a9d3250d0b2a407dd16bddeec/nautobot_device_onboarding-1.1.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d2174e82bd63c806743d5da1129a9494f24435b5732fb41a8bab0fd259069a72",
          "md5": "e4bf0740f8a8fb356d52ab0420b832a3",
          "sha256": "2ac8872815a68c40b6dfa915f39562810ec6310fae7e641c252627483b0cc99c"
        },
        "downloads": -1,
        "filename": "nautobot-device-onboarding-1.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "e4bf0740f8a8fb356d52ab0420b832a3",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6,<4.0",
        "size": 754916,
        "upload_time": "2021-09-08T08:48:35",
        "upload_time_iso_8601": "2021-09-08T08:48:35.933783Z",
        "url": "https://files.pythonhosted.org/packages/d2/17/4e82bd63c806743d5da1129a9494f24435b5732fb41a8bab0fd259069a72/nautobot-device-onboarding-1.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "18c11de1ef01d2c57572d29a2de9c12d864140551d36c03142e74a162e833c9e",
          "md5": "e52e4937776fd478b7f659c6e36dc581",
          "sha256": "a8fdf340d69882f7d42363da8532cbb359a5e9461f9af8a09b3962866cf89c8a"
        },
        "downloads": -1,
        "filename": "nautobot_device_onboarding-1.1.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "e52e4937776fd478b7f659c6e36dc581",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7,<4.0",
        "size": 779329,
        "upload_time": "2022-08-01T13:28:55",
        "upload_time_iso_8601": "2022-08-01T13:28:55.028305Z",
        "url": "https://files.pythonhosted.org/packages/18/c1/1de1ef01d2c57572d29a2de9c12d864140551d36c03142e74a162e833c9e/nautobot_device_onboarding-1.1.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "626759d910a24b46ba846da7f37e09bb9d95ea226d7501c289bb5588c737030f",
          "md5": "20a9b2c55b91244043690f83c40c7937",
          "sha256": "6056befa2d4fecd2657541e98d7a8a98882c5c7bb07e3b8daece24c89272f851"
        },
        "downloads": -1,
        "filename": "nautobot-device-onboarding-1.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "20a9b2c55b91244043690f83c40c7937",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7,<4.0",
        "size": 755895,
        "upload_time": "2022-08-01T13:28:57",
        "upload_time_iso_8601": "2022-08-01T13:28:57.589139Z",
        "url": "https://files.pythonhosted.org/packages/62/67/59d910a24b46ba846da7f37e09bb9d95ea226d7501c289bb5588c737030f/nautobot-device-onboarding-1.1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "18c11de1ef01d2c57572d29a2de9c12d864140551d36c03142e74a162e833c9e",
        "md5": "e52e4937776fd478b7f659c6e36dc581",
        "sha256": "a8fdf340d69882f7d42363da8532cbb359a5e9461f9af8a09b3962866cf89c8a"
      },
      "downloads": -1,
      "filename": "nautobot_device_onboarding-1.1.2-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "e52e4937776fd478b7f659c6e36dc581",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.7,<4.0",
      "size": 779329,
      "upload_time": "2022-08-01T13:28:55",
      "upload_time_iso_8601": "2022-08-01T13:28:55.028305Z",
      "url": "https://files.pythonhosted.org/packages/18/c1/1de1ef01d2c57572d29a2de9c12d864140551d36c03142e74a162e833c9e/nautobot_device_onboarding-1.1.2-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "626759d910a24b46ba846da7f37e09bb9d95ea226d7501c289bb5588c737030f",
        "md5": "20a9b2c55b91244043690f83c40c7937",
        "sha256": "6056befa2d4fecd2657541e98d7a8a98882c5c7bb07e3b8daece24c89272f851"
      },
      "downloads": -1,
      "filename": "nautobot-device-onboarding-1.1.2.tar.gz",
      "has_sig": false,
      "md5_digest": "20a9b2c55b91244043690f83c40c7937",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7,<4.0",
      "size": 755895,
      "upload_time": "2022-08-01T13:28:57",
      "upload_time_iso_8601": "2022-08-01T13:28:57.589139Z",
      "url": "https://files.pythonhosted.org/packages/62/67/59d910a24b46ba846da7f37e09bb9d95ea226d7501c289bb5588c737030f/nautobot-device-onboarding-1.1.2.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}