{
  "info": {
    "author": "Neongecko",
    "author_email": "developers@neon.ai",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "\nSpoken answers api for wikipedia\n\n\n```python\nfrom neon_solver_wikipedia_plugin import WikipediaSolver\n\nd = WikipediaSolver()\n\nquery = \"who is Isaac Newton\"\n\n# full answer\nans = d.spoken_answer(query)\nprint(ans)\n# Sir Isaac Newton  (25 December 1642 – 20 March 1726/27) was an English mathematician, physicist, astronomer, alchemist, theologian, and author (described in his time as a \"natural philosopher\") widely recognised as one of the greatest mathematicians and physicists of all time and among the most influential scientists. He was a key figure in the philosophical revolution known as the Enlightenment. His book Philosophiæ Naturalis Principia Mathematica (Mathematical Principles of Natural Philosophy), first published in 1687, established classical mechanics. Newton also made seminal contributions to optics, and shares credit with German mathematician Gottfried Wilhelm Leibniz for developing infinitesimal calculus.\n# In the Principia, Newton formulated the laws of motion and universal gravitation that formed the dominant scientific viewpoint until it was superseded by the theory of relativity. Newton used his mathematical description of gravity to derive Kepler's laws of planetary motion, account for tides, the trajectories of comets, the precession of the equinoxes and other phenomena, eradicating doubt about the Solar System's heliocentricity. He demonstrated that the motion of objects on Earth and celestial bodies could be accounted for by the same principles. Newton's inference that the Earth is an oblate spheroid was later confirmed by the geodetic measurements of Maupertuis, La Condamine, and others, convincing most European scientists of the superiority of Newtonian mechanics over earlier systems.\n# Newton built the first practical reflecting telescope and developed a sophisticated theory of colour based on the observation that a prism separates white light into the colours of the visible spectrum. His work on light was collected in his highly influential book Opticks, published in 1704. He also formulated an empirical law of cooling, made the first theoretical calculation of the speed of sound, and introduced the notion of a Newtonian fluid. In addition to his work on calculus, as a mathematician Newton contributed to the study of power series, generalised the binomial theorem to non-integer exponents, developed a method for approximating the roots of a function, and classified most of the cubic plane curves.\n# Newton was a fellow of Trinity College and the second Lucasian Professor of Mathematics at the University of Cambridge. He was a devout but unorthodox Christian who privately rejected the doctrine of the Trinity. He refused to take holy orders in the Church of England unlike most members of the Cambridge faculty of the day. Beyond his work on the mathematical sciences, Newton dedicated much of his time to the study of alchemy and biblical chronology, but most of his work in those areas remained unpublished until long after his death. Politically and personally tied to the Whig party, Newton served two brief terms as Member of Parliament for the University of Cambridge, in 1689–1690 and 1701–1702. He was knighted by Queen Anne in 1705 and spent the last three decades of his life in London, serving as Warden (1696–1699) and Master (1699–1727) of the Royal Mint, as well as president of the Royal Society (1703–1727).\n\n# chunked answer, \"tell me more\"\nfor sentence in d.long_answer(query):\n    print(sentence[\"title\"])\n    print(sentence[\"summary\"])\n    print(sentence.get(\"img\"))\n\n    # Isaac Newton\n    # Sir Isaac Newton  (25 December 1642 – 20 March 1726/27) was an English mathematician, physicist, astronomer, alchemist, theologian, and author (described in his time as a \"natural philosopher\") widely recognised as one of the greatest mathematicians and physicists of all time and among the most influential scientists.\n    # https://upload.wikimedia.org/wikipedia/commons/3/3b/Portrait_of_Sir_Isaac_Newton%2C_1689.jpg\n\n    # Isaac Newton\n    # He was a key figure in the philosophical revolution known as the Enlightenment.\n    # https://upload.wikimedia.org/wikipedia/commons/3/3b/Portrait_of_Sir_Isaac_Newton%2C_1689.jpg\n\n    # Isaac Newton\n    # His book Philosophiæ Naturalis Principia Mathematica (Mathematical Principles of Natural Philosophy), first published in 1687, established classical mechanics.\n    # https://upload.wikimedia.org/wikipedia/commons/3/3b/Portrait_of_Sir_Isaac_Newton%2C_1689.jpg\n\n    # Isaac Newton\n    # Newton also made seminal contributions to optics, and shares credit with German mathematician Gottfried Wilhelm Leibniz for developing infinitesimal calculus.\n    # In the Principia, Newton formulated the laws of motion and universal gravitation that formed the dominant scientific viewpoint until it was superseded by the theory of relativity.\n    # https://upload.wikimedia.org/wikipedia/commons/3/3b/Portrait_of_Sir_Isaac_Newton%2C_1689.jpg\n\n    # Isaac Newton\n    # Newton used his mathematical description of gravity to derive Kepler's laws of planetary motion, account for tides, the trajectories of comets, the precession of the equinoxes and other phenomena, eradicating doubt about the Solar System's heliocentricity.\n    # https://upload.wikimedia.org/wikipedia/commons/3/3b/Portrait_of_Sir_Isaac_Newton%2C_1689.jpg\n\n    # Isaac Newton\n    # He demonstrated that the motion of objects on Earth and celestial bodies could be accounted for by the same principles.\n    # https://upload.wikimedia.org/wikipedia/commons/3/3b/Portrait_of_Sir_Isaac_Newton%2C_1689.jpg\n\n    # Isaac Newton\n    # Newton's inference that the Earth is an oblate spheroid was later confirmed by the geodetic measurements of Maupertuis, La Condamine, and others, convincing most European scientists of the superiority of Newtonian mechanics over earlier systems.\n    # Newton built the first practical reflecting telescope and developed a sophisticated theory of colour based on the observation that a prism separates white light into the colours of the visible spectrum.\n    # https://upload.wikimedia.org/wikipedia/commons/3/3b/Portrait_of_Sir_Isaac_Newton%2C_1689.jpg\n\n    # Isaac Newton\n    # His work on light was collected in his highly influential book Opticks, published in 1704.\n    # https://upload.wikimedia.org/wikipedia/commons/3/3b/Portrait_of_Sir_Isaac_Newton%2C_1689.jpg\n\n    # Isaac Newton\n    # He also formulated an empirical law of cooling, made the first theoretical calculation of the speed of sound, and introduced the notion of a Newtonian fluid.\n    # https://upload.wikimedia.org/wikipedia/commons/3/3b/Portrait_of_Sir_Isaac_Newton%2C_1689.jpg\n\n    # Isaac Newton\n    # In addition to his work on calculus, as a mathematician Newton contributed to the study of power series, generalised the binomial theorem to non-integer exponents, developed a method for approximating the roots of a function, and classified most of the cubic plane curves.\n    # Newton was a fellow of Trinity College and the second Lucasian Professor of Mathematics at the University of Cambridge.\n    # https://upload.wikimedia.org/wikipedia/commons/3/3b/Portrait_of_Sir_Isaac_Newton%2C_1689.jpg\n\n    # Isaac Newton\n    # He was a devout but unorthodox Christian who privately rejected the doctrine of the Trinity.\n    # https://upload.wikimedia.org/wikipedia/commons/3/3b/Portrait_of_Sir_Isaac_Newton%2C_1689.jpg\n\n    # Isaac Newton\n    # He refused to take holy orders in the Church of England unlike most members of the Cambridge faculty of the day.\n    # https://upload.wikimedia.org/wikipedia/commons/3/3b/Portrait_of_Sir_Isaac_Newton%2C_1689.jpg\n\n    # Isaac Newton\n    # Beyond his work on the mathematical sciences, Newton dedicated much of his time to the study of alchemy and biblical chronology, but most of his work in those areas remained unpublished until long after his death.\n    # https://upload.wikimedia.org/wikipedia/commons/3/3b/Portrait_of_Sir_Isaac_Newton%2C_1689.jpg\n\n    # Isaac Newton\n    # Politically and personally tied to the Whig party, Newton served two brief terms as Member of Parliament for the University of Cambridge, in 1689–1690 and 1701–1702.\n    # https://upload.wikimedia.org/wikipedia/commons/3/3b/Portrait_of_Sir_Isaac_Newton%2C_1689.jpg\n\n\n# bidirectional auto translate by passing lang context\nsentence = d.spoken_answer(\"Quem é Isaac Newton\",\n                           context={\"lang\": \"pt\"})\nprint(sentence)\n# Sir Isaac Newton (25 de dezembro de 1642 - 20 de março de 1726/27) foi um matemático, físico, astrônomo, alquimista, teólogo e autor (descrito em seu tempo como um \"filósofo natural\") amplamente reconhecido como um dos maiores matemáticos e físicos de todos os tempos e entre os cientistas mais influentes. Ele era uma figura chave na revolução filosófica conhecida como Iluminismo. Seu livro Philosophiæ Naturalis Principia Mathematica (Princípios matemáticos da Filosofia Natural), publicado pela primeira vez em 1687, estabeleceu a mecânica clássica. Newton também fez contribuições seminais para a óptica, e compartilha crédito com o matemático alemão Gottfried Wilhelm Leibniz para desenvolver cálculo infinitesimal.\n# No Principia, Newton formulou as leis do movimento e da gravitação universal que formaram o ponto de vista científico dominante até ser superado pela teoria da relatividade. Newton usou sua descrição matemática da gravidade para derivar as leis de Kepler do movimento planetário, conta para as marés, as trajetórias dos cometas, a precessão dos equinócios e outros fenômenos, erradicando dúvidas sobre a heliocentricidade do Sistema Solar. Ele demonstrou que o movimento de objetos na Terra e corpos celestes poderia ser contabilizado pelos mesmos princípios. A inferência de Newton de que a Terra é um esferóide oblate foi mais tarde confirmada pelas medidas geodésicas de Maupertuis, La Condamine, e outros, convencendo a maioria dos cientistas europeus da superioridade da mecânica newtoniana sobre sistemas anteriores.\n# Newton construiu o primeiro telescópio reflexivo prático e desenvolveu uma teoria sofisticada da cor baseada na observação de que um prisma separa a luz branca nas cores do espectro visível. Seu trabalho sobre luz foi coletado em seu livro altamente influente Opticks, publicado em 1704. Ele também formulou uma lei empírica de resfriamento, fez o primeiro cálculo teórico da velocidade do som e introduziu a noção de um fluido Newtoniano. Além de seu trabalho em cálculo, como um matemático Newton contribuiu para o estudo da série de energia, generalizou o teorema binomial para expoentes não inteiros, desenvolveu um método para aproximar as raízes de uma função e classificou a maioria das curvas de plano cúbico.\n# Newton era um companheiro do Trinity College e o segundo professor Lucasian de Matemática na Universidade de Cambridge. Ele era um cristão devoto, mas não ortodoxo, que rejeitou privadamente a doutrina da Trindade. Ele se recusou a tomar ordens sagradas na Igreja da Inglaterra, ao contrário da maioria dos membros da faculdade de Cambridge do dia. Além de seu trabalho nas ciências matemáticas, Newton dedicou grande parte de seu tempo ao estudo da alquimia e da cronologia bíblica, mas a maioria de seu trabalho nessas áreas permaneceu inédita até muito tempo depois de sua morte. Politicamente e pessoalmente ligado ao partido Whig, Newton serviu dois mandatos breves como membro do Parlamento para a Universidade de Cambridge, em 1689-1690 e 1701-1702. Ele foi condecorado pela rainha Anne em 1705 e passou as últimas três décadas de sua vida em Londres, servindo como Warden (1696-1699) e Master (1699–1727) da Royal Mint, bem como presidente da Royal Society (1703–1727)\n\n```\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/NeonGeckoCom/neon_solver_wikipedia_plugin",
    "keywords": "mycroft plugin utterance fallback query",
    "license": "bsd3",
    "maintainer": "",
    "maintainer_email": "",
    "name": "neon-solver-wikipedia-plugin",
    "package_url": "https://pypi.org/project/neon-solver-wikipedia-plugin/",
    "platform": null,
    "project_url": "https://pypi.org/project/neon-solver-wikipedia-plugin/",
    "project_urls": {
      "Homepage": "https://github.com/NeonGeckoCom/neon_solver_wikipedia_plugin"
    },
    "release_url": "https://pypi.org/project/neon-solver-wikipedia-plugin/0.0.2a1/",
    "requires_dist": [
      "neon-solvers",
      "requests",
      "wikipedia-for-humans",
      "simplematch"
    ],
    "requires_python": "",
    "summary": "A question solver plugin for ovos/neon/mycroft",
    "version": "0.0.2a1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17138010,
  "releases": {
    "0.0.2a0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8279a10e09f15a316dd6939c6c1ce9628b7c4ca58c1e560109a3c853b8d9bc2c",
          "md5": "683314572b9e2d67e99dadab395f7a48",
          "sha256": "a2e0b0be00bdc3e327b31f2abe95d982880776e2236780049dcb46db204e65d8"
        },
        "downloads": -1,
        "filename": "neon_solver_wikipedia_plugin-0.0.2a0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "683314572b9e2d67e99dadab395f7a48",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 10882,
        "upload_time": "2022-05-31T20:47:21",
        "upload_time_iso_8601": "2022-05-31T20:47:21.163749Z",
        "url": "https://files.pythonhosted.org/packages/82/79/a10e09f15a316dd6939c6c1ce9628b7c4ca58c1e560109a3c853b8d9bc2c/neon_solver_wikipedia_plugin-0.0.2a0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.2a1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1cd6074342261fe1806f26b2f5ca22604d607c42d56458b6a2c01277062ea527",
          "md5": "114f7a8e70e27edc5cf2ac3cf7300405",
          "sha256": "b8cc04fa61634c3077bf5a9d761a5b1962d1a2f98b586ff938579e2c68a2ae08"
        },
        "downloads": -1,
        "filename": "neon_solver_wikipedia_plugin-0.0.2a1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "114f7a8e70e27edc5cf2ac3cf7300405",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 10883,
        "upload_time": "2022-06-01T20:48:46",
        "upload_time_iso_8601": "2022-06-01T20:48:46.003133Z",
        "url": "https://files.pythonhosted.org/packages/1c/d6/074342261fe1806f26b2f5ca22604d607c42d56458b6a2c01277062ea527/neon_solver_wikipedia_plugin-0.0.2a1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "1cd6074342261fe1806f26b2f5ca22604d607c42d56458b6a2c01277062ea527",
        "md5": "114f7a8e70e27edc5cf2ac3cf7300405",
        "sha256": "b8cc04fa61634c3077bf5a9d761a5b1962d1a2f98b586ff938579e2c68a2ae08"
      },
      "downloads": -1,
      "filename": "neon_solver_wikipedia_plugin-0.0.2a1-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "114f7a8e70e27edc5cf2ac3cf7300405",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 10883,
      "upload_time": "2022-06-01T20:48:46",
      "upload_time_iso_8601": "2022-06-01T20:48:46.003133Z",
      "url": "https://files.pythonhosted.org/packages/1c/d6/074342261fe1806f26b2f5ca22604d607c42d56458b6a2c01277062ea527/neon_solver_wikipedia_plugin-0.0.2a1-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}