{
  "info": {
    "author": "",
    "author_email": "LucaBonfiglioli <luca.bonfiglioli@gmail.com>",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 3 - Alpha",
      "Intended Audience :: Developers",
      "Intended Audience :: Science/Research",
      "License :: OSI Approved :: GNU General Public License v3 (GPLv3)",
      "Natural Language :: English",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.8",
      "Topic :: Scientific/Engineering",
      "Topic :: Software Development"
    ],
    "description": "# 📊 NNViz\n\nNNViz is a python package to visualize neural networks in a comprehensible way. It is based on [Graphviz](https://graphviz.org/) and [PyTorch](https://pytorch.org/). \n\n<img src=\"./images/example1.png\" height=400> <img src=\"./images/example2.png\" height=400>\n\nMore PDFs examples can be found in the `examples` folder.\n\n# 🧰 Installation\nMake sure you have a working installation of [Graphviz](https://graphviz.org/) on your system.\n- If you are using Windows, graphviz dependencies are easily installable with conda, so consider using [Miniconda](https://docs.conda.io/en/latest/miniconda.html) or [Anaconda](https://www.anaconda.com/products/individual) instead of the plain Python distribution. Trying to install graphviz without conda is generally associated with symptoms like headaches, asphyxiation, and death.\n- Linux users can install graphviz (and graphviz-dev) with their package manager (e.g. `sudo apt install -y graphviz graphviz-dev` on Ubuntu).\n\nThen:\n\n```bash\npip install nnviz\n```\n\n# 🖥️ CLI Usage\n\nCurrently, nnviz is supposed to be used via its CLI, and not as a library. A proper API will be added in the future, most likely with the 1.x release. Anyway, the CLI can do a lot of things, and it is pretty easy to use.\n\nI will try to explain the most important things here, but you can always display everything there is to know by entering:\n```bash\nnnviz --help\n```\n\nThe only entry point of NNViz is the `nnviz` command that in its simplest form does roughly the following:\n1. Load a model from torchvision, a local file or an installed package.\n2. Perform a symbolic trace of the model and extract a graph representation of it.\n3. Draw the graph representation to a pdf file named after the model.\n\nAdditional behavior is controlled by a set of options and flags that can be passed to the command.\n\n## 🔥 Visualizing built-in torchvision models\n\nYou can visualize any model from torchvision by passing its name to the `nnviz` command.\n```bash\nnnviz resnet18\nnnviz efficientnet_b0\nnnviz convnext_tiny\n```\n\n<img src=\"./images/resnet18.jpeg\" height=800> <img src=\"./images/efficientnet_b0.jpeg\" height=800> <img src=\"./images/convnext_tiny.jpeg\" height=800>\n\nThese models are saved to a pdf file named after the model in the current working directory.\n\n## 📦 Visualizing models from installed packages\n\nBeing limited to torchvision models is not very useful, so you can also visualize models from any installed package, as long as they are importable. To do so, you need to pass the fully qualified name of a python function (or class constructor) that returns an instance of the model you want to visualize.\n\n```bash\nnnviz package.module.submodule:MyModelConstructor\nnnviz package.module.submodule:a_function_that_returns_a_model\n```\n\n⚠️**NOTE:** Currently, there is a limitation with this feature: the model constructor **must** take no arguments (or at least no required ones), because I cannot find a way to easily pass arguments to the constructor from the command line. A workaround is to manually create a python file with a function that returns the model, and then pass that function to the `nnviz` command. I know, it's not ideal, this will be fixed in the 0.5.x release.\n\n## 🐍 Visualizing models from python files\n\nAnd if want to visualize a model that is not in a package, you can also pass a path to a python file that contains the model constructor. NNViz will attempt to dynamically import the file and extract the model constructor from it.\n```bash\nnnviz path/to/file.py:MyModelConstructor\nnnviz path/to/file.py:a_function_that_returns_a_model\n```\n\n⚠️**NOTE:** Currently, there is a limitation with this feature: the model constructor **must** take no arguments (or at least no required ones), because I cannot find a way to easily pass arguments to the constructor from the command line. A workaround is to manually create a python file with a function that returns the model, and then pass that function to the `nnviz` command. I know, it's not ideal, this will be fixed in the 0.5.x release.\n\n## 📑 Choosing a different output file\nSaving the pdf to the current working directory is not very useful, so you can also pass a path to a different file to the `nnviz` command using the `-o` or `--out` option.\n```bash\nnnviz resnet18 -o my_resnet18.pdf\nnnviz resnet18 -o my_resnet18.png\nnnviz resnet18 -o my_resnet18.svg\nnnviz resnet18 --out /very/custom/path/to/wow.pdf\n```\n\n## 📜 Dumping/Loading the graph representation\n\nIf you plan to create multiple visualizations of the same model, you can use JSON files to store the graph representation of the model, and then load it from the file instead of performing a symbolic trace every time, which, if done repeatedly, can become quite slow.\n\nTo dump the graph representation to a JSON file, you can pass the `-j` or `--json` flag to the `nnviz` command.\nThe JSON file will be saved together with the pdf file, just with a \".json\" extension instead of \".pdf\".\n```bash\nnnviz resnet18 -j\nnnviz resnet18 --json\nnnviz resnet18 -j -o /very/custom/path/to/wow.pdf\n```\n\nIn the third example (above), the JSON file will be saved to `/very/custom/path/to/wow.json`.\n\nOk, but once you have the JSON file, how do you load it? Well, you can pass the path to the JSON file to the `nnviz` command as if it was a model name, and it will load the graph representation from the file instead of performing a trace, and it will be blazing fast.\n```bash\nnnviz /very/custom/path/to/wow.json\n```\n\n## 🖼️ Displaying the output file (for the laziest people)\n\nIf you happen to be too lazy to open the pdf file manually, or press the `F5` key to refresh the file explorer, you can also pass the `-s` or `--show` flag to the `nnviz` command to automatically open the generated file with the default app associated to the specified file type.\n```bash\nnnviz resnet18 -s\nnnviz resnet18 --show\n```\n\n## 🪓 Plotting only a specific submodule\n\nSometimes you may be interested in visualizing only a specific submodule instead of the whole thing. To do so, you can pass the `-l` or `--layer` option to the `nnviz` command, followed by the name of the submodule you want to visualize. The submodule can be specified using a dot-separated path, just like you would do in python.\n```bash\nnnviz resnet18 -l layer2.0\nnnviz convnext_tiny -l features.3.0.block\n```\n\nThis will only plot the specified submodule and all of its children and save the result to a pdf file named after the submodule. For example, in the first example above, the pdf file will be named `resnet18_layer2-0.pdf` and in the second, `convnext_tiny_features-3-0-block.pdf`. You can always change the name of the output file using the `-o` or `--out` option.\n\n<img src=\"./images/resnet18_layer2-0.jpeg\" height=600> <img src=\"./images/convnext_tiny_features-3-0-block.jpeg\" height=600>\n\n## 🌂 Reducing the complexity of the graph\n\nWith NNViz, you can also collapse groups of nodes into a single \"collapsed\" node to reduce the complexity of the graph and improve readability. Currently the CLI allows to do so by two different methods:\n- **Collapse by depth**: merge together all nodes that have a depth greater than a specified value. The \"depth\" of a node is the number of nested submodules it is contained in. \n- **Collapse by name**: merge together all nodes that share the same path prefix. This is useful in case you want a detailed view of a specific submodule, but you don't care about the details of the other ones.\n\nThe depth collpsing is enabled by default and set to 2, which in most cases is enough to reduce the complexity of the graph without losing too much information. You can change the depth by passing the `-d` or `--depth` option to the `nnviz` command, followed by the desired depth.\n\nSet the depth to -1 to disable depth collapsing and plot the whole graph.\n\n```bash\nnnviz efficientnet_b0 -d 1\nnnviz efficientnet_b0 -d 2\nnnviz efficientnet_b0 -d 3\nnnviz efficientnet_b0 --depth -1\n```\n\n<img src=\"./images/efficientnet_b0_1.jpeg\" height=600> <img src=\"./images/efficientnet_b0_2.jpeg\" height=600> <img src=\"./images/efficientnet_b0_3.jpeg\" height=600> <img src=\"./images/efficientnet_b0_full.jpeg\" height=600>\n\nTo collapse by name, you can pass the `-c` or `--collapse` option to the `nnviz` command, followed by a path prefix. The path prefix can be specified using a dot-separated path, just like you would do in python. You can use this option multiple times to collapse multiple groups of nodes.\n\n```bash\nnnviz efficientnet_b0 --depth -1 --collapse features\n```\n\nHere, the \"classifier\" will be fully displayed, but the \"features\" submodule will be collapsed into a single node.\n\n## 🧮 Data tracing\n\nBesides the graph representation of the model, NNViz can also trace the data flow through the model and represent the data as labels attached to each graph edge. This is useful to understand how the data is transformed by the model and to identify potential bottlenecks in the model.\n\nData tracing cannot be done with a simple symbolic trace, because the data is not available at that point. We need to actually run the model on some bogus data to get the data flow, which can be more expensive in terms of both time and resources. For this reason data tracing is disabled by default.\n\nTo enable data tracing, just provide an input to the model. You can do with the `-i` or `--input` option to the `nnviz` command, followed by a string representing the input you want to pass. \n\nParsing complex tensor data from CLI is not easy, NNViz will try its best, but you may need to pass the input data as python code.\n\nSupported input types:\n- `default`: The default tensor used most commonly for image classification models. Equivalent to python code: \n    ```python\n    {\"x\": torch.randn(1, 3, 224, 224)}\n    ```\n- `image<side>`: A square image with the specified side (e.g. `image256`, `image64`, `image241`...). Equivalent to python code:\n    ```python\n    {\"x\": torch.randn(1, 3, side, side)}\n    ``` \n- `image<height>x<width>`: An image with the specified height and width (e.g. `image256x256`, `image64x64`, `image241x241`...). Equivalent to python code:\n    ```python\n    {\"x\": torch.randn(1, 3, height, width)}\n    ```\n- `tensor<shape>`: A tensor with the specified shape (e.g. `tensor18x23`, `tensor30`, `tensor4x5x256`...). Equivalent to python code:\n    ```python\n    {\"x\": torch.randn(*shape)}\n    ```\n- `<key1>:<value1>;<key2>:<value2>;...`: A dictionary of key-value pairs. Keys are strings and values can be any of the above types. This is especially useful for models that take multiple inputs, or have an input name different from `x`.\n- Plain python code. If the input string is not recognized as one of the above types, it will be evaluated as python code. This is useful if you want to pass a more complex input, like a list of tensors, or a dictionary of tensors. When using python code you will have the module `torch` already imported, so you can use it to create tensors. Example:\n    ```python\n    {\"x\": torch.randn(1, 3, 224, 224), \"y\": [torch.randn(1, 3, 224, 224), torch.randn(1, 3, 224, 224)]}\n    ```\n\n⚠️**NOTE:** You cannot just spam \"default\" into every model that comes to your mind. To perform data tracing you need to pass something that makes sense for the model. For example, if you pass an image to a linear model, the data tracing will fail, so it will default to the basic graph representation.\n\nLet's see some examples:\n\n```bash\nnnviz resnet18 -i default\n```\n\n<img src=\"./images/resnet18_edges.jpeg\" height=600>\n\nAs you can see, every edge is now labeled with the shape of the tensor that flows through it. \n\nAnd what if the data is not a tensor? I thought of that too! NNViz can also represent nested lists and dictionaries as HTML tables.\n\n<img src=\"./images/list_of_tensors.jpeg\" height=200>\n\n## 🎨 Customizing the graph\n\nNNViz also allows you to customize the graph representation of the model using the `-S` or `--style` option. Currently there are limited style options, but I plan to add more in the future. You can pass multiple style options at once, providing the `-S` option multiple times.\n\nStyle options are passed as a string in the form `key=value`. Don't worry about the type of the value, it will be automatically inferred by pydantic. The available options are:\n- `fontname`: str - The font to use for the graph. Default is \"Arial\". \n- `default_node_color`: str - The default color for nodes (in case the colorizer fails to return a color). Default is \"gray\". \n- `default_edge_color`: str - The default color for edges. Default is \"black\". \n- `node_style`: str - The style for nodes. See graphviz docs for details. Default is \"rounded,filled\". \n- `node_margin`: str - The horizontal and vertical margin for nodes. See graphviz docs for details. Default is \"0.2,0.1\". \n- `edge_thickness`: str - The thickness of edges. Default is \"2.0\". \n- `graph_title_font_size`: int - The font size for the graph title. Default is 48.\n- `node_title_font_size`: int - The font size for the node title. Default is 24. \n- `cluster_title_font_size`: int - The font size for the cluster title. Default is 18. \n- `show_title`: bool - Whether to show the graph title. Default is True. \n- `show_specs`: bool - Whether to show the specs as a label for each edge. Default is True.\n- `show_node_name`: bool - Whether to show the node name (just below the title). Default is True.\n- `show_node_params`: bool - Whether to show the count of parameters for each node. Default is True.\n- `show_node_arguments`: bool - Whether to show the arguments for each node. Default is True.\n- `show_node_source`: bool - Whether to show the source of each node. Default is True.\n- `show_clusters`: bool - Whether to show the clusters as gray subgraphs. Default is True.\n\n# Why NNViz\n\nDo you want to visualize a torch.nn.Module in a comprehensible way? Here are some options for you:\n\n## Netron\n\n[Netron](https://github.com/lutzroeder/netron) is a web-based viewer for neural network, deep learning and machine learning models. It supports `ONNX`, `Keras`, `CoreML`, `Caffe`, `Caffe2`, `MXNet`, `Darknet`, `TensorFlow`, `PyTorch`, `TorchScript`, `CoreML` and `PaddlePaddle` models. \n\nCool huh? No. It sucks ass:\n\n- You have to compile your models to ONNX runtime - which can be a pain in the ass and 90% of the times requires you to apply changes to your code. \n- Try to visualize a simple resnet18. You will get an endless clusterfuck of incomprehensible nodes that cannot be collapsed or reduced in any way. This is not useful. \n\n## Torchviz\n\n[Torchviz](https://github.com/szagoruyko/pytorchviz) is really just a toy project that just displays the backpropagation graph:\n\n- Module hierarchy is not tracked/displayed.\n- Cannot collapse nodes.\n- Limited to differentiable models.\n\n## Torchview\n\n[Torchview](https://github.com/mert-kurttutan/torchview) seems pretty cool. I did not know of its existence when I started developing nnviz, and in fact was developed in the same period. \n\nWell, they do pretty much everything that nnviz does, take a look at their style, and come back here. :D\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "deeplearning,graph,neural,nnviz,visualization",
    "license": "GNU General Public License v3 (GPLv3)",
    "maintainer": "",
    "maintainer_email": "",
    "name": "nnviz",
    "package_url": "https://pypi.org/project/nnviz/",
    "platform": null,
    "project_url": "https://pypi.org/project/nnviz/",
    "project_urls": {
      "Issues": "https://github.com/lucabonfiglioli/nnviz/issues",
      "Source": "https://github.com/lucabonfiglioli/nnviz"
    },
    "release_url": "https://pypi.org/project/nnviz/0.4.0/",
    "requires_dist": [
      "networkx>=2.8",
      "numpy",
      "pydantic>=1.10",
      "pygraphviz>=1.9",
      "torch>=1.12",
      "torchvision>=0.13",
      "typer>=0.6.0",
      "build; extra == 'build'",
      "hatch; extra == 'build'",
      "black; extra == 'dev'",
      "flake8; extra == 'dev'",
      "pylama; extra == 'dev'",
      "myst-parser==0.18.0; extra == 'docs'",
      "sphinx-material==0.0.35; extra == 'docs'",
      "sphinx==5.1.1; extra == 'docs'",
      "sphinxcontrib-mermaid==0.7.1; extra == 'docs'",
      "pytest; extra == 'tests'",
      "pytest-cov; extra == 'tests'"
    ],
    "requires_python": ">=3.8",
    "summary": "Neural models visualization.",
    "version": "0.4.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17259667,
  "releases": {
    "0.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "db3c5b17748673da74c28c1ea3d44f650d5aeeaaeb41f28581e742c79851b432",
          "md5": "7bc3f655648b84ef64d0f8a8341fd225",
          "sha256": "650383539b90a84e889959862c4f86c7a4c7658bd515f565d816108dbb480062"
        },
        "downloads": -1,
        "filename": "nnviz-0.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "7bc3f655648b84ef64d0f8a8341fd225",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 40664,
        "upload_time": "2023-01-22T14:58:17",
        "upload_time_iso_8601": "2023-01-22T14:58:17.771966Z",
        "url": "https://files.pythonhosted.org/packages/db/3c/5b17748673da74c28c1ea3d44f650d5aeeaaeb41f28581e742c79851b432/nnviz-0.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4d132b14f41771598ece2edaeb1dbcf4d01547253373e7d9455a3de81b52c849",
          "md5": "bcffbad8c19eb63f9a60d46c132007ae",
          "sha256": "b229a852308663b1741a9c07a4fc56b1b6917aa83771f4ab3e4deb8d413dd46a"
        },
        "downloads": -1,
        "filename": "nnviz-0.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "bcffbad8c19eb63f9a60d46c132007ae",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 25104,
        "upload_time": "2023-01-22T14:58:19",
        "upload_time_iso_8601": "2023-01-22T14:58:19.600157Z",
        "url": "https://files.pythonhosted.org/packages/4d/13/2b14f41771598ece2edaeb1dbcf4d01547253373e7d9455a3de81b52c849/nnviz-0.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4163b35a7b0087010adc79337bec36d6f9a37a9c57e4f7014a25a6265c71ee09",
          "md5": "04233dde2689bc5981559372d73cc8fe",
          "sha256": "37070dae69fbfcc220bc8af366bf1a2c5a19be489ee3dab7d691a6631197d100"
        },
        "downloads": -1,
        "filename": "nnviz-0.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "04233dde2689bc5981559372d73cc8fe",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 41075,
        "upload_time": "2023-02-13T10:51:53",
        "upload_time_iso_8601": "2023-02-13T10:51:53.160868Z",
        "url": "https://files.pythonhosted.org/packages/41/63/b35a7b0087010adc79337bec36d6f9a37a9c57e4f7014a25a6265c71ee09/nnviz-0.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5bb490d7af516915d71b0d06c03678583986a2cd52c8567f6759f21ea5dc36fa",
          "md5": "e67dfb7b0c282badb4aaa208a44abc0c",
          "sha256": "dff5633a3980c73c1fafd16ed03ce9787ab48b6401141ada0ef09d2bb81265ee"
        },
        "downloads": -1,
        "filename": "nnviz-0.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "e67dfb7b0c282badb4aaa208a44abc0c",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 25463,
        "upload_time": "2023-02-13T10:51:54",
        "upload_time_iso_8601": "2023-02-13T10:51:54.757347Z",
        "url": "https://files.pythonhosted.org/packages/5b/b4/90d7af516915d71b0d06c03678583986a2cd52c8567f6759f21ea5dc36fa/nnviz-0.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5fd937b1fa88a4d1414ae27176ef6b79b69a6ffd283c6586fe8ec460a414df87",
          "md5": "8639b145c3b4cd9213cf1ef686b80508",
          "sha256": "18237e732444b9faee92fb247a135f5f92de3afa1a9c9edae8c56ebe8b5b7756"
        },
        "downloads": -1,
        "filename": "nnviz-0.2.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "8639b145c3b4cd9213cf1ef686b80508",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 45289,
        "upload_time": "2023-02-17T23:59:30",
        "upload_time_iso_8601": "2023-02-17T23:59:30.303543Z",
        "url": "https://files.pythonhosted.org/packages/5f/d9/37b1fa88a4d1414ae27176ef6b79b69a6ffd283c6586fe8ec460a414df87/nnviz-0.2.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "70c7339b4113f87dd6cc0e82228588b20a3df09aabb61bd6b90ec40a0044358e",
          "md5": "8e741cf0f8f69465b9317a27f98b7572",
          "sha256": "65a4d0c58125f651293a8b92d1c0bf3c1ddcb184d2c892da1730ee9ce980aa73"
        },
        "downloads": -1,
        "filename": "nnviz-0.2.0.tar.gz",
        "has_sig": false,
        "md5_digest": "8e741cf0f8f69465b9317a27f98b7572",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 28934,
        "upload_time": "2023-02-17T23:59:32",
        "upload_time_iso_8601": "2023-02-17T23:59:32.036568Z",
        "url": "https://files.pythonhosted.org/packages/70/c7/339b4113f87dd6cc0e82228588b20a3df09aabb61bd6b90ec40a0044358e/nnviz-0.2.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b15b444250731000f48d5e2752f3edfeec4089bbaab75579dbce211e858d7acf",
          "md5": "44c24bf06d8d6c8962c84c7ecc8a512e",
          "sha256": "78c2a0e301f268957269341bc24bd86ad78c97911235f88f2929f4955307513a"
        },
        "downloads": -1,
        "filename": "nnviz-0.3.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "44c24bf06d8d6c8962c84c7ecc8a512e",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 47004,
        "upload_time": "2023-02-25T20:22:40",
        "upload_time_iso_8601": "2023-02-25T20:22:40.728104Z",
        "url": "https://files.pythonhosted.org/packages/b1/5b/444250731000f48d5e2752f3edfeec4089bbaab75579dbce211e858d7acf/nnviz-0.3.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "39939ead3e8fcfae98f915d492e450e0e2c1500b89385bc7e392adfc074c36ad",
          "md5": "27674a7f89a9e5b6784f3462cb7e9f37",
          "sha256": "2119d8e98ba707e788cf4b4d55d0b45f968171452cf9fe6356d0ea91143243a0"
        },
        "downloads": -1,
        "filename": "nnviz-0.3.0.tar.gz",
        "has_sig": false,
        "md5_digest": "27674a7f89a9e5b6784f3462cb7e9f37",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 30676,
        "upload_time": "2023-02-25T20:22:42",
        "upload_time_iso_8601": "2023-02-25T20:22:42.148843Z",
        "url": "https://files.pythonhosted.org/packages/39/93/9ead3e8fcfae98f915d492e450e0e2c1500b89385bc7e392adfc074c36ad/nnviz-0.3.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9ea2dc3796c595796d3e4c5149f9ac43689f147844c2f09d11b870544bcc5188",
          "md5": "b07c8e3fe85f922557c3a7c633af9aa0",
          "sha256": "01d2320cfae15f09d08ccc3b0521d81579d7c100bbd5bdec03905262ee50f395"
        },
        "downloads": -1,
        "filename": "nnviz-0.3.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "b07c8e3fe85f922557c3a7c633af9aa0",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 47024,
        "upload_time": "2023-02-26T09:49:17",
        "upload_time_iso_8601": "2023-02-26T09:49:17.701498Z",
        "url": "https://files.pythonhosted.org/packages/9e/a2/dc3796c595796d3e4c5149f9ac43689f147844c2f09d11b870544bcc5188/nnviz-0.3.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0e40460d4a28acf12980abeb783658bccbe274780efee21fb8286d73225ea369",
          "md5": "df233b939fb1387e8192800e90669561",
          "sha256": "cc56c07b711781dc8a5ecf96c860401c52d9e8b7ede0a92a2e6996d1e1051fba"
        },
        "downloads": -1,
        "filename": "nnviz-0.3.1.tar.gz",
        "has_sig": false,
        "md5_digest": "df233b939fb1387e8192800e90669561",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 30697,
        "upload_time": "2023-02-26T09:49:19",
        "upload_time_iso_8601": "2023-02-26T09:49:19.274764Z",
        "url": "https://files.pythonhosted.org/packages/0e/40/460d4a28acf12980abeb783658bccbe274780efee21fb8286d73225ea369/nnviz-0.3.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.4.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5f11b66429c77e47e2b56b4379268026ae26d681044c19a99d6f3468f19948f5",
          "md5": "2a950772d188061e3b51fb72ee9cfb9d",
          "sha256": "642da8c2aeb7ea3dfbf8e993082f7ea235df13b2f91d1699fd99232cb15ce34d"
        },
        "downloads": -1,
        "filename": "nnviz-0.4.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "2a950772d188061e3b51fb72ee9cfb9d",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 32708,
        "upload_time": "2023-03-12T10:50:55",
        "upload_time_iso_8601": "2023-03-12T10:50:55.838036Z",
        "url": "https://files.pythonhosted.org/packages/5f/11/b66429c77e47e2b56b4379268026ae26d681044c19a99d6f3468f19948f5/nnviz-0.4.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "13ac76e5b619cb748070d32f53e8f357eb65bb78b8db96f449e26f81bd2f8118",
          "md5": "206df9ca9e97d146cdb85cd5da7306a4",
          "sha256": "842441ab45e55510caf07ad238d5d0960687418f9e6ff922c57e96e31a516ac1"
        },
        "downloads": -1,
        "filename": "nnviz-0.4.0.tar.gz",
        "has_sig": false,
        "md5_digest": "206df9ca9e97d146cdb85cd5da7306a4",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 27575,
        "upload_time": "2023-03-12T10:50:57",
        "upload_time_iso_8601": "2023-03-12T10:50:57.593028Z",
        "url": "https://files.pythonhosted.org/packages/13/ac/76e5b619cb748070d32f53e8f357eb65bb78b8db96f449e26f81bd2f8118/nnviz-0.4.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "5f11b66429c77e47e2b56b4379268026ae26d681044c19a99d6f3468f19948f5",
        "md5": "2a950772d188061e3b51fb72ee9cfb9d",
        "sha256": "642da8c2aeb7ea3dfbf8e993082f7ea235df13b2f91d1699fd99232cb15ce34d"
      },
      "downloads": -1,
      "filename": "nnviz-0.4.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "2a950772d188061e3b51fb72ee9cfb9d",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.8",
      "size": 32708,
      "upload_time": "2023-03-12T10:50:55",
      "upload_time_iso_8601": "2023-03-12T10:50:55.838036Z",
      "url": "https://files.pythonhosted.org/packages/5f/11/b66429c77e47e2b56b4379268026ae26d681044c19a99d6f3468f19948f5/nnviz-0.4.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "13ac76e5b619cb748070d32f53e8f357eb65bb78b8db96f449e26f81bd2f8118",
        "md5": "206df9ca9e97d146cdb85cd5da7306a4",
        "sha256": "842441ab45e55510caf07ad238d5d0960687418f9e6ff922c57e96e31a516ac1"
      },
      "downloads": -1,
      "filename": "nnviz-0.4.0.tar.gz",
      "has_sig": false,
      "md5_digest": "206df9ca9e97d146cdb85cd5da7306a4",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.8",
      "size": 27575,
      "upload_time": "2023-03-12T10:50:57",
      "upload_time_iso_8601": "2023-03-12T10:50:57.593028Z",
      "url": "https://files.pythonhosted.org/packages/13/ac/76e5b619cb748070d32f53e8f357eb65bb78b8db96f449e26f81bd2f8118/nnviz-0.4.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}