{
  "info": {
    "author": "julesontheroad",
    "author_email": "julesontheroad@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: MacOS",
      "Operating System :: Microsoft :: Windows",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.10",
      "Programming Language :: Python :: 3.11",
      "Programming Language :: Python :: 3.9",
      "Topic :: Utilities"
    ],
    "description": "# Nintendo Switch Cleaner and Builder (NSC_Builder)\n![DeviceTag](https://img.shields.io/badge/Device-SWITCH-e60012.svg)  ![LanguageTag](https://img.shields.io/badge/languages-python_batch_html5_javascript-blue.svg)\n\n**Temporarly archived:** Currently i don't have the time to work on this repository, i will reopen it and reactivate issues if i have something to commit or time to work regularly on the project. The titledb fork will still continue to update and i will probably compile a new version including the latest master, don't think it had much changes since the last release i did but i'd probably compile it to include the latest keygeneration changes.\n\n**Update:** Leaving it open for commits.\n\n## 1. Description\n\n**Nintendo Switch Cleaner and Builder**: A multi-purpose tool for interacting with Switch game files - a \"Switch-Army Knife\". Written in Python, Batch, and HTML. Originally developed to remove titlerights and create multicontent NSP/XCI files, though over time has expanded to have significantly more features, specializing in batch processing and file information.\n\nNSC_Builder is based on the work of blawar’s nut.py and LucaFraga’s hacbuild. The core library, which is known as `squirrel`, was originally a nut fork, though over time it has added significant functionality and can be considered its own program. NSCB versions > 0.8 no longer rely on hacbuild for XCI generation, rather using its own code.\n\n## 2. What does it mean to *REMOVE TITLERIGHTS*?\nThis is also known as converting to use *standard crypto* - it means that you have repacked the contents to be installable without a ticket being added to the Switch's database. Theoretically, standard crypto files leave a smaller traceable footprint on your console, provided you're not sending other telemetry to Nintendo. Important: This does NOT mean you can run preloads or dumped content that doesn't have a ticket (sometimes seen as NSX files).\n\n\n## 3. What can I do with this program?\n\nCurrent version of the program allows you to:\n\n1.- Make **multi-content** xci or nsp files.\n\n2.- **Erase titlerights** encryption from nsp files.\n\n3.- **Build xci files** without the “update partition” which means they take less space on your storage.\n\n4.- Take off **deltas** from updates\n\n5.- **Split multi content** back into xci or nsp files\n\n6.- Change the packing of the content between xci and nsp\n\n7.- **Lower the Required System Version** to the actual encryption of the game.\n\n8.- Lower the masterkey needed to decrypt a game.\n\n9.- **Check out information** from a xci and nsp, including the Firmware needed to be able to execute it, the game info, the size of the nca content…\n\n10.- **Check data from nacp and cnmt files** without extracting them from nsp\\xci\n\n10.- Repack xci and nsp content in formats compatible with **fat32**\n\n11.- **Mass build** xci files and nsp files in single and multi content format\n\n12.- **Rename** nsp,xci files to match it's content\n\n13.- **Verify** nsp, nsx, nsz, xci and nca files\n\n14.- Output information in text format\n\n15.- **Extract content** of nsp files and secure partition of xci files\n\n16.- Set jobs for later in multi mode\n\n17.- Separate jobs by based-titleid in multi mode\n\n18.- **Remove bad characters from filenames** (sanitize) or convert asian names to romaji\n\n19.- Extract nca file contents for base games and dlcs or extract ncas as plaintext\n\n20.- **Joiner** for xc*,ns* and 0* fat32 files\n\n21.- **Compression** of nsp files into .nsz files\n\n22.- **Graphical interface** for file information trough a gui running on chromium\\chrome for local files and files on google drive\n\n23.- **Restoration** of nsp\\xci modified with NSC_Builder to their original game nca files.\n\n## 3.1 With the help of DBI installer it can:\n\n24.- **Install or transfer files** to mtp via switch locally, from google drive (auth and links) or from 1fichier\n\n25.- **Generate and transfer** xcis and multicontent xcis from pc to switch\n\n26.- **Autoupdate** your Nintendo Switch locally or from google drive\n\n27- **Search new updates and dlcs** for your installed games via nutdb for your installed games and xci in the gamecard\n\n28- **Dump your saves or games** from your Nintendo Switch\n\n29- **Uninstall** your games and delete archived games/placeholders\n\n30- **Generate and transfer SX autoloader files** for automounting your xcis for SD and HDD locations for scannable locations and non scannable by SX OS\n\n31- **Cleanup duplicated SX OS autoloader files** to avoid collision between SD and HDD files\n\n## 4. Batch modes:\n\nThe batch has 2 modes:\n\n- **auto mode:** you drag nsp files individually or folders with several files over the batch to enter in auto mode.\n\n- **manual mode:** you double click the batch and you can build a list of files to process.\n\nThe behavior of the auto-mode is configured trough the “Configuration menu in manual mode”.\n\n## 5. Manual mode options:\n\n- **MODE 0: Configuration mode.** Let’s you configure the way the program works in both auto and manual mode.\n- **MODE 1: Indidual packing.** Let’s you process a list of files and pack them individually\n  * Pack as nsp\\xci\n  * Supertrimm\\Trimm\\Untrimm xci files\n  * Rename xci or nsp files\n  * Rebuild nsp files in cnmt order and add cnmt.xml\n  * Verify nsp,xci files\n- **MODE 2: Multi packing.** Let’s you pack a list of files in a single xci or nsp file.\n  * Separate files by basedid\n  * Set up jobs for later\n  * Process previous jobs\n- **MODE 3: Multi-Content-Splitter.** Let’s you separate content to nsp and xci files.\n- **MODE 4: File-Info.** Let’s you see and export several info about nsp and xci files\n  * Data about included files in nsp\\xci\n  * Data about content ids in file\n  * Nut info as implemented by nut by blawar\n  * Information about firmware requirements and other game data\n  * Read cnmt file from meta nca\n  * Read nacp file from control nca\n  * Read npdm file from program nca\n  * Verify files with ability of detecting NSCB changes over them\n- **MODE 5: Database Mode.** Let’s you mass output information\n- **MODE 6: Advanced Mode.**\n  * Extracts all contents from a nsp\\xci\n  * Extracts all contents from a nsp\\xci in raw mode\n  * Extracts all contents from a nsp\\xci in plaintext\n  * Extracts files from nca inside a nsp\\xci  \n  * Patches a game that requires s link sccount\n- **MODE 7: File joiner mode.** Joins fat32 splitted files  \n- **MODE 8: Compression\\Decompression**\n  * Compress nsp files into nsz format\n  * Decompress nsz files into nsp files\n- **MODE 9: File Restoration Mode.** Restores modified files that are verifiable\n- **L: Legacy Mode.** Old functions\n- **D: GOOGLE DRIVE MODE:**\n  * Download Files from google drive\n    * Normal Download Function\n    * Search filter and library selection\n    * Download xci files trimmed or supertrimmed\n    * Download nsz files decompressed\n  * Check information about the files\n- **M: MTP MODE:**\n  * Game installation from local files or remote libraries\n  * File transfer from local files or remote libraries\n    * Normal transfer\n    * Generate xci and transfer\n    * Generate multi-xci and transfer\n  * **Autoupdate** the device via local libraries or google drive libraries\n  * **Dump or uninstall files**\n    * Dump installed content from the device to the pc\n    * Uninstall installed content on the device\n    * Delete archived games or placeholders entries from pc\n  * **Backup Savegames** in zips following JKSV format\n  * **Show device information**\n    * Device information shared via mtp\n    * Show installed games and xci on device\n    * Show new updates and dlc for installed games and xci on device. For accuracy xci has to follow NSCB format including the content_number tags\n    * Show archived games/placeholders registries\n    * Show list of available updates and dlcs for archived games\n  * **Generate SX autoloader files**\n    * Generate files for xci on the sd\n    * Generate files for xci in a hdd, optionally push and run a collision check with the SD files\n    * Push SX autoloader files from library folder\n    * Run collision check, cleanup unused SD autoloader files, cleanup colliding autoloader files pointing to HDD (In case a xci with that id is already in the SD)\n\n## 6. Configuration mode:\n\n#### Auto Mode options. (Affects only Auto-Mode)\n\n##### I. REPACK configuration\n\n- NSP\n- XCI\n- BOTH\n\n##### II. FOLDER'S TREATMENT\n\n- Repack folder's files individually (single-content file)\n- Repack folder's files together (multi-content file)\n\n##### III. RSV patching configuration\n\n- Patch Required System Version if it’s bigger than encryption\n- Don’t patch Required System Version if it’s bigger than encryption\n\n##### IV. KEYGENERATION configuration\n\n- Set the maximum keygeneration (encryption) the files are allowed to have.\n\n##### V. Global options. (Affects how the program works globally)\n\n##### VI. Text and background COLOR\n\n- Let’s you choose the colours of the cmd window\n\n##### VII. WORK FOLDER's name\n\n- Let’s you choose the name of the work folder\n\n##### VIII. OUTPUT FOLDER's name\n\n- Let’s you choose the name and location of the output folder\n\n##### IX. DELTA files treatment\n\n- Let’s you choose if you’re going to pack delta NCA files or not. Set to false by default.\n\n##### X. AUTO-EXIT configuration\n- Let’s you choose if the cmd window closes after completing the job.\n\n##### XI. KEY-GENERATION PROMPT\n\n- Let’s you choose if you want to see a prompt asking you to patch RSV and keygeneration in manual mode.\n\n##### XII. File stream BUFFER\n\n- Buffer for file-stream operations\n\n##### XIII. File FAT32\\EXFAT options\n\nPack xci or nsp in fat32 compatible formats or exfat format.\n\n- Change CARD FORMAT to exfat (Default)\n- Change CARD FORMAT to fat32 for SX OS (xc0 and ns0 files)\n- Change CARD FORMAT to fat32 for all CFW (archive folder)\n\n##### XIV. How to ORGANIZE output files (currently unused for new modes)\n\n- Organize files separetely (default)\n- Organize files in folders set by content\n\n##### XV. Set New Mode or Legacy Mode\n\n- Use new more advance methods (default)\n- Use old file processing methods\n\n##### XVI. ROMANIZE names when using direct-multi\n\n- Convert names to romaji (default)\n- Read names from file and keep asian namings when they're read\n\n##### XVII. TRANSLATE descriptions from game-info using google translator\n\n- FALSE (default)\n- TRUE. Translate japanese, chinese and korean descriptions.\n\n##### XVIII. WORKERS use multi threading for renames and database building\n\n- 1 (default\\DEACTIVATED)\n- YOUR NUMBER. Uses several workers to do multiple renames or create multiple database strings at the same time\n\n## 7. Gui for file  information:\n\n- **NSCB File_Info** is a html based gui that gives a graphic interface to NSCB info.\n  Yes, it has game-icons, pictures and that stuff you guys like.\n\n- Current functions are:\n\n  * **Game Information**. Combines data read from file with eshop data from nutdb\n  * **Description:** Description from the eshop (nutdb)\n  * **Image Gallery:** Pictures from the eshop (nutdb)\n  * **BaseID File-Tree:** Shows the lates version for dlcs and updates associated to the game (nutdb)\n  * **Titles:** Advanced Files List from NSCB-new\n  * **NACP Reader** from NSCB\n  * **NPDM Reader** from NSCB\n  * **CNMT Reader** from NSCB\n  * **Verification** from NSCB, till Level 2 so it's loaded fast. Use normal NSCB for hashing for now.\n  * **Game Information**. Combines data read from file with eshop data from nutdb\n  * **Libraries**. Load files from local libraries or google drive, having the library locations setup previously\n  * **Direct Links**. Read information from direct links.\n\n- You'll notice some information like BuildIDs is added now, the cnmt was made more readable and I added detection for multiprogram games like Grandia and Hotline Miami\n\n- **Known Issues:**\n\n  * CSS probably needs some work, specially for fullscreen.\n  * Upper corner menu is a placeholder\n  * NPDM decryption is failing in some games, is on my TODO list\n  * Multicontent files (generally xci) may need some work to improve parsing speeds\n  * Not reading yet splitted files (ns*,xc*,0*) but will add that soon\n\n- **TODO:**\n\n  * Output css to a file for theming\n  * Language translations\n  * Porting NSCB functions\n  * Let user choose nutdb files\n\n- **How to use:**\n\n  * If you have Chrome or Chromium Installed you're good to go.\n  * If you don't want to install those browsers you can use chromium portable.\n\t1. Get the last version for your system here: https://chromium.woolyss.com/\n\t2. Create a folder in ztools called \"Chromium\"\n\t3. Decompress the chromium files somewhere in your pc and execute \"chrlauncher 2.5.6 (64-bit).exe\" or whatever is called in your zip to get the needed files downloaded\n\t4. Move all files to ztools\\Chromium and rename \"chrlauncher 2.5.6 (64-bit).exe\" to \"chrlauncher.exe\". This takes priority over a chrome\\chromium installation\n  * Once you have all setup just execute \"Interface.bat\"\n\t5. Rememeber you need to fill keys_template.txt in ztools but I imagine you already know that\n- I use python:\t\t   \n  * Just get latest python 3 and install these dependencies:\n\turllib3 unidecode tqdm bs4 tqdm requests image pywin32 pycryptodome pykakasi googletrans chardet eel bottle\n  * Now the tricky part, I use the unreleased version of eel that isn't in pypy so go here https://github.com/ChrisKnott/Eel Download the master, seek the folder where  your eel installation is and overwrite the files with the ones in the master.\n\tIf you have trouble finding it try doing again pip install eel it'll tell you is up to date and installed in 'X' folder.\n  * Then execute \"Interface.bat\"\n- I use linux or mac:\t\t\t  \n  * Well i tested it on linux and i'll give you a build at a later time, have to admit I didn't test anything on mac though i imagine it works\n  * Install python and:\n\turllib3 unidecode tqdm bs4 tqdm requests image pycryptodome pykakasi googletrans chardet eel bottle\n  * Basically same as before ignoring pywin32 that NSCB uses to set the archive bit in folders\n  * Replace the eel files for the ones in the master like explained above.\n  * Run squirrel with:\n\tsquirrel.py -lib_call Interface start\n  * Or wait a few days for a build if you don't like python\n\n## 8. File_Info Gui examples:\n\n![Picture](https://i.ibb.co/12kCsDk/FI1.png)\n![Picture2](https://i.ibb.co/R93H02v/FI3.png)\n![Picture3](https://i.ibb.co/HCfTdxj/FI11.png)\n\n## 9. Important\n\nThis program attempts to modify the minimum data possible in nsp and xci files, due to that reason it requires signature patches to ignore both signatures at NCA headers. Firmwares that already include them are:\n- SX OS\n- ReiNX\n- For atmosphere you'll need the appropiate sigpatches, which should include the acid patches\n\nTo install multi-nsp you need a installer compatible with them. Reported compatible installers are:\n- SX OS rom-menu\n- SX OS installer\n- Blawar’s tinfoil or Lithium:\nhttp://tinfoil.io/Download#download\n- DBI Installer from DuckBill\nhttps://github.com/rashevskyv/switch/releases/\n- Awoo Installer\nhttps://github.com/Huntereb/Awoo-Installer\n\nTo install ncz files you need:\n- SX OS installer\n- Blawar’s tinfoil:\nhttps://github.com/digableinc/tinfoil\n- DBI Installer from DuckBill\nhttps://github.com/rashevskyv/switch/releases/tag/456\n- Awoo Installer\nhttps://github.com/Huntereb/Awoo-Installer\n\n## 10. Requirements\n\n- A computer with a Window's OS is needed\n- Fill keys_template.txt on the ztools folder and rename it to keys.txt\n  You can get a full keyset with Lockpick if your console is at FW6.2 or\n  A friend can lend you the needed keys.\n  If you want to add the xci_header_key a friend will need to lend it to you.\n  https://github.com/shchmue/Lockpick/releases\n- The mtp function requires 4.0 or upper but was built with 4.7.2 net frameworks as target. Recommended versions of net frameworks are 4.7.2 and 4.8.0\n\n## 11. Limitations\n- You can't make multi-content xci files with more than 8 games. It'll give error when loading in horizon. I suspect it may be a qlauncher limitation so it could work with theme mods but INTRO didn't test it.\nNote: This means “games”, updates and dl car not hold by that limitation.\n- Title-rights remove dlcs give a message prompt of incomplete content for some games from 6.0 onwards, that message can be skipped and the dlcs will work fine despite the prompt.\n- Currently the mtp mode can't patch\\convert games on the fly, it requires implementing the ability of patching streams or send the files via sockets from squirrel. One of the 2 options will be implemented in the future.\n\n## 12. Thanks and credits to\n\n**NSC_Builder is based on**\n\na.) Nut: Without the work of \"blawar\" one of the most talented Switch sceners nothing of this would be possible at this point.\nhttps://github.com/blawar/nut\n\nb.) Hacbuild: The xci repacking functions are based on hacbuild's code, made by LucaFraga\n\n- Original hacbuild: https://github.com/LucaFraga/hacbuild) by LucaFraga\n\n- Revised hacbuild by me: https://github.com/julesontheroad/hacbuild\n\nc.) The mtp mode relies heavily on DBI installer by DUCKBILL. Specifically it was tested with DBI 1.25\n\n- DBI is included in kefir CFW pack: https://github.com/rashevskyv/switch/releases\n\n- DBI 1.25 is first included in this release: https://github.com/rashevskyv/switch/releases/tag/456\n\n- A copy od DBI can also be found as nro and nsp in the NSCB master's folder called \"DBI\"\n\nd.) nsz,xcz and ncz specification by blawar: https://github.com/blawar/nsz\n\ne.) Big thx to 0Liam for his constant help.\n\nf.) pyNCA3,pyNPDM,pyPFS0,pyRomFS libraries adapted from pythac (made by Rikikooo)\n\ng.) an adaptation of Pysos from dagnelies is used for some operations: https://github.com/dagnelies/pysos\n\n**Also thanks to:**\n\nNicoboss for the original nsp and xci compression idea:\nhttps://github.com/nicoboss/nsZip/\n\nAnalogMan. He made splitNSP.py, figured the needed block size for Horizon format splitted nsps (wich differs from the splitted xci block size) and the need to archive the folders)\nhttps://github.com/AnalogMan151/splitNSP/releases\n\nThx to MadScript77 his great suggestions,specially the idea of profiles for the batch.\n\nThx to 0mn0 and the old SH crew for always being helpful.\n\nThx to evOLved, Cinnabar and a certain dragon for their help and good suggestions.\n\nAlso thanks to all members from gbatemp, elotrolado.net and my friends at discord ;)\n\n\n*2020 - JulesOnTheRoad - https://github.com/julesontheroad/NSC_BUILDER*\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/julesontheroad",
    "keywords": "ns,tool",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "nstool",
    "package_url": "https://pypi.org/project/nstool/",
    "platform": null,
    "project_url": "https://pypi.org/project/nstool/",
    "project_urls": {
      "Homepage": "https://github.com/julesontheroad",
      "Repository": "https://github.com/julesontheroad/NSC_BUILDER"
    },
    "release_url": "https://pypi.org/project/nstool/1.1.2/",
    "requires_dist": [
      "urllib3 (>=1.26.14,<2.0.0)",
      "unidecode (>=1.3.6,<2.0.0)",
      "tqdm (>=4.65.0,<5.0.0)",
      "bs4 (>=0.0.1,<0.0.2)",
      "requests (>=2.28.2,<3.0.0)",
      "image (>=1.5.33,<2.0.0)",
      "pycryptodome (>=3.17,<4.0)",
      "pykakasi (>=2.2.1,<3.0.0)",
      "httpx (==0.13.3)",
      "googletrans (>=3.0.0,<4.0.0)",
      "chardet (>=3.0.4,<4.0.0)",
      "eel (>=0.16.0,<0.17.0)",
      "bottle (>=0.12.25,<0.13.0)",
      "zstandard (>=0.20.0,<0.21.0)",
      "colorama (>=0.4.6,<0.5.0)",
      "google-auth-httplib2 (>=0.1.0,<0.2.0)",
      "google-auth-oauthlib (>=1.0.0,<2.0.0)",
      "oauth2client (>=4.1.3,<5.0.0)",
      "comtypes (>=1.1.14,<2.0.0)"
    ],
    "requires_python": ">=3.9,<4",
    "summary": "nstool",
    "version": "1.1.2",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17528686,
  "releases": {
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "119718a184a3e4f2a6c68337e371c144ca903fa38fdce6383faa3cf971ef1ee4",
          "md5": "bec1e776cd6834307e3a2afd633f9b7b",
          "sha256": "c5404f66a1cf4e291db2d3e3ddddaf15cbf40805a3983eab4615d733bfe3d48d"
        },
        "downloads": -1,
        "filename": "nstool-1.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "bec1e776cd6834307e3a2afd633f9b7b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.10",
        "size": 12006630,
        "upload_time": "2023-03-02T11:03:06",
        "upload_time_iso_8601": "2023-03-02T11:03:06.014337Z",
        "url": "https://files.pythonhosted.org/packages/11/97/18a184a3e4f2a6c68337e371c144ca903fa38fdce6383faa3cf971ef1ee4/nstool-1.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "58984cfcb347f3d869b0a47cb0aa8a25db7835dfe77e5bfef96cdafd286bc095",
          "md5": "4ca59caf9b15ed1e8179567efed44f79",
          "sha256": "32eecad8e73e34092269e412bb7295705015d6dc2fe8b34618d8629282cdab08"
        },
        "downloads": -1,
        "filename": "nstool-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "4ca59caf9b15ed1e8179567efed44f79",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.10",
        "size": 11790990,
        "upload_time": "2023-03-02T11:03:29",
        "upload_time_iso_8601": "2023-03-02T11:03:29.101809Z",
        "url": "https://files.pythonhosted.org/packages/58/98/4cfcb347f3d869b0a47cb0aa8a25db7835dfe77e5bfef96cdafd286bc095/nstool-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ff2ab8968f080f9cfb23fa03cc72912015373f07e3f324cf7c1fe2c437f3b7f9",
          "md5": "3afd29f5629a8e6b2545eb98a7f11f15",
          "sha256": "40c832c95dd55469ac3639e577f307e559119777084a2a0afe3d9b3211b1378e"
        },
        "downloads": -1,
        "filename": "nstool-1.0.5-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "3afd29f5629a8e6b2545eb98a7f11f15",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.10",
        "size": 12007679,
        "upload_time": "2023-03-07T16:26:05",
        "upload_time_iso_8601": "2023-03-07T16:26:05.083974Z",
        "url": "https://files.pythonhosted.org/packages/ff/2a/b8968f080f9cfb23fa03cc72912015373f07e3f324cf7c1fe2c437f3b7f9/nstool-1.0.5-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "470d91a5c749e14d3244bed6927ee264047fcf15c705dd0839b2c32dbee38d8a",
          "md5": "01f59eecac2f8dd6d072d9cbff6cdbd3",
          "sha256": "8479d25760565491d5c9c583df40dfee07e1054cd4712a25bbe88147a42757df"
        },
        "downloads": -1,
        "filename": "nstool-1.0.5.tar.gz",
        "has_sig": false,
        "md5_digest": "01f59eecac2f8dd6d072d9cbff6cdbd3",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.10",
        "size": 11792616,
        "upload_time": "2023-03-07T16:28:16",
        "upload_time_iso_8601": "2023-03-07T16:28:16.824808Z",
        "url": "https://files.pythonhosted.org/packages/47/0d/91a5c749e14d3244bed6927ee264047fcf15c705dd0839b2c32dbee38d8a/nstool-1.0.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "cc93f04652a0b35f8fbd33282cf3fe7277688186041c11fc618e801840a4a4ee",
          "md5": "d045883647a8076029d8403fe0e8ceb9",
          "sha256": "0534f85070973d4b7184cd5aee82b18d07e502b5ad24685296cd516d5c12d86e"
        },
        "downloads": -1,
        "filename": "nstool-1.0.6-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "d045883647a8076029d8403fe0e8ceb9",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.10.0,<3.11.0",
        "size": 11166291,
        "upload_time": "2023-03-07T17:24:50",
        "upload_time_iso_8601": "2023-03-07T17:24:50.092350Z",
        "url": "https://files.pythonhosted.org/packages/cc/93/f04652a0b35f8fbd33282cf3fe7277688186041c11fc618e801840a4a4ee/nstool-1.0.6-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "87a6a59e2a9d3c153b294e5a83d98a9eeadba1de3cabfbf095a2b88411e3bfe3",
          "md5": "951b16fd1c1f33a5482944812756ae64",
          "sha256": "e69cbc5f4e65983b67390a2da2266932b018af0e243072c35a7b1d4d34a8c4db"
        },
        "downloads": -1,
        "filename": "nstool-1.0.6.tar.gz",
        "has_sig": false,
        "md5_digest": "951b16fd1c1f33a5482944812756ae64",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.10.0,<3.11.0",
        "size": 11004189,
        "upload_time": "2023-03-07T17:25:26",
        "upload_time_iso_8601": "2023-03-07T17:25:26.166524Z",
        "url": "https://files.pythonhosted.org/packages/87/a6/a59e2a9d3c153b294e5a83d98a9eeadba1de3cabfbf095a2b88411e3bfe3/nstool-1.0.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.7": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0110dbc19140a0c128c586ba09c1eab828efd108529ab3b5f52664d1b6e70577",
          "md5": "7b5671efb0a5693331324a15259c94bc",
          "sha256": "7304f30f1db7fccf986dcb5a53a4f1f6e8f6eaed6ee69d71742b9b4fa9a73693"
        },
        "downloads": -1,
        "filename": "nstool-1.0.7-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "7b5671efb0a5693331324a15259c94bc",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.9,<4",
        "size": 11166298,
        "upload_time": "2023-03-08T01:27:46",
        "upload_time_iso_8601": "2023-03-08T01:27:46.357038Z",
        "url": "https://files.pythonhosted.org/packages/01/10/dbc19140a0c128c586ba09c1eab828efd108529ab3b5f52664d1b6e70577/nstool-1.0.7-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7bc2acb6a7932e9411437cba024a6a2dbc72f9a36e5586a4ec6c5cfa6bc37620",
          "md5": "c90fac9bc19545abf8ba2e22770c1501",
          "sha256": "2940c17f900f1179a7536e331bb11b243810a73b6fc5b8f83bf8217b6a670c8e"
        },
        "downloads": -1,
        "filename": "nstool-1.0.7.tar.gz",
        "has_sig": false,
        "md5_digest": "c90fac9bc19545abf8ba2e22770c1501",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.9,<4",
        "size": 11004149,
        "upload_time": "2023-03-08T01:27:55",
        "upload_time_iso_8601": "2023-03-08T01:27:55.611541Z",
        "url": "https://files.pythonhosted.org/packages/7b/c2/acb6a7932e9411437cba024a6a2dbc72f9a36e5586a4ec6c5cfa6bc37620/nstool-1.0.7.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9a6531f07b5e08b051ef1776e5595a2d7eeb51cc6b5d98e68cdc8e3141dc55c1",
          "md5": "9daaaaccaaabe1ae96421c13c711898b",
          "sha256": "9a7edf8fa7b4091368db85b0f61cd6c6b0f75224930be8ccd2b2c72ba5587dc9"
        },
        "downloads": -1,
        "filename": "nstool-1.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "9daaaaccaaabe1ae96421c13c711898b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.9,<4",
        "size": 12002991,
        "upload_time": "2023-03-10T16:29:23",
        "upload_time_iso_8601": "2023-03-10T16:29:23.005095Z",
        "url": "https://files.pythonhosted.org/packages/9a/65/31f07b5e08b051ef1776e5595a2d7eeb51cc6b5d98e68cdc8e3141dc55c1/nstool-1.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d6e2f1f666c61e6f4727fb1b0ffc4da5852c8235a5215fa8c23819778c779c3a",
          "md5": "64d6db89246f821267314757351921ea",
          "sha256": "4e05d8ec46a23dc23101cac6bea8b4aaf74e6602f7ce5700364bfcc3e47abfeb"
        },
        "downloads": -1,
        "filename": "nstool-1.1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "64d6db89246f821267314757351921ea",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.9,<4",
        "size": 12002989,
        "upload_time": "2023-03-10T16:35:14",
        "upload_time_iso_8601": "2023-03-10T16:35:14.625357Z",
        "url": "https://files.pythonhosted.org/packages/d6/e2/f1f666c61e6f4727fb1b0ffc4da5852c8235a5215fa8c23819778c779c3a/nstool-1.1.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d1c4d1b25f6a50a7bffdc3430e2e5b7c5ad2612c6da08f53a22a2e8a3ab9238d",
          "md5": "2656b4c3c1bef230f3a61e2eafe50c1d",
          "sha256": "1ad01824406bddce1571e1f5636d2a3903d418c2546219871bbb3a26e4cf2d94"
        },
        "downloads": -1,
        "filename": "nstool-1.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "2656b4c3c1bef230f3a61e2eafe50c1d",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.9,<4",
        "size": 11775585,
        "upload_time": "2023-03-10T16:37:26",
        "upload_time_iso_8601": "2023-03-10T16:37:26.141468Z",
        "url": "https://files.pythonhosted.org/packages/d1/c4/d1b25f6a50a7bffdc3430e2e5b7c5ad2612c6da08f53a22a2e8a3ab9238d/nstool-1.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "19c28c49a9aa83baa724235b0f74584a6f129c47e1937a7d5ad0a0e05af976d7",
          "md5": "56f6446362fe0ded36e8eb77be0c600b",
          "sha256": "b2865d07e2bf8ab12cf120b091b70180a0815ab2eed26d524fb2cd9d7bdcb8f9"
        },
        "downloads": -1,
        "filename": "nstool-1.1.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "56f6446362fe0ded36e8eb77be0c600b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.9,<4",
        "size": 12010534,
        "upload_time": "2023-03-31T15:40:59",
        "upload_time_iso_8601": "2023-03-31T15:40:59.725829Z",
        "url": "https://files.pythonhosted.org/packages/19/c2/8c49a9aa83baa724235b0f74584a6f129c47e1937a7d5ad0a0e05af976d7/nstool-1.1.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5a7f7a920f9d569f63253ec0abc05feba85a35b8ff40c5f1cc123779d9678f95",
          "md5": "b91e1fa619277218280bb31a08c3ef59",
          "sha256": "c2ba1e09c4eddd3858953a0212f1e66ce38fef75dea2a3354b9fba8d62a9dbbf"
        },
        "downloads": -1,
        "filename": "nstool-1.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "b91e1fa619277218280bb31a08c3ef59",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.9,<4",
        "size": 11792475,
        "upload_time": "2023-03-31T15:41:20",
        "upload_time_iso_8601": "2023-03-31T15:41:20.646540Z",
        "url": "https://files.pythonhosted.org/packages/5a/7f/7a920f9d569f63253ec0abc05feba85a35b8ff40c5f1cc123779d9678f95/nstool-1.1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "19c28c49a9aa83baa724235b0f74584a6f129c47e1937a7d5ad0a0e05af976d7",
        "md5": "56f6446362fe0ded36e8eb77be0c600b",
        "sha256": "b2865d07e2bf8ab12cf120b091b70180a0815ab2eed26d524fb2cd9d7bdcb8f9"
      },
      "downloads": -1,
      "filename": "nstool-1.1.2-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "56f6446362fe0ded36e8eb77be0c600b",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.9,<4",
      "size": 12010534,
      "upload_time": "2023-03-31T15:40:59",
      "upload_time_iso_8601": "2023-03-31T15:40:59.725829Z",
      "url": "https://files.pythonhosted.org/packages/19/c2/8c49a9aa83baa724235b0f74584a6f129c47e1937a7d5ad0a0e05af976d7/nstool-1.1.2-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "5a7f7a920f9d569f63253ec0abc05feba85a35b8ff40c5f1cc123779d9678f95",
        "md5": "b91e1fa619277218280bb31a08c3ef59",
        "sha256": "c2ba1e09c4eddd3858953a0212f1e66ce38fef75dea2a3354b9fba8d62a9dbbf"
      },
      "downloads": -1,
      "filename": "nstool-1.1.2.tar.gz",
      "has_sig": false,
      "md5_digest": "b91e1fa619277218280bb31a08c3ef59",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.9,<4",
      "size": 11792475,
      "upload_time": "2023-03-31T15:41:20",
      "upload_time_iso_8601": "2023-03-31T15:41:20.646540Z",
      "url": "https://files.pythonhosted.org/packages/5a/7f/7a920f9d569f63253ec0abc05feba85a35b8ff40c5f1cc123779d9678f95/nstool-1.1.2.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}