{
  "info": {
    "author": "Guenter Selbert, Thorsten Vocks, Maciej Wichowski, Daniela Scarpa, Maria Sparenberg, initOS GmbH, Odoo Community Association (OCA)",
    "author_email": "support@odoo-community.org",
    "bugtrack_url": null,
    "classifiers": [
      "Framework :: Odoo",
      "Framework :: Odoo :: 14.0",
      "License :: OSI Approved :: GNU Affero General Public License v3",
      "Programming Language :: Python"
    ],
    "description": "================\nDatev Export XML\n================\n\n.. !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n   !! This file is generated by oca-gen-addon-readme !!\n   !! changes will be overwritten.                   !!\n   !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\n.. |badge1| image:: https://img.shields.io/badge/maturity-Beta-yellow.png\n    :target: https://odoo-community.org/page/development-status\n    :alt: Beta\n.. |badge2| image:: https://img.shields.io/badge/licence-AGPL--3-blue.png\n    :target: http://www.gnu.org/licenses/agpl-3.0-standalone.html\n    :alt: License: AGPL-3\n.. |badge3| image:: https://img.shields.io/badge/github-OCA%2Fl10n--germany-lightgray.png?logo=github\n    :target: https://github.com/OCA/l10n-germany/tree/14.0/datev_export_xml\n    :alt: OCA/l10n-germany\n.. |badge4| image:: https://img.shields.io/badge/weblate-Translate%20me-F47D42.png\n    :target: https://translation.odoo-community.org/projects/l10n-germany-14-0/l10n-germany-14-0-datev_export_xml\n    :alt: Translate me on Weblate\n.. |badge5| image:: https://img.shields.io/badge/runbot-Try%20me-875A7B.png\n    :target: https://runbot.odoo-community.org/runbot/175/14.0\n    :alt: Try me on Runbot\n\n|badge1| |badge2| |badge3| |badge4| |badge5| \n\nOdoo Export to DATEV XML\n========================\n\nThe datev_export_xml module allows to export invoices and bills with their origin digitized receipts\nin order to transmitt structured accounting data via file-based DATEV XML format. The transfer of these files created by this module to the invoice books in DATEV Unternehmen Online can be done currently via the free DATEV document transfer app.\n\nThe DATEV XML interface cannot cover use cases such as:\n\n- Pure G/L account postings (G/L account to G/L account, e.g. payment postings)\n- Master data transfer for business partners (customers/creditors)\n- certain §13b UStG issues (see permissible tax codes for DATEV Unternehmen online)\n\n**Table of contents**\n\n.. contents::\n   :local:\n\nUsage\n=====\n\nNormally you will use the **Export Wizard** for exporting a time period. There is also a manual export option available directly from the contextual actions of the invoices and bills list view.\n\n\nExport by Wizard\n~~~~~~~~~~~~~~~~\n\nThe main export usage will be done by the **DATEV Export** Wizard, which can be executed from the menu item located at\n**Invoicing > Reporting > Datev Export**.\n\n.. image:: https://raw.githubusercontent.com/OCA/l10n-germany/14.0/datev_export_xml/static/description/example_datev_export_wizard.png\n    :width: 100%\n\nAt the wizard you can filter by *Invoice types* and limit the *time range*. At the *General Settings* you can choose your company and if you want to validate the XML-Export file by the provided XSD-Schema (Recommended).\n\n.. important::\n\n    It's very important for a valid import at DATEV that the export file meets the requirements! So make sure that\n    these flag is set when you want to upload your *ZIP-Exportfile* on a productive DATEV system.\n\nClick on the button **Create DATEV Export File** to create the zip file for the selected filter at background.\n\n\n\nManual Export\n~~~~~~~~~~~~~\n\n\nIt is also possible to export selected invoice(s) or refund(s) from the Invoices / Refunds *Action-Dropdown*. As result you can download a zip file ready to transfer to DATEV Unternehmen Online. The file contains the selected invoices / refunds as xml and pdf file and a document file which summarizes and classify all included files. This method can be handy if an exception occurs while generating a huge amount of invoices / refunds via the wizard, to fix and validate the related invoice / refund before running the wizard again.\n\n.. image:: https://raw.githubusercontent.com/OCA/l10n-germany/14.0/datev_export_xml/static/description/example_datev_export_wizard_manual.png\n    :width: 100%\n\nIf you create a manual export from the vendor bills list the export type is „Vendors“. If you create this export from the customer invoices the export type is „Customers“.\n\nIf you have the Check XSD option, it's possible that some errors occurs.\n\n.. image:: https://raw.githubusercontent.com/OCA/l10n-germany/14.0/datev_export_xml/static/description/example_datev_export_exception.png\n    :width: 100%\n\n\nOn errors, an activity will be applied to you for fixing the problem. If you have fixed the problem, just restart the wizard, or click on „Recreate DATEV Export File“. On success you can download the generated zip file from the wizards **Download DATEV File** section.\n\n\n.. hint::\n\n    The duration of the file creation depends on the number of invoices / refunds for that you will create the zip file!\n\n\n\nImport into DATEV\n=================\n\nRequirements\n~~~~~~~~~~~~\n\n1.) DATEV Unternehmen Online is activated for the client. (In order to simply import the receipts, it is not necessary for the client to have their own access to DATEV Unternehmen Online). Please ensure you have configured the following \"Advanced Settings\" in DATEV Unternehmen Online in order to allow to import split account moves with many invoice lines from Invoices / Bills:\n\n.. image:: https://raw.githubusercontent.com/OCA/l10n-germany/14.0/datev_export_xml/static/description/datev_belegtransfer_erweiterte_einstellungen.png\n     :width: 100%\n\n\n.. image:: https://raw.githubusercontent.com/OCA/l10n-germany/14.0/datev_export_xml/static/description/datev_belegtransfer_erweiterte_einstellungen_rechnungsdatenschnittstelle.png\n     :width: 100%\n\n\n2.) The DATEV Belegtransfer program is installed and open.\n\n\nTransmission to the tax advisor\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nThe ZIP file with the document images is first exported from Odoo and saved on the client's computer. The files can then be transferred to the tax consultant in 3 different ways:\n\n1st way: Transfer receipts and posting records with DATEV Belegtransfer\n\nThe client uploads both the ZIP file with the receipts and the CSV file with the posting records (posting batch) to DATEV Belegtransfer. The ZIP file with the receipts will be imported automatically. The invoices with the document data end up in DATEV Unternehmen Online. A provision for the tax consultant can now be made via the receipts app and the tile \"Outgoing invoices\" or \"Incoming invoices\".\n\n2nd way: Transfer receipts and posting records outside of DATEV\nThe client transfers both the ZIP file with the receipts independently of DATEV receipt transfer, e.g. by e-mail or on a USB stick. The tax consultant imports the ZIP file with the documents into DATEV document transfer and then fetches the batch of postings provided from the office.\n\n\nDATEV Belegtransfer\n~~~~~~~~~~~~~~~~~~~~\n\nTo transfer the .zip archive from Odoo, the DATEV document transfer program „DATEV Belegtransfer“ must be installed and open. In the opened DATEV Belegtransfer application you can now click on \"Add directories\" and make the following settings:\n\n.. image:: https://raw.githubusercontent.com/OCA/l10n-germany/14.0/datev_export_xml/static/description/belegtransfer_verzeichnis_anlegen_0.png\n     :width: 100%\n\n1.) \"Create directories\" dialog: Specify where the directories should be saved, how the company directory should be named and whether you want to delete or archive the source files after the upload. Then click on \"Save\".\n\n.. image:: https://raw.githubusercontent.com/OCA/l10n-germany/14.0/datev_export_xml/static/description/belegtransfer_verzeichnis_anlegen_1.png\n     :width: 100%\n\n\n2.) Now define the directories that are to be used by first selecting the client and then clicking on \"Next\". You can now use the two following suggested entries and configure them as follows:\n* Activate *Rechnungseingang* \"Create as directory\". Also activate \"Configure as XML interface\". To activate the XML interface, slide the slider in the \"Configure as XML interface\" column to the right. Then it is green. The setting is important for the transfer of the files. DATEV only reads in the receipts correctly with an activated XML interface.\n* Activate *Rechnungsausgang* \"Create as directory\". Also activate \"Configure as XML interface\". To activate the XML interface, slide the slider in the \"Configure as XML interface\" column to the right. Then it is also green.\n\n.. image:: https://raw.githubusercontent.com/OCA/l10n-germany/14.0/datev_export_xml/static/description/belegtransfer_verezcihnis_anlegen_2.png\n     :width: 100%\n\n\n.. image:: https://raw.githubusercontent.com/OCA/l10n-germany/14.0/datev_export_xml/static/description/belegtransfer_verzeichnis_anlegen_3.png\n     :width: 100%\n\nTransfer files\n~~~~~~~~~~~~~~\n\n1.) Double-click on either the “Rechnungseingang” or “Rechnungsausgang” directory. The storage location for the files to be uploaded opens. Place the file in the storage location. Make sure you put the files in the right directory:\n* ZIP file for outgoing invoices from Odoo in the directory with activated XML interface „Ausgangsrechnungen“.\n* ZIP file for incoming invoices from Odoo in the directory with activated XML interface „Eingangsrechnungen\".\n* EXCURSION: if you want to upload .csv files, e.g. exported from the datev_export_acii application, copy them to a directory without an activated XML interface (in the screenshot \"Other\")\n\nYou can tell for which directory the XML interface is activated by the interface symbol at the beginning of the line. If the symbol is displayed, the XML interface is activated in the directory (it should therefore be active in the two directories “Eingangsrechnungen” and “Ausgangsrechnungen”).\n\n.. image:: https://raw.githubusercontent.com/OCA/l10n-germany/14.0/datev_export_xml/static/description/belegtransfer_belege_hochladen.png\n     :width: 100%\n\n2.) Right-click on the directory. A new menu will open. Click Upload Receipts. Uploading deletes the files from the directory or moves them to an archive folder. You can specify which option should apply under Settings.\n\n.. image:: https://raw.githubusercontent.com/OCA/l10n-germany/14.0/datev_export_xml/static/description/belegtransfer_belege_hochladen_dateiauswahl.png\n     :width: 100%\n\n3.) To check whether the upload was successful, right-click on the directory. A new menu will open. Click Open Log. For more details click on “Import Log”\n\n.. image:: https://raw.githubusercontent.com/OCA/l10n-germany/14.0/datev_export_xml/static/description/belegtransfer_protokoll_timestamp.png\n     :width: 100%\n\n.. image:: https://raw.githubusercontent.com/OCA/l10n-germany/14.0/datev_export_xml/static/description/belegtransfer_protokoll_auswahl.png\n     :width: 100%\n\n.. image:: https://raw.githubusercontent.com/OCA/l10n-germany/14.0/datev_export_xml/static/description/belegtransfer_protokoll_liste.png\n     :width: 100%\n\n.. image:: https://raw.githubusercontent.com/OCA/l10n-germany/14.0/datev_export_xml/static/description/belegtransfer_protokoll_details.png\n     :width: 100%\n\n4.) Repeat steps 1 to 3 with the other directory (either for A/R invoices / A/R invoices if you want to upload those as well).\n\n\nCheck the import of the receipts in DATEV Unternehmen Online:\n\nDATEV Unternehmen Online automatically recognizes that the contents of the ZIP file are receipts that belong to a batch of bookings and imports them automatically. Further actions by the tax advisor are not required. If the receipts are displayed in the DATEV Unternehmen Online inbox, your client has transferred the ZIP file with the receipts to a directory with a deactivated XML interface. Ask your client to transfer the ZIP file with the receipts again to a directory with an activated XML interface. You can delete the receipts in the inbox. You can check whether the automatic receipt import worked correctly under: Applications → Receipts → Right side menu → Logs → Import → Display import log → Select import date and \"Display\"\n\n\nDownload booking records\n~~~~~~~~~~~~~~~~~~~~~~~~\n\n1.) In DATEV Unternehmen Online:\n\nThe \"Provide\" („Bereitstellen“)  position is on the Receipts start page in DATEV Unternehmen Online. The batch of bookings exported from Odoo and uploaded via DATEV document transfer for „Eingangsrechnungen“ and „Ausgangsrechnugnen“ can be marked here, in order to make them ready for collection by clicking on \"Provide\" for DATEV Kanzlei-Rechnungswesen. With the appropriate authorization, this process can be carried out by the client himself or by the tax consultant.\n\n.. image:: https://raw.githubusercontent.com/OCA/l10n-germany/14.0/datev_export_xml/static/description/datev_uo_bereitstellen_1.png\n     :width: 100%\n\n\n.. image:: https://raw.githubusercontent.com/OCA/l10n-germany/14.0/datev_export_xml/static/description/datev_uo_bereitstellen_2.png\n     :width: 100%\n\n2.) In DATEV Kanzlei-Rechnungswesen, this provided data must be retrieved via client supplement.\nThe procedure is as follows:\nUnder \"Preparatory activities\" in your overview on the left, click on \"Add client\".\nSelect the item \"Cash register/invoice stack from cash book/receipts online\".\nThe process is started by clicking on \"Get data\".\nThe \"Edit booking suggestions\" function is located in your booking line. This allows you to generate the posting proposals with the voucher image.\nSelect your stack and confirm your selection with \"Ok\". You have to repeat this in the next menu. Now your booking suggestions are displayed with the original voucher images from Odoo and can be booked there.\n\n\nEXCURSION for the tax consultant: If the client has also uploaded the CSV file with the posting records (posting batch) to DATEV Belegtransfer via the datev_export_ascii module, you will find this in DATEV Unternehmen Online in the inbox. Select \"Download Original\" to save the posting batch file on your computer. Import it from there into Kanzlei-Rechnungswesen. You can then delete the file from the inbox. In contrast to the receipts, the posting batch is not automatically recognized as such. The upload by the client using DATEV document transfer is only used for transmission to the tax consultant and could also be done by e-mail or on a USB stick.\n\n\nHow to deal with errors in bookings\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nIf there are errors in the postings, we recommend editing them at the source, i.e. in Odoo, and then providing a corrected posting stack.\n\n\nCurrent limitations / outlook\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nIt is currently recommended to use a customer account according to DATEV number logic for customer accounts as the standard Odoo customer account. To do this, you can simply change the number of the existing standard customer account (e.g. 1410/1205 -> 69999). It is also recommended to use a vendor account according to DATEV number logic for vendor accounts as a standard Odoo vendor account. To do this, you can simply change the number of the existing standard vendor account (e.g. 1610/3301 -> 99999).\n\nIn future versions it is planned to optionally have two additional fields on the partner: \"DATEV Debitor\" and \"DATEV Vendor\". These accounts should be able to be assigned automatically when they are created. For accounts that already exist with the tax advisor, these two fields should be editable manually to use the tax advisor's accounts for the export. The export of the \"DATEV Debitor\" and \"DATEV Vendor\" value should then optionally be exported instead of the current Odoo debtor / vendor accounts.\n\nInstead of the DATEV XML format type \"Invoice data\", the type \"Ledger\" should also be optionally selectable. This type includes an extended export of posting data, e.g. exchange rates for currencies etc.\n\nWith exported DATEV automatic accounts, any export of the DATEV tax key / posting key, which can be stored in Odoo for taxes, should be suppressed. This then prevents a momentary note in DATEV Kanzler-Rechnungswesen when postings are taken over (which can simply be ignored at the moment), since a posting key must also be transferred to DATEV for non-automatic accounts.\n\nAt the moment it is recommended for an identical tax statement in DATEV and Odoo not to post income/expenses with tax in journals of the “Bank” and “Cash” type. Instead, it would be better to post an incoming invoice / outgoing invoice with tax and then match the open item in the bank / cash register journal and thus post the customer / vendor as an offsetting account.\n\nif you use Odoo just as a billing engine, then probably adoptions directly in DATEV Kanzlei-Rechnungswesen wouldn’t be a big issue. If you plan to move to a full-aaccounting approach into Odoo we would recommend to reconcile the Odoo and DATEV trial balance after each month.\n\nBug Tracker\n===========\n\nBugs are tracked on `GitHub Issues <https://github.com/OCA/l10n-germany/issues>`_.\nIn case of trouble, please check there if your issue has already been reported.\nIf you spotted it first, help us smashing it by providing a detailed and welcomed\n`feedback <https://github.com/OCA/l10n-germany/issues/new?body=module:%20datev_export_xml%0Aversion:%2014.0%0A%0A**Steps%20to%20reproduce**%0A-%20...%0A%0A**Current%20behavior**%0A%0A**Expected%20behavior**>`_.\n\nDo not contact contributors directly about support or help with technical issues.\n\nCredits\n=======\n\nAuthors\n~~~~~~~\n\n* Guenter Selbert\n* Thorsten Vocks\n* Maciej Wichowski\n* Daniela Scarpa\n* Maria Sparenberg\n* initOS GmbH\n\nContributors\n~~~~~~~~~~~~\n\n* Thorsten Vocks (OpenBIG.org)\n* Guenter Selbert (sewisoft.de)\n* initOS GmbH (initOS.com)\n\nMaintainers\n~~~~~~~~~~~\n\nThis module is maintained by the OCA.\n\n.. image:: https://odoo-community.org/logo.png\n   :alt: Odoo Community Association\n   :target: https://odoo-community.org\n\nOCA, or the Odoo Community Association, is a nonprofit organization whose\nmission is to support the collaborative development of Odoo features and\npromote its widespread use.\n\nThis module is part of the `OCA/l10n-germany <https://github.com/OCA/l10n-germany/tree/14.0/datev_export_xml>`_ project on GitHub.\n\nYou are welcome to contribute. To learn how please visit https://odoo-community.org/page/Contribute.\n\n\n",
    "description_content_type": "",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/OCA/l10n-germany",
    "keywords": "",
    "license": "AGPL-3",
    "maintainer": "",
    "maintainer_email": "",
    "name": "odoo14-addon-datev-export-xml",
    "package_url": "https://pypi.org/project/odoo14-addon-datev-export-xml/",
    "platform": null,
    "project_url": "https://pypi.org/project/odoo14-addon-datev-export-xml/",
    "project_urls": {
      "Homepage": "https://github.com/OCA/l10n-germany"
    },
    "release_url": "https://pypi.org/project/odoo14-addon-datev-export-xml/14.0.1.0.1.dev5/",
    "requires_dist": [
      "odoo14-addon-datev-export",
      "odoo (<14.1dev,>=14.0a)"
    ],
    "requires_python": ">=3.6",
    "summary": "Export invoices and refunds as xml and pdf files zipped in DATEV format.",
    "version": "14.0.1.0.1.dev5",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17393547,
  "releases": {
    "14.0.1.0.1.dev4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "32ce5ba1b3a5410de737a671bf615602ba8d88c988f31d6a2a009129645995dd",
          "md5": "932f1dad70511ff057e59b5114d61c4c",
          "sha256": "89de867ae8ba3d216d20d9d03aa8d0553b36e7d933425da6abc2b56db2e0e467"
        },
        "downloads": -1,
        "filename": "odoo14_addon_datev_export_xml-14.0.1.0.1.dev4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "932f1dad70511ff057e59b5114d61c4c",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 2782560,
        "upload_time": "2023-03-21T11:13:25",
        "upload_time_iso_8601": "2023-03-21T11:13:25.599195Z",
        "url": "https://files.pythonhosted.org/packages/32/ce/5ba1b3a5410de737a671bf615602ba8d88c988f31d6a2a009129645995dd/odoo14_addon_datev_export_xml-14.0.1.0.1.dev4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "14.0.1.0.1.dev5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5836b571f3374f0a25870f4383733460ca59497f9c6d29c3ce152e8b6207cabb",
          "md5": "5d91cf52899396a82737cc30d7c3e227",
          "sha256": "5ddf25439192b77ab554904bd70424a2547cc63edc8c787fbda02b5d203c263a"
        },
        "downloads": -1,
        "filename": "odoo14_addon_datev_export_xml-14.0.1.0.1.dev5-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "5d91cf52899396a82737cc30d7c3e227",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 2782933,
        "upload_time": "2023-03-22T05:13:25",
        "upload_time_iso_8601": "2023-03-22T05:13:25.686982Z",
        "url": "https://files.pythonhosted.org/packages/58/36/b571f3374f0a25870f4383733460ca59497f9c6d29c3ce152e8b6207cabb/odoo14_addon_datev_export_xml-14.0.1.0.1.dev5-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "5836b571f3374f0a25870f4383733460ca59497f9c6d29c3ce152e8b6207cabb",
        "md5": "5d91cf52899396a82737cc30d7c3e227",
        "sha256": "5ddf25439192b77ab554904bd70424a2547cc63edc8c787fbda02b5d203c263a"
      },
      "downloads": -1,
      "filename": "odoo14_addon_datev_export_xml-14.0.1.0.1.dev5-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "5d91cf52899396a82737cc30d7c3e227",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6",
      "size": 2782933,
      "upload_time": "2023-03-22T05:13:25",
      "upload_time_iso_8601": "2023-03-22T05:13:25.686982Z",
      "url": "https://files.pythonhosted.org/packages/58/36/b571f3374f0a25870f4383733460ca59497f9c6d29c3ce152e8b6207cabb/odoo14_addon_datev_export_xml-14.0.1.0.1.dev5-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}