{
  "info": {
    "author": "Rasmus Einarsson, Carmen Galea, Alba Monistrol",
    "author_email": "python-opentoolflux@rasmuseinarsson.se",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 4 - Beta",
      "Intended Audience :: Science/Research",
      "Programming Language :: Python",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.10",
      "Programming Language :: Python :: 3.11",
      "Programming Language :: Python :: 3.8",
      "Programming Language :: Python :: 3.9",
      "Topic :: Scientific/Engineering"
    ],
    "description": "# Contents\n\n- [Contents](#contents)\n- [Overview](#overview)\n- [How the flux estimation works](#how-the-flux-estimation-works)\n- [Installation](#installation)\n- [Basic usage](#basic-usage)\n  - [Run an example](#run-an-example)\n  - [Use the built-in documentation](#use-the-built-in-documentation)\n  - [Configure OpenToolFlux using a configuration file](#configure-opentoolflux-using-a-configuration-file)\n  - [Import data from source files](#import-data-from-source-files)\n  - [Other ways to get a database](#other-ways-to-get-a-database)\n  - [Show info about the database](#show-info-about-the-database)\n  - [Estimate gas fluxes](#estimate-gas-fluxes)\n  - [Plot results](#plot-results)\n    - [`flux-fits`: flux estimation diagnostics](#flux-fits-flux-estimation-diagnostics)\n    - [`flux-time-series`: fluxes over time](#flux-time-series-fluxes-over-time)\n- [Notes on dimensions and units](#notes-on-dimensions-and-units)\n- [The database file](#the-database-file)\n  - [On data types and database size](#on-data-types-and-database-size)\n- [Source data file format](#source-data-file-format)\n  - [Notes on timestamps](#notes-on-timestamps)\n- [Configuration options](#configuration-options)\n\n# Overview\n\nOpenToolFlux is a software to estimate gas fluxes from soil using data from automatic chambers.\n\nThe software is used through a command-line interface (CLI) which allows the user to:\n\n- Import data from one or more source data files into a database file.\n- Filter the database based on time period, alarm status values, and other criteria.\n- Identify segments of the database corresponding to closures of chambers.\n- Estimate gas fluxes from the concentration time series during closure, and export these to a [tidy data](https://doi.org/10.18637/jss.v059.i10) file.\n- Generate diagrams for diagnostics.\n\n# How the flux estimation works\n\nThe software analyzes time series of gas concentrations in gas collected from multiple automated chambers connected to a single gas analyzer. The multiple chambers sequentially close (e.g. in 20-minute intervals) and gas is continuously pumped into the analyzer from the currently closed chamber. The profile of the concentration change during each chamber closure is used to estimate the flux from the soil under that chamber.\n\nA detailed explanation of the flux estimation and its underlying assumptions is to be published in a paper by Galea et al. When published, a reference to the paper will be added here.\n\n# Installation\n\nOpenToolFlux is written in Python and works with Python 3.8+.\n\nThis installation guide assumes that you already have Python 3.8+ and that you know how to use a terminal and install Python packages using `pip`. If you are unsure about any of these points, you might find it helpful to follow the instructions given by any of these sources:\n\n- Instructions from RealPython on [installing Python](https://realpython.com/installing-python/) and [using `pip`](https://realpython.com/what-is-pip/)\n- Instructions from [Python.org on getting started with Python](https://www.python.org/about/gettingstarted/)\n- Instructions from PyPA on [using pip and virtual environments](https://packaging.python.org/en/latest/guides/installing-using-pip-and-virtual-environments/#creating-a-virtual-environment)\n- Instructions [_Python for Data Analysis_, 3rd Edition](https://wesmckinney.com/book/preliminaries.html#installation_and_setup) using [miniconda](https://docs.conda.io/)\n\nHow to install:\n\n- Optionally, create and activate a virtual environment.\n- Install using `pip install opentoolflux`\n- Verify that the installation was successful by running the command `opentoolflux --help`. If the installation has succeeded, this will show a list of the available commands.\n\nIf installation according to these instructions fail, please submit a bug report [using the issue tracker](issues).\n\n# Basic usage\n\nThe command-line interface consists of a command `opentoolflux` with subcommands such as `opentoolflux import` and `opentoolflux fluxes`. Here is a quick introduction to basic usage of the command-line interface.\n\n## Run an example\n\nYou might find it instructive to get started using an example. An example of a configuration file, input data, and corresponding output data can be downloaded from here: [https://github.com/rasmuse/flux-estimation-example](https://github.com/rasmuse/flux-estimation-example).\n\n## Use the built-in documentation\n\nThe command-line interface has built-in documentation which is accessed by calling commands such as:\n\n```\nopentoolflux --help\nopentoolflux import --help\n```\n\nWhen adding `--help` to a command, the command will do nothing except print an information message.\n\nWe recommend exploring the software by reading the built-in help and experimenting with commands on some test data. OpenToolFlux will never change or delete your source data files, so you can safely play around. (And in any case, you do have a backup of your important research data, _right_?)\n\n## Configure OpenToolFlux using a configuration file\n\nMost configuration is made in a configuration file written in [TOML language](https://toml.io/en/). All the configuration options are listed and explained [at the end of this document](#configuration-options).\n\nA small number of configuration options can be made on the command line. These are listed and explained [in the built-in documentation](#use-the-built-in-documentation).\n\nOpenToolFlux by default looks for a configuration file named `opentoolflux.toml` in the working directory. This default can be overridden using the `--config` flag as follows:\n\n```\nopentoolflux --config my_config.toml [command]\n```\n\n## Import data from source files\n\nWhen the configuration file is in place, import data from source files using the following command:\n\n```\nopentoolflux import\n```\n\nThis will create a new database, or add data to an existing one, located at `opentoolflux/database.feather`. The data files to read are specified in the `import` section of the [config file](#configuration-options). Read more below about [the source data file format](#source-data-file-format).\n\nNote: `opentoolflux` will never change or remove the source data files, so you can safely try commands to see what happens. If you want to start over from zero, simply remove the `database.feather` file and run `opentoolflux import` again.\n\n## Other ways to get a database\n\nIt is also possible to copy the `opentoolflux/database.feather` file between computers. To \"export\" the database, simply copy the `database.feather` file and save it on a USB stick or network drive, or even send it by email if it's not too large.\n\nYou can also create the database file in any other way you like, following the [technical specification of the database below](#the-database-file).\n\n## Show info about the database\n\nTo show some basic info about the database file, run the following command:\n\n```\nopentoolflux info\n```\n\n## Estimate gas fluxes\n\nWhen the `database.feather` file is in place, estimate gas fluxes using the following command:\n\n```\nopentoolflux fluxes\n```\n\nThis will do several things:\n\n- Optionally, filter the database as specified in the `filters` section of the [config file](#configuration-options).\n- Split the remaining data into segments by chamber as specified in the `measurements` section of the [config file](#configuration-options).\n- Ignore any segments that are too short or too long, following the `measurements` section of the [config file](#configuration-options). Unexpectedly short segments can be created, for example, if the equipment is shut down or restarted.\n- For each of the remaining measurements, estimate the flux as specified in the `fluxes` section of the [config file](#configuration-options). (Read more about [how the flux estimation works](#how-the-flux-estimation-works) below.)\n- Save all the results to a file `opentoolflux/fluxes.csv`.\n\n## Plot results\n\nThe command group `opentoolflux plot` can be used to generate the following figures:\n\n### `flux-fits`: flux estimation diagnostics\n\nTo visualize the gas flux estimation and identify potential problems, run the following command:\n\n```\nopentoolflux plot flux-fits\n```\n\nThis command estimates gas fluxes following [the same steps as the `opentoolflux fluxes` command](#estimating-gas-fluxes), but instead of a results table it outputs one figure for each measurement in the folder `opentoolflux/plots/flux-fits`. Each figure shows the gas concentration(s) over time during a chamber closure, and the curve that has been fit to estimate the gas flux(es). The `t0_delay` and `t0_margin` parameters are also shown in this figure.\n\n### `flux-time-series`: fluxes over time\n\nTo generate figures showing the fluxes over time in each chamber, run:\n\n```\nopentoolflux plot flux-time-serie\n```\n\nThis command estimates gas fluxes following [the same steps as the `opentoolflux fluxes` command](#estimating-gas-fluxes) and then creates a figure for each chamber, showing the flux estimates of all gases over time.\n\n# Notes on dimensions and units\n\nThe software expects volumetric concentration data and produces volumetric flux estimates, i.e., fluxes in dimensions of length / time (= volume / area / time). The units can be, e.g., ppmv, ppbv, or simply fractions (i.e., m3/m3). The \"prefix\" implicit in the unit (e.g., 10^-6 for ppmv) also affects the flux estimates. For example, if concentration indata are in ppmv, and all other parameters given in SI units, then the flux estimates are given in 10^-6 m/s (micrometers per second).\n\nAs explained in [our paper on the estimation procedure](#how-the-flux-estimation-works), the flux estimates also depend on the chambers' footprint area A, volume V, and the sample flow rate Q. The configuration file (see below) requires specification of A, V, and Q. Technically, the only requirement is that Q/V has unit second, but **we strongly recommend using SI units for A, V, and Q (i.e., specify A in m2, V in m3, and Q in m3/s)**. See the example below.\n\nThe output flux estimates will have the units of [c * V / A] per second, where c is the concentration. E.g., if concentrations are in ppmv, V in m3 and A in m2, then flux estimates are in 10^-6 m/s (micrometer per second).\n\n# The database file\n\nOpenToolFlux uses a database file which is just a table stored as a [Feather file](https://arrow.apache.org/docs/python/feather.html). The default file path to the database is `database.feather` stored in the output directory.\n\nThe database has one row per sample and normally contains the following columns:\n- `__TIMESTAMP__`: a timestamp of the sample, in [UTC](https://en.wikipedia.org/wiki/Coordinated_Universal_Time). This column is used as primary key in the database, so the timestamps must be unique. The table must be sorted by timestamp in ascending order. The `__TIMESTAMP__` column is the only mandatory column in the database (although a database with only timestamps is not really useful).\n- One column identifying the current chamber. With the Picarro data, this is a number, but any data type will work.\n- One column giving sample concentration of each gas to analyze, e.g., `CO2`, `CH4_dry` and/or `N2O_dry`.\n- Optionally, additional columns used to filter out samples. For example `ALARM_STATUS` in the case of Picarro data files.\n\nThe command `opentoolflux import` ([see above](#import-data-from-source-files)) can be used to create the database from Picarro (or other) data files. It is also possible to create the database in any way (e.g., using a custom Python or R script). The database file can also be copied between folders or computers without any problem.\n\n## On data types and database size\n\nThe database can contain columns of different data types: unsigned (nonnegative) integers (`uint`), signed integers (`int`), floating-point numbers (`float`), booleans (`bool`), and strings (`str`). The numeric datatypes (`uint`, `int`, and `float`) come in different precisions/sizes:\n\n- `uint8`: Integers 0 to 255\n- `uint16`: Integers 0 to 65,535\n- `uint32`: Integers 0 to 4,294,967,295\n- `uint64`: Integers 0 to 18,446,744,073,709,551,615\n- `int8`: Integers -128 to 127\n- `int16`: Integers -32,768 to 32,767\n- `int32`: Integers -2,147,483,648 to 2,147,483,647\n- `int64`: Integers -9,223,372,036,854,775,808 to 9,223,372,036,854,775,807\n- `float16`: 16-bit [floating point](https://en.wikipedia.org/wiki/Floating-point_arithmetic) (a.k.a. \"half precision\")\n- `float32`: 32-bit [floating point](https://en.wikipedia.org/wiki/Floating-point_arithmetic) (a.k.a. \"single precision\")\n- `float64`: 64-bit [floating point](https://en.wikipedia.org/wiki/Floating-point_arithmetic) (a.k.a. \"double precision\")\n\nOptimizing only for data types capacity and precision, it makes sense to always choose `uint64`, `int64` and `float64`. However, for large databases (long time series), the database can grow fairly large, and it may make sense to choose a more restrictive data type.\n\nFor example, if the chambers are encoded as integers 1-12, or even 1-100, it is more than enough to use an `int8` or `uint8`, which takes only 1/8 of the space compared to an `int64`.\n\nFor the `float` data types, the choice is not as obvious because there is a loss of precision going from `float64` to `float32` or `float16`. But practically speaking, even a `float16` in many cases will be sufficient. In technical terms, a [`float16` significand has 3-4 significant decimal digits](https://en.wikipedia.org/wiki/Half-precision_floating-point_format#IEEE_754_half-precision_binary_floating-point_format:_binary16).\n\nTherefore, for example, when we work with Picarro data on N2O concentrations in ppmv (roughly 0.3 ppmv N2O), a `float16` can encode the difference beteween 0.300 ppmv and 0.301 ppmv without problem (a difference of 1 ppbv). This precision is much better than the [second-to-second noise in the Picarro concentration data](#source-data-file-format). This example shows that for many purposes, using `float16` instead of `float64` for gas concentrations will practically make very little difference for results. (By the way, the Picarro software converts all gas concentrations to `float64` before doing the flux estimate calculation, so only the value stored in the database is limited by the `float16` encoding.)\n\n**If in doubt about `float` data types, we suggest to use `float32` which has [at least 6 decimal digits of precision in the significand](https://en.wikipedia.org/wiki/Single-precision_floating-point_format#IEEE_754_standard:_binary32) and thus should be far more precise than practically speaking any gas analyzer out there.**\n\nHow much space can be saved by choosing smaller data types? As an example, consider a database with the following data columns:\n\n- Timestamp (always 64 bits in a Feather file)\n- Chamber number (`uint8` or `uint64`)\n- Alarm status (`int8` or `int64`)\n- Five gas concentrations: N2O, NO2, CH4, CO2, H2O (`float16` or `float64`)\n\nWith the smaller data types, each row will take 64 + 2 * 8 + 5 * 16 = 160 bits = 20 bytes.\n\nWith the larger data types, each row will take 64 + 2 * 64 + 3 * 64 = 384 bits = 64 bytes, or 3.2 times as much.\n\nIf we collect one data row per second during one year, the resulting database sizes will be either 601 or 1,925 megabytes (MiB). If your computer has less than 4 gigabytes of RAM memory, the program might get slow or even crash with the larger database, and in any case you might care about the difference in space on disk.\n\nThis example also shows that if your dataset is perhaps only a few weeks long with frequency 1 second, or maybe one year with frequency 1 minute, the database file will anyway be so small that there are probably very few reasons to worry about database size.\n\nA final related note is that floating-point data to be converted to timestamps in the `opentoolflux import` command should always be `float64`. The conversion of floating-point Unix timestamps (in seconds) is designed to preserve 6 decimal places (microseconds), something which requires `float64`. The `__TIMESTAMP__` column in the end is always encoded using 64 bits anyway, so there is no space to be saved by parsing the timestamp column as a `float32`. Failure to specify `float64` as data type for the timestamp column raises a helpful error message.\n\n# Source data file format\n\nHere is an example of what the default source file format looks like:\n\n```\nEPOCH_TIME      ALARM_STATUS   solenoid_valves     N2O_dry\n1620345675.170  0              5.0000000000E+00    3.3926340875E-01\n1620345675.991  0              5.0000000000E+00    3.3928078030E-01\n1620345676.605  2              5.0000000000E+00    3.5087647532E-01\n1620345677.312  0              6.0000000000E+00    3.3491837412E-01\n```\n\nThe data files from our Picarro equipment look like this, but with many more columns containing various information. A full example is given here: [example/indata](example/indata).\n\nSource data files must be be [delimited text files](https://en.wikipedia.org/wiki/Delimiter-separated_values). The default delimiter, following the data files we get from our Picarro equipment, is **one or more** whitespace characters (`sep = '\\s+'`), but other delimiters can be specified using the `sep` setting (e.g., `sep = \",\"` for standard csv files).\n\nFor example, setting `sep = \",\"` in the configuration file, an example input data file would be\n\n```\nEPOCH_TIME,ALARM_STATUS,solenoid_valves,N2O_dry\n1620345675.170,0,5.0000000000E+00,3.3926340875E-01\n1620345675.991,0,5.0000000000E+00,3.3928078030E-01\n1620345676.605,2,5.0000000000E+00,3.5087647532E-01\n1620345677.312,0,6.0000000000E+00,3.3491837412E-01\n```\n\n(Technical note: The Picarro source files, following roughly the format shown above, can also be seen as [fixed-width files](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_fwf.html), but since the data fields do not contain whitespace, they can also be parsed as delimited files as described here.)\n\nEach source data file must have a one-line header specifying the column names.\n\n## Notes on timestamps\n\nOne of the columns must contain timestamps of the measurements (in the example above, the colum `EPOCH_TIME`). The timestamps can be encoded as:\n\n- Numeric values, which are interpreted to be [Unix timestamps](https://en.wikipedia.org/wiki/Unix_time) expressed in seconds. In Picarro data files, the `EPOCH_TIME` column is a Unix timestamp in seconds (with three decimals, giving millisecond resolution).\n- String values, which are parsed using [`pandas.to_datetime()`](https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html) and then converted to UTC timestamps. This means that timestamp strings can be expressed\n  - in UTC using a string such as `\"2021-12-07T11:00:24.123Z\"`,\n  - in any other timezone, e.g., `\"2021-12-07 13:00:24.123+0200\"`, or\n  - without timezone, e.g., `\"2021-12-07 13:00:24\"`, which will be interpreted as UTC.\n\nWhen running the [`opentoolflux import` command](#import-data-from-source-files), the timestamp source column is converted to UTC timestamps following the above rules, and renamed to `__TIMESTAMP__`.\n\n# Configuration options\n\nBelow is an example configuration file listing all the configuration options.\n\n```toml\n# The [general] section is optional.\n[general]\n# `outdir` is the output directory path, relative to the configuration file.\n# Optional. Default \"opentoolflux\".\noutdir = \"outdata\"\n\n# The [import] section is optional. If you already have a Feather database\n# file, this is not needed.\n[import]\n# src lists the path(s) to input data files which should be delimited text\n# files as explained above. All paths are relative to the configuration file.\n# When running the `opentoolflux import` command, these paths are searched.\nsrc = [\n    \"path/to/filename.dat\",  # Path to a specific file\n    \"indata/2022/06/01/*.dat\",  # Unix-style glob patterns using *\n    \"indata/2022/**/*.dat\",  # Also ** globs are supported.\n]\n\n# sep specifies the delimiter used in the data files..\nsep = \"\\\\s+\"  # One or more whitespace characters (the default).\n# sep = \",\"  # Alternative for comma-separated files\n# sep = \"\\\\t,\"  # Alternative for tab-separated files\n\n# timestamp_col gives the name of the column containing sample timestamps.\n# See the README section on timestamps for details on formats.\ntimestamp_col = \"EPOCH_TIME\"\n\n# [import.columns] gives the names of the columns to import and their data types.\n# See the opentoolflux README section on data types for more details.\n[import.columns]\nEPOCH_TIME = \"float64\"\nvalve_number = \"float16\"\nALARM_STATUS = \"uint8\"\nCO2 = \"float32\"\nCH4_dry = \"float32\"\nN2O_dry = \"float32\"\n\n\n# Filters are optional.\n#\n# A [filters.x] section specifies the filtering to be done on column x.\n# Filters can specify `allow_only`, `disallow` and `min` and `max`\n# as shown in examples below. The data matched by a filter is treated\n# as if it was not present in the database; i.e., data \"removed\" by\n# filters do not contribute at all to flux estimates and are not shown\n# in plots generated.\n\n[filters.ALARM_STATUS]\ndisallow = [4]\n\n# __TIMESTAMP__ is a special column created in the database to store\n# the timestamps. This has datetime data type and any values specified in the\n# filter settings are automatically converted to datetime too.\n[filters.__TIMESTAMP__]\nmin_value = \"2022-05-09\"\nmax_value = \"2022-05-10 06:00:00\"\n\n# Advanced note on data types:\n# Filtering is done after import, i.e., using the data types specified in\n# the [import.columns] section above. Values specified in filter settings\n# are converted to the data types of the  corresponding column; therefore,\n# in the `valve_number` example below, the `allow_only` values specified\n# as integers will be converted to `float16`, the specified data type for\n# that column, before the filter is applied.\n[filters.valve_number]\nallow_only = [2, 3, 6, 7]\n\n[filters.CO2]\nmin = 0\nmax = 2000\n\n# The [measurements] section specifies how to split the database into segments\n# corresponding to chamber closures.\n[measurements]\n# chamber_col is the name of the database column indicating the current chamber.\n# A new segment starts when the value in this column changes.\nchamber_col = \"valve_number\"\n\n# The time values below (max_gap, min_duration, and max_duration) should be set\n# to values corresponding to the setup of your experiment.\n#\n# In our example, the input data have ca 1 Hz sampling frequency, so a gap\n# of 10 seconds indicates a problem/restart which we treat as a \"new\" segment;\n# and the segment length normally should be 20 minutes, so we discard any\n# segments deviating more than 30 seconds from that.\nmax_gap = \"00:00:10\"  # Max 10 seconds between samples.\nmin_duration = \"00:19:30\"  # Segment length minimum 19 minutes 30 seconds.\nmax_duration = \"00:20:30\"  # Segment length maximum 20 minutes 30 seconds.\n\n# The [fluxes] section specifies columns containing concentration data\n# to be analyzed.\n[fluxes]\ngases = [\"N2O_dry\", \"CH4_dry\", \"CO2\"]  # the list of gas-concentration columns\n\n# Chamber dimensions and sampled gas flow\n#\n# See notes on units in the README. In summary:\n# - Concentrations can be in any unit (e.g., ppmv or simple fractions m3/m3).\n# - V / Q must have unit second. (E.g., if Q is m3/s, then must be in m3.)\n# - A can have any unit.\n#\n# The resulting (volumetric) flux estimates will have the units of\n# [c * V / A] per second, where c is the concentration.\n# E.g., if concentrations are in ppmv, V in m3 and A in m2, then flux\n# estimates are in 10^-6 m/s (micrometer per second).\n#\n# We recommend using straight SI units throughout to minimize confusion.\nA = 0.25  # Soil area covered by the chamber, here 0.25 m2\nV = 50e-3  # Volume of chamber, here 50 liters in m3\nQ = 4.16e-6  # Gas flow drawn from chamber, here 0.25 liters/minute in m3/s\n\n# t0_delay is the time delay from chamber closure until the first gas arrives\n# in the gas analyzer. This delay depends on the tube length which may be\n# different between chambers.\n\n# Optionally, the same t0_delay can be set for all chambers:\n# t0_delay = \"00:06:00\"  # 6 minutes\n\n# t0_margin specifies an extra duration of data to discard after t0_delay,\n# to avoid estimation errors if the actual delay is longer which leads to \"old\"\n# gas concentrations being erroneously included in the curve fit.\n# Calculations are made using t0 equal to the closure start plus t0_delay.\n# See figures generated by `opentoolflux plot flux-fits` for an illustration.\nt0_margin = \"00:02:00\"\n\n# The `t0_delay` can be set to one value, e.g., t0_delay = \"00:06:00\" as above,\n# or as a table with different t0_delay for each chamber, as follows.\n# This is the preferred solution if the delay is substantially different\n# between chambers.\n# The left-hand side of these assignments is a string representation\n# of the chamber value, i.e., in this example the value found in the\n# `valve_number` column.\n[fluxes.t0_delay]\n2 = \"00:04:00\"  # 4 minutes\n3 = \"00:06:00\"  # 6 minutes\n6 = \"00:05:30\"  # 5 minutes 30 seconds\n7 = \"00:06:30\"  # 6 minutes 30 seconds\n\n# The [chamber_labels] section is optional. The labels may correspond to\n# labels used in the experimental design. If specified, these labels\n# are used in output file names and printed in figures.\n[chamber_labels]\n2 = \"A1\"\n3 = \"A2\"\n6 = \"B1\"\n7 = \"B2\"\n```\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/rasmuse/opentoolflux",
    "keywords": "",
    "license": "MIT License",
    "maintainer": "Rasmus Einarsson",
    "maintainer_email": "python-opentoolflux@rasmuseinarsson.se",
    "name": "opentoolflux",
    "package_url": "https://pypi.org/project/opentoolflux/",
    "platform": null,
    "project_url": "https://pypi.org/project/opentoolflux/",
    "project_urls": {
      "Homepage": "https://github.com/rasmuse/opentoolflux"
    },
    "release_url": "https://pypi.org/project/opentoolflux/0.2.3/",
    "requires_dist": [
      "click (>=8.0)",
      "pandas (>=1.4.0)",
      "pyarrow (>=8.0)",
      "pydantic (>=1.9)",
      "tomli (>=2.0.1)",
      "matplotlib (>=3.5)"
    ],
    "requires_python": ">=3.8",
    "summary": "OpenToolFlux is a command-line application to estimate gas fluxes from automatic chamber data.",
    "version": "0.2.3",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17388449,
  "releases": {
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "bc85839b3d84c058d9c5f37444ce4fc913ddecb8968649254bf0b3a47dc786e6",
          "md5": "de7b8a17d685a63d7ec0ee5a74b71029",
          "sha256": "a4c39114a4e636ded21dbd4225d9bfd87c1ab13008a138831933dd2e3ad91935"
        },
        "downloads": -1,
        "filename": "opentoolflux-0.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "de7b8a17d685a63d7ec0ee5a74b71029",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 32809,
        "upload_time": "2023-03-20T20:10:56",
        "upload_time_iso_8601": "2023-03-20T20:10:56.864109Z",
        "url": "https://files.pythonhosted.org/packages/bc/85/839b3d84c058d9c5f37444ce4fc913ddecb8968649254bf0b3a47dc786e6/opentoolflux-0.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e8981d47a762f4b4a0901001f1c97c6188ce35afdb7438c4f287cb17ef1dd620",
          "md5": "b12cbf74e9f4fbe2a2e071e83028928a",
          "sha256": "484e4f297640b6a5bc1d70bb1b6e89c10d56ca12daabd5a00201c0d34d13e9e5"
        },
        "downloads": -1,
        "filename": "opentoolflux-0.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "b12cbf74e9f4fbe2a2e071e83028928a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 41570,
        "upload_time": "2023-03-20T20:10:58",
        "upload_time_iso_8601": "2023-03-20T20:10:58.760921Z",
        "url": "https://files.pythonhosted.org/packages/e8/98/1d47a762f4b4a0901001f1c97c6188ce35afdb7438c4f287cb17ef1dd620/opentoolflux-0.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.0.dev0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b0843a457cd81071ff9c716cc821a389bf12fcffe97e59af6c00d40807e11501",
          "md5": "441e9aaa4d4d8ff896befadebcb63d06",
          "sha256": "81e35c3c78d5aad4c87eb01caa03118d54db0e41c275a4941e08418eda100fe0"
        },
        "downloads": -1,
        "filename": "opentoolflux-0.1.0.dev0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "441e9aaa4d4d8ff896befadebcb63d06",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 32255,
        "upload_time": "2023-03-20T20:09:22",
        "upload_time_iso_8601": "2023-03-20T20:09:22.403916Z",
        "url": "https://files.pythonhosted.org/packages/b0/84/3a457cd81071ff9c716cc821a389bf12fcffe97e59af6c00d40807e11501/opentoolflux-0.1.0.dev0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "080e86b194e3502522fb600a11e5fe7bff7da20ca71dbce814caef1f116a853d",
          "md5": "307d75c75fb15cd4644f6b303d8fcbb1",
          "sha256": "36d4bef93b273cf3045d0da4b0fb9bdf57d68aa753fc56007ed3e5e9e8c22dd7"
        },
        "downloads": -1,
        "filename": "opentoolflux-0.2.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "307d75c75fb15cd4644f6b303d8fcbb1",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 35872,
        "upload_time": "2023-03-21T17:54:23",
        "upload_time_iso_8601": "2023-03-21T17:54:23.218209Z",
        "url": "https://files.pythonhosted.org/packages/08/0e/86b194e3502522fb600a11e5fe7bff7da20ca71dbce814caef1f116a853d/opentoolflux-0.2.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d60f6b48e2f59536e09d73a4b9d127cbc4281888d9846db3e5bbf1f8bc8ad68b",
          "md5": "4cd7d3d28f733fdd6231214f0aebee87",
          "sha256": "b6bd8f9b301b3c10bc8294d466eda797719f59071b841625438caf186cc3c478"
        },
        "downloads": -1,
        "filename": "opentoolflux-0.2.0.tar.gz",
        "has_sig": false,
        "md5_digest": "4cd7d3d28f733fdd6231214f0aebee87",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 47296,
        "upload_time": "2023-03-21T17:54:26",
        "upload_time_iso_8601": "2023-03-21T17:54:26.159471Z",
        "url": "https://files.pythonhosted.org/packages/d6/0f/6b48e2f59536e09d73a4b9d127cbc4281888d9846db3e5bbf1f8bc8ad68b/opentoolflux-0.2.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "336698b74a8b01ecb5fc553826c4cf79faeaaef1790a7685961198b5df312d84",
          "md5": "ed586c54dad846b54d04c1debfd7c619",
          "sha256": "2f6b19e9de65f2e866135d98386a7bfbc43112f4bd906613f204072c53e5bba0"
        },
        "downloads": -1,
        "filename": "opentoolflux-0.2.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "ed586c54dad846b54d04c1debfd7c619",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 35870,
        "upload_time": "2023-03-21T17:58:55",
        "upload_time_iso_8601": "2023-03-21T17:58:55.081575Z",
        "url": "https://files.pythonhosted.org/packages/33/66/98b74a8b01ecb5fc553826c4cf79faeaaef1790a7685961198b5df312d84/opentoolflux-0.2.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "58ad024cdd8ab821013f90f128e7120e663f7ad1ed07b7faa2a8755c3b93f32a",
          "md5": "3ab7937c9a13128fd2842ae6a61f3782",
          "sha256": "7cb42104caa140db32c418d8039503fa9f09097a4197b5d1721ac1fd104da276"
        },
        "downloads": -1,
        "filename": "opentoolflux-0.2.1.tar.gz",
        "has_sig": false,
        "md5_digest": "3ab7937c9a13128fd2842ae6a61f3782",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 47339,
        "upload_time": "2023-03-21T17:58:57",
        "upload_time_iso_8601": "2023-03-21T17:58:57.339587Z",
        "url": "https://files.pythonhosted.org/packages/58/ad/024cdd8ab821013f90f128e7120e663f7ad1ed07b7faa2a8755c3b93f32a/opentoolflux-0.2.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "dc0a8172abb49afc7140c59fb1a6e1cde55ce2f9342ad54821441dda4e8de3d4",
          "md5": "aada5741762f1c0be3053add93de9422",
          "sha256": "395945cb29bd8aa993ef3e6f9feeeca26852714eea4270e69554ab69024cf647"
        },
        "downloads": -1,
        "filename": "opentoolflux-0.2.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "aada5741762f1c0be3053add93de9422",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 35872,
        "upload_time": "2023-03-21T18:38:40",
        "upload_time_iso_8601": "2023-03-21T18:38:40.226870Z",
        "url": "https://files.pythonhosted.org/packages/dc/0a/8172abb49afc7140c59fb1a6e1cde55ce2f9342ad54821441dda4e8de3d4/opentoolflux-0.2.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "daae0cc56bd9df6accbc9afaff7ddaef239d6c04c6c14c2ea22782004b4c0ad9",
          "md5": "a8f9c1bbea5ed71df7c817a7d3b368a3",
          "sha256": "bb1f116df7e085df693e34881ad0008079f96bfb15867592cb703bce90089e7a"
        },
        "downloads": -1,
        "filename": "opentoolflux-0.2.2.tar.gz",
        "has_sig": false,
        "md5_digest": "a8f9c1bbea5ed71df7c817a7d3b368a3",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 47366,
        "upload_time": "2023-03-21T18:38:43",
        "upload_time_iso_8601": "2023-03-21T18:38:43.034676Z",
        "url": "https://files.pythonhosted.org/packages/da/ae/0cc56bd9df6accbc9afaff7ddaef239d6c04c6c14c2ea22782004b4c0ad9/opentoolflux-0.2.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5f85b6e56741fbfd1dbc8c901acaf0fc82cfa9154c921987625e3d74cd6b4edd",
          "md5": "9d90c975c2f8005fe2dfc8ef1aba8a54",
          "sha256": "bef0dd8e0b1884e879bd8adf77d7904c72312c8d2d11ff6882baf36028f3af7e"
        },
        "downloads": -1,
        "filename": "opentoolflux-0.2.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "9d90c975c2f8005fe2dfc8ef1aba8a54",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 35882,
        "upload_time": "2023-03-21T21:08:32",
        "upload_time_iso_8601": "2023-03-21T21:08:32.596603Z",
        "url": "https://files.pythonhosted.org/packages/5f/85/b6e56741fbfd1dbc8c901acaf0fc82cfa9154c921987625e3d74cd6b4edd/opentoolflux-0.2.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "542d404d15ebd6b7b2bda45f60e6c03145cab14c437527a744150daaedec262e",
          "md5": "60a2f8ecad206ecb304b676b2ba35cc7",
          "sha256": "e507eecc4f2bb63abcfb02e88e74bb8bd32a62bc06870c4ae7041a4312840132"
        },
        "downloads": -1,
        "filename": "opentoolflux-0.2.3.tar.gz",
        "has_sig": false,
        "md5_digest": "60a2f8ecad206ecb304b676b2ba35cc7",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 47409,
        "upload_time": "2023-03-21T21:08:35",
        "upload_time_iso_8601": "2023-03-21T21:08:35.773194Z",
        "url": "https://files.pythonhosted.org/packages/54/2d/404d15ebd6b7b2bda45f60e6c03145cab14c437527a744150daaedec262e/opentoolflux-0.2.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "5f85b6e56741fbfd1dbc8c901acaf0fc82cfa9154c921987625e3d74cd6b4edd",
        "md5": "9d90c975c2f8005fe2dfc8ef1aba8a54",
        "sha256": "bef0dd8e0b1884e879bd8adf77d7904c72312c8d2d11ff6882baf36028f3af7e"
      },
      "downloads": -1,
      "filename": "opentoolflux-0.2.3-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "9d90c975c2f8005fe2dfc8ef1aba8a54",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.8",
      "size": 35882,
      "upload_time": "2023-03-21T21:08:32",
      "upload_time_iso_8601": "2023-03-21T21:08:32.596603Z",
      "url": "https://files.pythonhosted.org/packages/5f/85/b6e56741fbfd1dbc8c901acaf0fc82cfa9154c921987625e3d74cd6b4edd/opentoolflux-0.2.3-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "542d404d15ebd6b7b2bda45f60e6c03145cab14c437527a744150daaedec262e",
        "md5": "60a2f8ecad206ecb304b676b2ba35cc7",
        "sha256": "e507eecc4f2bb63abcfb02e88e74bb8bd32a62bc06870c4ae7041a4312840132"
      },
      "downloads": -1,
      "filename": "opentoolflux-0.2.3.tar.gz",
      "has_sig": false,
      "md5_digest": "60a2f8ecad206ecb304b676b2ba35cc7",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.8",
      "size": 47409,
      "upload_time": "2023-03-21T21:08:35",
      "upload_time_iso_8601": "2023-03-21T21:08:35.773194Z",
      "url": "https://files.pythonhosted.org/packages/54/2d/404d15ebd6b7b2bda45f60e6c03145cab14c437527a744150daaedec262e/opentoolflux-0.2.3.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}