{
  "info": {
    "author": "Issa Lompo",
    "author_email": "kaiyoux@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "Environment :: Console",
      "License :: OSI Approved :: GNU General Public License v3 (GPLv3)",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3",
      "Topic :: Utilities"
    ],
    "description": "# Introduction\n\nThe p_cmd_runner package was born from the need to run local commands (taken from local files) on any number of remote nodes accessible via SSH(/AMOS/MOSHELL).\nIt is written in Python 3, and is based on the Paramiko package.\n\nAs of **version 0.1.0**, SSH security key files are supported as an alternative to password authentication.\nSee this [tutorial](https://phoenixnap.com/kb/setup-passwordless-ssh) on how to setup your SSH security key files.\nIn general, you would generate public and private key-pair(s) on your local machine, then transfer the public key(s) to your remote node(s).\n\n### To install the package:\n**python -m pip install p_cmd_runr**\n\n\n### The p_cmd_runr package provides access to:\n- an API composed of a ConfigGrabber class, a CmdRunner class, a main function called boxjumper, and other utility functions.\n- the gp_cmd_runr a general purpose command runner script.\n\nWhether you will be implementing your own script with the help of the API, or running the gp_cmd_runr script, you will have to provide 2 types of files:\n- at least one configuration file stating which nodes to access, their login information, along with references to the files containing the commands to run on those nodes.\n- at least one command file containing the commands you would normally run on the above node(s).\n\n\n# The Main API Classes And Functions\n\nThe **ConfigGrabber** class creates an iterator type object. You provide it with the filename of your local configuration file.\n```\n__init__(self, filename=\"config.txt\", separator=\"=\", comment=\"#\", mvs=\",\", delay=\"0\", cmd_timeout=\"0.5\", prompts=\"$#?<>\")\n        Description:\n            Initializer of a ConfigGrabber object.\n            Reads a configuration file and makes available a dictionary of key-value pairs taken from that configuration file.\n        Parameters:\n            - Filename specifies the name of the configuration file to process.\n            - separator defines the character or string used as separator between key-value pairs.\n            - comment defines the character or string used for line comments.\n            - mvs (or multi-value seperator): defines the character or string that seperates multiple values.\n            - delay pause time (in seconds) before running the next command.\n            - cmd_timeout maximum time (in seconds) to wait for a command to finish executing.\n            - prompts string of characters representing command line prompts.\n        Returns:\n            ConfigGrabber object (which contains the jumpboxes used by the boxjumper function).\n```\n\n\nThe **CmdRunner** class creates an object that logs into a node *jumpbox-style* and runs commands taken from cmd_file. It outputs the results in log_file.\n```\n__init__(self, jumpbox, node, cmd_file, log_file, blocking, key_file=None)\n        Description:\n            Initializer of CmdRunner object.\n        Parameters:\n            - jumpbox defines parameters needed to login to node.\n            - node hostname or IP address of the node.\n            - cmd_file file containing the commands to execute on node.\n            - log_file name of file in which activity is logged. If log_file is not given, a log file will be created.\n            - blocking determines whether to block and wait for a command to finish executing.\n            - key_file optional SSH security key file.\n        Returns:\n            CmdRunner object.\n```\n\n\nThe **boxjumper** function internally creates CmdRunner objects from jumpboxes, and recursively logs into those boxes/nodes. If commands happen to be defined for a node, they are executed.\n```\nboxjumper(jumpboxes, count, fp=None, channelstack=None, print_output=False, blocking=True)\n    Description:\n        boxjumper recursively logs into the boxes/nodes defined in jumpboxes.\n        And optionally executes the commands for the current node if it's defined.\n    Parameters:\n        - jumpboxes list of jumpbox objects (contained within a ConfigGrabber object).\n\t- count number of jumpboxes.\n        - fp boxjumper's log file pointer.\n        - channelstack optional channel created by the previous node (if there was a previous node).\n        - print_output determines whether or not to print command output on the screen.\n        - blocking determines whether to block and wait for a command to finish executing.\n    Returns:\n        fp boxjumper's log file pointer.\n```\n\n\n## A Very Simple Example On How To Use The API\n``` \nfrom p_cmd_runr.p_cmd_runr import ConfigGrabber\nfrom p_cmd_runr.p_cmd_runr import boxjumper\n\n# your local configuration file\nfilename=\"config.txt\"\n# parse the configuration file and create a ConfigGrabber object, which contains one or more jumpboxes and their associated parameters\ncfo = ConfigGrabber(filename)\n# boxjumper will create a CmdRunner object from each jumpbox contained in cfo, and use the CmdRunner objects to remote into its corresponding node and optionally run commands on it.\nfp = boxjumper(cfo, len(cfo))\nif fp:\n\tfp.close()\n```\n\n\nFor more information on other functions and class methods, load the package and use the Python help() function to inspect them, or check the [source code](https://github.com/kaiyoux/p_cmd_runr).\n\n\n# How To Use The gp_cmd_runr Script \n\nThe gp_cmd_runr script is a general purpose and flexible means of automatically running commands remotely on one or more service node(s) using SSH(/AMOS/MOSHELL).\nIt allows you to jump from node to node, with the option of running commands on each node.\n**PLEASE MAKE SURE THAT YOU MANUALLY TEST THE COMMANDS ON THE INTENDED NODE(S) BEFORE RUNNING THEM \nAUTOMATICALLY WITH THIS SCRIPT.**\n\n\nThe script is controlled by one or more configuration files. See Definitions and the Example Configuration Files section below to have an idea on how to write your own configuration file(s).\n\n\n### Prerequisite (skip this if the p_cmd_runr package install was successful):\n1. Install the latest version of python 3 from https://www.python.org/ if you don't already have it.\nFor Windows users, during the python installation, make sure that the option to add the location of the python executable to your Windows PATH environment variable is selected.\n\n2. Install the paramiko package by doing the following: (This should not be necessary, because installing the p_cmd_runr package should install all dependancies such as Paramiko)\n\t1. Open a console or command prompt. For Windows users, Right click on Windows PowerShell (or CMD prompt) and select Run as Administrator. (If Run as Administrator does not work, try using the regular mode.)\n\t2. Type the following 2 commands: \n\n**python -m pip install –upgrade pip**\n\nand\n\n**python -m pip install –upgrade paramiko**\n\nor\n\n**python -m pip install -r requirements.txt**\n\n\n### To run the scrpit:\n**python -m gp_cmd_runr [-h] [-d] [-t] [-p] [-r|-n|-f] [-c CONFIG1 [CONFIG2 ...] ]**\n```\ngeneral purpose command runner\n\noptional arguments:\n  -h, --help            show this help message and exit\n  -d, --dry_run         display loaded configuration, but do not execute\n  -t, --timeout         sets command execution to non-blocking. default is blocking\n  -p, --print_output    flag to print command output to the screen. default is not to print\n  -r, --raw\t\tno manipulation of output file(s)\n  -n, --normal\t\tremove duplicate '\\n' between lines in output file(s). this \"normal\" appearance is the default behavior\n  -f, --flatten\t\tonly have output file(s) containing a single '\\n' between lines\n  -c CONFIG1 [CONFIG2 ...], --config CONFIG1 [CONFIG2 ...]\n                        list of one or many configuration files. default is config.txt\n```\n\n\n# Definitions\n```\n# This defines the structure of a configuration file.\n# # character is a comment\n# [] encloses an optional entry or block of entries\n# <> value to specify. Note that the terms file, filename and filepath within <> are synonymous\n\n[\n# optional jumpboxes. these are potentially intermediary nodes, and can only be accessed through ssh\n# example: ssh [-i key_file] [username@]node [-p port]\n# jumbox1\njump_cmd = ssh\nnode = <node>\n[username = <username>]  # will be prompted if not provided\n[\n[\n[key_file = <ssh security key file>]  # will not be prompted if not provided. this would usually be a private key file on your local machine\n[passphrase = <passphrase of key_file>]  # if your private key file was created with a passphrase for additional security, you will have to specify it here. Note that this entry is optional if you are not using a passphrase\n]\n# or\n[password = <password>]  # will be prompted if not provided. meaningless if key_file is provided\n]\n[port = <port number>]   # specify a custom ssh port number. default is 22\n[cmd_file = <filepath>]\n[log_file = <log filename>]\n[delay = <pause time before running next command>]  # defaults to 0 sec\n[cmd_timeout = <maximum time to wait for command execution>]  # maximum amount of time to wait (in seconds) for output from a command. it defaults to 0.5 sec. increase this value if you are missing some output. meaningless in blocking mode\n[prompts = <string of characters representing prompts on the node>]  # for blocking execution, the script blocks until it detects one of the prompts specified here. default is $#?<> . meaningless in non-blocking mode\nend\n\n\n#jumpbox2\n...\n\n#jumpboxN\n...\n]\n\n# and/or\n\n[\n# optional final node(s). these are similar nodes sharing the same login username, the same password (if key files are not used), and understanding the same commands. can either be accessed through ssh or amos/moshell\n# the name of each log file will be a combination of its corresponding IP/node name with date and timestamp. \n# Note that if there happens to be a local tmp/ folder, the script will silently move the logs files to that tmp/ folder as a measure to avoid cludder in the working directory\nnodes = <comma seperated list of nodes (either node names or IP addresses)>\n\n[\n# optional ssh security key files for the above final nodes \n# the first key file is for the secure login to the first node, the second key file to the second node, etc.\n# if there are more nodes than key files, the last key file will be used to login to the remaining nodes\n# if there are less nodes than key files, the excess key files are ignored\n# Note that individual passphrases are not allowed in this section for each final node\nkey_files = <comma seperated list of ssh security key files>\n]\n\n# command files for the above final nodes\n# the first command file is run on the first node, the second command file on the second node, etc.\n# if there are more nodes than command files, the last command file will be run on the remaining nodes\n# if there are less nodes than command files, the excess command files are ignored\ncmd_files = <comma seperated list of filepaths>\n\n# defines common parameters for the final nodes\njump_cmd  = amos or moshell or ssh  # examples: amos node or moshell node or ssh [-i key_file] [username@]node [-p port]\n[username = <username>]  # mandatory if using ssh. my amos/moshell does not use username\n[password = <password>]  # mandatory if using ssh and no key_files have been specified. this password will be used to login on all final nodes. meaningless if key_files are provided. my amos/moshell does not use password authentication\n[passphrase = <passphrase for one, some or all key_files>]  # you may define and use a common passphrase for one, all or some of the final nodes/key files. specifying a passcode here for some of the key files will not interfere with the other key files that do not require a passphrase\n[port = <port number>]   # specify a custom ssh port number. default is 22\n[delay = <pause time before running next command>]  # defaults to 0 sec\n[cmd_timeout = <maximum time to wait for command execution>]  # maximum amount of time to wait (in seconds) for output from a command. it defaults to 0.5 sec. increase this value if you are missing some output. meaningless in blocking mode\n[prompts = <string of characters representing prompts on the nodes>]  # for blocking execution, the script blocks until it detects one of the prompts specified here. default is $#?<> . meaningless in non-blocking mode \nend\n]\n```\n\n# Example Confiuration Files\n```\n# The below configuration will ssh to node 99.99.99.99, and from there ssh to node 88.88.88.88.\n# It will run the commands in linux_commands_2.txt on node 88.88.88.88, and save the output in EMM.txt under tmp/ folder.\n# Once done, it will backtrack and run the commands in linux_cmds.txt on node 99.99.99.99, and save the output in cubevm.txt.\n\njump_cmd = ssh\nnode = 99.99.99.99\nusername = \npassword = \n#cmd_timeout = 0.5\n#delay = 0\nlog_file = cubevm.txt\ncmd_file = linux_cmds.txt\nend\n\njump_cmd = ssh\nnode = 88.88.88.88\nusername = iTsm3\npassword = my5ecr3t#Cu8#passw  # yes, you may use '#' characters as part of your password\nlog_file = tmp/EMM.txt  # note: log file will be placed in tmp folder, if tmp/ exists\ncmd_file = linux_commands_2.txt\ncmd_timeout = 1\nend\n```\n\n```\n# The below configuration will ssh to 4 nodes: cube5, cube6, 3.3.3.3, cube1. Note that they must all accept the same login username and password credentials.\n# It will run the commands in linux2_commands on all 4 nodes and save the output locally in text files named after each node with a date and timestamp.\n\nnodes = cube5, cube6, 3.3.3.3, cube1\n\ncmd_files = linux2_commands\n\njump_cmd = ssh\nusername = iTsm3\npassword = my5ecr3tCu8passw\n#delay = 0\n#cmd_timeout = 1\nend\n```\n\n```\n# The below configuration will ssh to node 1.2.3.4, and from there amos to node box1, then box3.\n# It will run the commands in amos2_commands.txt on box1, run the commands in generic_cmds.txt on box3, and save the output files locally in a text files named after each node with a date and timestamp.\n# It will ignore the excess command files: DOES_NOT_EXIST.txt, RANDOM.txt.\n\n\njump_cmd = ssh\nnode = 1.2.3.4\nport = 22\nusername = iTsm3\npassword = my5ecr3tCu8passw\nprompts = $\nend\n\n#nodes = box2 \nnodes = box1, box3\n\ncmd_files = amos2_commands.txt, generic_cmds.txt, DOES_NOT_EXIST.txt, RANDOM.txt\n\njump_cmd = amos\n#delay = 1\nprompts = <>\nend\n```\n\n```\n# The below configuration will ssh to cubeX node using the private key in C:/Users/jd/ssh-keys/id_rsa (which does not require a passphrase),\n# and execute the commands in C:/Users/jd/work/commands_to_run_on_cubeX.\n\njump_cmd = ssh\nnode = cubeX\nport = 2233\nusername = jane-doe\nkey_file = C:/Users/jd/ssh-keys/id_rsa  # was not generated with a passphrase\n#key_file = C:/Users/jd/ssh-keys/pp_id_dsa  # was generated with the below passphrase\n#passphrase = passphrase-for-pp_id_dsa\nprompts = $\ncmd_file = C:/Users/jd/work/commands_to_run_on_cubeX\nend\n```\n\n```\n# The below configuration will successively ssh to the 2 nodes (aServer and 721.9.0.5) using the private key in pp_id_ed25519, along with passphrase \"common_pp*\",\n# and execute the commands in cmd1 on aServer, and commands in cmd2 on 721.9.0.5.\n\nnodes = aServer, 721.9.0.5\nkey_files = pp_id_ed25519\ncmd_files = cmd1, cmd2, cmd3, cmd4\n\njump_cmd = ssh\nusername = admin\npassphrase = common_pp*\nport = 2222\nprompts = $\nend\n```\n\n```\n# The below configuration will ssh to sales node using the private key in id_rsa and execute the commands in cmd1.txt.\n# Then ssh to dmz node using the private key in pp_id_rsa, along with its corresponding passphrase \"the_passphrase_of_pp_id_rsa\", and execute the commands in /home/billy/special/dmz/cmd2.\n# And finally, ssh to production node using the private key in id_ed25519, and execute the commands in cmd1.txt.\n\nnodes = sales, dmz, production\n\nkey_files = id_rsa, pp_id_rsa, id_ed25519\n\ncmd_files = cmd1.txt, /home/billy/special/dmz/cmd2, cmd1.txt, cmd.txt\n\njump_cmd = ssh\nusername = admin\npassphrase = the_passphrase_of_pp_id_rsa\nport = 2222\nprompts = $\nend\n```\n\n```\n# The below configuration will ssh to node 99.99.99.99, and from there ssh to node 88.88.88.88.\n# From node 88.88.88.88, it will ssh to nodes cube5, cube6, 3.3.3.3, cube1.\n# It will run the commands in linux2_commands.txt on cube5, cube6, 3.3.3.3 and cube1, and save \n# the output locally in text files named after each node with a date and timestamp.\n# It will backtrack and run the commands in linux_TEST_commands on node 88.88.88.88, and save the output in EMM.txt under tmp/ folder.\n# Once done, it will backtrack and run the commands in linux_cmds.txt on node 99.99.99.99, and save the output in cubevm.txt.\n\njump_cmd = ssh\nnode = 99.99.99.99\nusername = \nkey_file = /home/john/.ssh/id_to_login_to_99-99-99-99\ncmd_timeout = 10.0\n#delay = 0\nlog_file = cubevm.txt\ncmd_file = linux_cmds.txt\nend\n\njump_cmd = ssh\nnode = 88.88.88.88\nusername = ITteam\nkey_file = /home/john/.ssh/id_to_login_to_88-88-88-88\nlog_file = tmp/EMM.txt  # note: log file EMM.txt as well as the logs from the below nodes will be placed in the tmp/ folder, if it exists \ncmd_file = linux_TEST_commands\ncmd_timeout = 1\nend\n\nnodes = cube5, cube6, 3.3.3.3, cube1\n\nkey_files = /home/john/.ssh/id_to_login_to_cube5, /home/john/.ssh/id_to_login_to_cube6, /home/john/.ssh/id_to_login_to_3-3-3-3_and_cube1\n\ncmd_files = linux2_commands.txt\n\njump_cmd = ssh\nusername = admin\n#delay = 0\n#cmd_timeout = 1\nend\n```\n\n# Command File Special Notation:\n\nThe command file(s) would contain the typical commands that you would run, line by line, while logged in on the remote host(s).\nAs of **version 0.0.6**, a special notation \n\n**:<number of seconds>[sS]:** \n\ncan be used in your command files.\nThe purpose of this special notation is to wait for the output of the previous command that was issued, for which a prompt was returned but the expected output has yet to be received, as it is still being processed and will be returned in a few seconds or minutes.\n**Note that this special notation must appear on a seperate line, in order to keep it distinct from your regular commands. Any other command(s) that appear on the same line as this special notation will be ignored.**\n```\nExamples of valid notations:\n:2: (same as :2s: or :2S:) to wait for 2 seconds.\n:063: (same as :63: or :63s:) to wait for 63 seconds.\n\nExamples of non-valid notations:\n:: (same as :s: or :S:) will be ignored\n:5.9: will be ignored\n:1m5s: will be ignored, use :65: instead\n```\n\n# Limitations/Known Issues:\n\n- Pagination type commands like `more` or `less` will lock after the first output. It is best to avoid such commands.\nYou may try to run gp_cmd_runr with the -t or --timeout option. This will force the script to send the next command after the delay you specify, which may result in unexpected behavior on the remote node.\n\n- Given that my AMOS/MOSHELL environments do not require login credentials, the script does not provide the option of specifying such login credentials for AMOS/MOSHELL access.\n\n\n\n\nLet me know if you have any questions: <kaiyoux@gmail.com>\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/kaiyoux/p_cmd_runr",
    "keywords": "ssh,automation,automate,amos,moshell,remote,command,runner,run,execution,execute,paramiko,based,jumpbox,simple,easy,jump,hop",
    "license": "GNU General Public License v3 (GPLv3)",
    "maintainer": "Issa Lompo",
    "maintainer_email": "kaiyoux@gmail.com",
    "name": "p-cmd-runr",
    "package_url": "https://pypi.org/project/p-cmd-runr/",
    "platform": null,
    "project_url": "https://pypi.org/project/p-cmd-runr/",
    "project_urls": {
      "Bug Tracker": "https://github.com/kaiyoux/p_cmd_runr/issues",
      "Homepage": "https://github.com/kaiyoux/p_cmd_runr"
    },
    "release_url": "https://pypi.org/project/p-cmd-runr/0.1.2/",
    "requires_dist": [
      "paramiko (>=2.7.2)"
    ],
    "requires_python": ">=3.6",
    "summary": "A multi-purpose and flexible way to run commands on remote hosts.",
    "version": "0.1.2",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 15530232,
  "releases": {
    "0.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "514b414c6c37253c06969eac84be1dd096c602a1ed5b81af62e0247557fca45b",
          "md5": "76dc7e43edcc001c69a39dd52f1e03ea",
          "sha256": "bec93c341c28ff1e7ab33ae1a574c831919ee7ddf7f79d61f81d9fd7f8836173"
        },
        "downloads": -1,
        "filename": "p_cmd_runr-0.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "76dc7e43edcc001c69a39dd52f1e03ea",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 50271,
        "upload_time": "2022-05-09T03:57:07",
        "upload_time_iso_8601": "2022-05-09T03:57:07.482192Z",
        "url": "https://files.pythonhosted.org/packages/51/4b/414c6c37253c06969eac84be1dd096c602a1ed5b81af62e0247557fca45b/p_cmd_runr-0.0.1-py3-none-any.whl",
        "yanked": true,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "af1b7ecad23ac9f8ac729af1fa47e3fde153b3ed59ed4ca8acc5cec532989714",
          "md5": "8402852d61faa57ce65da587f8baf7c6",
          "sha256": "41cc5d41c8d842aaefb89e80ce68e7ff77fb2d62d5d65bf319a8cc483f1b0f33"
        },
        "downloads": -1,
        "filename": "p_cmd_runr-0.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "8402852d61faa57ce65da587f8baf7c6",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 48053,
        "upload_time": "2022-05-09T03:58:18",
        "upload_time_iso_8601": "2022-05-09T03:58:18.205455Z",
        "url": "https://files.pythonhosted.org/packages/af/1b/7ecad23ac9f8ac729af1fa47e3fde153b3ed59ed4ca8acc5cec532989714/p_cmd_runr-0.0.1.tar.gz",
        "yanked": true,
        "yanked_reason": null
      }
    ],
    "0.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6687dbb4ad767d7ab1ea3f87f2dc612c16b12854ad37a7a9bb2e62e2e043c418",
          "md5": "da3fc2abe41d382b151a456f00cd98d8",
          "sha256": "cf98d1b4472c274a323418f39389ae82eb45749877c83775d9dfb5e58e81c516"
        },
        "downloads": -1,
        "filename": "p_cmd_runr-0.0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "da3fc2abe41d382b151a456f00cd98d8",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 50257,
        "upload_time": "2022-05-11T16:37:38",
        "upload_time_iso_8601": "2022-05-11T16:37:38.691729Z",
        "url": "https://files.pythonhosted.org/packages/66/87/dbb4ad767d7ab1ea3f87f2dc612c16b12854ad37a7a9bb2e62e2e043c418/p_cmd_runr-0.0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2cd94781a6e98d26c2e8690e0ea35fb68bfa81f9d75aca82532409cfb0415554",
          "md5": "d3c961f2f9c10c9a26d910f765028f46",
          "sha256": "8c9923cdc1a7da330aec7b58af9c8dea93d23eea93b7ef9c468a0d37b2582b3f"
        },
        "downloads": -1,
        "filename": "p_cmd_runr-0.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "d3c961f2f9c10c9a26d910f765028f46",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 48026,
        "upload_time": "2022-05-11T16:37:40",
        "upload_time_iso_8601": "2022-05-11T16:37:40.315806Z",
        "url": "https://files.pythonhosted.org/packages/2c/d9/4781a6e98d26c2e8690e0ea35fb68bfa81f9d75aca82532409cfb0415554/p_cmd_runr-0.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d1449874923d642ebc4372bf2c1057e9c0e5bc33b69939a4a52830041de9f268",
          "md5": "87da10b1600fb8a4ae540f6c6be09a90",
          "sha256": "0e4ec0d96afb91f3058623ae362fdff6c0e530648de62851353d27af592567b9"
        },
        "downloads": -1,
        "filename": "p_cmd_runr-0.0.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "87da10b1600fb8a4ae540f6c6be09a90",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 50255,
        "upload_time": "2022-05-15T21:38:17",
        "upload_time_iso_8601": "2022-05-15T21:38:17.157857Z",
        "url": "https://files.pythonhosted.org/packages/d1/44/9874923d642ebc4372bf2c1057e9c0e5bc33b69939a4a52830041de9f268/p_cmd_runr-0.0.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8ea0a557d99a0f484230f61591d2420eeb87e5d59b48c574eea3dede1d9c2acc",
          "md5": "cdde009ae7e7ebc00117464d67451210",
          "sha256": "1aab57b3d88b5334273d555e9986047e8001766ea496e011ddcb80736a9e57db"
        },
        "downloads": -1,
        "filename": "p_cmd_runr-0.0.3.tar.gz",
        "has_sig": false,
        "md5_digest": "cdde009ae7e7ebc00117464d67451210",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 48037,
        "upload_time": "2022-05-15T21:38:18",
        "upload_time_iso_8601": "2022-05-15T21:38:18.914022Z",
        "url": "https://files.pythonhosted.org/packages/8e/a0/a557d99a0f484230f61591d2420eeb87e5d59b48c574eea3dede1d9c2acc/p_cmd_runr-0.0.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8c27e30c96b065c2bb22a829a7d9d37c14edb83fa38a7a60284ca1b4d0b25aac",
          "md5": "6c0fd9bb5ff123b0452d95affc5e825f",
          "sha256": "300f4a0b78062b629658078a91657e6996baa59db9631a75e96c1606acc96842"
        },
        "downloads": -1,
        "filename": "p_cmd_runr-0.0.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "6c0fd9bb5ff123b0452d95affc5e825f",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 50284,
        "upload_time": "2022-05-28T21:27:10",
        "upload_time_iso_8601": "2022-05-28T21:27:10.110676Z",
        "url": "https://files.pythonhosted.org/packages/8c/27/e30c96b065c2bb22a829a7d9d37c14edb83fa38a7a60284ca1b4d0b25aac/p_cmd_runr-0.0.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "73036a094112c00f05a24b25b61d739d5d3097ad727fc30cf46d9a75e31159e2",
          "md5": "288077bfe7bea605627b1d9b9114f4e5",
          "sha256": "542d7c3df66224e6a648355a2932b3fbdf6e87d715e1f68a50414023f39ec41c"
        },
        "downloads": -1,
        "filename": "p_cmd_runr-0.0.4.tar.gz",
        "has_sig": false,
        "md5_digest": "288077bfe7bea605627b1d9b9114f4e5",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 48053,
        "upload_time": "2022-05-28T21:27:14",
        "upload_time_iso_8601": "2022-05-28T21:27:14.934732Z",
        "url": "https://files.pythonhosted.org/packages/73/03/6a094112c00f05a24b25b61d739d5d3097ad727fc30cf46d9a75e31159e2/p_cmd_runr-0.0.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e3e4c2286a93aa60b889fe3d8c673378b4684e9b8b8fdd3cd4f42207308d2625",
          "md5": "4e4f45027f5b753ccfe0157e9bde0849",
          "sha256": "865d7be2d26eae5aa4ef3f9c4a55773eb95d9863feeba8e767f92855ccc3109b"
        },
        "downloads": -1,
        "filename": "p_cmd_runr-0.0.5-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "4e4f45027f5b753ccfe0157e9bde0849",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 50202,
        "upload_time": "2022-06-03T01:02:26",
        "upload_time_iso_8601": "2022-06-03T01:02:26.184040Z",
        "url": "https://files.pythonhosted.org/packages/e3/e4/c2286a93aa60b889fe3d8c673378b4684e9b8b8fdd3cd4f42207308d2625/p_cmd_runr-0.0.5-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6c82c93d532e3b4a92764c97ab2a89334e509e676694abc32f76b3f180ffcc5e",
          "md5": "a26183701941b1b916b630c0d72c9b94",
          "sha256": "e4361d1c7cae76575eb9051981536e7ee08197f1b027f47c274e87f841185214"
        },
        "downloads": -1,
        "filename": "p_cmd_runr-0.0.5.tar.gz",
        "has_sig": false,
        "md5_digest": "a26183701941b1b916b630c0d72c9b94",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 47954,
        "upload_time": "2022-06-03T01:02:29",
        "upload_time_iso_8601": "2022-06-03T01:02:29.771057Z",
        "url": "https://files.pythonhosted.org/packages/6c/82/c93d532e3b4a92764c97ab2a89334e509e676694abc32f76b3f180ffcc5e/p_cmd_runr-0.0.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "870b48e0571306cb5fbc7c24b45b7f6dddd31caceac495416bcbaa5c7b71b610",
          "md5": "29f03c884f8f093a0027a7b3f4cd267a",
          "sha256": "730d9ae14ca4c240e6b28c8d3365e9b8753a7e697cc92eb7d2d780d799cb5df5"
        },
        "downloads": -1,
        "filename": "p_cmd_runr-0.0.6-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "29f03c884f8f093a0027a7b3f4cd267a",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 51298,
        "upload_time": "2022-07-16T23:41:57",
        "upload_time_iso_8601": "2022-07-16T23:41:57.139654Z",
        "url": "https://files.pythonhosted.org/packages/87/0b/48e0571306cb5fbc7c24b45b7f6dddd31caceac495416bcbaa5c7b71b610/p_cmd_runr-0.0.6-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "fd408ae0f2df23cce1a4c82375f33035809f3fdad36ba215673199c8fdafbe29",
          "md5": "4b23b91571a145b3f6d834536cec1028",
          "sha256": "c64dc39c06ac36755a8b4e8c1c58d226fab6a031d42981eb553cb9c3703bac83"
        },
        "downloads": -1,
        "filename": "p_cmd_runr-0.0.6.tar.gz",
        "has_sig": false,
        "md5_digest": "4b23b91571a145b3f6d834536cec1028",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 49932,
        "upload_time": "2022-07-16T23:42:01",
        "upload_time_iso_8601": "2022-07-16T23:42:01.368390Z",
        "url": "https://files.pythonhosted.org/packages/fd/40/8ae0f2df23cce1a4c82375f33035809f3fdad36ba215673199c8fdafbe29/p_cmd_runr-0.0.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9c2819a4619a5440094ff825e0cd5087fc8a7a8aa87c36062ce310a05c7c8fff",
          "md5": "b2c0d0df8c9e2a4dc899ebc8e5cf3d9e",
          "sha256": "6d3ad869c1a07e3702f6814e35c4b10ae1b49fe42e7b539729f0864d32d70b6b"
        },
        "downloads": -1,
        "filename": "p_cmd_runr-0.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "b2c0d0df8c9e2a4dc899ebc8e5cf3d9e",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 55247,
        "upload_time": "2022-07-27T23:11:16",
        "upload_time_iso_8601": "2022-07-27T23:11:16.357550Z",
        "url": "https://files.pythonhosted.org/packages/9c/28/19a4619a5440094ff825e0cd5087fc8a7a8aa87c36062ce310a05c7c8fff/p_cmd_runr-0.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f8fa777b3f41aa144d01aaebe67b89a41f49c6bc24495f88ed1fdbae231cbf10",
          "md5": "b8ecedccd8b52557e2d09d5e39292020",
          "sha256": "5b04d13ced5e2ea73745eb1bd3e3788b3130a0f161c2cc4f87a14780f7d6c724"
        },
        "downloads": -1,
        "filename": "p_cmd_runr-0.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "b8ecedccd8b52557e2d09d5e39292020",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 55620,
        "upload_time": "2022-07-27T23:11:27",
        "upload_time_iso_8601": "2022-07-27T23:11:27.389235Z",
        "url": "https://files.pythonhosted.org/packages/f8/fa/777b3f41aa144d01aaebe67b89a41f49c6bc24495f88ed1fdbae231cbf10/p_cmd_runr-0.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "64bebbe43433eeb93eb5e61868d33a206239712d8c2f8642f7f492e0445ea602",
          "md5": "a2c1c99f9af90d7f97f84aa1dd99572a",
          "sha256": "9360332454e45fc003220c5e5f18129db9b71e3f3843cee42b080631185840e6"
        },
        "downloads": -1,
        "filename": "p_cmd_runr-0.1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "a2c1c99f9af90d7f97f84aa1dd99572a",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 55238,
        "upload_time": "2022-07-28T16:40:16",
        "upload_time_iso_8601": "2022-07-28T16:40:16.062613Z",
        "url": "https://files.pythonhosted.org/packages/64/be/bbe43433eeb93eb5e61868d33a206239712d8c2f8642f7f492e0445ea602/p_cmd_runr-0.1.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "300b9dcaa16b924a6f006ac3e039d1bca17d95696ea128c99d60e00ab5bc30da",
          "md5": "4324efd44488e89a29007c33dff7f970",
          "sha256": "b1e8c0d6322dd2ed710c78b7a7b65551f6cfcd87d4d5c0517a09337222062b07"
        },
        "downloads": -1,
        "filename": "p_cmd_runr-0.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "4324efd44488e89a29007c33dff7f970",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 55623,
        "upload_time": "2022-07-28T16:40:21",
        "upload_time_iso_8601": "2022-07-28T16:40:21.740878Z",
        "url": "https://files.pythonhosted.org/packages/30/0b/9dcaa16b924a6f006ac3e039d1bca17d95696ea128c99d60e00ab5bc30da/p_cmd_runr-0.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ed92da4e7e7a5f6a22a5e9b9824a473067a7e8fadcec99681e60a201f91797fd",
          "md5": "0ee86dfbe50bd349d3cd5c20256f5051",
          "sha256": "c4de93be5c83357cd867012d97551a2c0c8d3294ba9f6b1ca4f5f96a542cdab4"
        },
        "downloads": -1,
        "filename": "p_cmd_runr-0.1.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "0ee86dfbe50bd349d3cd5c20256f5051",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 55242,
        "upload_time": "2022-10-26T00:46:30",
        "upload_time_iso_8601": "2022-10-26T00:46:30.268704Z",
        "url": "https://files.pythonhosted.org/packages/ed/92/da4e7e7a5f6a22a5e9b9824a473067a7e8fadcec99681e60a201f91797fd/p_cmd_runr-0.1.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "dc165bb3e25f461315a2cd7cf7b24bd5abbdbfb84fc2341de6ea427df6b82779",
          "md5": "0ba981ebf31cdfb7051152031544c8fb",
          "sha256": "bd8bfc5de1d87ffe6f3a22e5287b9b147e6cecfef57c7b688bb428682b4a4b07"
        },
        "downloads": -1,
        "filename": "p_cmd_runr-0.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "0ba981ebf31cdfb7051152031544c8fb",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 55646,
        "upload_time": "2022-10-26T00:46:35",
        "upload_time_iso_8601": "2022-10-26T00:46:35.519460Z",
        "url": "https://files.pythonhosted.org/packages/dc/16/5bb3e25f461315a2cd7cf7b24bd5abbdbfb84fc2341de6ea427df6b82779/p_cmd_runr-0.1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "ed92da4e7e7a5f6a22a5e9b9824a473067a7e8fadcec99681e60a201f91797fd",
        "md5": "0ee86dfbe50bd349d3cd5c20256f5051",
        "sha256": "c4de93be5c83357cd867012d97551a2c0c8d3294ba9f6b1ca4f5f96a542cdab4"
      },
      "downloads": -1,
      "filename": "p_cmd_runr-0.1.2-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "0ee86dfbe50bd349d3cd5c20256f5051",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6",
      "size": 55242,
      "upload_time": "2022-10-26T00:46:30",
      "upload_time_iso_8601": "2022-10-26T00:46:30.268704Z",
      "url": "https://files.pythonhosted.org/packages/ed/92/da4e7e7a5f6a22a5e9b9824a473067a7e8fadcec99681e60a201f91797fd/p_cmd_runr-0.1.2-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "dc165bb3e25f461315a2cd7cf7b24bd5abbdbfb84fc2341de6ea427df6b82779",
        "md5": "0ba981ebf31cdfb7051152031544c8fb",
        "sha256": "bd8bfc5de1d87ffe6f3a22e5287b9b147e6cecfef57c7b688bb428682b4a4b07"
      },
      "downloads": -1,
      "filename": "p_cmd_runr-0.1.2.tar.gz",
      "has_sig": false,
      "md5_digest": "0ba981ebf31cdfb7051152031544c8fb",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 55646,
      "upload_time": "2022-10-26T00:46:35",
      "upload_time_iso_8601": "2022-10-26T00:46:35.519460Z",
      "url": "https://files.pythonhosted.org/packages/dc/16/5bb3e25f461315a2cd7cf7b24bd5abbdbfb84fc2341de6ea427df6b82779/p_cmd_runr-0.1.2.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}