{
  "info": {
    "author": "",
    "author_email": "Moshe Kaplan <me@moshekaplan.com>",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 3 - Alpha",
      "License :: CC0 1.0 Universal (CC0 1.0) Public Domain Dedication",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3",
      "Topic :: System :: Networking :: Firewalls"
    ],
    "description": "# Palo Alto Firewall Analyzer\n\n![Build](https://github.com/moshekaplan/palo_alto_firewall_analyzer/actions/workflows/test.yml/badge.svg)\n\nPython3 scripts for reviewing and fixing Palo Alto Firewall configurations\n\nThis repository contains the script `pan_analyzer`, which can detects and fix Palo Alto Network firewall configuration issues, as well as several other helper scripts.\n\nThe validators are designed to have as few false positives as possible. If there is a false positive, please [report an issue](https://github.com/moshekaplan/palo_alto_firewall_analyzer/issues/new)!\n\n## pan_analyzer Quickstart\n\n1. Install the package with `pip install pan_analyzer`\n2. Run all validators on an XML configuration file downloaded with Panorama -> Setup -> Operations -> \"Export Panorama configuration version\":\n`pan_analyzer --xml 12345.xml`\n\n## Using pan_analyzer\n\nThe first time you launch pan_analyzer, it will create a `PAN_CONFIG.cfg` file\nin `\"~\\.pan_policy_analyzer\\` and instruct you to edit it.\nThe second time you launch the analyzer it will detect that \"API_KEY.txt\" is not present,\nand will prompt you for credentials and save the retrieved API key to \"API_KEY.txt\"\n\n* Run all validators on all device groups:\n`pan_analyzer`\n\n* Run a single validator on all device groups:\n`pan_analyzer --validator UnusedServices`\n\n* Run a single validator on a single device group:\n`pan_analyzer --device-group my_device_group --validator UnusedServices`\n\n* Run all validators on an XML configuration file downloaded with \"Export Panorama configuration version\":\n`pan_analyzer --xml 12345.xml`\n\n\nIf you're not sure where to start, I recommend downloading an XML file from:\n`Panorama -> Setup -> Operations -> Export Panorama configuration version` and running: `pan_analyzer.py --xml 12345.xml`\n\n## Common Workflows\nThere are a few common workflows to clean the firewall configuration:\n\n### Consolidate Service Objects\nConsolidate Service objects so there is only one object for each Service:\n* Delete unused Service objects: `python pan_analyzer --fixer DeleteUnusedServices`\n* Check if any Service objects have misleading names: `python pan_analyzer --validator MisleadingServices`\n* Consolidate service objects in use: `python pan_analyzer --fixer ConsolidateServices`\n* Delete the now-unused Service objects: `python pan_analyzer --fixer DeleteUnusedServices`\n* Define a convention in the config file, then rename to fit the naming convention: `python pan_analyzer --fixer RenameUnconventionallyNamedServices`\n\n### Consolidate Address Objects\nConsolidate Address objects so there is only one object for each target:\n* Delete unused Address objects: `python pan_analyzer --fixer DeleteUnusedAddresses`\n* Delete Address objects with FQDNs that don't resolve: `python pan_analyzer --validator BadHostname`\n* Check if any Address objects have IPs in FQDNs: `python pan_analyzer --validator FQDNContainsIP`\n* Check if any Address objects have misleading names: `python pan_analyzer --validator MisleadingAddresses`\n* Replace Address objects using IPs with FQDNs: `python pan_analyzer --fixer FixIPWithResolvingFQDN`\n* Consolidate Address objects in use: `python pan_analyzer --fixer ConsolidateAddresses`\n* Delete the now-unused Address objects: `python pan_analyzer --fixer DeleteUnusedAddresses`\n* Make all FQDN objects use FQDNs: `python pan_analyzer --fixer FixUnqualifiedFQDN`\n* Define a convention in the config file, then rename objects to fit a naming convention: `python pan_analyzer --fixer RenameUnconventionallyNamedAddresses`\n\n\n## Known Issues\n\nThe validators for checking zones (ExtaZones, MissingZones, and ExtraRules) all\nrequire looking up the zones for address objects on the firewall. This requires many API\nrequests and can take a very long time. Given that PA recommends limiting the number of\nconcurrent API calls to five, and that's shared among the web UI, these calls are not\nparallelized. Because of these concerns, the default configuration skips those validators.\n\n## Other scripts\nIn addition to **pan_analyzer**, several other scripts are included in this package:\n* **pan_categorization_lookup** - Looks up categorization for either a single URL or a file with a list of URLs\n* **pan_disable_rules** - Takes a textfile with a list of security rules and disables them (useful for disabling rules found with PolicyOptimizer)\n* **pan_dump_active_sessions** - Dumps all active sessions from all firewalls\n* **pan_run_command** - Runs a single command on a single firewall\n* **pan_zone_lookup** - Looks up Zone for a single IP on all firewalls\n\n## License ##\n\nThis project is in the worldwide [public domain](LICENSE).\n\nThis project is in the public domain within the United States, and\ncopyright and related rights in the work worldwide are waived through\nthe [CC0 1.0 Universal public domain\ndedication](https://creativecommons.org/publicdomain/zero/1.0/).\n\nAll contributions to this project will be released under the CC0\ndedication. By submitting a pull request, you are agreeing to comply\nwith this waiver of copyright interest.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "",
    "license": "CC0 1.0 Universal  Statement of Purpose  The laws of most jurisdictions throughout the world automatically confer exclusive Copyright and Related Rights (defined below) upon the creator and subsequent owner(s) (each and all, an \"owner\") of an original work of authorship and/or a database (each, a \"Work\").  Certain owners wish to permanently relinquish those rights to a Work for the purpose of contributing to a commons of creative, cultural and scientific works (\"Commons\") that the public can reliably and without fear of later claims of infringement build upon, modify, incorporate in other works, reuse and redistribute as freely as possible in any form whatsoever and for any purposes, including without limitation commercial purposes. These owners may contribute to the Commons to promote the ideal of a free culture and the further production of creative, cultural and scientific works, or to gain reputation or greater distribution for their Work in part through the use and efforts of others.  For these and/or other purposes and motivations, and without any expectation of additional consideration or compensation, the person associating CC0 with a Work (the \"Affirmer\"), to the extent that he or she is an owner of Copyright and Related Rights in the Work, voluntarily elects to apply CC0 to the Work and publicly distribute the Work under its terms, with knowledge of his or her Copyright and Related Rights in the Work and the meaning and intended legal effect of CC0 on those rights.  1. Copyright and Related Rights. A Work made available under CC0 may be protected by copyright and related or neighboring rights (\"Copyright and Related Rights\"). Copyright and Related Rights include, but are not limited to, the following:  i. the right to reproduce, adapt, distribute, perform, display, communicate, and translate a Work;  ii. moral rights retained by the original author(s) and/or performer(s);  iii. publicity and privacy rights pertaining to a person's image or likeness depicted in a Work;  iv. rights protecting against unfair competition in regards to a Work, subject to the limitations in paragraph 4(a), below;  v. rights protecting the extraction, dissemination, use and reuse of data in a Work;  vi. database rights (such as those arising under Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, and under any national implementation thereof, including any amended or successor version of such directive); and  vii. other similar, equivalent or corresponding rights throughout the world based on applicable law or treaty, and any national implementations thereof.  2. Waiver. To the greatest extent permitted by, but not in contravention of, applicable law, Affirmer hereby overtly, fully, permanently, irrevocably and unconditionally waives, abandons, and surrenders all of Affirmer's Copyright and Related Rights and associated claims and causes of action, whether now known or unknown (including existing as well as future claims and causes of action), in the Work (i) in all territories worldwide, (ii) for the maximum duration provided by applicable law or treaty (including future time extensions), (iii) in any current or future medium and for any number of copies, and (iv) for any purpose whatsoever, including without limitation commercial, advertising or promotional purposes (the \"Waiver\"). Affirmer makes the Waiver for the benefit of each member of the public at large and to the detriment of Affirmer's heirs and successors, fully intending that such Waiver shall not be subject to revocation, rescission, cancellation, termination, or any other legal or equitable action to disrupt the quiet enjoyment of the Work by the public as contemplated by Affirmer's express Statement of Purpose.  3. Public License Fallback. Should any part of the Waiver for any reason be judged legally invalid or ineffective under applicable law, then the Waiver shall be preserved to the maximum extent permitted taking into account Affirmer's express Statement of Purpose. In addition, to the extent the Waiver is so judged Affirmer hereby grants to each affected person a royalty-free, non transferable, non sublicensable, non exclusive, irrevocable and unconditional license to exercise Affirmer's Copyright and Related Rights in the Work (i) in all territories worldwide, (ii) for the maximum duration provided by applicable law or treaty (including future time extensions), (iii) in any current or future medium and for any number of copies, and (iv) for any purpose whatsoever, including without limitation commercial, advertising or promotional purposes (the \"License\"). The License shall be deemed effective as of the date CC0 was applied by Affirmer to the Work. Should any part of the License for any reason be judged legally invalid or ineffective under applicable law, such partial invalidity or ineffectiveness shall not invalidate the remainder of the License, and in such case Affirmer hereby affirms that he or she will not (i) exercise any of his or her remaining Copyright and Related Rights in the Work or (ii) assert any associated claims and causes of action with respect to the Work, in either case contrary to Affirmer's express Statement of Purpose.  4. Limitations and Disclaimers.  a. No trademark or patent rights held by Affirmer are waived, abandoned, surrendered, licensed or otherwise affected by this document.  b. Affirmer offers the Work as-is and makes no representations or warranties of any kind concerning the Work, express, implied, statutory or otherwise, including without limitation warranties of title, merchantability, fitness for a particular purpose, non infringement, or the absence of latent or other defects, accuracy, or the present or absence of errors, whether or not discoverable, all to the greatest extent permissible under applicable law.  c. Affirmer disclaims responsibility for clearing rights of other persons that may apply to the Work or any use thereof, including without limitation any person's Copyright and Related Rights in the Work. Further, Affirmer disclaims responsibility for obtaining any necessary consents, permissions or other rights required for any use of the Work.  d. Affirmer understands and acknowledges that Creative Commons is not a party to this document and has no duty or obligation with respect to this CC0 or use of the Work.  For more information, please see <http://creativecommons.org/publicdomain/zero/1.0/> ",
    "maintainer": "",
    "maintainer_email": "",
    "name": "pan-analyzer",
    "package_url": "https://pypi.org/project/pan-analyzer/",
    "platform": null,
    "project_url": "https://pypi.org/project/pan-analyzer/",
    "project_urls": {
      "Bug Tracker": "https://github.com/moshekaplan/palo_alto_firewall_analyzer/issues",
      "Homepage": "https://github.com/moshekaplan/palo_alto_firewall_analyzer"
    },
    "release_url": "https://pypi.org/project/pan-analyzer/0.0.3.2/",
    "requires_dist": [
      "requests",
      "xmltodict",
      "pytest ; extra == 'test'"
    ],
    "requires_python": ">=3.7",
    "summary": "Detect and remediate configuration issues in Palo Alto Networks firewalls",
    "version": "0.0.3.2",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17403921,
  "releases": {
    "0.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ac0ae497dc2d4559297a720ef4969a6cb803164071677b5dcfb100a2866fa0f1",
          "md5": "a5c2cb468355df7c3f474c0951f3f76b",
          "sha256": "d84775a2908a957ed0bbb551208272899b9dea547aae4aff9f41fb308f4eea99"
        },
        "downloads": -1,
        "filename": "pan_analyzer-0.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "a5c2cb468355df7c3f474c0951f3f76b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 77648,
        "upload_time": "2023-03-16T03:11:41",
        "upload_time_iso_8601": "2023-03-16T03:11:41.020107Z",
        "url": "https://files.pythonhosted.org/packages/ac/0a/e497dc2d4559297a720ef4969a6cb803164071677b5dcfb100a2866fa0f1/pan_analyzer-0.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a5286fdcff6cb40a620b6ae7f1b9e79f5fc5780131ba93303d72369ba1cf77b4",
          "md5": "eeb34ec2de2072538f751bd6a8b4d48e",
          "sha256": "85ba4120829ddc3c15dc7fd24af15d4716378c82b3be3fe168b48c97866fc0a0"
        },
        "downloads": -1,
        "filename": "pan_analyzer-0.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "eeb34ec2de2072538f751bd6a8b4d48e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 58040,
        "upload_time": "2023-03-16T03:11:42",
        "upload_time_iso_8601": "2023-03-16T03:11:42.269481Z",
        "url": "https://files.pythonhosted.org/packages/a5/28/6fdcff6cb40a620b6ae7f1b9e79f5fc5780131ba93303d72369ba1cf77b4/pan_analyzer-0.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.3.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "117487f963ab130ee1312b4a0a35be3044a820a48ef2fb212bc5ead208f0a04a",
          "md5": "f414873aa86ad91d000843d4a78c7b97",
          "sha256": "489c326e9ab0f5c1778b70ac33137c12e40eb1c5b05cfdb403ae94c775b5f8c9"
        },
        "downloads": -1,
        "filename": "pan_analyzer-0.0.3.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "f414873aa86ad91d000843d4a78c7b97",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 76891,
        "upload_time": "2023-03-22T20:29:48",
        "upload_time_iso_8601": "2023-03-22T20:29:48.391665Z",
        "url": "https://files.pythonhosted.org/packages/11/74/87f963ab130ee1312b4a0a35be3044a820a48ef2fb212bc5ead208f0a04a/pan_analyzer-0.0.3.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ea352bcbd0c2a2de054e8c22955704586842fdb74f58e014290813c6df222b83",
          "md5": "6ed8a61a2789d0e454ed36bbe6df9abd",
          "sha256": "8b27d13851e204a10ede6ff6f49836c1ad141b7e4ee7bd775e2019b7ddf57890"
        },
        "downloads": -1,
        "filename": "pan_analyzer-0.0.3.2.tar.gz",
        "has_sig": false,
        "md5_digest": "6ed8a61a2789d0e454ed36bbe6df9abd",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 58176,
        "upload_time": "2023-03-22T20:29:50",
        "upload_time_iso_8601": "2023-03-22T20:29:50.096972Z",
        "url": "https://files.pythonhosted.org/packages/ea/35/2bcbd0c2a2de054e8c22955704586842fdb74f58e014290813c6df222b83/pan_analyzer-0.0.3.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "117487f963ab130ee1312b4a0a35be3044a820a48ef2fb212bc5ead208f0a04a",
        "md5": "f414873aa86ad91d000843d4a78c7b97",
        "sha256": "489c326e9ab0f5c1778b70ac33137c12e40eb1c5b05cfdb403ae94c775b5f8c9"
      },
      "downloads": -1,
      "filename": "pan_analyzer-0.0.3.2-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "f414873aa86ad91d000843d4a78c7b97",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.7",
      "size": 76891,
      "upload_time": "2023-03-22T20:29:48",
      "upload_time_iso_8601": "2023-03-22T20:29:48.391665Z",
      "url": "https://files.pythonhosted.org/packages/11/74/87f963ab130ee1312b4a0a35be3044a820a48ef2fb212bc5ead208f0a04a/pan_analyzer-0.0.3.2-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "ea352bcbd0c2a2de054e8c22955704586842fdb74f58e014290813c6df222b83",
        "md5": "6ed8a61a2789d0e454ed36bbe6df9abd",
        "sha256": "8b27d13851e204a10ede6ff6f49836c1ad141b7e4ee7bd775e2019b7ddf57890"
      },
      "downloads": -1,
      "filename": "pan_analyzer-0.0.3.2.tar.gz",
      "has_sig": false,
      "md5_digest": "6ed8a61a2789d0e454ed36bbe6df9abd",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7",
      "size": 58176,
      "upload_time": "2023-03-22T20:29:50",
      "upload_time_iso_8601": "2023-03-22T20:29:50.096972Z",
      "url": "https://files.pythonhosted.org/packages/ea/35/2bcbd0c2a2de054e8c22955704586842fdb74f58e014290813c6df222b83/pan_analyzer-0.0.3.2.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}