{
  "info": {
    "author": "Stephen Karl Larroque",
    "author_email": "lrq3000@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "Environment :: Console",
      "Intended Audience :: Science/Research",
      "License :: OSI Approved :: MIT License",
      "Operating System :: MacOS :: MacOS X",
      "Operating System :: Microsoft :: Windows",
      "Operating System :: POSIX :: Linux",
      "Programming Language :: Python :: 2.7",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.3",
      "Programming Language :: Python :: 3.4",
      "Programming Language :: Python :: 3.5",
      "Programming Language :: Python :: 3.6",
      "Programming Language :: Python :: 3.7",
      "Programming Language :: Python :: 3.8",
      "Topic :: Utilities"
    ],
    "description": "# Pathmatcher: Manipulate file paths trees like simple text using powerful regular expressions!\n\n[![PyPI-Status](https://img.shields.io/pypi/v/pathmatcher.svg)](https://pypi.org/project/pathmatcher)\n[![PyPI-Versions](https://img.shields.io/pypi/pyversions/pathmatcher.svg?logo=python&logoColor=white)](https://pypi.org/project/pathmatcher)\n[![PyPI-Downloads](https://img.shields.io/pypi/dm/pathmatcher.svg?logo=python&logoColor=white)](https://pypi.org/project/pathmatcher)\n\nPatchmatcher is a files and folders hierarchy management tool in python, with a regular expression matcher on _paths_ (instead of just filenames). Can display a simulation report and automatically detect conflicts (already existing files, collisions of multiple files copied to the same output filename because of regexp, etc.). Can also be used as a Python module that returns the list of matched files and the transformations.\n\nIf you often run experiments, you use scripts and applications, with some that you didn't design yourself. It might then happen that these apps/scripts expect a specific directory layout to work. Usually, you reorganize your files manually. Not only is this time consuming, this is also very error prone (eg, copying the wrong files to the wrong id).\n\nIf you happen to know this situation, this tool might help you: just specify a regular expression matching the files you need, enter an output regular expression (that can reuse parts of the input files, for example your subjects ids, using regexp groups and recall), and then launch the program.\n\nThis module works for any file management purpose, but it is particularly optimized via the reorientation_registration_helper.py submodule to work for neuroimaging, such as reorganizing very fast any dataset into a BIDS compliant format.\n\nThis application can also be used as a Python module, so that you can include it in a pipeline to (semi-)automate repetitive stuff, like selecting the appropriate files to open in your favorite tool like SPM. For an exemple, see the script `reorient_pipeline` at the root of this repository.\n\nAs a Python module, it can not only match inputpaths, but also group them dynamically in a tree-like structure (a recursive dict) depending on the named regexp groups. This is a very useful and powerful too to quickly match multi-modal data and group them together (eg, structural and functional images) together, per subject and per study, in a single command. See `reorient_registration_helper.py` for an example use.\n\nRuns on Python 3 (Python 3.7 and 3.8 tested), and a previous version worked for Python 2.7.15 although compatibility isn't guaranteed anymore since Python 2 support is now deprecated.\n\nIf you are not experienced with [regular expressions](http://regexone.com/), you can use online tools such as [Pythex](http://pythex.org/) to instantly test your regexp.\n\n## Install\n\nSimply use pypi:\n\n```\npip install --upgrade pathmatcher\n```\n\nOr on Windows you can use the prebuilt binaries in the [GitHub Releases](https://github.com/lrq3000/pathmatcher/releases).\n\n## Quickstart\n\nLet's say you have a directory named \"root\", with subdirectories, and inside each subdirectory you have some files. Now, you want to reorganize so that all files are in one single folder, but you want to keep the original subfolder name but prepend it in the filename.\n\nYou can match them like this:\n\n```\npathmatcher -i \"root\" -ri \"(\\dir)/(.*)\" --test\n```\n\nThe arguments are as follows:\n* `-i` is the input root directory from where the recursive file search will start.\n* `-ri` is the input paths regular expression, to match the files you want. The matching is partial by default, so you can just type part of the filepath you want to match, not the whole (if you want the regex to match the whole path, use a regex starting with `^` and ending with `$` such as `\"^my/whole/path.ext$\"`). `(.*)` will match anything, and `\\dir` is a special argument that will match any directory (or file) until the next subdirectory level, which kind of allows a virtual walk through a tree. All paths are specified with `/`, never with `\\`, whatever the platform (including on Windows OSes).\n* `--test` will test whether at least one file can be matched. This is great to quickly test whether a regular expression is adequately matching the thing you want, without having to walk through all files.\n\nHere is the output we get:\n\n```\n== Regex Path Matcher started ==\n\nParameters:\n- Input root: root\n- Input regex: ([^\\\\/]*?)/(.*)\n- Output root: None\n- Output regex: None\n- Full arguments: X:\\Path\\To\\pathmatcher -i root -ri (\\dir)/(.*) --test\n\n\nComputing paths matching and simulation report, please wait (total time depends on files count - filesize has no influence). Press CTRL+C to abort\n\nMatch: folderA/file1.txt\n\n0files [00:00, ?files/s]\nEnd of simulation. 1 files matched.\n```\n\nSince we have matched one file, this shows the regexp works, we're good to go.\n\nNote: In the case it didn't work (no file matched), and there are lots of files, you can prematurely stop the file search by pressing CTRL+C.\n\nNext, type this:\n\n```\npathmatcher -i \"root\" -ri \"(\\dir)/(.*)\" -o \"out\" -ro \"\\1_\\2\" --copy\n```\n\nThis reuses the previous command's input arguments (except `--test`) and adds the 3 following arguments:\n* `--copy` will copy the matched files to an output folder, potentially with a modified filename if specified in `-ro`. Alternative commands are: `--move`, `--move_fast`, `--delete`, `--symlink`.\n* `-o` is the output directory.\n* `-ro` is the output paths regular expression. This allows to dynamically change the output filenames by reusing regexp groups from the matched input paths. Here, we reuse the subdirectory name captured in `\\1` and reuse it to prepend before the original input path `\\2`.\n\nBefore applying any file modification operation, pathmatcher will provide a complete simulation report of what it plans to do, including whether there will be overwriting conflicts (eg, 2 different files will get the same filename).\n\nHere is the simulation report for our command above:\n\n```\n== REGEX PATH MATCHER SIMULATION REPORT ==\nTotal number of files matched: 6\nParameters:\n- Input root: b'root'\n- Input regex: ([^\\\\/]*?)/(.*)\n- Output root: b'out'\n- Output regex: \\1_\\2\n- Full arguments: X:\\Path\\To\\pathmatcher -i root -ri (\\dir)/(.*) -o out -ro \\1_\\2 --copy\n\nList of matched files:\n* folderA/file1.txt --> folderA_file1.txt  \n* folderA/file2.txt --> folderA_file2.txt  \n* folderA/file3.txt --> folderA_file3.txt  \n* folderB/file4.txt --> folderB_file4.txt  \n* folderB/file5.txt --> folderB_file5.txt  \n* folderB/file6.txt --> folderB_file6.txt  \n```\n\nBy default, the simulation report is saved as `pathmatcher_report.txt` in the current terminal folder (as shown by `pwd`) and is opened in the default text editor. This behavior can be modified using `--noreport``, which will print the simulation report directly in the terminal.\n\nNow, we manually review the simulation report, and we can see that everything is going as planned.\n\nLet's go back to the terminal:\n\n```\n== Regex Path Matcher started ==\n\nParameters:\n- Input root: root\n- Input regex: ([^\\\\/]*?)/(.*)\n- Output root: out\n- Output regex: \\1_\\2\n- Full arguments: X:\\Path\\To\\pathmatcher -i root -ri (\\dir)/(.*) -o out -ro \\1_\\2 --copy\n\n\nComputing paths matching and simulation report, please wait (total time depends on files count - filesize has no influence). Press CTRL+C to abort\n\n12files [00:00, ?files/s]\nEnd of simulation. 6 files matched.\nPreparing simulation report, please wait a few seconds...\nOpening simulation report with your default editor, a new window should open.\n\n\nNo conflict detected. You are good to go!\nDo you want to apply the result of the path reorganization simulation on 6 files? [Y/N]:\n```\n\nThe terminal confirms that there are no conflicts (which would have appeared in the simulation report too), and asks us whether we want to proceed.\n\nIf we type `Y` and tap Enter, the files will be copied and renamed according to the simulation report above. If we type `N` or simply CTRL+C, the application stops.\n\nThis concludes this quickstart. There is a lot more that you can do with this tool, such as matching a precise number range (let's say you have images numbered 1 to 100 and you want to delete the first 3, you can use `-ra 4:1-3 --delete` where `4` is the position of the input regexp matching group that matches the number in your input paths). By default, only paths leading to a file are considered as a leaf and hence walked, with directories being considered as nodes (this is to avoid processing multiple times the same directory leading to various paths - with files we are sure it's a leaf, there is a unique path in the tree leading to it in theory), but you can specify `--dir` to consider any directory as a leaf (in which case the walk order is as follows: first the files, then the deepest subdirectories, then progressively upwards to the root, and in alphabetical order).\n\nThere is also the very powerful `--tree` option, also available as an argument in the Python module, which allows to group together in a tree-like structure the matched input files, which is a very powerful way to match multi-modal data and cluster them together in usually a single command.\n\nPro tip: if you can't get a file reorganization task done in a single command, try to break down your task into several smaller steps, such as for example first renaming, then moving, then renaming again, then moving again, then deleting the unnecessary files, etc. Usually, a seemingly impossible file reorganization task is easily done with a few smaller `pathmatcher` calls.\n\n## Usage\n\n```\nusage: pathmatcher [-h] -i /some/path -ri \"sub[^/]+/\\d+\" [-o /new/path] [-ro \"newsub/\\1\"] [-c] [-s] [-m]\n                           [--move_fast] [-d] [-t] [--dir] [-y] [-f] [--show_fullpath] [-ra 1:10-255]\n                           [-re \"newsub/\\1\"] [--report pathmatcher_report.txt] [--noreport] [--tree]\n                           [-l /some/folder/filename.log] [-v] [--silent]\n\nRegex PathMatcher v1.7.4\nDescription: Match paths using regular expression, and then generate a report. Can also substitute using regex to generate output paths. A copy mode is also provided to allow the copy of files from input to output paths.\nThis app is essentially a path matcher using regexp, and it then rewrites the path using regexp, so that you can reuse elements from input path to build the output path.\nThis is very useful to reorganize folders for experiments, where scripts/softwares expect a specific directories layout in order to work.\n\nAdvices\n-------\n- Filepath comparison: Paths are compared against filepaths, not just folders (but of course you can match folders with regex, but remember when designing your regexp that it will compared against files paths, not directories).\n- Relative filepath: Paths are relative to the rootpath (except if --show-fullpath) and that they are always unix style, even on Windows (for consistency on all platforms and to easily reuse regexp).\n- Partial matching: partial matching regex is accepted, so you don't need to model the full filepath, only the part you need (eg, 'myfile' will match '/myfolder/sub/myfile-034.mat').\n- Unix filepaths: on all platforms, including Windows, paths will be in unix format (except if you set --show_fullpath). It makes things simpler for you to make crossplatform regex patterns.\n- Use [^/]+ to match any file/folder in the filepath: because paths are always unix-like, you can use [^/]+ to match any part of the filepath. Eg, \"([^/]+)/([^/]+)/data/mprage/.+\\.(img|hdr|txt)\" will match \"UWS/John_Doe/data/mprage/12345_t1_mprage_98782.hdr\".\n- Split your big task in several smaller, simpler subtasks: instead of trying to do a regex that match T1, T2, DTI, everything at the same time, try to focus on only one modality at a time and execute them using multiple regex queries: eg, move first structural images, then functional images, then dti, etc. instead of all at once.\n- Python module: this library can be used as a Python module to include in your scripts (just call `main(return_report=True)`).\n\nNote: use --gui (without any other argument) to launch the experimental gui (needs Gooey library).\n\nIn addition to the switches provided below, using this program as a Python module also provides 2 additional options:\n - return_report = True to return as a variable the files matched and the report instead of saving in a file.\n - regroup = True will return the matched files (if return_report=True) in a tree structure of nested list/dicts depending on if the groups are named or not. Groups can also avoid being matched by using non-matching groups in regex.\n\n\noptional arguments:\n  -h, --help            show this help message and exit\n  -i /some/path, --input /some/path\n                        Path to the input folder\n  -ri \"sub[^/]+/(\\d+)\", --regex_input \"sub[^/]+/(\\d+)\"\n                        Regex to match input paths. Must be defined relatively from --input folder. Do not forget to enclose it in double quotes (and not single)! To match any directory, use [^/\\]*? or the alias \\dir, or \\dirnodot if you want to match folders in combination with --dir switch.\n  -o /new/path, --output /new/path\n                        Path to the output folder (where file will get copied over if --copy)\n  -ro \"newsub/\\1\", --regex_output \"newsub/\\1\"\n                        Regex to substitute input paths to convert to output paths. Must be defined relatively from --output folder. If not provided but --output is specified, will keep the same directory layout as input (useful to extract specific files without changing layout). Do not forget to enclose it in double quotes!\n  -c, --copy            Copy the matched input paths to the regex-substituted output paths.\n  -s, --symlink         Copy with a symbolic/soft link the matched input paths to the regex-substituted output paths (works only on Linux).\n  -m, --move            Move the matched input paths to the regex-substituted output paths.\n  --move_fast           Move the matched input paths to the regex-substituted output paths, without checking first that the copy was done correctly.\n  -d, --delete          Delete the matched files.\n  -t, --test            Regex test mode: Stop after the first matched file and show the result of substitution. Useful to quickly check if the regex patterns are ok.\n  --dir                 Match directories too? (else only files are matched)\n  -y, --yes             Automatically accept the simulation and apply changes (good for batch processing and command chaining).\n  -f, --force           Force overwriting the target path already exists. Note that by default, if a file already exist, without this option, it won't get overwritten and no message will be displayed.\n  --show_fullpath       Show full paths instead of relative paths in the simulation.\n  -ra 1:10-255, --range 1:10-255\n                        Range mode: match only the files with filenames containing numbers in the specified range. The format is: (regex-match-group-id):(range-start)-(range-end). regex-match-group-id is the id of the regular expression that will contain the numbers that must be compared to the range. range-end is inclusive.\n  -re \"newsub/\\1\", --regex_exists \"newsub/\\1\"\n                        Regex of output path to check if the matched regex here is matched prior writing output files.\n  --report pathmatcher_report.txt\n                        Where to store the simulation report (default: pwd = current working dir).\n  --noreport            Do not create a report file, print the report in the console.\n  --tree                Regroup in a tree structure the matched files according to named and unnamed regex groups, and save the result as a json file (pathmatcher_tree.json).\n  -l /some/folder/filename.log, --log /some/folder/filename.log\n                        Path to the log file. (Output will be piped to both the stdout and the log file)\n  -v, --verbose         Verbose mode (show more output).\n  --silent              No console output (but if --log specified, the log will still be saved in the specified file).\n\n```\n\n## Libraries\n\n### Required\n\n* core Python libraries...\n* argparse\n* pathlib2 (provided with the script)\n* Tee (provided with the script)\n\n### Optional\n\n* **[tqdm](https://github.com/tqdm/tqdm/)** (for progress bar, **highly recommended**)\n* scandir (for faster file walking and simulation report)\n* Gooey (for gui)\n\n## Tutorial\n\nHere is a short introduction in the usage of `pathmatcher.py`.\n\nThe most important trick to use `pathmatcher.py` efficiently that you should remember is this one: **try to break operations over multiple commands**. Indeed, it's simpler to match anatomical first, then functional, then dwi, etc... Rather than trying to match and reorder them all in only one command (which is possible but hard, for exactly the same result!).\n\nLet's take a concrete example: we are going to reorganize the NIfTI files from the [ABIDE I dataset](http://fcon_1000.projects.nitrc.org/indi/abide/) to the [BIDS scheme](http://bids.neuroimaging.io/).\n\nTo do that, first create a directory anywhere you want (we will call this directory the \"root directory\", and unzip inside all ABIDE I dataset in one folder \"ABIDE\" (just \"unzip here\" the ABIDE I archives and this will create the `ABIDE` folder with the expected scheme). Then, inside the root directory, create another folder `ABIDE-BIDS` just beside the `ABIDE` folder. Now, open a terminal/console, and `cd` to the root directory, where there are now two subdirectories: \"ABIDE\" with ABIDE1 data, and `ABIDE-BIDS` that is empty.\n\nNow, in the commandline, execute the two following commands:\n\n```python\npython pathmatcher.py -ri \"Caltech_([0-9]+)/\\dir/scans/anat/resources/NIfTI/files/mprage.nii.gz\" -ro \"sub-\\1/anat/sub-\\1_T1w.nii.gz\" -i ABIDE/ -o ABIDE-BIDS/ -c\n\npython pathmatcher.py -ri \"Caltech_([0-9]+)/\\dir/scans/rest/resources/NIfTI/files/rest.nii.gz\" -ro \"sub-\\1/func/sub-\\1_task-rest_bold.nii.gz\" -i ABIDE/ -o ABIDE-BIDS/ -c\n```\n\nWhere `-i = --input` (base input directory), `-o = --output` (base output directory where files will get copied/moved), `-ri = --regex_input` (regular expression to match input files), `-ro = --regex_output` (regular expression to copy/move input files to output folder), `-c = --copy` (to enable copy mode, can also --symlink, --move, --delete). Note that you can type `--help` to get an extensive documentation of the arguments along with advices.\n\nNote also that `\\dir` is an alias for `[^/\\]*`, which allows to reliably match any directory in the path. Note also that `--regex_input` (`-ri`) and `--regex_output` (`-ro`) are matching paths relative to the `--input` and `--output` folders, thus nothing above `--input` and `--output` exist for pathmatcher. This was done so for two reasons: to more easily make your regexp (because you don't have to care about any parent folder from your `--input` or `--output`), and because of safety (to avoid `--delete` on your disk root! You are guaranteed that patchmatcher only works on subdirs).\n\nAfter executing both of these commands, `pathmatcher.py` will generate a report detailing all file operations it will do, and eventually warn you about conflicts (files getting the same filename and thus collisionning in the output folder).\n\nThis works alright, converting the `ABIDE I` dataset scheme to `BIDS`, but this can be made simpler. Pathmatcher was made to allow for loose matching, so basically the idea is that you should try to match only the things that are necessary for you (either for recapture to use in the output like subject's id, or just to disambiguate like the folder name). Here are two simplified commands doing the same thing as above:\n\n```python\npython pathmatcher.py -c -i \"ABIDE/\" -o \"ABIDE-BIDS/\" -ri \"Caltech_([0-9]+)/.+/mprage.nii.gz\" -ro \"sub-\\1/anat/sub-\\1_T1w.nii.gz\"\n\npython pathmatcher.py -c -i \"ABIDE/\" -o \"ABIDE-BIDS/\" -ri \"Caltech_([0-9]+)/.+/rest.nii.gz\" -ro \"sub-\\1/func/sub-\\1_task-rest_bold.nii.gz\"\n```\n\nAlso partial matching is supported, so if you just want to get the list of all T1, you can do the following:\n\n```python\npython pathmatcher.py -i \"ABIDE/\" -ri \"mprage.nii.gz\"\n```\n\nThis will generate the whole list of T1 and show them in a report.\n\nOf course, you can also use absolute paths for `--input` and `--output`.\n\nAnd a last trick to help you when you design the regular expressions: use the `--test` argument to see if it matches at least one file, and what operation will be done:\n\n```python\npython pathmatcher.py -c --test -i \"ABIDE/\" -o \"ABIDE-BIDS/\" -ri \"Caltech_([0-9]+)/.+/mprage.nii.gz\" -ro \"sub-\\1/anat/sub-\\1_T1w.nii.gz\"\n```\n\nResult:\n\n```\n== Regex Path Matcher started ==\n\nParameters:\n- Input root: C:\\GigaData\\BIDS\\ABIDE\n- Input regex: Caltech_([0-9]+)/.+/mprage.nii.gz\n- Output root: C:\\GigaData\\BIDS\\ABIDE-BIDS\n- Output regex: sub-\\1/anat/sub-\\1_T1w.nii.gz\n\n\nComputing paths matching and simulation report, please wait (total time depends\non files count - filesize has no influence). Press CTRL+C to abort\n\nMatch: Caltech_51456/Caltech_51456/scans/anat/resources/NIfTI/files/mprage.nii.gz --> sub-51456/anat/sub-51456_T1w.nii.gz\n\n\nEnd of simulation. 1 files matched.\n```\n\nFinally, `pathmatcher.py` can be used as an integral part of your own scripts, by either using it on commandline with the `--yes` argument to skip the report, or from your own python script by using the following:\n\n```python\nfrom pathmatcher import main as pm\n\n# Match all T1 from ABIDE I, don't forget the r'' to avoid conflicts with / character\n# You can use the commandline arguments, but the script will be called without bash but directly inside Python\nmy_results = pm(r'-i \"ABIDE/\" -ri \"mprage.nii.gz\"', return_report=True)  # use return_report=True to get the matches returned to your my_results variable\n\nprint(my_results)\n```\n\nA concrete example of scripting of `pathmatcher.py` can be found inside the `reorientation_registration_helper.py` script, which streamlines the manual preprocessing of fMRI data (reorientation, coregistration, quality and motion assessment, generation of composite motion metrics such as framewise median absolute deviation, etc).\n\n### Similar projects\n\nA similar project, and potentially more powerful, is [fselect](https://github.com/jhspetersson/fselect), which allows to use SQL-like queries on files. In MATLAB, similar functions are available in [dirPlus](https://github.com/kpeaton/dirPlus).\n\n## Auxiliary tool: Reorientation and registration helper\n\n### Description\n\nA companion to help you reorient and coregister manually your structural and functional MRI in SPM, without having to click to select files.\n\nThis helper script will scan all images in the specified input path, and will accompagny you step-by-step to do the reorientation and coregistration correctly.\n\nThis script requires SPM12 (and MATLAB), and runs only on Windows (because of the matlab wrapper limitations).\n\nThis script follows the following steps:\n\n1. Automatic reorientation of structural MRI using [spm_auto_reorient.m](https://github.com/lrq3000/spm_auto_reorient) (please install this script along with SPM12 beforehand).\n2. Check reorient and adjust manually.\n3. Side-by-side check of multiple subjects' structural MRI.\n4. Detection of functional images (just walk through all folders to build a list of functional images and pair them to their respective structural images given the input regexp).\n5. Automatic co-registration of functional images onto structural.\n6. Manual co-registration of functional images with structural.\n7. Extraction of framewise displacement motion metrics from functional images.\n\nThis script will not only guide you through these steps, in the correct order, but it will also automatically load the files for you (no chance of doing a mistake or missing a subject), while showing you a progress bar (showing how many subjects are remaining and with a time estimate to finish).\n\nThere is a CLI user interface: you can skip steps you already done or don't want to do, skip patients, or reload another image (for step 4, to check other functional images).\n\nNote that the last step, extraction of framewise displacement motion metrics from functional images, can be done without requiring matlab nor a matlab wrapper (and hence should work on any platform), by using the `--motiononly` and `--regex_motion` switches (this will directly look for the `rp_*.txt` files that you previously generated with `spm_realign`).\n\n### Usage\n\n```\nusage: reorientation_registration_helper [-h] -i /some/path [-ra \"reg_expr+/anat\\.(img|nii)\"]\n                                                 [-rf \"reg_expr+/func\\.(img|nii)\"] [-rp \"reg_expr+/rp_.+\\.txt\"] [-m]\n                                                 [-v]\n\nReorientation and registration helper v1.7.4\nDescription: Guide and automate the file selection process that is required in SPM between each reorientation/registration.\n\nNo more useless clicks, just do the reorientation/registration in batch, you don't need to worry about selecting the corresponding files, this helper will do it for you.\n\nIf you have tqdm installed, a nice progress bar will tell you how many subjects are remaining to be processed and how much time will it take at your current pace.\n\nNote: you need to `pip install mlab` before using this script.\nNote2: you need to have set both spm and spm_auto_reorient in your path in MATLAB before using this script.\nNote3: you need the pathmatcher.py library (see lrq3000 github).\n\n\n\noptional arguments:\n  -h, --help            show this help message and exit\n  -i /some/path, --input /some/path\n                        Path to the input folder (the root directory where you placed the files, the default supported tree structure being: \"Condition/subject_id/data/(sess_id)?/(mprage|rest)/*.(img|nii)\". You can also use --regex_anat and --regex_func to define your own directory layout.\n  -ra \"(reg_expr)+/anat\\.(img|nii)\", --regex_anat \"(reg_expr)+/anat\\.(img|nii)\"\n                        Regular expression to match anatomical images (default: Liege CRC scheme). Use regex groups to match with functional regex (if you want to do step 4 - manual coreg). Note: should target nii or img, not hdr.\n  -rf \"(reg_expr)+/func\\.(img|nii)\", --regex_func \"(reg_expr)+/func\\.(img|nii)\"\n                        Regular expression to match functional images (default: Liege CRC scheme). Regex groups will be matched with the anatomical regex, so you should provide the same groups for both regex. Note: should target nii or img, not hdr (using non-capturing group, eg: \".*\\.(?:img|nii)\". If a named group (?P<func>...) is specified, this will allow to separately coregister any file matching this group, which will be removed from the list of regex groups (thus this group is additional, it does not count in the \"same number of groups\" rule).\n  -rp \"(reg_expr)+/rp_.+\\.txt\", --regex_motion \"(reg_expr)+/rp_.+\\.txt\"\n                        Regular expression to match motion parameter files rp_*.txt as generated by spm_realign. If this argument is provided, motion parameters will be fetched from these files directly instead of recalculating from functional images. The regex needs to contain at least one group in parentheses to define a key for the output excel file.\n  -m, --motiononly      If true, and if --regex_motion is specified, then only this step will be done, using the already generated rpfiles.\n  -v, --verbose         Verbose mode (show more output).\n\n```\n\n### Libraries\n\n#### Required\n\n* argparse\n* pathmatcher\n* mlabwrap aka matlap_wrapper ([Python2](https://github.com/mrkrd/matlab_wrapper) version, [Python3](https://github.com/deeuu/matlab_wrapper/tree/python3) version as provided with this module)\n* pypiwin32 (for mlabwrap)\n* pip install --ignore-installed pywin32\n    * then execute `python Scripts\\pywin32_postinstall.py -install` in an admin command prompt, see [this explanation](https://stackoverflow.com/questions/58612306/how-to-fix-importerror-dll-load-failed-while-importing-win32api#comment103561767_58613735).\n\n#### Optional\n\n* scandir, to scan files faster\n* tqdm, to show the progress bar\n* numpy >= 1.18.1, for the optional last step to generate motion metrics from functional images\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/lrq3000/pathmatcher",
    "keywords": "",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "pathmatcher",
    "package_url": "https://pypi.org/project/pathmatcher/",
    "platform": "any",
    "project_url": "https://pypi.org/project/pathmatcher/",
    "project_urls": {
      "Homepage": "https://github.com/lrq3000/pathmatcher"
    },
    "release_url": "https://pypi.org/project/pathmatcher/1.7.5/",
    "requires_dist": [
      "chardet (>=3.0.4)",
      "tqdm (>=4.46.0)",
      "scandir (>=1.10.0)"
    ],
    "requires_python": "",
    "summary": "Regular Expression Path Matcher",
    "version": "1.7.5",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 7289937,
  "releases": {
    "1.7.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "215626a5664ab73e1b2415b8634105e17383de0661768ade005214a996452b40",
          "md5": "da7f454d2cfd4b991cdb4e4c33eaf6bb",
          "sha256": "802b50a68a42d923859235b70f3355531d25d9925e8468b08b28e694d9c6f192"
        },
        "downloads": -1,
        "filename": "pathmatcher-1.7.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "da7f454d2cfd4b991cdb4e4c33eaf6bb",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 39838,
        "upload_time": "2020-05-17T19:26:17",
        "upload_time_iso_8601": "2020-05-17T19:26:17.456729Z",
        "url": "https://files.pythonhosted.org/packages/21/56/26a5664ab73e1b2415b8634105e17383de0661768ade005214a996452b40/pathmatcher-1.7.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d88f511ce1dba589a88f6fdb611145cbf87395885bf9ad24e3d5e5308043a9a1",
          "md5": "a921d8c88fccc18b116ac865a389e9e3",
          "sha256": "fc6fb2a01e7351bf047f57aad17f15d6bcd473dc9daa58cf26b67fe231564a36"
        },
        "downloads": -1,
        "filename": "pathmatcher-1.7.3.tar.gz",
        "has_sig": false,
        "md5_digest": "a921d8c88fccc18b116ac865a389e9e3",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 45337,
        "upload_time": "2020-05-17T19:26:19",
        "upload_time_iso_8601": "2020-05-17T19:26:19.651853Z",
        "url": "https://files.pythonhosted.org/packages/d8/8f/511ce1dba589a88f6fdb611145cbf87395885bf9ad24e3d5e5308043a9a1/pathmatcher-1.7.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.7.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e2ea51cc492e50335575c3a1b44e08ab287a60e100a816b453d04f0de1a298f4",
          "md5": "11e08acd0e90fd32bc192a4433c39478",
          "sha256": "913400bdf905aa1e3b01ada692a933fcf6abc014de11da8d9fad84959938d68b"
        },
        "downloads": -1,
        "filename": "pathmatcher-1.7.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "11e08acd0e90fd32bc192a4433c39478",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 94084,
        "upload_time": "2020-05-20T21:21:50",
        "upload_time_iso_8601": "2020-05-20T21:21:50.657525Z",
        "url": "https://files.pythonhosted.org/packages/e2/ea/51cc492e50335575c3a1b44e08ab287a60e100a816b453d04f0de1a298f4/pathmatcher-1.7.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ce4b9b373855bab8032b1b2cea2a9ad0b3fc6bc7a0ec76d2e61e2584f190d08f",
          "md5": "6e6cc0efc8ebeeb618243e31260d727b",
          "sha256": "ddf0a456e82f41bbd122850ad38bfce4eb57baee984b27d5dd093ab826eb392c"
        },
        "downloads": -1,
        "filename": "pathmatcher-1.7.4.tar.gz",
        "has_sig": false,
        "md5_digest": "6e6cc0efc8ebeeb618243e31260d727b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 95927,
        "upload_time": "2020-05-20T21:21:54",
        "upload_time_iso_8601": "2020-05-20T21:21:54.504445Z",
        "url": "https://files.pythonhosted.org/packages/ce/4b/9b373855bab8032b1b2cea2a9ad0b3fc6bc7a0ec76d2e61e2584f190d08f/pathmatcher-1.7.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.7.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c68a8028ef1571fef1b1c9bcc4204db9af84856a6cbc42a050e415bfbcf81f28",
          "md5": "cbe30144a3abab55bdd32dc5fbbc1b1d",
          "sha256": "359f323ac69bc7ae651551dda86b001429fea9aa12cfe6922e908fdeb6bf7166"
        },
        "downloads": -1,
        "filename": "pathmatcher-1.7.5-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "cbe30144a3abab55bdd32dc5fbbc1b1d",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 97197,
        "upload_time": "2020-05-20T22:27:17",
        "upload_time_iso_8601": "2020-05-20T22:27:17.146635Z",
        "url": "https://files.pythonhosted.org/packages/c6/8a/8028ef1571fef1b1c9bcc4204db9af84856a6cbc42a050e415bfbcf81f28/pathmatcher-1.7.5-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "24656b5170325a08d6fac4e89359ea0dc31bf4b1b074c45de933a0aeb999a472",
          "md5": "3517084ec305b79d6dce44f0b31e2da2",
          "sha256": "e077746f1a656136f9fc8e8b0bbecd693f652a24c59018c342198a773987483a"
        },
        "downloads": -1,
        "filename": "pathmatcher-1.7.5.tar.gz",
        "has_sig": false,
        "md5_digest": "3517084ec305b79d6dce44f0b31e2da2",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 104274,
        "upload_time": "2020-05-20T22:27:19",
        "upload_time_iso_8601": "2020-05-20T22:27:19.881960Z",
        "url": "https://files.pythonhosted.org/packages/24/65/6b5170325a08d6fac4e89359ea0dc31bf4b1b074c45de933a0aeb999a472/pathmatcher-1.7.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "c68a8028ef1571fef1b1c9bcc4204db9af84856a6cbc42a050e415bfbcf81f28",
        "md5": "cbe30144a3abab55bdd32dc5fbbc1b1d",
        "sha256": "359f323ac69bc7ae651551dda86b001429fea9aa12cfe6922e908fdeb6bf7166"
      },
      "downloads": -1,
      "filename": "pathmatcher-1.7.5-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "cbe30144a3abab55bdd32dc5fbbc1b1d",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 97197,
      "upload_time": "2020-05-20T22:27:17",
      "upload_time_iso_8601": "2020-05-20T22:27:17.146635Z",
      "url": "https://files.pythonhosted.org/packages/c6/8a/8028ef1571fef1b1c9bcc4204db9af84856a6cbc42a050e415bfbcf81f28/pathmatcher-1.7.5-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "24656b5170325a08d6fac4e89359ea0dc31bf4b1b074c45de933a0aeb999a472",
        "md5": "3517084ec305b79d6dce44f0b31e2da2",
        "sha256": "e077746f1a656136f9fc8e8b0bbecd693f652a24c59018c342198a773987483a"
      },
      "downloads": -1,
      "filename": "pathmatcher-1.7.5.tar.gz",
      "has_sig": false,
      "md5_digest": "3517084ec305b79d6dce44f0b31e2da2",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 104274,
      "upload_time": "2020-05-20T22:27:19",
      "upload_time_iso_8601": "2020-05-20T22:27:19.881960Z",
      "url": "https://files.pythonhosted.org/packages/24/65/6b5170325a08d6fac4e89359ea0dc31bf4b1b074c45de933a0aeb999a472/pathmatcher-1.7.5.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}