{
  "info": {
    "author": "Divya Tej Sowpati",
    "author_email": "tej@ccmb.res.in",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "# PERF\n[![Build](https://img.shields.io/badge/Build-passing-brightgreen.svg)]()\n[![PyPI](https://img.shields.io/badge/PyPI-v0.4.5-blue.svg)]()\n[![License](https://img.shields.io/badge/Licence-MIT-blue.svg)]()\n## Introduction\nPERF is a Python package developed for fast and accurate identification of microsatellites from DNA sequences. Microsatellites or Simple Sequence Repeats (SSRs) are short tandem repeats of 1-6nt motifs. They are present in all genomes, and have a wide range of uses and functional roles. The existing tools for SSR identification have one or more caveats in terms of speed, comprehensiveness, accuracy, ease-of-use, flexibility and memory usage. PERF was designed to address all these problems.\n\nPERF is a recursive acronym that stands for \"PERF is an Exhaustive Repeat Finder\". It is compatible with both Python 2 (tested on Python 2.7) and 3 (tested on Python 3.5). Its key features are:\n  - Fast run time. As an example, identification of all SSRs from the entire human genome takes less than 7 minutes. The speed can be further improved ~3 to 4 fold using [PyPy](https://pypy.org/) (human genome finishes in less than 2 minutes using PyPy v5.8.0)\n  - Linear time and space complexity (O(n))\n  - Identifies perfect SSRs\n  - 100% accurate and comprehensive - Does not miss any repeats or does not pick any incorrect ones\n  - Easy to use - The only required argument is the input DNA sequence in FASTA format\n  - Flexible - Most of the parameters are customizable by the user at runtime\n  - Repeat cutoffs can be specified either in terms of the total repeat length or in terms of number of repeating units\n  - TSV output and HTML report. The default output is an easily parseable and exportable tab-separated format. Optionally, PERF also generates an interactive HTML report that depicts trends in repeat data as concise charts and tables\n\n## Change log \n\n## [0.4.6] - 2021-04-22\n### Fixes\n - Fixed usage of unit options file input for fastq input.\n - Fixed usage of repeats input file.\n\n## [0.4.5] - 2020-05-07\n### Added\n - Annotation of repeats w.r.t to genomic context using a GFF or GTF file. (option -g).\n - Multi-threading. Parallel identification of repeats in different sequences.\n - Identification of perfect repeats in fastq files.\n - Analysis report for repeats in fastq files.\n - Option to identify atomic repeats.\n\n### Changed\n - Analysis report rebuilt with Semantic ui and Apex Charts.\n - Visualisation of repeat annotation data in analysis report.\n\n### Fixes \n - Python2 compatability fixed.\n - Bug fixes for PyPi compatability.\n - Import error issues.\n\n## Installation\nPERF can be directly installed using pip with the package name `perf_ssr`. \n```bash\n$ pip install perf_ssr\n```\n\nThis name was chosen for the package so as not to clash with the existing `perf` package.\n\nAlternatively, it can be installed from the source code:\n```bash\n# Download the git repo\n$ git clone https://github.com/RKMlab/perf.git\n\n# Install\n$ cd perf\n$ python setup.py install\n```\nBoth of the methods add a console command `PERF`, which can be executed from any directory. It can also be used without installation by running the `core.py` file in the `PERF` subfolder:\n\n```bash\n$ git clone https://github.com/RKMlab/perf.git\n$ cd perf/PERF\n$ python core.py -h # Print the help message of PERF (see below)\n```\n\n## Usage\nThe help message and available options can be accessed using\n```bash\n$ PERF -h # Short option\n$ PERF --help # Long option\n```\nwhich gives the following output\n```\nusage: core.py [-h] -i <FILE> [-o <FILE>] [--format <STR>] [--version]\n               [-rep <FILE>] [-m <INT>] [-M <INT>] [-s <INT>] [-S <FLOAT>]\n               [--include-atomic] [-l <INT> | -u INT or FILE] [-a] [--info]\n               [-g <FILE>] [--anno-format <STR>] [--gene-key <STR>]\n               [--up-promoter <INT>] [--down-promoter <INT>]\n               [-f <FILE> | -F <FILE>] [-t <INT>]\n\nRequired arguments:\n  -i <FILE>, --input <FILE>\n                        Input sequence file.\n\nOptional arguments:\n  -o <FILE>, --output <FILE>\n                        Output file name. Default: Input file name + _perf.tsv\n  --format <STR>        Input file format. Default: fasta, Permissible: fasta,\n                        fastq\n  --version             show program's version number and exit\n  -rep <FILE>, --repeats <FILE>\n                        File with list of repeats (Not allowed with -m and/or\n                        -M)\n  -m <INT>, --min-motif-size <INT>\n                        Minimum size of a repeat motif in bp (Not allowed with\n                        -rep)\n  -M <INT>, --max-motif-size <INT>\n                        Maximum size of a repeat motif in bp (Not allowed with\n                        -rep)\n  -s <INT>, --min-seq-length <INT>\n                        Minimum size of sequence length for consideration (in\n                        bp)\n  -S <FLOAT>, --max-seq-length <FLOAT>\n                        Maximum size of sequence length for consideration (in\n                        bp)\n  --include-atomic      An option to include factor atomic repeats for minimum\n                        motif sizes greater than 1.\n  -l <INT>, --min-length <INT>\n                        Minimum length cutoff of repeat\n  -u INT or FILE, --min-units INT or FILE\n                        Minimum number of repeating units to be considered.\n                        Can be an integer or a file specifying cutoffs for\n                        different motif sizes.\n  -a, --analyse         Generate a summary HTML report.\n  --info                Sequence file info recorded in the output.\n  -f <FILE>, --filter-seq-ids <FILE>\n                        List of sequence ids in fasta file which will be\n                        ignored.\n  -F <FILE>, --target-seq-ids <FILE>\n                        List of sequence ids in fasta file which will be used.\n  -t <INT>, --threads <INT>\n                        Number of threads to run the process on. Default is 1.\n\nAnnotation arguments:\n  -g <FILE>, --annotate <FILE>\n                        Genic annotation input file for annotation, Both GFF\n                        and GTF can be processed. Use --anno-format to specify\n                        format.\n  --anno-format <STR>   Format of genic annotation file. Valid inputs: GFF,\n                        GTF. Default: GFF\n  --gene-key <STR>      Attribute key for geneId. The default identifier is\n                        \"gene\". Please check the annotation file and pick a\n                        robust gene identifier from the attribute column.\n  --up-promoter <INT>   Upstream distance(bp) from TSS to be considered as\n                        promoter region. Default 1000\n  --down-promoter <INT>\n                        Downstream distance(bp) from TSS to be considered as\n                        promoter region. Default 1000\n```\nThe details of each option are given below:\n\n### `-i or --input`\n**Expects:** *FILE*<br>\n**Default:** *None*<br>\nThis is the only required argument for the program. The input file must be a valid FASTA/FASTQ file. PERF uses [Biopython's](http://biopython.org/wiki/SeqIO) FASTA parser to read the input fasta files. It accepts both single-line and multi-line sequences. Files with multiple sequences are also valid. To see more details about the FASTA format, see [this page](http://bioperl.org/formats/sequence_formats/FASTA_sequence_format).\n\n### `-o or --output`\n**Expects:** *STRING (to be used as filename)*<br>\n**Default:** *Input Filename + _perf.tsv (see below)*<br>\nIf this option is not provided, the default output filename will be the same as the input filename, with its extension replaced with '_perf.tsv'. For example, if the input filename is `my_seq.fa`, the default output filename will be `my_seq_perf.tsv`. If the input filename does not have any extension, `_perf.tsv` will be appended to the filename. Please note that even in the case of no identified SSRs, the output file is still created (therefore overwriting any previous file of the same name) but with no content in the file.\n#### Output for fasta\nThe output is a tab-delimited file, with one SSR record per line. \nThe output columns follow the [BED](https://genome.ucsc.edu/FAQ/FAQformat.html) format. The details of the columns are given below:\n\n| S.No | Column | Description |\n|:----:| ------ | ----------- |\n| 1 | Chromosome | Chromosome or Sequence Name as specified by the first word in the FASTA header |\n| 2 | Repeat Start | 0-based start position of SSR in the Chromosome |\n| 3 | Repeat Stop | End position of SSR in the Chromosome |\n| 4 | Repeat Class | Class of repeat as grouped by their cyclical variations |\n| 5 | Repeat Length | Total length of identified repeat in nt |\n| 6 | Repeat Strand | Strand of SSR based on their cyclical variation |\n| 7 | Motif Number | Number of times the base motif is repeated |\n| 8 | Actual Repeat | Starting sequence of the SSR irrespective of Repeat class and strand|\n\nAn example output showing some of the largest repeats from *Drosophila melanogaster* is given below\n```\nX       22012826  22014795  ACTGGG  1969    -       328     TCCCAG\n2RHet   591337    591966    AATACT  629     -       104     ATTAGT\n4       1042143   1042690   AAATAT  547     +       91      AAATAT\n2RHet   598244    598789    AATACT  545     -       90      AGTATT\nXHet    122       663       AGAT    541     +       135     GATA\nX       22422335  22422827  AGAT    492     +       123     GATA\n3R      975265    975710    AAAT    445     -       111     TTAT\nX       15442288  15442724  ACAGAT  436     +       72      ACAGAT\n2L      22086818  22087152  AATACT  334     -       55      TATTAG\nYHet    137144    137466    AAGAC   322     -       64      CTTGT\n```\n\n#### Output for fastq\nThe output is a tab-delimited file, with data on each repeat class per line.\n| S.No | Column | Description |\n|:----:| ------ | ----------- |\n| 1 | Repeat Class | Class of repeat as grouped by their cyclical variations |\n| 2 | Number of reads | Number of reads having an instance of the repeat |\n| 3 | Frequency | Total number of instances of the repeat  |\n| 4 | Bases | Total number of bases covered by the repeat |\n| 5 | Repeat reads per million reads | Number of  |\n| 6 | Instances per million reads | Strand of SSR based on their cyclical variation |\n| 7 | Repeat Bases per MB of sequence | Number of times the base motif is repeated |\n| 8 | Length distribution | Starting sequence of the SSR irrespective of Repeat class and strand|\n| 9 | Motif distribution | Starting sequence of the SSR irrespective of Repeat class and strand|\n\n\n### `--format`\n**Expects:** *STRING (specifying format of the file)*<br>\n**Default:** *fasta*<br>\nPERF was originally developed to identify repeats in FASTA files. In version 4.0.0 PERF can identify repeats in FASTQ sequence files as well. The default format the program expects is fasta. Specify input format as 'fasta' for FASTA files and 'fastq' for FASTQ files.\n\n### `-a or --analyze`\n**Expects:** *None*<br>\n**Default:** *False*<br>\nIn addition to the default tab-separated output, PERF can also generate a fully interactive HTML report for easy downstream analysis of the repeat data. The filename will be the same prefix as that of the main output. For example, if the input filename was `my_seq.fa`, the analysis report will be  `my_seq_perf.html`. An example HTML report, generated from the repeat data of *Homo sapiens* (build hg19), can be accessed [here](https://raw.githubusercontent.com/RKMlab/perf/html-report/test_data/Human_hg19_perf.html) (Right click -> Save As).\n\n### `-l or --min-length`\n**Expects:** *INTEGER*<br>\n**Default:** *12*<br>\nMinimum length cut-off to be considered when finding an SSR. The same cut-off will apply for SSRs of all motif lengths, even if the motif length is not a divisor of this value. In such cases, SSRs that end with a partial motif are also picked if they pass the length cut-off.\n\n### `-u or --min-units`\n**Expects:** *INTEGER* OR *FILE*<br>\n**Default:** *None*<br>\nThis option finds SSRs with a minimum number of repeating motifs. The argument accepts either an integer or file. If an integer is specified, the same value is used for all motif lengths. Instead, a specific value for each motif length using a two-column tab-separated file as demonstrated below:\n\n```bash\n$ cat repeat_units.txt\n1\t10\n2\t6\n3\t4\n4\t3\n5\t2\n6\t2\n```\n\nThe first column specifies the motif length, and the second column specifies the minimum number of times the motif should be repeated to be considered an SSR. This file can be used to identify repeats with different number of repeating motifs: monomers repeated at least 10 times, dimers repeated at least 6 times etc., using the following command\n``` bash\n$ PERF -i my_seq.fa -m 1 -M 6 -u repeat_units.txt\n```\n\n### `-rep or --repeats`\n**Expects:** *FILE*<br>\n**Default:** *None*<br>\nPERF provides an option to limit the search to specific repeat motifs. The repeats of interest should be specified via a file containing 4 tab-separated columns, as shown below:\n\n```bash\n$ cat my_repeats.txt\nA   A   1   +                                                                \nT   A   1   -\nAG  AG  2   +\nCT  AG  2   -\nGA  AG  2   +\nTC  AG  2   -\n$ PERF -i my_seq.fa -rep my_repeats.txt # Find all A and AG repeats from my_seq.fa\n```\n\n**Note:** This option is not allowed when `-m` or `-M` options are used.\n### `-m or --min-motif-size`\n**Expects:** *INTEGER*<br>\n**Default:** *1*<br>\nMinimum length of motifs to be considered. By default, PERF ignores redundant motifs. For example, a stretch of 12 A's is considered a monomer repeat of 12 A's rather than a dimer repeat of 6 AA's. However, this is only true if `-m` is set to 1. If for example, `-m` is set to 2, then stretches of 12 A's are reported as dimer AA repeats. If this behavior isn't desired, we suggest using the `-rep` option (see above) to specify the motifs that should/shouldn't be included.\n\n### `-M or --max-motif-size`\n**Expects:** *INTEGER*<br>\n**Default:** *6*<br>\nMaximum length of motifs to be considered. Setting a large value of `-M` has a non-trivial effect on both the runtime and memory usage of PERF. This is noticeable with `-M` values above 10.\n\n### `--include-atomic`\n**Expects:** *None*<br>\n**Default:** *False*<br>\nSearches for atomic repeats when set to *True*. For example, when minimum motif size is set to 2bp, PERF ignores monomer repeats. When include atomic repeats is set to *True*, PERF identifies AA, CC, GG and TT as dimer repeats.\n\n### `-s or --min-seq-length`\n**Expects:** *INTEGER*<br>\n**Default:** *0*<br>\nMinimum length of the input sequence to be searched for SSRs in bp. All sequences in the input file that are smaller than this length will be ignored.\n\n### `-S or --max-seq-length`\n**Expects:** *INTEGER*<br>\n**Default:** *Infinity*<br>\nMaximum length of the input sequence to be searched for SSRs in bp. All sequences in the input file that are larger than this length will be ignored.\n\n### `-f or --filter-seq-ids`\n**Expects:** *FILE*<br>\n**Default:** *None*<br>\nThis option accepts a file with a list of sequence IDs in the input file that should be ignored. Useful for ignoring contigs, scaffold, or other poor quality sequences. The IDs can be FASTA headers (starting with '>' symbol) or just the names without the '>' symbol.\n\n### `-F or --target-seq-ids`\n**Expects:** *FILE*<br>\n**Default:** *None*<br>\nThis option accepts a file with a list of sequence IDs in the input file that should be analyzed. All other sequences will be ignored. Useful for analyzing specific chromosomes from a large input file. The IDs can be FASTA headers (starting with '>' symbol) or just the names without the '>' symbol.\n\n### `--info`\n**Expects:** *None*<br>\n**Default:** *False*<br>\nThis option when set to *True*, includes information about the input sequence files and repeat summary data in the output file.\n\n```bash\n$ tail -5 test_input_perf.tsv\ngi|514486271|gb|KE346361.1|\t2667759\t2667775\tATC\t16\t+\t5\tCAT\n#File_name: test_input.fa\n#Total_sequences: 2\n#Total_bases: 6462134\n#GC: 53.970000\n```\n\n### `-g or --annotate`\n**Expects:** *FILE*<br>\n**Default:** *None*<br>\nInput a genomic feature file to annotate the repeats in the genomic context. PERF accepts both GFF and GTF format genomic feature files. Each repeat is annotated w.r.t the closest gene and classified either as Genic, Exonic, Intronic and Intergenic according to the position of the repeat. Besides this, the repeat is also checked if it falls in the promoter region of the gene. Annotation adds 7 columns to the default perf output which already consist 8 columns.\n\n| S.No | Column | Description |\n|:----:| ------ | ----------- |\n| 9 | Gene name | Name of the closest gene |\n| 10 | Gene Start | Start position of gene in the Chromosome |\n| 11 | Gene Stop | End position of gene in the Chromosome |\n| 12 | Strand | The strand orientation of the gene |\n| 13 | Genomic annotation | Annotation of the repeat w.r.t to the gene. Possible annotations are {Genic, Exonic, Intronic, Intergenic} |\n| 14 | Promoter annotation | If repeat falls in the promoter region of the closest gene. The default promoter region is 1Kb upstream and downstream of TSS. |\n| 15 | Distance from TSS | Distance of the repeat from the TSS of the gene. |\n\n### `--anno-format`\n**Expects:** *STRING*<br>\n**Default:** *GFF*<br>\nOption to specify the format of the input genomic feature file. Accepted  inputs are GFF or GTF. More details about the GFF and GTF formats can be found [here](https://asia.ensembl.org/info/website/upload/gff.html).\n\n### `--gene-key`\n**Expects:** *STRING*<br>\n**Default:** *gene*<br>\nThe attribute key used for the name of the gene in the GFF/GTF file. In the below example GFF file, we have the location of a gene and it's mRNA and exon locations. The last column of the file specifies attributes associated with each feature, like ID, Parent, gene etc. PERF uses on of the attribute to identify the gene and also it's exons. In th below example the key \"gene\" can be used to identify gene and the exons of the gene as they have the same gene name. Please check your GFF/GTF file for a robust attribute key which can identify all genes and their corresponding exons. We are actively working on better annotation where we can identify genes and their exons based on the ID and Parent.\n\n```\n# Sample GFF\nNC_004354.4\tRefSeq\tgene\t124370\t126714\t.\t-\t.\tID=gene1;Name=CG17636;gbkey=Gene;gene=CG17636;gene_biotype=protein_coding;gene_synonym=DmelCG17636,EG:23E12.1;\nNC_004354.4\tRefSeq\tmRNA\t124370\t126714\t.\t-\t.\tID=rna1;Parent=gene1;Name=NM_001103384.3;gbkey=mRNA;gene=CG17636;transcript_id=NM_001103384.3\nNC_004354.4\tRefSeq\texon\t126626\t126714\t.\t-\t.\tID=id13;Parent=rna1;gbkey=mRNA;gene=CG17636;transcript_id=NM_001103384.3\nNC_004354.4\tRefSeq\texon\t125495\t126259\t.\t-\t.\tID=id14;Parent=rna1;gbkey=mRNA;gene=CG17636;transcript_id=NM_001103384.3\n```\n\n### `--up-promoter`\n**Expects:** *INT*<br>\n**Default:** *1000*<br>\nUpstream distance(bp) from the TSS of the gene to be considered as promoter region. Default 1000.\n\n### `--down-promoter`\n**Expects:** *INT*<br>\n**Default:** *1000*<br>\nDownstream distance(bp) from the TSS of the gene to be considered as promoter region. Default 1000.\n\n### `--version`\nPrints the version info of PERF.\n\n## Examples\n\nThe following examples assume that the file with input sequence in FASTA format is named `my_seq.fa`.\n\n#### Basic Usage\n``` bash\n# Find all monomer to hexamer repeats of >=12nt length\n$ PERF -i my_seq.fa\n# Specify output filename\n$ PERF -i my_seq.fa -o PERF_output.tsv\n# Specify fastq format\n$ PERF -i my_seq.fastq --format fastq\n```\n\n#### Generate Analysis Report\n``` bash\n# Find all monomer to hexamer repeats of >=12nt length and generate an HTML report\n$ PERF -i my_seq.fa -a\n# Specify output filename\n$ PERF -i my_seq.fa -o PERF_out.tsv -a # HTML file is called PERF_out.html\n```\n\n#### Annotate Repeats\n``` bash\n# Find all monomer to hexamer repeats of >=12nt length and annotate them\n$ PERF -i my_seq.fa -g my_seq.gff\n# Specify feature file format and set downstream promoter region to 500bp\n$ PERF -i my_seq.fa -g my_seq.gtf --anno-format gtf --down-promoter 500 # HTML file is called PERF_out.html\n```\n\n#### Set Cut-off Criteria\n```bash\n# Find all monomer to hexamer repeats of >=15nt length\n$ PERF -i my_seq.fa -l 15\n# Find SSRs with at least 6 repeating motifs (for all motif lengths)\n$ PERF -i my_seq.fa -u 6\n```\n\n#### Identify Specific Repeats\n``` bash\n$ cat my_repeats.txt\nAG  AG  2   +\nCT  AG  2   -\nGA  AG  2   +\nTC  AG  2   -\n# Find all AG repeats and generate an HTML report\n$ PERF -i my_seq.fa -rep my_repeats.txt -a\n```\n\n#### Change Motif Length Cut-offs\n```bash\n# Ignore monomer and dimer repeats, and repeats with <4 repeating units\n$ PERF -i my_seq.fa -m 3 -u 4\n# Report only tetramer repeats of >=16nt length, and generate HTML report\n$ PERF -i my_seq.fa -m 4 -M 4 -l 16 -a\n\n```\n\nIn all the above examples, the output of PERF is saved to `my_seq_perf.tsv` and the HTML report is saved to `my_seq_perf.html` unless `-o` is specified.\n\n\n## Citation\n\nIf you find PERF useful for your research, please cite it as follows:\n\nPERF: an exhaustive algorithm for ultra-fast and efficient identification of microsatellites from large DNA sequences<br>\n*Akshay Kumar Avvaru, Divya Tej Sowpati, Rakesh Kumar Mishra*<br>\nBioinformatics, , btx721<br>\n[doi](https://doi.org/10.1093/bioinformatics/btx721): 10.1093/bioinformatics/btx721\n\n## Contact\nFor queries or suggestions, please contact:\n\nDivya Tej Sowpati - <tej@ccmb.res.in><br>\nAkshay Kumar Avvaru - <avvaru@ccmb.res.in>\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/rkmlab/perf",
    "keywords": "ssr microsatellites",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "perf-ssr",
    "package_url": "https://pypi.org/project/perf-ssr/",
    "platform": null,
    "project_url": "https://pypi.org/project/perf-ssr/",
    "project_urls": {
      "Homepage": "https://github.com/rkmlab/perf"
    },
    "release_url": "https://pypi.org/project/perf-ssr/0.4.8/",
    "requires_dist": [
      "biopython (==1.69)",
      "tqdm (>=4)"
    ],
    "requires_python": "",
    "summary": "PERF is an exhaustive repeat finder",
    "version": "0.4.8",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 14126396,
  "releases": {
    "0.2.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a2cf7a99f73d2642224d84e6d3da8de0215b4fa26eaa7749b44d43e5ed4aabb2",
          "md5": "b9860eb26211a3619a42e06eac83840d",
          "sha256": "06e8a6dc0e9be40c40faae31efa83dbe396ab60218c794b16f55855ee73fff77"
        },
        "downloads": -1,
        "filename": "perf_ssr-0.2.0.tar.gz",
        "has_sig": false,
        "md5_digest": "b9860eb26211a3619a42e06eac83840d",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 156409,
        "upload_time": "2017-08-30T06:38:49",
        "upload_time_iso_8601": "2017-08-30T06:38:49.839608Z",
        "url": "https://files.pythonhosted.org/packages/a2/cf/7a99f73d2642224d84e6d3da8de0215b4fa26eaa7749b44d43e5ed4aabb2/perf_ssr-0.2.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1f960406447cf5685393133e26b7df10e3a1dadd61c800ce35ee734b2471e76c",
          "md5": "dc3cf0c3838e3ef4f39f2b3a454f0202",
          "sha256": "ba71c2f297f9c06c62ce02948a53ca6bf80794bcc19701356451d97a545a448b"
        },
        "downloads": -1,
        "filename": "perf_ssr-0.2.1.tar.gz",
        "has_sig": false,
        "md5_digest": "dc3cf0c3838e3ef4f39f2b3a454f0202",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 156514,
        "upload_time": "2017-10-08T07:05:05",
        "upload_time_iso_8601": "2017-10-08T07:05:05.621494Z",
        "url": "https://files.pythonhosted.org/packages/1f/96/0406447cf5685393133e26b7df10e3a1dadd61c800ce35ee734b2471e76c/perf_ssr-0.2.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ba11ced11796904ca84d2deda1f4166881484516336b13eddff54f276144f676",
          "md5": "5bb0349a166edcc26bac4bc43ac1a46e",
          "sha256": "9c8f2f94bd2a2fc21f7493664e09c25ddb6fd3281b00c3842cb226557e1d750e"
        },
        "downloads": -1,
        "filename": "perf_ssr-0.2.2.tar.gz",
        "has_sig": false,
        "md5_digest": "5bb0349a166edcc26bac4bc43ac1a46e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 156522,
        "upload_time": "2017-10-08T07:14:21",
        "upload_time_iso_8601": "2017-10-08T07:14:21.873131Z",
        "url": "https://files.pythonhosted.org/packages/ba/11/ced11796904ca84d2deda1f4166881484516336b13eddff54f276144f676/perf_ssr-0.2.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ce578e010fd7efcc83b91f0c1f02915bd79207d25c6d731b5589553866a51984",
          "md5": "c63534533c6975d1d0b3f21805ffc2f5",
          "sha256": "6cf1f304f5c8f57a3a7e113f84586d2ea0673145f4010f439d180cf798e231e1"
        },
        "downloads": -1,
        "filename": "perf_ssr-0.2.3.tar.gz",
        "has_sig": false,
        "md5_digest": "c63534533c6975d1d0b3f21805ffc2f5",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 128126,
        "upload_time": "2017-10-08T08:56:51",
        "upload_time_iso_8601": "2017-10-08T08:56:51.337226Z",
        "url": "https://files.pythonhosted.org/packages/ce/57/8e010fd7efcc83b91f0c1f02915bd79207d25c6d731b5589553866a51984/perf_ssr-0.2.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "940e917a54b552efd3520090e07bd54e7bcd94d3f0a48320eef385ef91cc576b",
          "md5": "09149045ee74aa8a21db47c1b47a68c2",
          "sha256": "99af4d13c4e369eae7d453dcc7abb5e9ff68f250939a1feb81086aad2dfccdca"
        },
        "downloads": -1,
        "filename": "perf_ssr-0.2.4.tar.gz",
        "has_sig": false,
        "md5_digest": "09149045ee74aa8a21db47c1b47a68c2",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 128134,
        "upload_time": "2017-10-08T09:36:37",
        "upload_time_iso_8601": "2017-10-08T09:36:37.267903Z",
        "url": "https://files.pythonhosted.org/packages/94/0e/917a54b552efd3520090e07bd54e7bcd94d3f0a48320eef385ef91cc576b/perf_ssr-0.2.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "703b278417a122788e4ecae0f890c5abe4f35b1d1e9ecb950297607817e16def",
          "md5": "d08da1be84b04ce2034d1e51952b45ca",
          "sha256": "100e720446bcae63023395c8b1b1ae51ecde80386ff930afea166a5bc41dcc23"
        },
        "downloads": -1,
        "filename": "perf_ssr-0.2.5-py3.5.egg",
        "has_sig": false,
        "md5_digest": "d08da1be84b04ce2034d1e51952b45ca",
        "packagetype": "bdist_egg",
        "python_version": "3.5",
        "requires_python": null,
        "size": 142493,
        "upload_time": "2020-05-06T12:43:56",
        "upload_time_iso_8601": "2020-05-06T12:43:56.651438Z",
        "url": "https://files.pythonhosted.org/packages/70/3b/278417a122788e4ecae0f890c5abe4f35b1d1e9ecb950297607817e16def/perf_ssr-0.2.5-py3.5.egg",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "64bc299b58ab934a1ad6c353d541cb8c45a09b8c0bcb2ba2854bc198472204b0",
          "md5": "9e6bda58778eacb7c06f548d260cebbf",
          "sha256": "66bd5088665b1d07784ab96173908ef7d55fac9e709c6607a80d978cb0b5a4d9"
        },
        "downloads": -1,
        "filename": "perf_ssr-0.2.5.tar.gz",
        "has_sig": false,
        "md5_digest": "9e6bda58778eacb7c06f548d260cebbf",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 129487,
        "upload_time": "2017-10-19T07:21:21",
        "upload_time_iso_8601": "2017-10-19T07:21:21.743863Z",
        "url": "https://files.pythonhosted.org/packages/64/bc/299b58ab934a1ad6c353d541cb8c45a09b8c0bcb2ba2854bc198472204b0/perf_ssr-0.2.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.4.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "38ae5f48851c77d2cd5cd8a29776b90495c34d22c2617f1cc3f989227d7d9f6b",
          "md5": "2c4ac09bef4c4f927029d69b6415b75b",
          "sha256": "79e5ff878c7f83e3037614010e4f71758fd16d2826e27966694d4e9aed9298df"
        },
        "downloads": -1,
        "filename": "perf_ssr-0.4.4.tar.gz",
        "has_sig": false,
        "md5_digest": "2c4ac09bef4c4f927029d69b6415b75b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 820458,
        "upload_time": "2020-05-07T05:49:29",
        "upload_time_iso_8601": "2020-05-07T05:49:29.233879Z",
        "url": "https://files.pythonhosted.org/packages/38/ae/5f48851c77d2cd5cd8a29776b90495c34d22c2617f1cc3f989227d7d9f6b/perf_ssr-0.4.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.4.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a6e784d850154a831a934391933ab0a4dae4beb6ead1715a4325841dcf460471",
          "md5": "2155dfe219fa379fb479c907df1e6336",
          "sha256": "a5ca804db69d7ceda1b343b8a0bd0d50f5168f284ef52e94c76cc79061629e26"
        },
        "downloads": -1,
        "filename": "perf_ssr-0.4.5.tar.gz",
        "has_sig": false,
        "md5_digest": "2155dfe219fa379fb479c907df1e6336",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 824488,
        "upload_time": "2020-05-11T12:19:52",
        "upload_time_iso_8601": "2020-05-11T12:19:52.592207Z",
        "url": "https://files.pythonhosted.org/packages/a6/e7/84d850154a831a934391933ab0a4dae4beb6ead1715a4325841dcf460471/perf_ssr-0.4.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.4.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "adb5fee87f84df9b305a25aa8da27e41e27af0918ca95aa883334f805ae1bbb4",
          "md5": "f1b19e5a22449fc09a3695dad650088c",
          "sha256": "a871c4abcb9d1912a85f4a7121b7dae0d588478d6f3a5fbc57b0492a41b5fbf4"
        },
        "downloads": -1,
        "filename": "perf_ssr-0.4.6-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "f1b19e5a22449fc09a3695dad650088c",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 944309,
        "upload_time": "2021-04-22T05:57:34",
        "upload_time_iso_8601": "2021-04-22T05:57:34.674786Z",
        "url": "https://files.pythonhosted.org/packages/ad/b5/fee87f84df9b305a25aa8da27e41e27af0918ca95aa883334f805ae1bbb4/perf_ssr-0.4.6-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0fe35a994ec65ff20758351244ccd4976d0caaa0afe77ced6a5eecc01ee37391",
          "md5": "9d2448236a44978d5b011f3848e9e0d3",
          "sha256": "8ad5df083d3b560fb4cd9d64ab1bf1e74127a0f720e1e4f4e85f2cbb86d9059f"
        },
        "downloads": -1,
        "filename": "perf_ssr-0.4.6.tar.gz",
        "has_sig": false,
        "md5_digest": "9d2448236a44978d5b011f3848e9e0d3",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 834096,
        "upload_time": "2021-04-22T05:57:37",
        "upload_time_iso_8601": "2021-04-22T05:57:37.222857Z",
        "url": "https://files.pythonhosted.org/packages/0f/e3/5a994ec65ff20758351244ccd4976d0caaa0afe77ced6a5eecc01ee37391/perf_ssr-0.4.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.4.8": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f42d837ba7a52f75bb52e9d7f586c290b3d6ab384cdebdf4b6d2c38399e286be",
          "md5": "d65ae8bbd8d3b85c014a092700a9d428",
          "sha256": "3f937f64bd665ab9e0cc7413622516704b6e1eeecb1da384d5c9954615e0fc40"
        },
        "downloads": -1,
        "filename": "perf_ssr-0.4.8-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "d65ae8bbd8d3b85c014a092700a9d428",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 944341,
        "upload_time": "2022-06-14T11:02:30",
        "upload_time_iso_8601": "2022-06-14T11:02:30.920193Z",
        "url": "https://files.pythonhosted.org/packages/f4/2d/837ba7a52f75bb52e9d7f586c290b3d6ab384cdebdf4b6d2c38399e286be/perf_ssr-0.4.8-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "dd3fd5ca89440d2ef0059595b8844d4b99138a4f00cc2096336436dbdd44ea58",
          "md5": "b9275561ec3bc131c525ee0c30a0a1ee",
          "sha256": "772b3dbaed1a0f0b2019248dc7afafb0148f8521ac8cb82b12cf34031ef5ef1a"
        },
        "downloads": -1,
        "filename": "perf_ssr-0.4.8.tar.gz",
        "has_sig": false,
        "md5_digest": "b9275561ec3bc131c525ee0c30a0a1ee",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 828681,
        "upload_time": "2022-06-14T11:02:33",
        "upload_time_iso_8601": "2022-06-14T11:02:33.792711Z",
        "url": "https://files.pythonhosted.org/packages/dd/3f/d5ca89440d2ef0059595b8844d4b99138a4f00cc2096336436dbdd44ea58/perf_ssr-0.4.8.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "f42d837ba7a52f75bb52e9d7f586c290b3d6ab384cdebdf4b6d2c38399e286be",
        "md5": "d65ae8bbd8d3b85c014a092700a9d428",
        "sha256": "3f937f64bd665ab9e0cc7413622516704b6e1eeecb1da384d5c9954615e0fc40"
      },
      "downloads": -1,
      "filename": "perf_ssr-0.4.8-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "d65ae8bbd8d3b85c014a092700a9d428",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 944341,
      "upload_time": "2022-06-14T11:02:30",
      "upload_time_iso_8601": "2022-06-14T11:02:30.920193Z",
      "url": "https://files.pythonhosted.org/packages/f4/2d/837ba7a52f75bb52e9d7f586c290b3d6ab384cdebdf4b6d2c38399e286be/perf_ssr-0.4.8-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "dd3fd5ca89440d2ef0059595b8844d4b99138a4f00cc2096336436dbdd44ea58",
        "md5": "b9275561ec3bc131c525ee0c30a0a1ee",
        "sha256": "772b3dbaed1a0f0b2019248dc7afafb0148f8521ac8cb82b12cf34031ef5ef1a"
      },
      "downloads": -1,
      "filename": "perf_ssr-0.4.8.tar.gz",
      "has_sig": false,
      "md5_digest": "b9275561ec3bc131c525ee0c30a0a1ee",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 828681,
      "upload_time": "2022-06-14T11:02:33",
      "upload_time_iso_8601": "2022-06-14T11:02:33.792711Z",
      "url": "https://files.pythonhosted.org/packages/dd/3f/d5ca89440d2ef0059595b8844d4b99138a4f00cc2096336436dbdd44ea58/perf_ssr-0.4.8.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}