{
  "info": {
    "author": "",
    "author_email": "Stefan Hagen <stefan@hagen.link>",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 3 - Alpha",
      "Intended Audience :: Developers",
      "License :: OSI Approved :: MIT License",
      "Programming Language :: Python :: 3.10",
      "Programming Language :: Python :: 3.8",
      "Programming Language :: Python :: 3.9"
    ],
    "description": "# piemap\n\nOne-view visualization of grouped characterizations (Quality Pie).\n\n[License: MIT](https://git.sr.ht/~sthagen/piemap/tree/default/item/LICENSE)\n\n[![version](https://img.shields.io/pypi/v/piemap.svg?style=flat)](https://pypi.python.org/pypi/piemap/)\n[![downloads](https://pepy.tech/badge/piemap/month)](https://pepy.tech/project/piemap)\n[![wheel](https://img.shields.io/pypi/wheel/piemap.svg?style=flat)](https://pypi.python.org/pypi/piemap/)\n[![supported-versions](https://img.shields.io/pypi/pyversions/piemap.svg?style=flat)](https://pypi.python.org/pypi/piemap/)\n[![supported-implementations](https://img.shields.io/pypi/implementation/piemap.svg?style=flat)](https://pypi.python.org/pypi/piemap/)\n\n## Documentation\n\nUser and developer [documentation of piemap](https://codes.dilettant.life/docs/piemap).\n\n## Bug Tracker\n\nFeature requests and bug reports are best entered in the [todos of piemap](https://todo.sr.ht/~sthagen/piemap).\n\n## Primary Source repository\n\nThe primary source of `piemap` lives somewhere on a mountain in Central Switzerland.\nBut, we use decentralized version control (git), so any clone can become the source to everyone's benefit, no central only code.\nAnyway, the preferred public clones of `piemap` are:\n\n* [on codeberg](https://codeberg.org/sthagen/piemap) - a democratic community-driven, non-profit software development platform operated by Codeberg e.V.\n* [at sourcehut](https://git.sr.ht/~sthagen/piemap) - a collection of tools useful for software development.\n\n## Status\n\nExperimental\n\n## Short How to Quality Pie\n\n*(From HowTo of Reference Implementation)*\n\n* The tool uses a simple text area (shown below), to accept lines of semicolon-separated entries of data (point or comma are both accepted as floating point separators for all numeric input values).\n* The general format for data lines is:\n  AXIS_NO;AXIS_NAME;AXIS_TYPE;MIN;LIMIT;MAX;VALUE;UNIT where usually only LIMIT, MAX and VALUE must be set. \n Thus a minimal valid input data set could be a one liner like: ;;;;1;2;0.8; producing one full circle sector not quite reaching the limit.\n\n* The sectors are plotted clockwise starting at 12:00 in the sequence the lines of data are input. The first entry of each line may override this by explicitly setting this number (starting at 0).\n\n* The default axis type is LINEAR. Other types like FOLDED, CATEGORIAL or BIMONOTONE have to be requested by entering the respective keyword into the third column of the data line.\n\n* The axis types LINEAR, FOLDED and CATEGORIAL result in scaling the area (CATEGORIAL equally spaced), whereas the axis type BIMONOTONE is scaled linear with respect to the radius.\n\n* The axis type ORDER may be used to introduce ordered categorial scales (based on a declaration of the set of ordered values):\n    1. Declaration: ORDER_DT;DUMMY;2c;2b;2a;1 eg. for doubletalk type. The lowest (leftmost value) will be placed at the origin of the segment. \n       An axis definition might then be: ;DT Type;ORDER_DT;;2b;1;2c;\n    2. Declaration: ORDER_LC;ORIGIN;not ok;LIMIT_VALUE;ok eg. for \"Live Call\". The (never occurring) placeholder LIMIT_VALUE will be placed at the limit of the segment.\n\n* The axis type BIMONOTONE scales linear (in the radius, not the area) from Origin to Limit and from Limit to Outer circle and thus needs declaration of a Value corresponding to the origin.\n\n* A title can be set by adding a line like eg. SHOW_TITLE;A long title for the plot\n* For the picture title and for the segment labeling, a pipe symbol, i.e. \"|\" will cause a line break.\n* The display of the values reached may be enabled by adding a line like eg. SHOW_VALUE;1\n* The display of the units may be disabled by adding a line like eg. SHOW_UNIT;0\n* Appending a SHOW_abc to an axis definition line, toggles the state of the global definition of SHOW_abc.\n* The default coloring may be changed by adding a line like eg. COLORING_DEFAULT;#FFFFFF;#DD0000;#FFFF20;#008800 or amended by adding a line like eg. COLORING_OPTIONAL;#FFFFFF;#FF2020;#FFFF20;#77FF20. \n  The keyword COLORING_DEFAULT is magic and used for each axis per default. The entries following the COLORING* keyword are hexadecimal RGB values with # as prefix and are mapped onto NULL, MIN, LIMIT, MAX. Non-matching inputs are rewritten as #FFFFFF. \n   If another coloring scheme shall be used per axis, this must be declared as additional entry in the axis declaration following the usual entries by referencing the relevant coloring label, eg. ;;;;1;2;0.8;;COLORING_OPTIONAL.\n\n* By pressing the button “Parse and plot” you will get the result in the right hand area(s) if your browser has session cookies enabled\n\n## ... as in ITU-T P.505\n\n*(Informational text of Reference Implementation)*\n\n### Preface\n\nThe numerous complex parameters that determine the quality of telecommunication equipment as well as end-to-end quality can be interpreted by technical experts only.\n\nThis tool provides a novel quality representation methodology which is easy to use and also easy to understand for non-experts and which can serve as a basis for commercial decisions on a management or marketing level with\n\n* Quick and easy recognition of expected speech quality problems for selected parameters (limit value violation);\n* Assessment of strengths and weaknesses of signal processing implemented in a terminal or other telecommunication equipment, including end-to-end considerations (quality statement);\n* Easy comparison of different equipment or connections based on the corresponding representations;\n* Easy extension of the representation by new parameters relevant to quality in the future.\n\n### Introduction\n\nThe one-view visualization methodology is based on the allocation of individual circle segments to the selected parameters - the so-called \"quality pie\"; a maximum number of 16 different segments is considered here for practical reasons.\n\nThe total number of parameters represented determines the size of the individual segments in the quality pie. The axes are shown with a common origin. The individual circle segments have the same size (spanned angle 360° divided by number of selected quality parameters).\n\nThe representation of individual segment sizes is not interdependent, thus guaranteeing the independence of the different quality parameters from each other, which leads to the following advantages:\n\n* Independent representation of individual quality parameters.\n* Segment sizes are determined by the number of selected parameters and are identical.\n* Segment size (radius) is a measure for the quality regarding this parameter.\n* A concentric circle around the origin is defined (1/√2) which represents a minimum quality measure; falling below this segment size (radius) indicates a non-compliance with this limit value.\n* By means of a suitable colour selection results lying within the tolerance or transgressing the limit values can be easily visualized.\n\nThis online application of P.505 can help you to produce high quality graphs for your individual set of parameters. It is intended to support the use of this methodology in the field, e.g. for recurring reporting task, but also for benchmarking or for test events.\n\n### Types of axes\n\nThe advantage of this tool is the ability to use different types of axes (scalings) within one quality pie, depending on your needs. There are four different types of axes. It is very important to first of all select the right type of axis for each parameter you want to display. The types itself are explained below, whereas the application of them is explained under ‘operating the tool’.\n\n#### LINEAR\n\nThe linear axis type is scaling the area, based on the input values for minimum, limit and maximum.\n\nThe minimum value cannot be specified, it will be determined by continuing the scale defined by limit and maximum values. Any entries in the MIN section will be ignored.\n\n#### FOLDED\n\nThe folded axis type is scaling the area and (quite similar to the linear axis type) with the important exception that this scale is literally folded.\n\nThe maximum value is not a numerical maximum but rather an optimum, for the limit there will be two values, i.e.:\n\n1.) LIMIT\n2.) 2×MAX - LIMIT\n\nThe minimum value will be determined in the same way as for the linear scale, i.e. any entries in the MIN section will be ignored and both the scale ends will be calculated as predefined by the limit and maximum values.\n\n#### BI-MONOTONE\n\nThe axis type BI-MONOTONE scales linear (in the radius, not the area) from the origin to the limit and from the limit to the maximum.\n\nIt therefore requires the input of a minimum value. The scales in both segments of the axis can be as much different as desired.\n\n#### CATEGORIAL\n\nThe categorial axis type is scaling the area, equally spaced, and can be used to display results, which are achieved without a scale.\n\nFor the data input lines this type is also referred to as ORDER*. The axis type ORDER* may be used to introduce ordered categorical scales (based on a declaration of the set of ordered values), see the following two examples:\n\n1.) Declaration: ORDER_DT;DUMMY;2c;2b;2a;1 e.g. for doubletalk type.\n\nThe placeholder \"DUMMY\" is used to initiate the axis at the origin of the segment.\n\nAn axis definition might then be: ;DT Type;ORDER_DT;;2b;1;2c;\n\n2.) Declaration: ORDER_LC;ORIGIN;not ok;LIMIT_VALUE;ok e.g. for \"Live Call\".\n\nThe placeholder \"ORIGIN\" is used to initiate the axis at the origin of the segment, whereas the placeholder \"LIMIT_VALUE\" is used to define the axis across the limit circle of the segment.\n\nOther ordered categorial scales can be defined as needed, but care has to be taken that the categories can be ordered in the same dimension; e.g.:\n\n* \"Very Good, Good, Fair, Poor, Bad\" can be ordered with sense;\n* \"Loud, Good, Noisy, Poor\" cannot be ordered because different dimensions are used.\n\n### Operating the tool\n\nThe composition of the data input lines is done in the text box on the left side of the browser window.\n\nThe separation of commands within one line is done by semicolon (;). For many parameters no entry renders a default value. Both, point (.) and comma (,) are accepted as decimal separator.\n\nThere are separate data input lines for labelling of the quality pie and it segments. You can select a title for the plot and decide whether values and units should be displayed along with the segments.\n\nFor practical reasons you import and export your settings and values to and from your own excel spreadsheet(s). As a starting point it might useful to export the default quality pie from the website into an excel spreadsheet and start working from there on.\n\nThe \"Template\" tab contains the set of data input lines, which will produce the quality pies as contained in P.505. They can be used as a good starting point to derive easily similar quality pies.\n\nThe sectors are plotted clockwise starting at 12:00 in the sequence the data input lines are listed.\n\nThe general format for data input lines creating segments is:\n\nAXIS_NO;AXIS_NAME;AXIS_TYPE;MIN;LIMIT;MAX;VALUE;UNIT where usually only LIMIT, MAX and VALUE must be set.\n\nThese data input lines have to be written for each segment that should be created. Below the data input field buttons are placed which assist to create data input lines corresponding to the four different types of axes.\n\n#### AXIS_NO\n\nThis entry means axis number, which by default is the consecutive number in the order of the segment command lines. Thus switching the segment command lines will result in switching the segments in the quality pie, unless explicitly numbered (starting at 0).\n\n#### AXIS_NAME\n\nThis entry can be used to display the name of the parameter next to the outer end of the segment, if not switched off by a global setting.\n\n#### AXIS_TYPE\n\nThis entry can be used to select the type of axis as explained above; the default setting is LINEAR.\n\n#### MIN\n\nThe minimum value of the axis; for linear and folded scales any entries in this section will be ignored; the categorial scale does also not make direct use of minimum values.\n\n#### LIMIT\n\nLimit between result values considered ok and result values considered not ok. In the case of the FOLDED axis type, there will be two values displayed:\n\n1.) LIMIT\n\n2.) 2×MAX - LIMIT\n\n#### MAX\n\nMaximum or optimum value of the axis that can be reached for this parameter.\n\n#### VALUE\n\nActually achieved result value for each parameter; this determines the actual size of the coloured areas; the display of the value itself next to the outer end of the segment can be enabled by a global setting.\n\n#### UNIT\n\nThis entry can be used to add a unit to the result value, if not disabled by a global setting.\n\nA pipe symbol, i.e. \"|\" will cause a line break.\n\n#### Global data input lines affecting the entire pie chart are\n\nFor the picture title and for the segment labelling, a pipe symbol, i.e. \"|\" will cause a line break.\n\nA title for the pie chart can be set by adding a line like e.g. SHOW_TITLE;A long title for the plot.\n\nThe display of the result values achieved may be enabled by adding a line like e.g. SHOW_VALUE;1.\n\nThe display of the units may be disabled by adding a line like e.g. SHOW_UNIT;0.\n\nAppending a SHOW* to an axis definition line, toggles the state of the global definition of SHOW*; where * can be UNIT or TITLE.\n\nThe default coloring may be changed by adding a line like e.g. COLORING_DEFAULT;#FFFFFF;#DD0000;#FFFF20;#008800.\n\nThe entries following the COLORING* keyword are hexadecimal RGB values with # as prefix and are mapped onto NULL, MIN, LIMIT, MAX. Non-matching inputs are rewritten as #FFFFFF.\n\nIf different coloring schemes should be used per axis, they must be declared as additional entries in the data input lines appended to the general format, explained above, and referring to the relevant coloring label, e.g. ;;;;1;2;0.8;;COLORING*.\n\nOf course, such COLORING* settings should be defined before they can be referred to, e.g.\n\nCOLORING_Eagle;#FFFFFF;#FF2020;#FFFF20;#77FF20.\n\n#### Resulting Pie Chart\n\nBy pressing the button “Parse and plot” the resulting pie chart will be displayed in the right hand area(s) if your browser has session cookies enabled.\n\nDepending on your browser settings, display etc., some details may not be displayed as expected; click onto the pie chart to see the original (i.e. larger) picture, which should be ok.\n\nThe input data lines together with the quality pie can be exported to Excel or the graph can be saved in jpg or png format, respectively.\n\n### Parameters\n\nExamples of speech quality parameters together with typical values are to be found in Recommendation ITU-T P.505.\n\nHowever, the application of this tool is not limited to such parameters. In general, any kind of quality related parameters can be used. However, it is recommended to carefully select a set of parameters which is reflecting all aspects of the quality for the topic or device under consideration, e.g.: selecting only parameters with respect to the receiving channel might not be a balanced decision when attempting to benchmark mobile telephone sets.\n\n**Note**: The default branch is `default`.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "developer-tools,visualization",
    "license": "",
    "maintainer": "",
    "maintainer_email": "Stefan Hagen <stefan@hagen.link>",
    "name": "piemap",
    "package_url": "https://pypi.org/project/piemap/",
    "platform": null,
    "project_url": "https://pypi.org/project/piemap/",
    "project_urls": {
      "Bug-Tracker": "https://todo.sr.ht/~sthagen/piemap",
      "Documentation": "https://codes.dilettant.life/docs/piemap",
      "Homepage": "https://git.sr.ht/~sthagen/piemap",
      "Source-Code": "https://git.sr.ht/~sthagen/piemap",
      "Test-Coverage": "https://codes.dilettant.life/coverage/piemap"
    },
    "release_url": "https://pypi.org/project/piemap/2022.10.2/",
    "requires_dist": [
      "typer (>=0.6.1)",
      "black ; extra == 'dev'",
      "coverage ; extra == 'dev'",
      "flake8 ; extra == 'dev'",
      "hypothesis ; extra == 'dev'",
      "mypy ; extra == 'dev'",
      "pytest ; extra == 'dev'",
      "pytest-cov ; extra == 'dev'",
      "pytest-flake8 ; extra == 'dev'"
    ],
    "requires_python": ">=3.8",
    "summary": "One-view visualization of grouped characterizations (Quality Pie).",
    "version": "2022.10.2",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 15281449,
  "releases": {
    "2022.10.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "eb3f251f082b0f980329bea1153a1b523b704682edaf5329f5d80b3df070f7ee",
          "md5": "7748ae3b75434ce3600e6f81a04ccabf",
          "sha256": "35deb50f315ed0750ad7631303540eb9687ceb3675589773ee12f310c2fb8a1e"
        },
        "downloads": -1,
        "filename": "piemap-2022.10.2-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "7748ae3b75434ce3600e6f81a04ccabf",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": ">=3.8",
        "size": 17287,
        "upload_time": "2022-10-02T13:14:07",
        "upload_time_iso_8601": "2022-10-02T13:14:07.107903Z",
        "url": "https://files.pythonhosted.org/packages/eb/3f/251f082b0f980329bea1153a1b523b704682edaf5329f5d80b3df070f7ee/piemap-2022.10.2-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "49177025c61835bb1d5f3bc97e5265897777be99add17b5b3c0a4a3ddc996fdb",
          "md5": "b6e869b1b56f9e124e1694aefa3505f1",
          "sha256": "f8fed3ccc13052a4c6050df5fd7e852595a0d5022fde63977fbc454e2fc35e20"
        },
        "downloads": -1,
        "filename": "piemap-2022.10.2.tar.gz",
        "has_sig": false,
        "md5_digest": "b6e869b1b56f9e124e1694aefa3505f1",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 48871,
        "upload_time": "2022-10-02T13:14:08",
        "upload_time_iso_8601": "2022-10-02T13:14:08.863832Z",
        "url": "https://files.pythonhosted.org/packages/49/17/7025c61835bb1d5f3bc97e5265897777be99add17b5b3c0a4a3ddc996fdb/piemap-2022.10.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2022.7.30": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "613daac4548598402c08437d0ece1715f078b9c93fb1dc27c59d03910beb1a4f",
          "md5": "52826f1f5b9bb700d7e6aeb440b6114c",
          "sha256": "9cfdcd29285b229eef0132b77eb0fa489868a49a9ada4b8910e6350e952ddb1d"
        },
        "downloads": -1,
        "filename": "piemap-2022.7.30-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "52826f1f5b9bb700d7e6aeb440b6114c",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": ">=3.8",
        "size": 23781,
        "upload_time": "2022-07-31T16:44:34",
        "upload_time_iso_8601": "2022-07-31T16:44:34.838808Z",
        "url": "https://files.pythonhosted.org/packages/61/3d/aac4548598402c08437d0ece1715f078b9c93fb1dc27c59d03910beb1a4f/piemap-2022.7.30-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "359acc103dc03fef05ff8e60da0b7df105a3167189a43379065e100696a51757",
          "md5": "34a0427f9d7458032a0846fcccf7a320",
          "sha256": "994e481d8b2d1593856e3fac1b217063c13536fd33ef5e0d28d5682e86412ec0"
        },
        "downloads": -1,
        "filename": "piemap-2022.7.30.tar.gz",
        "has_sig": false,
        "md5_digest": "34a0427f9d7458032a0846fcccf7a320",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 42263,
        "upload_time": "2022-07-31T16:44:36",
        "upload_time_iso_8601": "2022-07-31T16:44:36.581002Z",
        "url": "https://files.pythonhosted.org/packages/35/9a/cc103dc03fef05ff8e60da0b7df105a3167189a43379065e100696a51757/piemap-2022.7.30.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "eb3f251f082b0f980329bea1153a1b523b704682edaf5329f5d80b3df070f7ee",
        "md5": "7748ae3b75434ce3600e6f81a04ccabf",
        "sha256": "35deb50f315ed0750ad7631303540eb9687ceb3675589773ee12f310c2fb8a1e"
      },
      "downloads": -1,
      "filename": "piemap-2022.10.2-py2.py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "7748ae3b75434ce3600e6f81a04ccabf",
      "packagetype": "bdist_wheel",
      "python_version": "py2.py3",
      "requires_python": ">=3.8",
      "size": 17287,
      "upload_time": "2022-10-02T13:14:07",
      "upload_time_iso_8601": "2022-10-02T13:14:07.107903Z",
      "url": "https://files.pythonhosted.org/packages/eb/3f/251f082b0f980329bea1153a1b523b704682edaf5329f5d80b3df070f7ee/piemap-2022.10.2-py2.py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "49177025c61835bb1d5f3bc97e5265897777be99add17b5b3c0a4a3ddc996fdb",
        "md5": "b6e869b1b56f9e124e1694aefa3505f1",
        "sha256": "f8fed3ccc13052a4c6050df5fd7e852595a0d5022fde63977fbc454e2fc35e20"
      },
      "downloads": -1,
      "filename": "piemap-2022.10.2.tar.gz",
      "has_sig": false,
      "md5_digest": "b6e869b1b56f9e124e1694aefa3505f1",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.8",
      "size": 48871,
      "upload_time": "2022-10-02T13:14:08",
      "upload_time_iso_8601": "2022-10-02T13:14:08.863832Z",
      "url": "https://files.pythonhosted.org/packages/49/17/7025c61835bb1d5f3bc97e5265897777be99add17b5b3c0a4a3ddc996fdb/piemap-2022.10.2.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}