{
  "info": {
    "author": "zaphB",
    "author_email": "",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "# Human-Readble-Ascii to gdsII Converter\n\nPolyp is a renderer that creates gdsII layout files from an all-ascii human-readble layout language. Geometric shapes are constructed from primitive shapes, e.g., squares, circles or text, that are translated, rotated, scaled or otherwise transformed and can be added, subtracted or intersected with each other.\n\nPolyp is definitely interesting for you if you\n* are not afraid of using the command line\n* have experience with drawing gdsII files\n* are a fan of mark-up languages\n\nPolyp is probably not for you if you\n* prefer manually drawing geometry\n* fell uncomfortable using the command line\n\nA minimal example is shown in the following:\n\n```\nSYMBOL main\n  LAYER 0\n    rect(10).rotate(45) - text(\"hello world\", dy=3)\n```\n\nIf this is saved in a text file `minimal.pls` it can be compile with the command\n\n```\npolyp minimal.pls\n```\n\nThis creates a gdsII file `minimal.gds` containing a single symbol with the name `main` that contains a shape in layer 0. This shape is given by a square with side length 10, rotated by 45 degrees, from which the text 'hello world' with height 3 is cut-out. For more advanced examples see the examples section of this readme.\n\n\n# Installation\n\nInstall polyp and its dependencies with\n\n```\npip install polyp\n```\n\nExecuting `polyp -h` on the shell should now show the polyp quick help, `polyp --ersion` should show the expected version number.\n\n\n# Basic usage\n\nTo compile a .pls polyp layout script to a .gds file, run `polyp filename`, where `filename` has to be replaced with the path of the .pls file.\n\nPassing the `-v` option (`polyp -v filename`) compiles the layout script and opens a simple viewer afterwards.\n\nPassing the `-w` option keeps checkign the .pls file for updates, recompiles it in case a change in the file is detected and keeps the compiled result open in a viewer.\n\nIf the `-p` option is passed to polyp, the layout script is compiled to .pdf instead of .gds. One pdf file is created for each gdsII symbol.\n\n\n# Examples\n\nThis list of examples starts from a minimal .pls example and moves to more and more complex layout scripts step by step. A formal documentation of the polyp layout language is currently not available, feel free to contact me or open an issue in case this is needed.\n\n\n## Minimal example\n\nA minimal layout script example looks like this:\n\n```\nSYMBOL main\n  LAYER 0\n    rect(10)\n```\n\nThe capitalized `SYMBOL` and `LAYER` context keywords have to be placed in the beginning of a line and mark the beginning of a symbol or layer context. Note that the indentation used in these examples is not required for the scripts to compile successfully, but improves readability.\n\nThe last line `rect(10)` of this example creates a geometric shape, namely a 10x10 square. Since the `rect` is placed inside the `SYMBOL` and `LAYER` contexts, it will be placed in the gdsII symbol named `main` and in layer `0` in the resulting .gds file. Create a text file with the above content, name it `test.pls`, compile it with `polyp -v text.pls`, and see for yourself!\n\n\n## Using different layers and symbol names\n\nThe following example shows how geometry can be added to different layers and symbols:\n\n```\nSYMBOL main\n  LAYER 1\n    rect(10)\n  LAYER 2\n    polygon([0,0], [0,10], [-5,5])\n\nSYMBOL sub\n  LAYER 1\n    rect(5, 10)\n```\n\nThe line `rect(10)` again creates a 10x10 square in symbol main, layer 1. The `polygon(...)` built-in creates a polygon using the passed list of coordinates. Coordinates are specified as a comma separated pair of numbers enclosed in square brackets `[...]` in polyp layout scripts. The `polygon(...)` line is placed after `LAYER 2`, hence the resulting polygon is placed in layer 2 of the gds file.\n\nThe line `SYMBOL sub` then switches the active symbol from `main` to `sub`, hence all following geometry is placed in the symbol `sub`. In this case, the last line `rect(5, 10)` creates a rectangle of 5 units width and 10 units height.\n\n\n## Creating text\n\nThe built-in `text(...)` creates geometry defined by a string of characters. The named parameter `dx` or `dy` must be present to specify the resulting text's height or width. For example `text(\"hello world\", dy=10)` creates a geometry reading \"hello world\" with a height of 10 units.\n\nThe text is placed with the shape's center of mass placed at [0,0] by default. Optionally, an anchor position can be specified by passing a named parameter `n`, `e`, `s`, `w`, `ne`, `se`, `sw`, or `nw`, which places the text such that the respective side or corner of the bounding box is placed at the given position. For example the line `text(\"hello world\", se=[0,0])` places the lower left corner of the text geometry on the point [0,0].\n\n\n## Other ways to call `rect(...)`\n\nWe already saw that calling rect with a single parameter creates a square with the respective side length. It is also possible to pass two numeric parameters, e.g. `rect(5, 10)`, to create a rectangle with the given width and height. In addition, an anchor position can be specified by passing a named argument `n`, `e`, `s`, `w`, `ne`, `se`, `sw`, or `nw`, analogous to `text(...)`.\n\n\n## Geometric sum, difference and intersect operations\n\nIn polyp layout scripts, geometric objects can be easily added, subtracted or intersected with each other using the arithmetic operators `+`, `-` and `*`, respectively:\n\n```\nSYMBOL main\n  LAYER 1\n    rect(10) + polygon([0,0], [0,10], [-5,5])\n  LAYER 2\n    rect(10) - polygon([0,0], [0,10], [-5,5])\n  LAYER 3\n    rect(10) * polygon([0,0], [0,10], [-5,5])\n```\n\nIn this example, the sum of the square and the polygon is placed in layer 1, the difference is placed in layer 2, and the intersection of both is placed in layer 3.\n\n\n## Translate, rotate, mirror, grow, round, array\n\nEvery geometric shape supports a number of transformations that can be invoked by appending a `.` and the respective transformation:\n\n### Translate\n\nTo shift a shape to another position, use `.translate(...)`:\n\n*Relative shift:* The code line `rect(10).translate(20, 30)` creates a square with side length 10 and shifts it 20 units in x-direction and 30 units in y-direction\n\n*Absolute shift:* The code line `rect(10).translate(s=[10,20])` creates a square with side length 10 and shifts it such that the southern end of the shape is moved to the coordinate `[10, 20]`. Here, south refers to the lower middle of the shapes bounding box. All possible anchors are `n`, `e`, `s`, `w`, `ne`, `se`, `sw` and `nw`, referring to the respective corner of side of the shapes bounding box.\n\nTranslate supports the optional boolean arguement `copy`, which if set to true, causes the untranslated shape to be kept in the result, e.g. `rect(10).translate(0, 20, copy=True)`.\n\n\n### Rotate\n\nTo rotate a square by 30 degrees, use `rect(10).rotate(30)`. Optionally, the center of rotation can be specified as a second parameter: `rect(10).rotate(30, [0, 10])`. By default, the center of rotation is given by the center of mass of the rotated geometry.\n\nRotate supports the optional boolean arguement `copy`, which if set to true, causes the unrotated shape to be kept in the result, e.g. `rect(10).rotate(120, copy=True)`.\n\n\n### Mirror\n\nTo mirror a geometry at a given point or line, use the `.mirror(...)`. The following example shows three different ways of calling the method:\n\n```\nSYMBOL main\n  LAYER 1\n    polygon([0,0], [0,10], [10,0]).mirror([-5, 5], copy=True)\n  LAYER 2\n    polygon([0,0], [0,10], [10,0]).mirror(x=-5, copy=True)\n  LAYER 3\n    polygon([0,0], [0,10], [10,0]).mirror([5,10], [10,0], copy=True)\n```\n\n\n*Mirror at a given point:* Passing a single coordinate to the mirror method performs a point-reflection of the shape at the given coordinate.\n\n*Mirror at the x or y-axis:* Passing a named parameter x or y, e.g., `x=-5`, `y=10`, mirrors with respect to the implied line.\n\n*Mirror at a freely defined line:* Passing two coordinates to mirror causes the shape to be mirrored at the line that connects these to points.\n\nMirror supports the optional boolean arguement `copy`, which if set to true, causes the unmirrored shape to be kept in the result, e.g. `rect(10).mirror([20, 5], copy=True)`.\n\n### Grow/shrink\n\nTo grow or shrink a given geometry, use `.grow(...)`. Grow expects a single numeric parameter that specifies by how many units to grow the respective shape in all directions. If this number is negative, the shape is shrunk instead.\n\n### Round corners\n\nTo round all corners a given geometry, use `.round(...)`. Round expects a single numeric parameter that specifies the maximum radius of the corners after rounding.\n\n### Creating arrays of shapes\n\nTo place a shape many times in as a 1D or 2D array, use `.array(...)`. Array expects two numeric parameters that specify how often the shape should be multiplied in x and in y-direction. Two more optional parameters can be used to specify column and row spacing. The default spacing is zero, implying that the shape is repeated in x- or y-direction with a period equal to its width or height, respectively.\n\nThis example code places an array of rotated squares with and without specified column and row spacing:\n\n```\nSYMBOL main\n  LAYER 1\n    rect(10).rotate(45).array(5, 5)\n  LAYER 2\n    rect(10).rotate(45).array(5, 5, 10, 20)\n```\n\n### Calculating height, width, bounding box and center of mass\n\nThe functions `height(...)` and `width(...)` return the height and width of the shape that is passed as an argument. For example `height(rect(10))` returns 10. The function `bb(...)` returns the bounding box of a shape. The function `center(...)` returns a shapes center of mass.\n\n\n### Mathematical functions\n\nThe trigonometric functions and there inverse functions are available as `cos`, `sin`, `tan`, `asin`, `acos`, `atan`. Angles are given in units of degrees. The function `atan2` is a variant of `atan` that uses two arguments and is able to handle the full circle. See the numpy documentation of `atan2` for further details.\n\nThe function `abs(...)` returns the absolute value of the passed number. The functions `min`, `max` and `mean` return the minimum, maximum or arithmetical mean of the passed list of numbers.\n\n\n### Type conversions\n\nUse `int(...)` to convert a number to integer. Use `char(...)` to convert an integer number to the respective letter of the alphabet.\n\n\n## Defining (parametric) shapes\n\nDrawing large geometries using only primitive shapes results in large expressions that get increasingly confusing and difficult to read. To make expressions more readable, polyp allows to define named shapes with the keyword `SHAPE`:\n\n```\nSHAPE diamond()\n  rect(10).rotate(45)\n\nSYMBOL main\n  LAYER 1\n    diamond()\n  LAYER 2\n    diamond().grow(-2).round(1)\n  LAYER 3\n    diamond().translate(5, 5)\n  LAYER 3\n    diamond() - text('A', dy=5)\n```\n\nLike the `SYMBOL` and `LAYER` keywords, `SHAPE` must be upper case and placed at the beginning of a line. `SHAPE` is followed by the desired symbol name and a pair of round brackets. The following lines specify the desired geometry. In this example, the shape name is `diamond` and the geometry is given by a square rotated by 45 degrees. Later, in the layers of the symbol `main`, this shape is created using the statement `diamond()`. As shown, all available methods to manipulate geometry can also be applied to `diamond()`.\n\n**Important:** it is not possible to use gdsII references for `SHAPE`s in polyp. `SHAPE`s are always copied as often as they are used in the geometry. It is also not possible to use multiple layers in a `SHAPE`. If you want reference the same piece of geometry multiple times in your script to save memory, or if you want to define multi layered geometries, you are looking for the gdsII symbol and symbol references, which are described later in this tutorial.\n\nIt is often desirable to define shapes that use free parameters. In polyp, this can be done by specifying an argument list in the brackets of the `SHAPE` definition:\n\n```\nSHAPE label(string, height)\n  rect(width(text(string, dy=height))+3, height+1)\n    - text(string, dy=height)\n\nSYMBOL main\n  LAYER 1\n    label(\"such a nice label\", 10)\n```\n\nIn this example, the parametric shape `label` expects two parameters. The resulting geometry consists of a rectangle with the width calculated from the width of a text instance: `width(text(string, dy=height))+3`. Another text instance is then subtracted from this rectangle.\n\nTo create this parametric shape, it is required to pass the parameters to the `label(...)` call, as shown in symbol main. With this definition labels can then be conveniently created and in case the label structure should be changed later, it is possible to do so by only editing a few lines of the script.\n\n\n## Defining symbol references\n\nSymbols and symbol references are an important feature of the gdsII standard.  Symbols are created by placing symbol sections to the pls script. References are created using the `ref(...)` function:\n\n```\nSYMBOL sym1\n  LAYER 1\n    rect(10)\n\nSYMBOL sym2\n  LAYER 1\n    text('foobar', dy=10)\n\nSYMBOL main\n  ref(sym1).array(2, 2, 5, 5)\n  ref(sym2).translate(0,10).rotate(10)\n\n  LAYER 2\n    rect(5)\n```\n\nIn this example, two symbols `sym1` and `sym2` are defined, each containing a simple geometric shape on layer 1. Then the symbol `main` is defined, which contains references to both shapes. Obviously, the referenced geometry cannot be altered except for translation, rotation or array formation. Adding, subtracting, growing or rounding corners are not available for references.\n\nBecause referenced symbols already contain layer definitions, it is not necessary to place the references in `LAYER` sections. Regular shapes can be added to the symbol in addition to references using `LAYER` sections.\n\n\n## Defining and referencing parametric symbols\n\nUsing free parameters in the definition of symbols can be quite useful. In analogy to `SHAPE`s, this can be done by adding an argument list after the symbol name:\n\n```\nSYMBOL sym{}{:.0f}(a, b)\n  LAYER 1\n    rect(a).translate(-a-1, 0)\n  LAYER 2\n    rect(b).translate(a+1, 0)\n\nSYMBOL main\n  ref(sym, 10,  5)\n  ref(sym,  5,  5)\n  ref(sym,  5, 10)\n```\n\nHere, a parametric symbol with the name `sym{}{:.0f}` with two parameters `a` and `b` is defined (why there are curly braces in the name is explained below). The symbol contains translated rectangles with sizes specified by the two parameters on layer 1 and layer 2.\n\nThis parametric symbol is referenced with three different choices of `a` and `b` in the symbol `main`. The parameters are passed to the `ref()` function in addition to the symbol name.\n\nBecause the gdsII file format does not support parametric symbols, polyp will create as many gdsII symbols, as parameter choices exist in the layout script. To do so, polyp needs to be capable of creating a unique symbol name from a given parameter set. Therefore, the names of parametric symbols should contain as many `{}` placeholders as parameters exist. A placeholder is given by a pair of curly braces `{}`, optionally containing formatting options. In this example, the symbol name `sym{}{:.0f}` contains the placeholder `{}` for the parameters `a` and the placeholder `{:.0f}` for the parameter `b`. See the documentation of [python's format language](https://www.python.org/dev/peps/pep-3101/) for more details on placeholder structure.\n\n\n## Imports\n\nAny pls script can also serve as a library that can be references from other pls scripts: The `IMPORT` keyword followed by the path to another pls script allows to import shapes and symbols from the external file. Consider this example for a layout split across two different files lib.pls and main.pls:\n\nlib.pls:\n```\nSHAPE externalShape(a, b)\n  rect(a).rotate(b)\n```\n\nmain.pls:\n```\nIMPORT lib.pls\n\nSYMBOL main\n  LAYER 0\n    lib.externalShape(10, 60)\n```\n\nThe `IMPORT` in main.pls loads all definitions from lib.pls which then can be referenced by `lub.name(...)`, where name is the name defined in lib.pls. To prevent naming collisions, the symbols from a library can also be made accessible under a custom name using the `AS` keyword:\n```\nIMPORT lib.pls AS sub\n...\nsub.externalShape(...)\n```\n\n\n## Named layers\n\nThe `LAYER` context also accepts names, not only numbers:\n\n```\n...\nLAYER named_layer\n  text('foobar', dy=10)\n...\n```\n\nBecause gdsII files do not support named layers, polyp will automatically assign a layer number and create a symbol called \"legend\", in which the layer name to layer number correspondence is written. To force a specific gdsII layer number and give the layer a name at the same time, the simply pass both number and name to the `LAYER` context:\n\n```\n...\nLAYER 10 named_layer\n  text('foobar', dy=10)\n...\n```\n\n## Parameter sweeps\n\nIt is often desired to design a geometry with a free parameter and to place copies of this geometry with the free parameter being swept through a given range. Parametric geometry is possible with parametric `SHAPE`s or `SYMBOL`s, as shown before. To sweep paramters, the `.call(...)` method is used:\n\n```\nSHAPE shiftedCross(size, linewidth, xOffset, yOffset)\n  (rect(size, linewidth)\n  + rect(linewidth, size)).translate(xOffset, yOffset)\n\nSYMBOL main\n  LAYER param_sweeps\n    shiftedCross.call(start=(5,.5,36,-10), step=(0,0,6,6), stop=(0,0,55,5))\n```\n\nThis example defines a parametric shape `shiftedCross` with four free parameters. The line `shiftedCross.call(...)` then places instances of this shape with the four parameters varied as given by the `start`, `step` and `stop` arguments. The routine starts by choosing all parameters according to the `start`-list, namely `size=5`, `linewidth=.5`, `xOffset=36` and `yOffset=-10`. Each parameter is then incremented as specified by the respective number in the `step`-list until it reaches the value given in the `stop`-list. A `step` value of zero implies that the respective parameter is not swept at all. The parametric shape `shiftedCross` is created for all possible combinations of parameters.\n\n\n## Globals\n\nIn larger layouts it is helpful to maintain a central list of global parameters, e.g. linewidths, minimum paddings or spacings etc. This is done using the `GLOBALS` context in polyp layout scripts:\n\n```\nGLOBALS\n  linewidth = 15\n  width = 100\n\nSYMBOL main\n  LAYER 0\n    rect(linewidth, width)\n```\n\nThe definitions from the `GLOBALS` section can be used anywhere in the layout script.\n\n\n## Objects und unpacking\n\nObjects can be created to group globally stored parameters:\n\n```\nGLOBALS\n  optsA = {\n    linewidth = 15\n    width = 100\n  }\n  optsB = {\n    linewidth = 15\n    width = 100\n  }\n\nSHAPE wire(linewidth, width)\n  rect(linewidth, width)\n\n\nSYMBOL main\n  LAYER 0\n    wire(*optsA)\n  LAYER 1\n    wire(*optsB)\n```\n\nThe unary `*` operator applied to objects unpacks the obect into a parameter list. This way it is not necessary to write down all argument names anymore, which is helpful in layouts with many free parameters.\n\n## QR codes\n\nThe `qrcode` native creates a qr code geometry from a given string. The optional named parameters `dx` and `dy` specify the size of the resulting code in x and y directions. With the `robust` parameter (1...4, higher=more robust, default 2) the redundancy in the generated code can be adjusted. The `res` parameter controls the number of \"pixels\" used in the qrcode. By default, the `res` is automatically chosen according to the input string.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "polyp",
    "package_url": "https://pypi.org/project/polyp/",
    "platform": null,
    "project_url": "https://pypi.org/project/polyp/",
    "project_urls": null,
    "release_url": "https://pypi.org/project/polyp/1.1.1/",
    "requires_dist": [
      "numpy",
      "gdspy",
      "matplotlib",
      "qrcode"
    ],
    "requires_python": "",
    "summary": "A renderer that creates gdsII files from an all-ascii human-readble layout language",
    "version": "1.1.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 14261852,
  "releases": {
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "79758be15f0209366be5afd29c22127945ec3472815e7ba3c7763bbc65da5ae4",
          "md5": "8246e850c83e8db8660aec85958494ce",
          "sha256": "a6f2958af0475a0d4ac3a894f688f1c3538597be6a05de81f651b4387d2737d7"
        },
        "downloads": -1,
        "filename": "polyp-1.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "8246e850c83e8db8660aec85958494ce",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 27502,
        "upload_time": "2021-08-23T16:54:12",
        "upload_time_iso_8601": "2021-08-23T16:54:12.331672Z",
        "url": "https://files.pythonhosted.org/packages/79/75/8be15f0209366be5afd29c22127945ec3472815e7ba3c7763bbc65da5ae4/polyp-1.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3ef1024b98f3d8c5e44c9de7ffc436287b76ab707d24c0287accdb33a9ce11b6",
          "md5": "9c0f182770e5b59e5ac1d4f59e4692d0",
          "sha256": "3f84ea1726fe989505583a174237d8c563877cba705ef53f0a15f2229d275afd"
        },
        "downloads": -1,
        "filename": "polyp-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "9c0f182770e5b59e5ac1d4f59e4692d0",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 26288,
        "upload_time": "2021-08-23T16:54:14",
        "upload_time_iso_8601": "2021-08-23T16:54:14.210689Z",
        "url": "https://files.pythonhosted.org/packages/3e/f1/024b98f3d8c5e44c9de7ffc436287b76ab707d24c0287accdb33a9ce11b6/polyp-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7b44afd9d4f2e9e5bc7a544f674467e2104b1ec13ca565cc045ebad966c53c13",
          "md5": "b2ecc491d2950accb9ddc9e77c264c5e",
          "sha256": "9c1c469dad03a8164786b7fbe8f7e511cf6660f51f0081322c0ca76b432cd0c9"
        },
        "downloads": -1,
        "filename": "polyp-1.0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "b2ecc491d2950accb9ddc9e77c264c5e",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 32613,
        "upload_time": "2021-10-26T12:05:40",
        "upload_time_iso_8601": "2021-10-26T12:05:40.685372Z",
        "url": "https://files.pythonhosted.org/packages/7b/44/afd9d4f2e9e5bc7a544f674467e2104b1ec13ca565cc045ebad966c53c13/polyp-1.0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c7c5b8251887d38700a962ad516ce5467e12f6dfad54c8aa9003103aa867bcac",
          "md5": "17aa058d2ac57bb02ec091ab3b9574fa",
          "sha256": "f345c649f91ba442b02f4c3ab4d328b3786622dbda278d6d00a3dbecb9a17f69"
        },
        "downloads": -1,
        "filename": "polyp-1.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "17aa058d2ac57bb02ec091ab3b9574fa",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 36577,
        "upload_time": "2021-10-26T12:05:42",
        "upload_time_iso_8601": "2021-10-26T12:05:42.777316Z",
        "url": "https://files.pythonhosted.org/packages/c7/c5/b8251887d38700a962ad516ce5467e12f6dfad54c8aa9003103aa867bcac/polyp-1.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "bd7d6363544725288e9ce3ec3b3e6d337f8fce28d710810da2f983044bec55b0",
          "md5": "2a49b9512c03b4e6b92d336c3b2b2794",
          "sha256": "9529c0e10ca97b26c2bdb2ee00631e128f855397563f9802a11529f0815aff4a"
        },
        "downloads": -1,
        "filename": "polyp-1.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "2a49b9512c03b4e6b92d336c3b2b2794",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 36392,
        "upload_time": "2022-06-24T18:32:37",
        "upload_time_iso_8601": "2022-06-24T18:32:37.534371Z",
        "url": "https://files.pythonhosted.org/packages/bd/7d/6363544725288e9ce3ec3b3e6d337f8fce28d710810da2f983044bec55b0/polyp-1.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9a69d465f69e9534626135c6159863d80c5566b91b5164bb4118b5158a6b1486",
          "md5": "8f9d9f972b0deaa0e661a595aa70bc88",
          "sha256": "eb373f63f347b44cafb93dc836e2dca8d70c7bae9dabcab438dc287ced0a5326"
        },
        "downloads": -1,
        "filename": "polyp-1.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "8f9d9f972b0deaa0e661a595aa70bc88",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 41930,
        "upload_time": "2022-06-24T18:32:39",
        "upload_time_iso_8601": "2022-06-24T18:32:39.269139Z",
        "url": "https://files.pythonhosted.org/packages/9a/69/d465f69e9534626135c6159863d80c5566b91b5164bb4118b5158a6b1486/polyp-1.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2eeb7f8fb703d8dcc78a1ba2f7f0d4dba701e6e4719067d74b7c271fa4bd2583",
          "md5": "85df41c51d7bb6a1ed383211802d7994",
          "sha256": "578489784c56b97a2048987d034973ae96ad5b9f500247af4c55c971a7e57409"
        },
        "downloads": -1,
        "filename": "polyp-1.1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "85df41c51d7bb6a1ed383211802d7994",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 36671,
        "upload_time": "2022-06-27T15:37:58",
        "upload_time_iso_8601": "2022-06-27T15:37:58.452195Z",
        "url": "https://files.pythonhosted.org/packages/2e/eb/7f8fb703d8dcc78a1ba2f7f0d4dba701e6e4719067d74b7c271fa4bd2583/polyp-1.1.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "03a615301529c30521b0767b5e07ab914cd07af12f2b7c2a3394edf6d3739b66",
          "md5": "f10d8380e27305b0ce8b3eb45b08eb13",
          "sha256": "5b3820be5cb82d3485e0089d7a85dc7205be1db765bc29617d8e568b52cd2893"
        },
        "downloads": -1,
        "filename": "polyp-1.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "f10d8380e27305b0ce8b3eb45b08eb13",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 42091,
        "upload_time": "2022-06-27T15:38:08",
        "upload_time_iso_8601": "2022-06-27T15:38:08.103772Z",
        "url": "https://files.pythonhosted.org/packages/03/a6/15301529c30521b0767b5e07ab914cd07af12f2b7c2a3394edf6d3739b66/polyp-1.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "2eeb7f8fb703d8dcc78a1ba2f7f0d4dba701e6e4719067d74b7c271fa4bd2583",
        "md5": "85df41c51d7bb6a1ed383211802d7994",
        "sha256": "578489784c56b97a2048987d034973ae96ad5b9f500247af4c55c971a7e57409"
      },
      "downloads": -1,
      "filename": "polyp-1.1.1-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "85df41c51d7bb6a1ed383211802d7994",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 36671,
      "upload_time": "2022-06-27T15:37:58",
      "upload_time_iso_8601": "2022-06-27T15:37:58.452195Z",
      "url": "https://files.pythonhosted.org/packages/2e/eb/7f8fb703d8dcc78a1ba2f7f0d4dba701e6e4719067d74b7c271fa4bd2583/polyp-1.1.1-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "03a615301529c30521b0767b5e07ab914cd07af12f2b7c2a3394edf6d3739b66",
        "md5": "f10d8380e27305b0ce8b3eb45b08eb13",
        "sha256": "5b3820be5cb82d3485e0089d7a85dc7205be1db765bc29617d8e568b52cd2893"
      },
      "downloads": -1,
      "filename": "polyp-1.1.1.tar.gz",
      "has_sig": false,
      "md5_digest": "f10d8380e27305b0ce8b3eb45b08eb13",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 42091,
      "upload_time": "2022-06-27T15:38:08",
      "upload_time_iso_8601": "2022-06-27T15:38:08.103772Z",
      "url": "https://files.pythonhosted.org/packages/03/a6/15301529c30521b0767b5e07ab914cd07af12f2b7c2a3394edf6d3739b66/polyp-1.1.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}