{
  "info": {
    "author": "Tomas Babej. Original code by Nicholas Cole",
    "author_email": "tomas@proteinqure.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "Environment :: Console",
      "Environment :: Console :: Curses",
      "Intended Audience :: Developers",
      "License :: OSI Approved :: BSD License",
      "Operating System :: POSIX",
      "Programming Language :: Python :: 2.6",
      "Programming Language :: Python :: 2.7",
      "Programming Language :: Python :: 3",
      "Topic :: Terminals"
    ],
    "description": "This library provides a framework for developing console applications using Python and curses.\n\nThis framework should be powerful enough to create everything from quick, simple programs to complex, multi-screen applications. It is designed to make doing the simple tasks very quick and to take much of the pain out of writing larger applications.\n\nThere is a very wide variety of default widgets - everything from simple text fields to more complex tree and grid views.\n\nI have used versions of this library for private scripts and small applications for around ten years. As a result, it is fairly mature.\t\n\nDocumentation is online at http://npyscreen.readthedocs.org\n\nPlease report bugs or make feature requests using the bug-tracker at http://code.google.com/p/npyscreen.\n\nThere is a mailing list available at https://groups.google.com/forum/?fromgroups#!forum/npyscreen/\n\n\n*Latest Changes*:\n\nVersion 4.9.1: minor change to Multiline widgets to make custom versions easier (final widget value is never set to MORE_LABEL).\n\nVersion 4.9:  new function blank_terminal() added. (User request)  Improvements to facilities for writing unit tests. (user request)\nBugs related to hidden widgets fixed.\n\nVersion 4.8.7 New methods added to the Multiline class to assist widget authors. \n\n\nVersion 4.8.6 MultiLineAction widgets no longer raise an exception if empty\nand selected unless set to do so explicitly.\n\nVersion 4.8.5 improves the writing of tests.\n\nVersion 4.8.4 adds support for custom-defined colours (not recommended.\nAdded at user request for a custom application).\n\nVersion 4.8.3 updates the documentation.\n\nVersion 4.8.2 makes the standard grid widget easier to customize by adding\nthe custom_print_cell method.\n\nVersion 4.8.1 fixes a bug that causes npyscreen to crash.\n\nVersion 4.8.0 adds a mechanism for finer control of BoxTitle contained\nwidgets.\n\nVersion 4.7.2 includes documentation updates.\n\nVersion 4.7.1 is a bugfix release.\n\nVersion 4.7.0 adds scripting support for writing automated tests.\n\nVersion 4.6.4 adds keybindings relevant to Windows.\n\nVersion 4.6.3 is a minor bug-fix release.\n\nVersion 4.6.1 updates the documentation to note that there is a bug in\nPython's curses library in 3.4.0.  This is fixed in 3.4.1.  I do not propose\nto put a workaround into npyscreen, which would complicate the code a great\ndeal for a bug that very few people face.  For more details, see:\nhttp://bugs.python.org/issue21088\n\n\n\n\nVersion 4.6.0 introduces a way to define a callback for when widget values change.  The help system has been improved by minor interface changes.  \nBoth of these were user suggestions.  Thank you to those who suggested them.\n\nVersion 4.5.0 introduces a greater control of colour for certain widgets.  \n\nVersion 4.4.0 introduces the new tree class TreeData.  This is a new version of NPSTreeData that follows PEP 8 conventions for method names.  NPSTreeData is now deprecated.\nThe form class ActionFormMinimal has been added at a user request.  This is a special version of ActionFrom that only features an OK button by default.\n\nVersion 4.3.5 introduces the new classes SliderNoLabel, TitleSliderNoLabel, SliderPercent, TitleSliderPercent.\n\n\nVersion 4.3.4 Minor bugfixes.  The notify functions and ActionPopups derived from them now use the ActionFormV2 widgets.  \nThis change should not affect existing code, but let me know if there are problems.\n\nVersion 4.3.0 allows you to specify a negative value for rely or relx when creating a widget.  This will cause the widget to be aligned\nwith the bottom or right of the screen.  The new method *set_relyx(y, x)* can be used to set the position of the widget on the Form if you never need to do that manually. \n\nThe classes *ActionFormV2*, *ActionFormExpandedV2* and *ActionFormV2WithMenus* have been introduced.\nThese feature cleaner code that should be easier to subclass.  \n\nThe *ButtonPress* class can now be created with the argument\n*when_pressed_function=None*, which can be used in place of overriding the *whenPressed* method.  Note that this might create a reference cycle\nwithin your application, so use with care. \n\n\nVersion 4.2.0 introduces the ability of Grid widgets to highlight the whole line that the cursor is on (user request).\n\nVersion 4.1.0 introduces support for hvc consoles (thanks to wu.fuheng@********* for the bug report).  Title widgets can now define a when_cursor_moved() method directly \non themselves that will be called as expected by the contained entry_widget during its edit loop (user request). \n\n\nVersion 4.0.0 introduces a new version scheme.  Due to a packaging error in\nthe 3.0 release series some users were having problems obtaining the latest\nversion. This is most easily fixed with a new major version release.\n\nVersion 3.10 MultiLineEditable, MultiLineEditableTitle, MultiLineEditableBoxed classes added, allowing the user to edit lists of items. \nSee EXAMPLE-MultilineEditable for an example.   \n\nVersion 3.6 Title.. widgets should now resize properly.  Menu items can now\nbe specified with arguments and keywords.\n\nVersion 3.5 when_value_edited defined on Title.. widgets now work as users expect.\n\nVersion 3.4 Fixed bugs in Title.. widgets and in the App classes.\n\nVersion 3.3 and the subsequent minor releases fix some bugs, mainly related\nto changes caused by allowing resized forms.\n\nVersion 3.2 adds CheckboxBare - a checkbox without a label.  Added at user request. \n\nVersion 3.0 *IMPORTANT* The version number has changed to version 3.0.  \nThis is because newer versions of pip distinguish between pre-release and released versions, \nand this will allow more flexibility in future releases. A version '2.0' might have caused confusion at this stage.  \n\nVersion 3.0 fixes the specification of max_width values for titled widgets (Thanks to Phil Rich for the bug report).  \nPlease report any further problems.\n\nVersion 2.0pre90 introduces a new BufferPager and TitleBufferPager class. (User request, suggested by dennis@wsec.be)\n\nVersion 2.0pre88 *IMPORTANT* This version supports resizing the terminal.\nRead the documentation for more detail about how to disable this feature if\nyou need to.  It has been implemented in a way that should be compatible\nwith existing code.  New code can make the resizing even more flexible.\n\nVersion 2.0pre87 Updates the documentation and contains various bug fixes.\n\nVersion 2.0pre85 and 2.0pre86 are both bugfix releases. \n\nVersion 2.0pre84 introduces an experimental system for editing lists of\noptions.  See documentation for details.\n\nVersion 2.0pre83 multi-line checkbox widgets are now possible.  These can also be used as contained widgets within the multiselect class. See documentation for details.\n\nVersion 2.0pre82 changes the menu system and allows menu items to be given keyboard shortcuts.\n\nVersion 2.0pre81 introduces FilenameCombo, TitleFilenameCombo.\n\nVersion 2.0pre79 is a bugfix release.\n\nVersion 2.0pre76 further improves the handling of mouse events on compatible\nterminals.\n\n\nVersion 2.0pre75 improves the handling of the mouse on compatible terminals.\n\nVersion 2.0pre74 corrects one minor bug and introduces makes box widgets\nbehave slightly more predictably (.editable attribute now linked to that of\nthe contained widget.\n\nVersion 2.0pre73 corrects two bugs - thanks to Lasse for his help in finding\nthem and offering patches.\n\nVersion 2.0pre71 new tree classes introduced. Bug fixes.\n\nVersion 2.0pre70 introduces the MLTreeMultiSelect class.\n\nVersion 2.0pre69 fixes and tidies up some of the new tree classes.  There is an API change assocatied with this, noted in the documentation, though backward compatibility should have been maintained. \n\nVersion 2.0pre68 setting a form's .editing attribute to False now causes it to exit immediately,\neven if a widget is still being edited.\n\nVersion 2.0pre67 fixes minor bugs.\n\nVersion 2.0pre65 fixes several bugs.  All textboxes now honour the .hidden\nattribute.  The major side effect of this is that tree classes are now\neasier to write.\n\nVersion 2.0pre64 extends multi-page support and includes revision to the\ndocumentation.\n\nVersion 2.0pre63 adds initial support for multi-page forms.  See documentation on the \nFormMultiPage class for details.\n\nVersion 2.0pre57 fixes color support - it should now be possible to display\na terminal with a different color background. Text widgets have some\nadditional color options.\n\nVersion 2.0pre52 fixes compatibility with python2.6, 3.0 and 3.1.  All other versions should be unaffected.\n\nVersion 2.0pre50 enables basic mouse support.  Note that the Apple terminal does not handle mouse events correctly.",
    "description_content_type": "",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "http://www.npcole.com/npyscreen/",
    "keywords": "",
    "license": "New BSD License",
    "maintainer": "",
    "maintainer_email": "",
    "name": "pq-npyscreen",
    "package_url": "https://pypi.org/project/pq-npyscreen/",
    "platform": "",
    "project_url": "https://pypi.org/project/pq-npyscreen/",
    "project_urls": {
      "Homepage": "http://www.npcole.com/npyscreen/"
    },
    "release_url": "https://pypi.org/project/pq-npyscreen/4.9.1/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "Fork of npyscreen with community patches on top.",
    "version": "4.9.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 12545323,
  "releases": {
    "4.9.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "177a07b4cf8fd373fdbfa072df184854bffba50aa3dcf43365168d786ca7233a",
          "md5": "a16172dde9d3e30080c4bcd757b1e97d",
          "sha256": "1ca8ed224f3f3c3f8d1d8c21b66f889d3f3dd5a5108bf8c6c7b06660dc59bfab"
        },
        "downloads": -1,
        "filename": "pq_npyscreen-4.9.1.tar.gz",
        "has_sig": false,
        "md5_digest": "a16172dde9d3e30080c4bcd757b1e97d",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 103162,
        "upload_time": "2022-01-11T23:48:55",
        "upload_time_iso_8601": "2022-01-11T23:48:55.399592Z",
        "url": "https://files.pythonhosted.org/packages/17/7a/07b4cf8fd373fdbfa072df184854bffba50aa3dcf43365168d786ca7233a/pq_npyscreen-4.9.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "177a07b4cf8fd373fdbfa072df184854bffba50aa3dcf43365168d786ca7233a",
        "md5": "a16172dde9d3e30080c4bcd757b1e97d",
        "sha256": "1ca8ed224f3f3c3f8d1d8c21b66f889d3f3dd5a5108bf8c6c7b06660dc59bfab"
      },
      "downloads": -1,
      "filename": "pq_npyscreen-4.9.1.tar.gz",
      "has_sig": false,
      "md5_digest": "a16172dde9d3e30080c4bcd757b1e97d",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 103162,
      "upload_time": "2022-01-11T23:48:55",
      "upload_time_iso_8601": "2022-01-11T23:48:55.399592Z",
      "url": "https://files.pythonhosted.org/packages/17/7a/07b4cf8fd373fdbfa072df184854bffba50aa3dcf43365168d786ca7233a/pq_npyscreen-4.9.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}