{
  "info": {
    "author": "Zachary Pardos, Anirudhan Badrinath, Matthew Jade Johnson, Christian Garay",
    "author_email": "zp@berkeley.edu, abadrinath@berkeley.edu, mattjj@csail.mit.edu, c.garay@berkeley.edu",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3.5",
      "Programming Language :: Python :: 3.6",
      "Programming Language :: Python :: 3.7",
      "Programming Language :: Python :: 3.8"
    ],
    "description": "# pyBKT\n\nPython implementation of the Bayesian Knowledge Tracing algorithm and variants, estimating student cognitive mastery from problem solving sequences.\n\n```\n    pip install pyBKT\n```\nBased on the work of Zachary A. Pardos (zp@berkeley.edu) and Matthew J. Johnson (mattjj@csail.mit.edu) @ https://github.com/CAHLR/xBKT. All-platform python adaptation and optimizations by Anirudhan Badrinath (abadrinath@berkeley.edu). Data helpers and other utility functions written by Frederic Wang (fredwang@berkeley.edu). Original Python and boost adaptation of xBKT by Cristian Garay (c.garay@berkeley.edu). For implementation details, analysis of runtime and data requirements, and model variant replication testing, refer to:\n\nBadrinath, A., Wang, F., Pardos, Z.A. (2021) [pyBKT: An Accessible Python Library of Bayesian Knowledge Tracing Models](https://educationaldatamining.org/EDM2021/virtual/static/pdf/EDM21_paper_237.pdf). In S. Hsiao, & S. Sahebi  (Eds.) *Proceedings of the 14th International Conference on Educational Data Mining* (EDM). Pages 468-474.\n\nExamples from the paper can be found in [pyBKT-examples](https://github.com/CAHLR/pyBKT-examples/ \"pyBKT examples\") repo.\n\n[pyBKT Quick Start Tutorial](https://colab.research.google.com/drive/13abu919edUXbvPV3qeGPpvwnFBExU7Vd \"pyBKT quick start in Colab\")\n\n[pyBKT Tutorial from LAK Workshop in Google Colab Notebook](https://colab.research.google.com/drive/1Kg6AvXKdSZXoqzSZ5BRHuewyHRMvrZs1 \"pyBKT quick start in Colab\") \n\n## Requirements\nPython >= 3.5\n\nSupported OS: All platforms! (Yes, Windows too)\n\n## Supported model variants\npyBKT can be used to define and fit many BKT variants, including these from the literature: \n\n* Individual student priors, learn rate, guess, and slip [1,2]\n* Individual item guess and slip [3,4,5]\n* Individual item or resource learn rate [4,5]\n\n1. Pardos, Z. A., Heffernan, N. T. (2010) Modeling Individualization in a Bayesian Networks Implementation of Knowledge Tracing. In P. De Bra, A. Kobsa, D. Chin (Eds.) *Proceedings of the 18th International Conference on User Modeling, Adaptation and Personalization* (UMAP). Big Island of Hawaii. Pages. Springer. Pages 255-266. [[doi]](https://doi.org/10.1007/978-3-642-13470-8_24\n)\n\n1. Pardos, Z. A., Heffernan, N. T. (2010) Using HMMs and bagged decision trees to leverage rich features of user and skill from an intelligent tutoring system dataset. In J. Stamper & A. Niculescu-Mizil (Eds.) *Proceedings of the KDD Cup Workshop at the 16th ACM Conference on Knowledge Discovery and Data Mining* (SIGKDD). Washington, D.C. ACM. Pages 24-35. [[kdd cup]](https://pslcdatashop.web.cmu.edu/KDDCup/workshop/papers/pardos_heffernan_KDD_Cup_2010_article.pdf)\n\n1. Pardos, Z. & Heffernan, N. (2011) KT-IDEM: Introducing Item Difficulty to the Knowledge Tracing Model. In Konstant et al. (eds.) *Proceedings of the 20th International Conference on User Modeling, Adaptation and Personalization* (UMAP). Girona, Spain. Springer. Pages 243-254. [[doi]](https://doi.org/10.1007/978-3-642-22362-4_21)\n\n1. Pardos, Z. A., Bergner, Y., Seaton, D., Pritchard, D.E. (2013) Adapting Bayesian Knowledge Tracing to a Massive Open Online College Course in edX. In S.K. D’Mello, R.A. Calvo, & A. Olney (Eds.) *Proceedings of the 6th International Conference on Educational Data Mining* (EDM). Memphis, TN. Pages 137-144. [[edm]](http://educationaldatamining.org/EDM2013/proceedings/paper_20.pdf)\n\n1. Xu, Y., Johnson, M. J., Pardos, Z. A. (2015) Scaling cognitive modeling to massive open environments. In *Proceedings of the Workshop on Machine Learning for Education at the 32nd International Conference on Machine Learning* (ICML). Lille, France. [[icml ml4ed]](http://ml4ed.cc/attachments/XuY.pdf)\n\n# Installation and setup\nThis is intended as a quick overview of steps to install and setup and to run pyBKT locally. \n\nWe offer both a pure Python port and a Python/C++ extension version of pyBKT for the sake of accessibility and ease of use on any platform. Note that pip, by default, will install the C++/Python version unless the required libraries are not found or there is an error during installation. In the case of such issues, it will revert to the pure Python implementation.\n\nThe former pure Python versions does not fit models or scale as quickly or efficiently as the latter (due to nested for loops needed for DP). Here are a few speed comparisons - both on the same machine - that may be useful in deciding which version is more appropriate given the usage (e.g. model fitting is far more demanding than prediction). \n\n|                 Test Description                | pyBKT (Python) | pyBKT (C++) |\n|:-----------------------------------------------:|:--------------:|---------------:|\n| synthetic data, model fit (500 students)        |     ~1m55s     |      ~1.5s     |\n| synthetic data, model fit (5000 students)       |     ~1h30m     |      ~45s      |\n| cross validated cognitive tutor data            |     ~4m10s     |       ~3s      |\n| synthetic data, predict onestep (500 students)  |       ~2s      |      ~0.8s     |\n| synthetic data, predict onestep (5000 students) |     ~2m15s     |      ~35s      |\n\n## Installing Dependencies for Fast C++ Inferencing (Optional - for OS X and Linux before Xenial) ##\n\n### Linux\n\nIf you have a C++ compiler already installed, pip will install pyBKT with fast C++ inferencing. C++ compilers are already installed on nearly all Linux distributions. If it is not installed on your machine, type `sudo apt install gcc g++` if using Debian based distributions. Otherwise, whichever package manager is appropriately suited to your distribution (`dnf`, `pacman`, etc.). Without a compiler, pip will install pyBKT without C++ speed optimizations.\n\nIn case this is a hassle, we provide a Conda environment that works very easily. Simply execute inside your base conda environment:\n\n``` source setup_conda.sh ```\n\nYou may need to run the above as root.\n\n### Mac\n\nThe latest version of Python is necessary for OS X. If homebrew is installed, run the following commands to download the necessary dependencies:\n```\n    brew install libomp\n```\n\nIn case this is a hassle, we provide a Conda environment that works very easily. Simply execute inside your base conda environment:\n\n``` source setup_conda.sh ```\n\nYou may need to run the above as root.\n\n## Installing pyBKT ##\n\nYou can simply run:\n```\n    pip install pyBKT\n``` \nAlternatively, if `pip` poses some problems, you can clone the repository as such and then run the `setup.py` script manually.\n\n```\n    git clone https://github.com/CAHLR/pyBKT.git\n    cd pyBKT\n    python3 setup.py install\n```\n\n# Preparing Data and Running Model #\n\nThe following serves as a mini-tutorial for how to get started with pyBKT. There is more information available at the Colab notebook listed at the top of the README.\n\n## Input and Output Data ##\n\nThe accepted input formats are Pandas DataFrames and data files of type csv (comma separated) or tsv (tab separated). pyBKT will automatically infer which delimiter to use in the case that it is passed a data file. Since column names mapping meaning to each field in the data (i.e. skill name, correct/incorrect) vary per data source, you may need to specify a mapping from your data file's column names to pyBKT's expected column names. In many cases with Cognitive Tutor and Assistments datasets, pyBKT will be able to automatically infer column name mappings, but in the case that it is unable to, it will raise an exception. Note that the correctness is given by -1 (no response), 0 (incorrect), or 1 (correct).\n\n## Creating and Training Models ##\n\nThe process of creating and training models in pyBKT resemble that of SciKit Learn. pyBKT provides easy methods of fetching online datasets and to fit on a combination or all skills available in any particular dataset.\n\n```python\nfrom pyBKT.models import Model\n\n# Initialize the model with an optional seed\nmodel = Model(seed = 42, num_fits = 1)\n\n# Fetch Assistments and CognitiveTutor data (optional - if you have your own dataset, that's fine too!)\nmodel.fetch_dataset('https://raw.githubusercontent.com/CAHLR/pyBKT-examples/master/data/as.csv', '.')\nmodel.fetch_dataset('https://raw.githubusercontent.com/CAHLR/pyBKT-examples/master/data/ct.csv', '.')\n\n# Train a simple BKT model on all skills in the CT dataset\nmodel.fit(data_path = 'ct.csv')\n\n# Train a simple BKT model on one skill in the CT dataset\n# Note that calling fit deletes any previous trained BKT model!\nmodel.fit(data_path = 'ct.csv', skills = \"Plot imperfect radical\")\n\n# Train a simple BKT model on multiple skills in the CT dataset\nmodel.fit(data_path = 'ct.csv', skills = [\"Plot imperfect radical\",\n                                          \"Plot pi\"])\n\n# Train a multiguess and slip BKT model on multiple skills in the\n# CT dataset. Note: if you are not using CognitiveTutor or Assistments\n# data, you may need to provide a column mapping for the guess/slip\n# classes to use (i.e. if the column name is gsclasses, you would\n# specify multigs = 'gsclasses' or specify a defaults dictionary\n# defaults = {'multigs': 'gsclasses'}).\nmodel.fit(data_path = 'ct.csv', skills = [\"Plot imperfect radical\",\n                                          \"Plot pi\"],\n                                multigs = True)\n\n# We can combine multiple model variants.\nmodel.fit(data_path = 'ct.csv', skills = [\"Plot imperfect radical\",\n                                          \"Plot pi\"],\n                                multigs = True, forgets = True,\n                                multilearn = True)\n\n# We can use a different column to specify the different learn and \n# forget classes. In this case, we use student ID.\nmodel.fit(data_path = 'ct.csv', skills = [\"Plot imperfect radical\",\n                                          \"Plot pi\"],\n                                multigs = True, forgets = True,\n                                multilearn = 'Anon Student Id')\n\n# View the trained parameters!\nprint(model.params())\n```\n\nNote that if we train on a dataset that has unfamiliar columns to pyBKT, you will be required to specify a mapping of column names in that dataset to expected pyBKT columns. This is referred to as the model defaults (i.e. it specifies the default column names to lookup in the dataset). An example usage is provided below for an unknown dataset which has column names \"row\", \"skill\\_t\", \"answer\", and \"gs\\_classes\".\n``` python\n# Load unfamiliar dataset.\ndf = pd.read_csv('mystery.csv')\n\n# For other non-Assistments/CogTutor style datasets, we will need to specify the\n# columns corresponding to each required column (i.e. the user ID, correct/incorrect).\n# For that, we use a defaults dictionary.\n# In this case, the order ID that pyBKT expects is specified by the column row in the\n# dataset, the skill_name is specified by a column skill_t and the correctness is specified\n# by the answer column in the dataset.\ndefaults = {'order_id': 'row', 'skill_name': 'skill_t', 'correct': 'answer'}\n\n# This defaults dictionary contains columns specifying what columns correspond\n# to the desired guess/slip classes, etc. In this case, our desired column for\n# the guess/slip classes is a column named gs_classes.\ndefaults['multigs'] = 'gs_classes'\n\n# Fit using the defaults (column mappings) specified in the dictionary.\nmodel.fit(data = df, defaults = defaults)\n\n# Predict/evaluate/etc.\ntraining_acc = model.evaluate(data = df, metric = 'accuracy')\n```\n\n## Model Prediction and Evaluation ##\n\nPrediction and evaluation behave similarly to SciKit-Learn. pyBKT offers a variety of features for prediction and evaluation.\n\n```python\nfrom pyBKT.models import Model\n\n# Initialize the model with an optional seed\nmodel = Model(seed = 42, num_fits = 1)\n\n# Load the Cognitive Tutor data (not necessary, but shown\n# for the purposes of the tutorial that pyBKT accepts\n# DataFrames as well as file locations!).\nct_df = pd.read_csv('ct.csv', encoding = 'latin')\n\n# Train a simple BKT model on all skills in the CT dataset\nmodel.fit(data_path = 'ct.csv')\n\n# Predict on all skills on the training data.\n# This returns a Pandas DataFrame.\npreds_df = model.predict(data_path = 'ct.csv')\n\n# Evaluate the RMSE of the model on the training data.\n# Note that the default evaluate metric is RMSE.\ntraining_rmse = model.evaluate(data = ct_df)\n\n# Evaluate the AUC of the model on the training data. The supported\n# metrics are AUC, RMSE and accuracy (they should be lowercased in\n# the argument!).\ntraining_auc = model.evaluate(data_path = 'ct.csv', metric = 'auc')\n\n# We can define a custom metric as well.\ndef mae(true_vals, pred_vals):\n  \"\"\" Calculates the mean absolute error. \"\"\"\n  return np.mean(np.abs(true_vals - pred_vals))\n\ntraining_mae = model.evaluate(data_path = 'ct.csv', metric = mae)\n```\n\n## Crossvalidation ##\n\nCrossvalidation is offered as a blackbox function similar to a combination of fit and evaluate that accepts a particular number of folds, a seed, and a metric (either one of the 3 provided that are 'rmse', 'auc' or 'accuracy' or a custom Python function taking 2 arguments). Similar arguments for the model types, data path/data, and skill names are accepted as with the fit function.\n\n``` python\nfrom pyBKT.models import Model\n\n# Initialize the model with an optional seed\nmodel = Model(seed = 42, num_fits = 1)\n\n# Crossvalidate with 5 folds on all skills in the CT dataset.\ncrossvalidated_errors = model.crossvalidate(data_path = 'ct.csv', folds = 5)\n\n# Crossvalidate on a particular set of skills with a given \n# seed, folds and metric.\ndef mae(true_vals, pred_vals):\n  \"\"\" Calculates the mean absolute error. \"\"\"\n  return np.mean(np.abs(true_vals - pred_vals))\n\n# Note that the skills argument accepts a REGEX pattern. In this case, this matches and \n# crossvalidates on all skills containing the word fraction.\ncrossvalidated_mae_errs = model.crossvalidate(data_path = 'ct.csv', skills = \".*fraction.*\",\n                                              folds = 10, metric = mae)\n\n# Crossvalidate using multiple model variants.\ncrossvalidated_multigsf = model.crossvalidate(data_path = 'ct.csv', multigs = True, forgets = True)\n```\n\n## Extended Features ##\n\nExtended features include model parameter initialization by setting model.coef_, providing a configuration dictionary, setting model default columns, and more. For more information about these features, take a look at the Colab notebook provided at the top of the README.\n\n# Internal Data Format #\n\n_pyBKT_ models student mastery of a skills as they progress through series of learning resources and checks for understanding. Mastery is modelled as a latent variable has two states - \"knowing\" and \"not knowing\". At each checkpoint, students may be given a learning resource (i.e. watch a video) and/or question(s) to check for understanding. The model finds the probability of learning, forgetting, slipping and guessing that maximizes the likelihood of observed student responses to questions. \n\nTo run the pyBKT model, define the following variables:\n* `num_subparts`: The number of unique questions used to check understanding. Each subpart has a unique set of emission probabilities.\n* `num_resources`: The number of unique learning resources available to students.\n* `num_fit_initialization`: The number of iterations in the EM step.\n\n\nNext, create an input object `Data`, containing the following attributes: \n* `data`: a matrix containing sequential checkpoints for all students, with their responses. Each row represents a different subpart, and each column a checkpoint for a student. There are three potential values: {0 = no response or no question asked, 1 = wrong response, 2 = correct response}. If at a checkpoint, a resource was given but no question asked, the associated column would have `0` values in all rows. For example, to set up data containing 5 subparts given to two students over 2-3 checkpoints, the matrix would look as follows:\n\n        | 0  0  0  0  2 |\n        | 0  1  0  0  0 |\n        | 0  0  0  0  0 |\n        | 0  0  0  0  0 |\n        | 0  0  2  0  0 |   \n\n  In the above example, the first student starts out with just a learning resource, and no checks for understanding. In subsequent checkpoints, this student also responds to subpart 2 and 5, and gets the first wrong and the second correct.   \n\n* `starts`: defines each student's starting column on the `data` matrix. For the above matrix, `starts` would be defined as: \n\n        | 1  4 |\n\n* `lengths`: defines the number of check point for each student. For the above matrix, `lengths` would be defined as: \n\n        | 3  2 |\n\n* `resources`: defines the sequential id of the resources at each checkpoint. Each position in the vector corresponds to the column in the `data` matrix. For the above matrix, the learning `resources` at each checkpoint would be structured as: \n\n        | 1  2  1  1  3 |\n\n* `stateseqs`: this attribute is the true knowledge state for above data and should be left undefined before running the `pyBKT` model. \n\n\nThe output of the model can will be stored in a `fitmodel` object, containing the following probabilities as attributes: \n* `As`: the transition probability between the \"knowing\" and \"not knowing\" state. Includes both the `learns` and `forgets` probabilities, and their inverse. `As` creates a separate transition probability for each resource.\n* `learns`: the probability of transitioning to the \"knowing\" state given \"not known\".\n* `forgets`: the probability of transitioning to the \"not knowing\" state given \"known\".\n* `prior`: the prior probability of \"knowing\".\n\nThe `fitmodel` also includes the following emission probabilities:\n* `guesses`: the probability of guessing correctly, given \"not knowing\" state.\n* `slips`: the probability of picking incorrect answer, given \"knowing\" state.\n\n## Citation\nTo credit this library, please cite our paper published in the Educaitonal Data Mining Conference:\n\nBadrinath, A., Wang, F., Pardos, Z.A. (2021) pyBKT: An Accessible Python Library of Bayesian Knowledge Tracing Models. In S. Hsiao, & S. Sahebi  (Eds.) *Proceedings of the 14th International Conference on Educational Data Mining* (EDM). Pages 468-474.\n```\n@inproceedings{badrinath2021pybkt,\n  title={pyBKT: An Accessible Python Library of Bayesian Knowledge Tracing Models},\n  author={Badrinath, Anirudhan and Wang, Frederic and Pardos, Zachary},\n  booktitle={Proceedings of the 9th International Conference on Learning Analytics \\& Knowledge},\n  pages={468--474},\n  year={2021}\n}\n```\n\n## TODOs ##\n* Exporting compiled binaries on PyPi\n* Additional model variants",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "https://github.com/CAHLR/pyBKT/archive/1.0.tar.gz",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/CAHLR/pyBKT",
    "keywords": "BKT,Bayesian Knowledge Tracing,Bayesian Network,Hidden Markov Model,Intelligent Tutoring Systems,Adaptive Learning",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "pyBKT",
    "package_url": "https://pypi.org/project/pyBKT/",
    "platform": "",
    "project_url": "https://pypi.org/project/pyBKT/",
    "project_urls": {
      "Download": "https://github.com/CAHLR/pyBKT/archive/1.0.tar.gz",
      "Homepage": "https://github.com/CAHLR/pyBKT"
    },
    "release_url": "https://pypi.org/project/pyBKT/1.4/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "PyBKT - Python Implentation of Bayesian Knowledge Tracing",
    "version": "1.4",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 12066486,
  "releases": {
    "1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "07063180ff73cf8e6bed7bfdef36075a5a9db80055e7d3d0cf2ad2aa1aba3025",
          "md5": "ea6a1b8929e717a8b1c5f7888b16fd1e",
          "sha256": "6bcf47e49f4fe2fe191c1db4afa257a938d71a15fbff3c75ffdd121e16d7f3e1"
        },
        "downloads": -1,
        "filename": "pyBKT-1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "ea6a1b8929e717a8b1c5f7888b16fd1e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 13050037,
        "upload_time": "2020-04-09T03:26:53",
        "upload_time_iso_8601": "2020-04-09T03:26:53.491639Z",
        "url": "https://files.pythonhosted.org/packages/07/06/3180ff73cf8e6bed7bfdef36075a5a9db80055e7d3d0cf2ad2aa1aba3025/pyBKT-1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b6f72b7bf4e96be1036473b39720a44a46e6b68d5b27de61f13726ed9e0409ac",
          "md5": "b5e2cc328422161ecc4ba15810429027",
          "sha256": "f9103cbe7985a1612e1cdc54415baa35f898eb678389f96c1c84001faddd98a6"
        },
        "downloads": -1,
        "filename": "pyBKT-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "b5e2cc328422161ecc4ba15810429027",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 40150704,
        "upload_time": "2020-06-25T01:22:05",
        "upload_time_iso_8601": "2020-06-25T01:22:05.174244Z",
        "url": "https://files.pythonhosted.org/packages/b6/f7/2b7bf4e96be1036473b39720a44a46e6b68d5b27de61f13726ed9e0409ac/pyBKT-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b53b692a8ba0666b407161d43516b550756e145fdd6c7d0ce3bcacd328179ba5",
          "md5": "b05aedb10fb40e4de96c06d2f4ba8163",
          "sha256": "dfad6b6ffcf679fb1b3689325d113496612b257013d51e9474a38727451ecc23"
        },
        "downloads": -1,
        "filename": "pyBKT-1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "b05aedb10fb40e4de96c06d2f4ba8163",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 13605179,
        "upload_time": "2020-07-23T00:44:56",
        "upload_time_iso_8601": "2020-07-23T00:44:56.906578Z",
        "url": "https://files.pythonhosted.org/packages/b5/3b/692a8ba0666b407161d43516b550756e145fdd6c7d0ce3bcacd328179ba5/pyBKT-1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e890eaf08f93e6773f052c0e4fcf085c4980e3f7cda39c396352c3ebf366fc5b",
          "md5": "db6bdc74052aa0947607769adda882aa",
          "sha256": "03a6a81d274a26c6945ecd4e0fae9c1176c752c4a8ab4a817a47a5bc82e22d8d"
        },
        "downloads": -1,
        "filename": "pyBKT-1.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "db6bdc74052aa0947607769adda882aa",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 27219343,
        "upload_time": "2020-07-28T20:57:04",
        "upload_time_iso_8601": "2020-07-28T20:57:04.355712Z",
        "url": "https://files.pythonhosted.org/packages/e8/90/eaf08f93e6773f052c0e4fcf085c4980e3f7cda39c396352c3ebf366fc5b/pyBKT-1.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3821230822d8bd8bec02f4ec5f12d7ecb99fbaf0cfcabbe72a4614e8e5a0e507",
          "md5": "572866db33f7dbf58a497ae4589a03d1",
          "sha256": "fbaaa1c40fa954fbf7362ea55b862d68f08d91944f39430ada3fd3301bd5a3cc"
        },
        "downloads": -1,
        "filename": "pyBKT-1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "572866db33f7dbf58a497ae4589a03d1",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 14172106,
        "upload_time": "2021-02-17T12:26:54",
        "upload_time_iso_8601": "2021-02-17T12:26:54.586819Z",
        "url": "https://files.pythonhosted.org/packages/38/21/230822d8bd8bec02f4ec5f12d7ecb99fbaf0cfcabbe72a4614e8e5a0e507/pyBKT-1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.2.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9ccca8fd7053b5b37240d7c17303fe04859b6335636ff98c856be92b7d5685df",
          "md5": "442a6138cc46ef6cd3858364d8660db9",
          "sha256": "c8cfbf3a0daec16fb7342431ad58ef3f6daff87d9ebd35e62af866a357918758"
        },
        "downloads": -1,
        "filename": "pyBKT-1.2.1.tar.gz",
        "has_sig": false,
        "md5_digest": "442a6138cc46ef6cd3858364d8660db9",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 14312898,
        "upload_time": "2021-02-24T00:26:12",
        "upload_time_iso_8601": "2021-02-24T00:26:12.666784Z",
        "url": "https://files.pythonhosted.org/packages/9c/cc/a8fd7053b5b37240d7c17303fe04859b6335636ff98c856be92b7d5685df/pyBKT-1.2.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.2.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b1be634bd30183089f0e7986bfe99da4df5d728bacfcd73bbc25404b5e5cc4ad",
          "md5": "ac5b4fc5ad5e38efea9ee4ff79c72d8f",
          "sha256": "7b319eaddba613e5c046609b66c5ace63343b171da0d935c2a582e2435e0eff7"
        },
        "downloads": -1,
        "filename": "pyBKT-1.2.2.tar.gz",
        "has_sig": false,
        "md5_digest": "ac5b4fc5ad5e38efea9ee4ff79c72d8f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 28239670,
        "upload_time": "2021-04-10T05:17:09",
        "upload_time_iso_8601": "2021-04-10T05:17:09.630105Z",
        "url": "https://files.pythonhosted.org/packages/b1/be/634bd30183089f0e7986bfe99da4df5d728bacfcd73bbc25404b5e5cc4ad/pyBKT-1.2.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "fb60c8cdb60a0c89c3f50da3d31f72616092bb81a45fa0941e88aa8269b7604d",
          "md5": "501c0369c526c00dc3b76be669c0e33c",
          "sha256": "c489ebfa2cd670f841aa769a2901076a2296104a425b333b0cf3c6ce89665c7f"
        },
        "downloads": -1,
        "filename": "pyBKT-1.3.tar.gz",
        "has_sig": false,
        "md5_digest": "501c0369c526c00dc3b76be669c0e33c",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 32367413,
        "upload_time": "2021-05-01T02:16:53",
        "upload_time_iso_8601": "2021-05-01T02:16:53.147334Z",
        "url": "https://files.pythonhosted.org/packages/fb/60/c8cdb60a0c89c3f50da3d31f72616092bb81a45fa0941e88aa8269b7604d/pyBKT-1.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.3.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "613d6b176c4666fa6ab1714b3c8b5c338f6348b6d514907372ee632eb8bd2b4d",
          "md5": "5393ec5251bfcae68b670877808d688b",
          "sha256": "eced347c19dd24e112c6deb1150eabb7db29db327062e95af865168cc360e207"
        },
        "downloads": -1,
        "filename": "pyBKT-1.3.1.tar.gz",
        "has_sig": false,
        "md5_digest": "5393ec5251bfcae68b670877808d688b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 2228106,
        "upload_time": "2021-05-11T23:46:28",
        "upload_time_iso_8601": "2021-05-11T23:46:28.434576Z",
        "url": "https://files.pythonhosted.org/packages/61/3d/6b176c4666fa6ab1714b3c8b5c338f6348b6d514907372ee632eb8bd2b4d/pyBKT-1.3.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "71696b5e0169b2167cde787cdd1200582307994d35f012c5c499e7c09db50fc4",
          "md5": "a14073b8a10d9d449738db5d0efc173d",
          "sha256": "485076c386846bdafb9642b3389853c9eebeb312744d21214f085dcae97ba136"
        },
        "downloads": -1,
        "filename": "pyBKT-1.4.tar.gz",
        "has_sig": false,
        "md5_digest": "a14073b8a10d9d449738db5d0efc173d",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 32674262,
        "upload_time": "2021-11-19T05:19:12",
        "upload_time_iso_8601": "2021-11-19T05:19:12.405345Z",
        "url": "https://files.pythonhosted.org/packages/71/69/6b5e0169b2167cde787cdd1200582307994d35f012c5c499e7c09db50fc4/pyBKT-1.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "71696b5e0169b2167cde787cdd1200582307994d35f012c5c499e7c09db50fc4",
        "md5": "a14073b8a10d9d449738db5d0efc173d",
        "sha256": "485076c386846bdafb9642b3389853c9eebeb312744d21214f085dcae97ba136"
      },
      "downloads": -1,
      "filename": "pyBKT-1.4.tar.gz",
      "has_sig": false,
      "md5_digest": "a14073b8a10d9d449738db5d0efc173d",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 32674262,
      "upload_time": "2021-11-19T05:19:12",
      "upload_time_iso_8601": "2021-11-19T05:19:12.405345Z",
      "url": "https://files.pythonhosted.org/packages/71/69/6b5e0169b2167cde787cdd1200582307994d35f012c5c499e7c09db50fc4/pyBKT-1.4.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}