{
  "info": {
    "author": "",
    "author_email": "Jueon Park <bluegbgb@gmail.com>",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: Apache Software License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# pykis\n- pykis는 한국투자증권에서 제공하는 Open Trading API를 쉽게 사용하기 위한 **비공식** python wrapper입니다. \n- 기존 eFriend expert (HTS 프로그램) 연동 방식 API 대비 다음과 같은 장점들이 있습니다. \n  - Web API 방식 사용 \n  - 별도의 HTS 프로그램에 의존하지 않음\n  - 사용 가능 환경(OS)에 제한이 없음\n\n- 기존 eFriend expert 연동 방식 API를 사용하는 python 패키지는 [pjueon/eFriendPy](https://github.com/pjueon/eFriendPy)를 참고하세요.\n\n\n## 사용전 유의사항 \n### license 관련\npykis는 Apache-2.0 license를 따릅니다. \n- Apache-2.0 license에서 규정하는 조건 안에서 자유롭게 수정/재배포/사용이 가능합니다. 자세한 사항은 [LICENSE](LICENSE)를 참고 바랍니다.\n- pykis의 동작에는 불완전한 부분이나 버그가 있을 수 있습니다. 또한 pykis의 API는 언제든 변경될 수 있습니다.\n- pykis의 제작자([pjueon](https://github.com/pjueon))는 이 코드에 대해서 어떤 것도 보장하지 않습니다. 코드 사용중 생긴 **어떠한 종류의 피해(ex> 버그, 사용자의 실수, 투자로 인한 손실 등)에 대해서도 책임지지 않습니다.**\n\n### KIS Developers 서비스 신청\n- pykis를 사용하기 위해서는 한국투자증권 홈페이지에서 KIS Developers 서비스 신청을 통해 API key를 발급받아야 합니다.\n- KIS Developers 서비스 신청방법은 한국투자증권의 [공식 wikidocs](https://wikidocs.net/159333)를 참고하세요.\n\n### 기타\n- pykis는 개인 투자 용도로만 개발되었습니다. \n- pykis를 사용하기 위해서는 python 3.7 버전 이상이 필요합니다.\n- pykis는 아직 개발 단계입니다. 버그나 기능 요청 등의 feedback은 issue나 pull request를 통해 부탁드립니다. \n\n## 패키지 설치 \n- pykis는 현재 개발 단계로 수정이 잦습니다. git을 통해 해당 repository를 clone하여 사용하세요.  \n```shell\ngit clone https://github.com/pjueon/pykis.git\ncd pykis\npip3 install -r requirements.txt\n```\n- 추후 pip 를 통해 설치할 수 있도록 정식 패키징 예정입니다. \n\n\n## API 기본 사용법 \n### 패키지 import \n```python\nimport pykis\n```\n\n### `Api` 객체 생성\n실제 계좌를 사용하는 경우\n```python\n# API 사용을 위한 API key정보 및 계좌 정보를 설정합니다. \n# 별도의 파일(json, yaml, xml, etc) 등에 내용을 저장하여 불러오는 것을 추천합니다. \n# key 정보는 절대 외부로 유출되지 않도록 주의하시고, 유출시 즉시 재발급 하시기 바랍니다.  \n\nkey_info = {\t\t# KIS Developers 서비스 신청을 통해 발급받은 API key 정보\n\t\"appkey\": \"[발급 받은 APP Key]\",                  \n\t\"appsecret\": \"[발급 받은 APP Secret]\" \n}\n\naccount_info = {\t# 사용할 계좌 정보\n\t\"account_code\": \"[API를 신청한 종합 계좌번호(계좌번호 앞자리 8자리 숫자)]\",   \n\t\"product_code\": \"[계좌번호의 끝자리 2자리 숫자]\"             # ex> \"01\", \"22\", etc\n}\n\n# API 객체 생성 \napi = pykis.Api(key_info=key_info, account_info=account_info)\n```\n\n모의 계좌를 사용하는 경우 \n```python\ndomain = pykis.DomainInfo(kind=\"virtual\")\n\n\n# API 객체 생성 \napi = pykis.Api(key_info=key_info, domain_info=domain_info, account_info=account_info)\n```\n\n### 사용 계좌 변경\n```python\naccount_info = {    # 사용할 계좌 정보\n\t\"account_code\": \"[API를 신청한 종합 계좌번호(계좌번호 앞자리 8자리 숫자)]\",   \n\t\"product_code\": \"[계좌번호의 끝자리 2자리 숫자]\"             # ex> \"01\", \"22\", etc\n}\n\napi.set_account(account_info)\n```\n\n### 거래 가능 현금 조회\n```python\ncash = api.get_kr_buyable_cash()\nprint(f\"거래 가능 현금: {cash} 원\")\n```\n\n### 국내 주식 현재가 조회\n```python\nticker = \"005930\"   # 삼성전자 종목코드\nprice = api.get_kr_current_price(ticker)\nprint(f\"삼성전자 현재가: {price} 원\")\n```\n\n### 국내 주식 최근 가격 조회 (일/주/월 OHLCV)\n```python\n# 최근 30 일/주/월 OHLCV 데이터를 DataFrame으로 반환\nticker = \"005930\"   # 삼성전자 종목코드\ntime_unit = \"D\"     # 기간 분류 코드 (D/day-일, W/week-주, M/month-월), 기본값 \"D\"\nohlcv = api.get_kr_ohlcv(ticker, time_unit)\n```\n\n### 국내 주식 하한가 조회\n```python\nticker = \"005930\"   # 삼성전자 종목코드\nprice = api.get_kr_min_price(ticker)\nprint(f\"삼성전자 하한가: {price} 원\")\n```\n\n### 국내 주식 상한가 조회\n```python\nticker = \"005930\"   # 삼성전자 종목코드\nprice = api.get_kr_max_price(ticker)\nprint(f\"삼성전자 상한가: {price} 원\")\n```\n\n### 국내 주식 잔고 조회 \n```python\n# DataFrame 형태로 국내 주식 잔고 반환 \nstock = api.get_kr_stock_balance()\nprint(f\"보유중인 국내 주식: \\n{stock}\")\n```\n\n### 국내 주식 총 예수금 조회 \n```python\ndeposit = api.get_kr_deposit()\nprint(f\"총 예수금: {deposit} 원\")\n```\n\n### 국내 주식 매수 주문\n```python\nticker = \"005930\"   # 삼성전자 종목코드\nprice = 100000      # 매수 가격 예시. 가격이 0 이하인 경우 시장가로 매수\n\n# 종목코드 ticker인 국내 주식 1주 매수 주문 \nret = api.buy_kr_stock(ticker, 1, price=price)\n\n# 반환값: 서버 응답 (주문 번호 등의 정보)\nprint(ret)\n```\n\n### 국내 주식 매도 주문 \n```python\nticker = \"005930\"   # 삼성전자 종목코드\nprice = 100000      # 매도 가격 예시. 가격이 0 이하인 경우 시장가로 매도\n\n# 종목코드 ticker인 국내 주식 1주를 지정가로 매도 주문 \nret = api.sell_kr_stock(ticker, 1, price=price)\n\n# 반환값: 서버 응답 (주문 번호 등의 정보)\nprint(ret)\n```\n\n### 정정/취소 가능한 국내 주식 주문 조회\n```python\n# 정정/취소 가능한 국내 주식 주문을 DataFrame으로 반환\norders = api.get_kr_orders()\nprint(orders)\n```\n\n### 미체결 국내 주식 주문 취소\n```python\n# order_num: 주문 번호. api.get_kr_orders 통해 확인 가능.\n# amount: 취소할 주문 수량. 지정하지 않은 경우 잔량 전부 취소.\napi.cancel_kr_order(order_num, amount)\n```\n\n### 모든 미체결 국내 주식 주문 취소\n```python\napi.cancel_all_kr_orders()\n```\n\n### 국내 주식 주문 정정\n```python\n# order_num: 주문 번호. api.get_kr_orders 통해 확인 가능.\n# price: 정정할 1주당 가격.\n# amount: 정정할 주문 수량. 지정하지 않은 경우 잔량 전부 정정.\napi.revise_kr_order(order_num, price, amount)\n```\n\n\n## 관련 참고 자료\n- [한국투자증권 KIS Developers](https://apiportal.koreainvestment.com)\n- [한국투자증권 Open Trading API Github](https://github.com/koreainvestment/open-trading-api)\n- [한국투자증권 Wikidocs](https://wikidocs.net/profile/info/book/13688)\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "",
    "license": "Apache License Version 2.0, January 2004 http://www.apache.org/licenses/  TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION  1. Definitions.  \"License\" shall mean the terms and conditions for use, reproduction, and distribution as defined by Sections 1 through 9 of this document.  \"Licensor\" shall mean the copyright owner or entity authorized by the copyright owner that is granting the License.  \"Legal Entity\" shall mean the union of the acting entity and all other entities that control, are controlled by, or are under common control with that entity. For the purposes of this definition, \"control\" means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity.  \"You\" (or \"Your\") shall mean an individual or Legal Entity exercising permissions granted by this License.  \"Source\" form shall mean the preferred form for making modifications, including but not limited to software source code, documentation source, and configuration files.  \"Object\" form shall mean any form resulting from mechanical transformation or translation of a Source form, including but not limited to compiled object code, generated documentation, and conversions to other media types.  \"Work\" shall mean the work of authorship, whether in Source or Object form, made available under the License, as indicated by a copyright notice that is included in or attached to the work (an example is provided in the Appendix below).  \"Derivative Works\" shall mean any work, whether in Source or Object form, that is based on (or derived from) the Work and for which the editorial revisions, annotations, elaborations, or other modifications represent, as a whole, an original work of authorship. For the purposes of this License, Derivative Works shall not include works that remain separable from, or merely link (or bind by name) to the interfaces of, the Work and Derivative Works thereof.  \"Contribution\" shall mean any work of authorship, including the original version of the Work and any modifications or additions to that Work or Derivative Works thereof, that is intentionally submitted to Licensor for inclusion in the Work by the copyright owner or by an individual or Legal Entity authorized to submit on behalf of the copyright owner. For the purposes of this definition, \"submitted\" means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Work, but excluding communication that is conspicuously marked or otherwise designated in writing by the copyright owner as \"Not a Contribution.\"  \"Contributor\" shall mean Licensor and any individual or Legal Entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Work.  2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare Derivative Works of, publicly display, publicly perform, sublicense, and distribute the Work and such Derivative Works in Source or Object form.  3. Grant of Patent License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this section) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Work, where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Work to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Work or a Contribution incorporated within the Work constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for that Work shall terminate as of the date such litigation is filed.  4. Redistribution. You may reproduce and distribute copies of the Work or Derivative Works thereof in any medium, with or without modifications, and in Source or Object form, provided that You meet the following conditions:  (a) You must give any other recipients of the Work or Derivative Works a copy of this License; and  (b) You must cause any modified files to carry prominent notices stating that You changed the files; and  (c) You must retain, in the Source form of any Derivative Works that You distribute, all copyright, patent, trademark, and attribution notices from the Source form of the Work, excluding those notices that do not pertain to any part of the Derivative Works; and  (d) If the Work includes a \"NOTICE\" text file as part of its distribution, then any Derivative Works that You distribute must include a readable copy of the attribution notices contained within such NOTICE file, excluding those notices that do not pertain to any part of the Derivative Works, in at least one of the following places: within a NOTICE text file distributed as part of the Derivative Works; within the Source form or documentation, if provided along with the Derivative Works; or, within a display generated by the Derivative Works, if and wherever such third-party notices normally appear. The contents of the NOTICE file are for informational purposes only and do not modify the License. You may add Your own attribution notices within Derivative Works that You distribute, alongside or as an addendum to the NOTICE text from the Work, provided that such additional attribution notices cannot be construed as modifying the License.  You may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions for use, reproduction, or distribution of Your modifications, or for any such Derivative Works as a whole, provided Your use, reproduction, and distribution of the Work otherwise complies with the conditions stated in this License.  5. Submission of Contributions. Unless You explicitly state otherwise, any Contribution intentionally submitted for inclusion in the Work by You to the Licensor shall be under the terms and conditions of this License, without any additional terms or conditions. Notwithstanding the above, nothing herein shall supersede or modify the terms of any separate license agreement you may have executed with Licensor regarding such Contributions.  6. Trademarks. This License does not grant permission to use the trade names, trademarks, service marks, or product names of the Licensor, except as required for reasonable and customary use in describing the origin of the Work and reproducing the content of the NOTICE file.  7. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Work (and each Contributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Work and assume any risks associated with Your exercise of permissions under this License.  8. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Work (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages.  9. Accepting Warranty or Additional Liability. While redistributing the Work or Derivative Works thereof, You may choose to offer, and charge a fee for, acceptance of support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability.  END OF TERMS AND CONDITIONS  APPENDIX: How to apply the Apache License to your work.  To apply the Apache License to your work, attach the following boilerplate notice, with the fields enclosed by brackets \"[]\" replaced with your own identifying information. (Don't include the brackets!)  The text should be enclosed in the appropriate comment syntax for the file format. We also recommend that a file or class name and description of purpose be included on the same \"printed page\" as the copyright notice for easier identification within third-party archives.  Copyright 2022 Jueon Park  Licensed under the Apache License, Version 2.0 (the \"License\"); you may not use this file except in compliance with the License. You may obtain a copy of the License at  http://www.apache.org/licenses/LICENSE-2.0  Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License.",
    "maintainer": "",
    "maintainer_email": "",
    "name": "pykis",
    "package_url": "https://pypi.org/project/pykis/",
    "platform": null,
    "project_url": "https://pypi.org/project/pykis/",
    "project_urls": {
      "Bug Tracker": "https://github.com/pjueon/pykis/issues",
      "Github": "https://github.com/pjueon/pykis"
    },
    "release_url": "https://pypi.org/project/pykis/0.7.0/",
    "requires_dist": [
      "pandas>=1.4",
      "requests>=2.25.1"
    ],
    "requires_python": ">=3.7",
    "summary": "A python wrapper for open trading api of Korea Investment & Securities.",
    "version": "0.7.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 14365022,
  "releases": {
    "0.7.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ab7f8877ee2e936ecfe56923b8dac246942b800e58489efbaac00df9a4d6f1c1",
          "md5": "07f00678cbbfaaf62029373389e8bad3",
          "sha256": "4c68b1ce04962c366ae2d5a679a8b9a3f6fc3154f91537456c3bde2734edf99c"
        },
        "downloads": -1,
        "filename": "pykis-0.7.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "07f00678cbbfaaf62029373389e8bad3",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 19856,
        "upload_time": "2022-07-07T14:00:13",
        "upload_time_iso_8601": "2022-07-07T14:00:13.962789Z",
        "url": "https://files.pythonhosted.org/packages/ab/7f/8877ee2e936ecfe56923b8dac246942b800e58489efbaac00df9a4d6f1c1/pykis-0.7.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "07253bedb8dffe2101d88660702487375586c0a19fcba2ab8bb206c9262e1bfe",
          "md5": "6e9af3a36100785493cff6b5e14ce422",
          "sha256": "f300b82bb8d6fc6eb538d3f40a0bd898d96a842a31d57ee2c71ee71eb9620068"
        },
        "downloads": -1,
        "filename": "pykis-0.7.0.tar.gz",
        "has_sig": false,
        "md5_digest": "6e9af3a36100785493cff6b5e14ce422",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 19289,
        "upload_time": "2022-07-07T14:00:16",
        "upload_time_iso_8601": "2022-07-07T14:00:16.502301Z",
        "url": "https://files.pythonhosted.org/packages/07/25/3bedb8dffe2101d88660702487375586c0a19fcba2ab8bb206c9262e1bfe/pykis-0.7.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "ab7f8877ee2e936ecfe56923b8dac246942b800e58489efbaac00df9a4d6f1c1",
        "md5": "07f00678cbbfaaf62029373389e8bad3",
        "sha256": "4c68b1ce04962c366ae2d5a679a8b9a3f6fc3154f91537456c3bde2734edf99c"
      },
      "downloads": -1,
      "filename": "pykis-0.7.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "07f00678cbbfaaf62029373389e8bad3",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.7",
      "size": 19856,
      "upload_time": "2022-07-07T14:00:13",
      "upload_time_iso_8601": "2022-07-07T14:00:13.962789Z",
      "url": "https://files.pythonhosted.org/packages/ab/7f/8877ee2e936ecfe56923b8dac246942b800e58489efbaac00df9a4d6f1c1/pykis-0.7.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "07253bedb8dffe2101d88660702487375586c0a19fcba2ab8bb206c9262e1bfe",
        "md5": "6e9af3a36100785493cff6b5e14ce422",
        "sha256": "f300b82bb8d6fc6eb538d3f40a0bd898d96a842a31d57ee2c71ee71eb9620068"
      },
      "downloads": -1,
      "filename": "pykis-0.7.0.tar.gz",
      "has_sig": false,
      "md5_digest": "6e9af3a36100785493cff6b5e14ce422",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7",
      "size": 19289,
      "upload_time": "2022-07-07T14:00:16",
      "upload_time_iso_8601": "2022-07-07T14:00:16.502301Z",
      "url": "https://files.pythonhosted.org/packages/07/25/3bedb8dffe2101d88660702487375586c0a19fcba2ab8bb206c9262e1bfe/pykis-0.7.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}