{
  "info": {
    "author": "Timothy Drysdale",
    "author_email": "timothy.d.drysdale@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: GNU Affero General Public License v3",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# pyoam\npython orbital angular momentum codes\n\n## Getting started\n\nIf you are already familiar with modelling antenna arrays, then you can jump straight into trying out the code. If not, here's a brief primer:\n\n### Electromagnetic radiators\n\nThe electric field at a distance from a simple electromagnetic radiator is proportional to 1/r, where r is the distance. Note that the usual conservation of energy laws require this because the power (i.e. energy/time) in an electric field must be conserved as it radiates out into space in all directions. At each instant in time, the energy summed up over the surface of the sphere of radius r must be constant, thus the energy per unit area must reduce at the rate 1/r^2. Since power is proportional to energy <img src=\"https://render.githubusercontent.com/render/math?math=P=E/t\">, and since the power of an electric field is proportional to the amplitude squared <img src=\"https://render.githubusercontent.com/render/math?math=P \\propto E^2\"> this forces the amplitude to reduce at a rate of 1/r, as explained [here](https://en.wikipedia.org/wiki/Near_and_far_field).\n\n<img src=https://quicklatex.com/cache3/4a/ql_62a5b6cac6ba46dabe7eb0c126de334a_l3.png>\n\nwhere:\n\n- A is the complex amplitude of the field (i.e. includes the phase)\n- U is the magnitude of the transmitter's radiation pattern as a function of elevation and azimuth\n- r is distance between the transmitter and the receiver (or source and destination)\n- t is the time\n- <img src=\"https://render.githubusercontent.com/render/math?math=\\theta\"> is the elevation\n- <img src=\"https://render.githubusercontent.com/render/math?math=\\phi\"> is the azimuth\n- k is the propagation constant\n\nFor an isotropic radiator, <img src=\"https://render.githubusercontent.com/render/math?math=U(\\theta,\\phi)=1\"> for all azimuth and elevation values.\n\nFor more complicated radiators, with multiple individual elements, the basic principle of the conservation of energy holds, but you are usually interested in the way the amount of energy radiated varies with the azimuth and elevation - this is sometimes called the radiation pattern or if it is an antenna array, sometimes it is also called the array factor.\n\n[//]: <> (A\\left(r,t,\\theta,\\phi\\right)\\propto\\frac{U(\\theta,\\phi)}{4\\pi}\\frac{e^{kr + \\omega t + \\Psi(\\theta,\\phi)}}{r})\n\n### Array factor (Array far field, or radiation pattern)\n\nAn array combines multiple radiators. For communications applications, radio waves are typically sufficiently low power that there are no non-linear effects occuring in the air between the transmit and receive antennas. So we can say that propagation takes place in a linear regime. That means we can use the principle of superposition to simply add up the fields arriving from different sources to find the far field at any given location far away from the antenna. If we have a list of sources, and a list of far field locations we want to know about the transmission from the array at, we have a simple task: do a complex (i.e. magnitude and phase) addition of the contribution from each source point at the first far field point on the list. Repeat for the next point on the far field list. We do this at a single frequency, i.e. we are calculating the channel properties. If we want to know about the effects on modulated signals, we can do this by repeating the calculation at different frequencies which represent the instantaneous frequencies used in the communication. Since we often have our signals limited to a specific licensed band, you will typically do the calculations for the centre frequency in the band, then the upper and lower band edges (maximum and minimum frequency). In some applications you may go further - but that is outside the scope of the present code. See background theory below for a couple of other considerations e.g. how to model the individual elements, and the effect of having multiple elements close together.\n\n### Inputs\n\nThe code requires two arrays and a parameter:\n\n- an array of source points \n- an array of destination points\n- the frequency of the transmitted signals\n\nCalculations are done on a single frequency. If you want to see the effect of varying the frequency, simply re-run the code with a different frequency setting. MKS units are assumed, so dimensions are in metres, and frequency in Hertz.\n\n#### Geometry \n\nThe calculation assumes a homogenous vaccuum with no objects - a good equivalent to modelling radio waves transmitted on a dry day, or in space. There is a bit of a difference on a rainy day at some frequencies such as millimetre-waves  - but that's probably outside the scope of your project. If you needed to model this, then you could consider extending the code to include an absorption term in the propagation. But don't do that unless you really know you need to. It's usually handled separately anyway.\n\nThe coordinate system is cartesian, i.e. defined in terms of positions on three orthogonal linear axes X, Y, Z. There is no pre-defined \"UP\" - that is over to you.\n\n#### Source points\n\nSource points have a position in 3D space, a phase and a magnitude. The frequency is the same for all source points, so we save some memory by storing the frequency as a single variable elsewhere, and not repeating it in every source point. The magnitude and phase of the source point are set by the modeller (you) - e.g. it might be eight elements spaced around the circumference of a circle, each with the phase increased by a quarter-pi compared to its neighbour in a clock-wise direction looking in the direction of transmission.\n\nSource points are assumed to be iso-tropic. You might like to consider how to modify the code to permit the usage of calculated radiation patterns. I've previously done this for far field files calculated in CST, as seen in the legacy code [here](./legacy/n2ff.py), but you could do something that used simple analytical models of dipoles, for example. In which case, you need to describe the orientation of the radiation pattern with respect to the 3D environment you have created.\n\n#### Far field sample points\n\nThe far field sample points also have a position in 3D space, and a phase and a magnitude. They have the same underlying data structure as a source point. We just treat them differently - we work out the phase and magnitude by summing the contributions from the source points.\n\n\n#### Helpers\n\nThere are some helpers you might find useful to build for yourself (if they are not yet implemented) - if they are not already implemented, you will need to code them yourself.\n\nSource helpers need to know something about the phase increment for the elements\n\n- line array - number of elements, phase increment, total length, orientation, centre point\n- circle array - number of elements, phase increment, diameter, orientation, centre-point\n\nFar-field helpers only need the geometry info\n\n- line field - number of elements, total length, orientation, centre-point\n- circle field - number of elements, diameter, orientation, centre-point\n- plane field - number of elements per side, side length, orientation, centre point\n\nThere are multiple ways to define each of these geometries - feel free to create your own methods to suit the way you want to work.\n\n#### Validation\n\nThe approach taken in this code has been validated in other implementations, by comparison to measured data, and subsequently published in peer-reviewed journals. The code in this repo can be validated by comparing to the previously published data, starting with fairly simple linear arrays and building up to OAM-generating antennas.\n\nThe first validation example is taken from Kraus, J. D. and Marhefka R. J., \"Antennas For All Applications\", 3rd Edition (International), McGraw Hill, Boston, 2002, pp.90-93. A two-element array with isotropic elements spaced half a wavelength apart, and in-phase excitation gives a well-known pattern in the elevation plane:\n\n<img src=\"./img/two_element_el.png\">\n\nAnd in the azimuth plane, a constant value:\n\n<img src=\"./img/two_element_az.png\">\n\n\n## Background Theory\n\nOrbital Angular Momentum (OAM) modes can be generated by antenna arrays. The code in this repo is intended to assist in modelling them.\n\n### Orbital Angular Momentum Modes\n\nFor an introduction to OAM, see this [tutorial](https://doi.org/10.1049/iet-map.2017.0293).\n\n### Antenna arrays\n\nTraditional antenna arrays combine two or more antenna elements to provide features such as narrower beams, and beams which can be steered to different directions. These features are often attractive to designers of communication and radar systems because narrower, steerable beams avoid wasting energy on signal that the receiver will never intercept, thereby increasing the signal-to-noise ratio, and hence the maximum possible data rate. Of course, traditional beam steering is not all that antenna arrays can do - they can also do things like create spatial modes with interesting and useful properties, such as [OAM modes](https://doi.org/10.1049/iet-map.2017.0293).\n\n#### Comments on modelling antennas and antenna arrays\n\nThere are some complicating factors we can neglect in a simple analysis of antenna arrays - the radiation pattern of the individual elements, and the parasitic effects of having more than one element in the array.\n\n##### Array element patterns\n\nArray antenna elements are often similar to antennas that are used on their own, and can be modelled in a similar way, i.e. using computationally intensive numerical software techniques so as to calculate the impact of details in the structure. There are a number of different techniques. One of the earlier methods that is useful for wire-based antennas is the Method of Moments, although I've tended to work on / use time domain methods such as [FDTD](https://doi.org/10.1002/mop.24310) and [FIT](https://doi.org/10.1049/iet-map.2015.0808). For our purposes, the differences in performance between different unit element types, and an isotropic radiator, is sufficiently small, that we can use isotropic radiators as our array elements. Just bear in mind that isotropic radiators are a theoretical oddity - they do not exist in the real world unless the emissions are [incoherent](https://en.wikipedia.org/wiki/Isotropic_radiator). \n\nYou'll know when your analysis needs to upgrade to an actual real-world antenna pattern (you'll be trying to build something and figure out how well it should work, and the difference between what you are getting and what you expect should reduce if you start to use the correct radiation pattern for the unit elements). If you are not at that stage yet, or if you are otherwise in doubt as to whether you need to go that far, then you can stick with an isotropic radiator.\n\n##### Parasitic loading effects\n\nAntennas are sensitive to the presence of other antennas, and even just metal, especially within a range of a quarter of a wavelength. If the antennas in your array are spaced sufficiently far apart, then you can neglect the effects they have on each other in your analysis to make your calculations simpler and faster. That is the approach taken in this code - but be aware that there is no built-in facility to tell you when you really should start including the mutual effects. That's up to you! Like in the previous section - if you are simply exploring the effects of different array configurations, then ignoring mutual coupling is fine. When you start trying to compare simulation and measurement, you will find you want to include the effects to explain why the results are not as good as you expected.\n\n\n\n### Legacy code\nIf you are new to OAM you can safely skip the legacy code. It deals with a particular implementation that complicates the analysis and takes more computer resource to run. The code in the legacy section of this repo combines elements of an approach used to calculate the properties of time-switched OAM antennas as reported in a 2017 EuCAP conference paper [https://doi.org/10.23919/EuCAP.2017.7928218] as applied to demonstrating the basic properties of different OAM modes, similar to those presented for a continuous wave system in Fig 4(a,b) of [2018 IET Tutorial article](https://doi.org/10.1049/iet-map.2017.0293). This code may come in handy if you want to develop any lines of investigation into time-switched antenna arrays, although bear in mind:\n\n  - the time-switched array calculations require more CPU power\n  - the modelling so far assumes there is no modulation i.e. no data\n \nIf you are not sure - skip the legacy code altogether.\n\n### Extra thoughts\n\nIf you are conducting a great many runs of the code, with similar geometries, you might like to consider developing a caching mechanism your results for later re-use, and checking for runs which boil down to the same effective geometry if measured in terms of wavelengths (spoiler - don't actually do this - but do think about it). This is a considerable development task, and the effort invested would need to be traded off against the benefits gained. There is a cost to evaluating whether to use the cached result or calculate it fresh. For complex models, it is likely that there may be some efficiencies to be gained from having a cache granularity at the level of individual destination points and subsets of source points, however they are probably outweighed by the cost of whatever hashing scheme is used to index into the cache. So don't rush into trying this .... thinking about it is a useful exercise though, because it introduces you to the idea that it is the size of the geometry in terms of wavelengths which matters. Scale the geometry down by a factor of two, and double the frequency, you get the same results. It is only when you consider material properties, which vary with frequency, that you see differences for otherwise similar scale geometries. This leads to the realisation that different frequencies of electromagnetic waves do not have intrinsically different properties - it is the materials which they interact with that cause the frequency dependence (typically due to the nature of the atomic bonds in the molecules, and the frequencies at which they resonate). Thus you can rest easy that radio waves, light from the sun, and the x-rays used in medicine achieve their different purposes through the materials they interact with - not because they are any different from each other (except in wavelength, or energy - depending on the branch of physics or engineering you are working in at the time - see [Planck's constant](https://en.wikipedia.org/wiki/Planck_constant)).\n\n\n\n\n\n\n\n\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/timdrysdale/pyoam",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "pyoam",
    "package_url": "https://pypi.org/project/pyoam/",
    "platform": "",
    "project_url": "https://pypi.org/project/pyoam/",
    "project_urls": {
      "Bug Tracker": "https://github.com/timdrysdale/pyoam/issues",
      "Homepage": "https://github.com/timdrysdale/pyoam"
    },
    "release_url": "https://pypi.org/project/pyoam/0.0.4/",
    "requires_dist": null,
    "requires_python": ">=3.6",
    "summary": "Array factor calculations for linear and orbital angular momentum mode antennas",
    "version": "0.0.4",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 10489795,
  "releases": {
    "0.0.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7cb97e454a0f778445beeef80736b04a3f3f9b09536ce90681fd91ca9c5ef528",
          "md5": "40bfc18cd482c4ec5bf626de2524a1a6",
          "sha256": "696a0fc5295469715310cb374fd7ff809a6a38be93579beb7f19b8f0c4f7dfc9"
        },
        "downloads": -1,
        "filename": "pyoam-0.0.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "40bfc18cd482c4ec5bf626de2524a1a6",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 25403,
        "upload_time": "2021-05-27T16:02:37",
        "upload_time_iso_8601": "2021-05-27T16:02:37.758990Z",
        "url": "https://files.pythonhosted.org/packages/7c/b9/7e454a0f778445beeef80736b04a3f3f9b09536ce90681fd91ca9c5ef528/pyoam-0.0.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4f394f0d72e7cd57aa390d1f9e3fd9ddd25e210feffb2162dcbde8d5d0639058",
          "md5": "b7e0aea0cb535e746909fdae427b4237",
          "sha256": "ee1e42541de5a58b11ce6049be9644a27fda8e46e4d44226bd99f52922a130eb"
        },
        "downloads": -1,
        "filename": "pyoam-0.0.4.tar.gz",
        "has_sig": false,
        "md5_digest": "b7e0aea0cb535e746909fdae427b4237",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 17855,
        "upload_time": "2021-05-27T16:02:39",
        "upload_time_iso_8601": "2021-05-27T16:02:39.023480Z",
        "url": "https://files.pythonhosted.org/packages/4f/39/4f0d72e7cd57aa390d1f9e3fd9ddd25e210feffb2162dcbde8d5d0639058/pyoam-0.0.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "7cb97e454a0f778445beeef80736b04a3f3f9b09536ce90681fd91ca9c5ef528",
        "md5": "40bfc18cd482c4ec5bf626de2524a1a6",
        "sha256": "696a0fc5295469715310cb374fd7ff809a6a38be93579beb7f19b8f0c4f7dfc9"
      },
      "downloads": -1,
      "filename": "pyoam-0.0.4-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "40bfc18cd482c4ec5bf626de2524a1a6",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6",
      "size": 25403,
      "upload_time": "2021-05-27T16:02:37",
      "upload_time_iso_8601": "2021-05-27T16:02:37.758990Z",
      "url": "https://files.pythonhosted.org/packages/7c/b9/7e454a0f778445beeef80736b04a3f3f9b09536ce90681fd91ca9c5ef528/pyoam-0.0.4-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "4f394f0d72e7cd57aa390d1f9e3fd9ddd25e210feffb2162dcbde8d5d0639058",
        "md5": "b7e0aea0cb535e746909fdae427b4237",
        "sha256": "ee1e42541de5a58b11ce6049be9644a27fda8e46e4d44226bd99f52922a130eb"
      },
      "downloads": -1,
      "filename": "pyoam-0.0.4.tar.gz",
      "has_sig": false,
      "md5_digest": "b7e0aea0cb535e746909fdae427b4237",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 17855,
      "upload_time": "2021-05-27T16:02:39",
      "upload_time_iso_8601": "2021-05-27T16:02:39.023480Z",
      "url": "https://files.pythonhosted.org/packages/4f/39/4f0d72e7cd57aa390d1f9e3fd9ddd25e210feffb2162dcbde8d5d0639058/pyoam-0.0.4.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}