{
  "info": {
    "author": "Tom Lippincott",
    "author_email": "tom.lippincott@jhu.edu",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "#####\nOCHRE\n#####\n\n****************************************************\nThe Open Computational Humanities Research Ecosystem\n****************************************************\n\nThe Open Computational Humanities Research Ecosystem (OCHRE) provides the server infrastructure and client libraries to experiment with complex machine learning and rich humanistic scholarship.\n\n.. _installation:\n\n============\nInstallation\n============\n\nThis package can be installed via `pip`::\n\n  $ pip install pyochre\n\nHowever, it's advisable to employ Python `virtual environments <https://docs.python.org/3/library/venv.html>`_ (here and in other situations), in which case you would run something like the following in a new empty directory::\n\n  $ python3 -m venv local\n  $ source local/bin/activate\n  $ pip install pyochre\n\nand run `deactivate` to exit the virtual environment, `source local/bin/acticate` to enter it again.\n\nThe simple package doesn't include certain dependencies that are important for deploying a dedicated server, but is designed to be fully functional without requiring significant modification.  There are three extra options that can be included, `ldap`, `postgres`, and `torchserve`.  For instance, to include the full set of options, the command is::\n\n  $ pip install pyochre[ldap,postgres,torchserve]\n\nNote that these options may require additional effort, such as non-Python dependencies that need to be installed independently.  For most situations, the simple package is the right choice.\n\n.. _library:\n\n=================\nLibrary structure\n=================\n\nThe package has five submodules:\n\n**pyochre.utils**\n  Various functions and classes that are generally useful in many places throughout the package\n\n**pyochre.server**\n  The OCHRE server, an orchestrated set of servers and frontends that manages the complexity of interdisciplinary computational research\n\n**pyochre.primary_sources**\n  Formal domain descriptions, data, and multimedia materials\n\n**pyochre.machine_learning**\n  Training, applying, and fine-tuning models with well-defined signatures\n\n**pyochre.scholarly_knowledge**\n  Labeling data, specifying conceptual frameworks, and comparing hypotheses\n\nThe latter three submodules correspond to basic concepts in computational humanities research, and constitute the \"client library\" that will be most relevant for the majority of users.\n\nAdditionally, the `pyochre.primary_sources`, `pyochre.machine_learning`, `pyochre.scholarly_knowledge`, and `pyochre.server` submodules can each be executed as scripts, for instance::\n\n  $ python -m pyochre.scholarly_knowledge --help\n\nwill print usage information about the `pyochre.scholarly_knowledge` script.  See the Scripts_ section for detailed information on how to use these tools.\n\n.. _concepts:\n\n=======================\nConcepts and background\n=======================\n\n.. _primary_sources:\n\n---------------\nPrimary sources\n---------------\n\nA primary source consists of the *domain*, describing types of entities and their potential properties and relationships, and the *data*, which are the actual instantiations of those types of entities, their specific properties and relationships.  For practical reasons, when a property is associated with a substantial amount of information (like a long document, image, video, etc), there is a third aspect of primary sources, *materials*, allowing them to be stored and accessed efficiently.\n\nAs a simple abstract example, primary sources of campaign contribution information might have a *domain* capturing that there are entity types *Politician*, *Office*, *Donation*, and *Organization*, that a *Politician* has text property *givenName*, relationship *runningFor* with *Office*, another property *headShot* that should be a unique identifier (that will select a file in the *materials*) and so forth.  The *domain* might have thousands of entities of each type, e.g. a *Politician* with *givenName* of \"Dan\", *runningFor* an *Office* with its own properties, and a *headShot* value of \"some_long_random_value\".  Finally, the *materials* might contain lots of image files, one of them named \"some_long_random_value\".\n\nBoth *domain* and *data* are represented using the `RDF framework <https://www.w3.org/TR/rdf11-concepts/>`_, and the representation has several goals:\n\n- Map closely to human understanding and intuition\n- Avoid introducing debatable scholarly inferences\n- Define and constrain the form of information in the primary sources\n- Provide links from the *domain* into the broader space of human knowledge\n\nEach of these requires careful consideration by the scholar, and can be sensitive to the field, the specific research, and available resources.\n\nOCHRE uses `Wikidata <https://www.wikidata.org/wiki/Wikidata:Main_Page>`_ `entities <https://www.wikidata.org/w/index.php?search=&title=Special:Search&profile=advanced&fulltext=1&ns0=1>`_ and `properties <https://www.wikidata.org/w/index.php?search=&title=Special%3ASearch&profile=advanced&fulltext=1&ns120=1>`_ for semantic links to broader human knowledge.\n\nThe `SHACL vocabulary <https://www.w3.org/TR/2017/REC-shacl-20170720/>`_ is used in domain representations to constrain how entities and properties are arranged in a given primary source.\n  \n.. _machine_learning:\n\n----------------\nMachine learning\n----------------\n\nMachine learning models, in the most general sense, are *functions* that take in some sort of information as input, and produce another sort of information as output.  By describing the structure and semantics (or the \"signature\") of these inputs and outputs for a given model, OCHRE can determine how a model can be adapted (\"trained\" or \"fine-tuned\") on new primary sources, or applied to them to infer new information.  Focusing on the structural and semantics of model input and output, there are several goals for representation:\n\n- Both input and output signatures should allow expressive specification of graph structure\n- Provenance of training data for a fitted model to facilitate parameter re-use etc\n- Output of a model, in combination with its signatures and the corresponding inputs, should allow creation of annotations of the same form as described in `Scholarly knowledge`__.\n\nOCHRE has provisionally adopted the `MLSchema specification <http://ml-schema.github.io/documentation/ML%20Schema.html>`_ to describe models, though real-world experience will determine if it is sufficiently expressive.\n\nIdeally, signatures are generated as models are assembled and trained.  In particular, OCHRE will be integrating the `Starcoder project <https://github.com/starcoder/starcoder-python>`_ to automatically generate, train, and reuse `graph neural networks <https://en.wikipedia.org/wiki/Graph_neural_network>`_ based on primary sources and scholarly knowledge, with signatures capturing the structural and semantic relationships.\n\nExisting techniques like topic models, pretrained object recognition, and so forth, are being translated into simple signatures that provide a starting point for OCHRE.\n\n.. __: scholarly_knowledge_\n.. _scholarly_knowledge:\n\n-------------------\nScholarly knowledge\n-------------------\n\nColloquially, \"scholarly knowledge\" corresponds to information not clearly immanent in primary sources themselves according to the research context.  This can be a rather subtle distinction, because it depends on the aims of the scholar and the norms of the field.  As a simple example, scholars often work with materials that have been classified in some way: for Cuneiform tablets, this might be according to language, genre, material, kingdom, and so forth.  These classifications differ greatly in certainty, tangibility, agreement, and relevance for a given scholarly effort.\n\nTrying to \"get behind\" *all* of this sort of scholarly knowledge is generally a lost cause: the closest situation might be something like archaeological fieldwork, but even that is not straightforward.  Instead, OCHRE encourages scholars to find stable, canonical materials and explicitly reify them as \"primary sources\", in the sense of \"this is what a scholar in my position treats as the foundation to build on\".  This view of \"primary sources\" will often include information like the classifications mentioned earlier, but the fact that the \"material\" was determined by a spectrogram thousands of years after an inscription was made can be represented in the primary source representation itself.\n\nTherefore, in OCHRE, \"scholarly knowledge\" roughly refers to structured information that is added and interacted with *via* OCHRE and *by* a specific, identifiable *agent*.\n\nScholarly knowledge can take an infinite variety of forms, much like primary sources themselves, and so OCHRE again uses the `RDF framework <https://www.w3.org/TR/rdf11-concepts/>`_ for its representation.  Even moreso that with model signatures, the details of this representation will need to evolve with real-world experience.\n\n-------------------------------------\nAdditional resources being considered\n-------------------------------------\n\nThere are several existing standards being considered for OCHRE's various representational needs: the `PROV ontology <https://www.w3.org/TR/2013/REC-prov-o-20130430/>`_ for describing the provenance of primary sources, models, and annotations\n\n.. _scripts:\n\n=================\nThe OCHRE Scripts\n=================\n\n.. _primary_sources_script:\n\n---------------\nPrimary sources\n---------------\n\nThe general pattern for converting a non-RDF document is: as a format is parsed, certain \"events\" fire, each of which is an opportunity to generate RDF triples based on the event and the current location in the document.\n\nEach event indicates what has just been parsed by sending a *tag*, *content*, and a dictionary of *attributes* (only *tag* is certain to have a value).  The particular tags and attributes will be specific to the format and data.  For instance, the event that fires for a cell in a CSV file in the column \"day\" with value \"Monday\" would send the tag \"cell\", the content \"Monday\", and the attribute dictionary::\n\n  {\"id\" : \"day\"}\n\nAlong with the tag and attributes, the event sends its *location*, which for most formats is the list of \"parent\" events the current event is happening under.  If the above event was happening while processing the 22nd row of a file called \"some_file.csv\", the location might be (ignore for the moment the \"uid\" entries)::\n\n  [\n    {\"tag\" : \"table\", \"content\" : \"\", \"attributes\" : {\"id\" : \"some_file.csv\"}, \"uid\" : \"43k2\"},\n    {\"tag\" : \"row\", \"content\" : \"\", \"attributes\" : {\"id\" : \"22\"}, \"uid\" : \"213j\"}\n  ]\n\nNo matter the format (CSV, XML, etc), events have the same structure, and in fact the event just described might be this JSON object::\n\n  {\n    \"tag\" : \"cell\",\n    \"attributes\" : {\"id\" : \"day\", \"value\" : \"Monday\"},\n    \"location\" : [\n      {\"tag\" : \"table\", \"attributes\" : {\"id\" : \"some_file.csv\"}, \"uid\" : \"43k2\"},\n      {\"tag\" : \"row\", \"attributes\" : {\"id\" : \"22\"}, \"uid\" : \"213j\"}\n    ],\n    \"uid\" : \"t98f\"\n  }\n  \nAgain, the possible values for *tag* will depend on the format (HTML won't ever have a \"row\" tag, but might have \"div\", \"body\", etc), as will the *attributes* dictionary.\n\nThe goal is to decide what RDF triples to generate when seeing an event.  This involves specifying rules that 1) can be determined if they match the event, and 2) describe the RDF triple(s) to create from it.  Here is an example of a match portion::\n\n  {\n    \"tag\" : [\"cell\"],\n    \"attributes\" : {\"id\" : [\"day\"]}\n  }\n\nNote how it constrains the tag and the attribute \"id\" by giving a list of acceptable values.\n  \nHere is an example of a creation portion with some placeholders for readability, that creates the two triples (S, P1, O1) and (S, P2, O2) when its rule matches::\n    \n  {\n    \"subject\" : S,\n    \"predicate_objects\" : [\n      {\n        \"predicate\" : P1,\n\t\"object\" : O1\n      },\n      {\n        \"predicate\" : P2,\n\t\"object\" : O2\n      }\n    ]\n  }\n    \nThe placeholders are a bit more interesting: they tell OCHRE how to create an RDF node based on the event.  Here is an example that creates an RDF integer literal node that doesn't depend at all on the event::\n\n  {\n    \"type\" : \"literal\",\n    \"datatype\" : \"integer\",\n    \"value\" : \"27\"\n  }\n\nHere is an example that also creates an integer literal node, but based on the event::\n\n  {\n    \"type\" : \"literal\",\n    \"datatype\" : \"integer\",\n    \"value\" : \"{content}\"\n  }\n\nIn the CSV example, if the rule were matching rows, this would correspond to the row number.  This curly-braces interpolation can also be used to refer to attributes and locations in the event, and mixed arbitrarily with bare strings, allowing the extraction of fairly sophisticated patterns.\n\nHere is an example that creates a URI node, directly specifying the Wikidata entry for \"photograph\"::\n\n  {\n    \"type\" : \"uri\",\n    \"value\" : \"wd:Q125191\"\n  }\n\nImportantly, most entities in a primary source will not have a clear corresponding entity in Wikidata (e.g. there may be a long list of photos, so the above example is useful for saying \"this is an instance of a photo\", but not for referring to *this* or *that* specific photo).  To handle this, every time an event occurs, OCHRE creates a *unique identifier* based on the event.  This unique identifier is the \"uid\" seen in the full event example above, and can be interpolated as-needed to derive unique URIs.  For instance::\n\n  {\n    \"type\" : \"uri\",\n    \"value\" : \"ochre:{uid}\"\n  }\n\nis an entity in the OCHRE namespace corresponding to the particular event being processed.\n\nFinally, OCHRE keeps track of the sequential number of each tag value within one tier of the input, and this number can be interpolated with \"index\".  For example, if the input involves processing sentences, each of which are a sequence of words, the string \"{index}\" within a word-rule will give the current word's number within its sentence, starting from 0.\n\n^^^^^^^^^\nMaterials\n^^^^^^^^^\n\nThe mechanisms described above are for generating RDF.  There is also the need to connect parts of RDF to *materials*, larger files that don't belong directly in the RDF graph, such as JPGs, audio recordings, and long documents.  To accomplish this, there is special information that can be added to an entry in a \"predicate_object\" list::\n\n  {\n    \"predicate\" : P,\n    \"object\" : O,\n    \"file\" : \"path/some_file_{attributes['name']}.jpg\",\n    \"file_type\" : \"image/jpg\"\n  }\n\nWhen the *pyochre.primary_sources* script encounters a \"file\" like this, it looks for it on the local filesystem.  If found, it creates a unique identifier *I* based on the file's contents, and adds an additional RDF triple that links it to the object in the predicate_object rule (roughly, (O, hasMaterialId, I)) indicating \"the entity O has an associated file identified with the id I\".  Then, after OCHRE creates the RDF graph, it also uploads all such files in the appropriate fashion.\n  \n.. _machine_learning_script:\n\n----------------\nMachine learning\n----------------\n\nWhile the ultimate aim is for OCHRE to employ and generate complex models, there are already several simple types of models that can be incorporated via the *pyochre.machine_learning* script.  Ultimately, all models are transformed into `MAR archives <https://github.com/pytorch/serve/tree/master/model-archiver#artifact-details>`_, so other than the case of `Existing MAR archives`_, these situations are essentially different ways of *building* such an archive for a particular type of model.\n\n^^^^^^^^^^^^^^^^^^^^^\nExisting MAR archives\n^^^^^^^^^^^^^^^^^^^^^\n\nThe simplest scenario::\n\n  $ python -m pyochre.machine_learning create --mar_url https://torchserve.pytorch.org/mar_files/maskrcnn.mar --name \"Object detection\" --signature_file https://github.com/comp-int-hum/ochre-python/raw/main/examples/object_detection_signature.ttl\n\n^^^^^^^^^^^^\nTopic models\n^^^^^^^^^^^^\n\n^^^^^^^^^^^^^^^^^^\nHuggingface models\n^^^^^^^^^^^^^^^^^^\n\n^^^^^^^^^^^^^\nCustom models\n^^^^^^^^^^^^^\n\n.. _scholarly_knowledge_script:\n\n-------------------\nScholarly knowledge\n-------------------\n\n.. _server_script:\n\n------\nServer\n------\n\nThe package also contains the server side of OCHRE under the `pyochre.server` submodule.  When invoked as a script, it functions in most ways as a standard [Django](https://docs.djangoproject.com/en/4.1/) project's `manage.py` script::\n\n  $ python -m pyochre.server --help\n\nThe database for the server can be initialized and initial user created by running::\n\n  $ python -m pyochre.server migrate\n  $ python -m pyochre.server createcachetable\n  $ python -m pyochre.server collectstatic\n  $ python -m pyochre.server shell_plus\n  >> u = User.objects.create(username=\"joe\", email=\"joe@somewhere.net\", is_staff=True, is_superuser=True)\n  >> u.set_password(\"CHANGE_ME\")\n  >> u.save()\n\nFinally, start the server with::\n  \n  $ python -m pyochre.server runserver\n\nAt this point you should be able to browse to http://localhost:8000 and interact with the site.  Note that it will only be accessible on the local computer and this is by design: it is running without encryption, and using infrastructure that won't scale well and doesn't implement some important functionality.\n\n.. _advanced_topics:\n\n===============\nAdvanced topics\n===============\n\n--------------------------------------\nConverting a new primary source format\n--------------------------------------\n\n---------------------------------------\nRunning a full \"production\"-like server\n---------------------------------------\n\nTo run a full-functioning (though resource-constrained) OCHRE server on your personal computer you'll need to take a few more steps than the simple procedure described in the Server_ section.\n\nFirst, install either `Docker <https://www.docker.com/>`_ or `Podman <https://podman.io/>`_, depending on what's available or easiest for your operating system.  In what follows, substitute \"docker\" for \"podman\" if you installed the former.\n\nSecond, start containers for the Jena RDF database and the Redis cache::\n\n  $ podman run -d --rm --name jena -p 3030:3030 -e ADMIN_PASSWORD=CHANGE_ME docker.io/stain/jena-fuseki\n  $ podman run -d --rm --name redis -p 6379:6379 docker.io/library/redis\n\nThird, the Celery execution server and Torchserve model server each need to run alongside the OCHRE server.  The simplest way to accomplish this is to open two more terminals, navigate to the virtual environment directory where OCHRE is installed, run::\n\n  $ source local/bin/activate\n\nto enter the same virtual environment as the OCHRE package, and then run the following commands, one in each terminal::\n\n  $ celery -A pyochre.server.ochre worker -l DEBUG\n  $ torchserve --model-store ~/ochre/models/ --foreground --no-config-snapshots\n\nAt this point, with the two containers running (can be verified with `podman ps`), and Celery and TorchServe running in separate terminals, running::\n\n  $ USE_JENA=True USE_TORCHSERVE=True python -m pyochre.server runserver\n\nShould start the OCHRE server, and the site should work near-identically to when it's officially deployed.\n\n",
    "description_content_type": "",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/comp-int-hum/ochre-python",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "pyochre",
    "package_url": "https://pypi.org/project/pyochre/",
    "platform": null,
    "project_url": "https://pypi.org/project/pyochre/",
    "project_urls": {
      "Homepage": "https://github.com/comp-int-hum/ochre-python"
    },
    "release_url": "https://pypi.org/project/pyochre/0.0.4/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "Client and server for the Open Computational Humanities Research Ecosystem (OCHRE)",
    "version": "0.0.4",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16275485,
  "releases": {
    "0.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f4c79ab50ee45f008f9db6515c0c1ec53362ae0f8e46d82237a08dba71be5bb0",
          "md5": "3f6df73d90d8c7c85796a2b8c0310d9c",
          "sha256": "f770c5d74b84a117ac4f1282065bf17bb50152c434c22b05598ff2e21c13fb25"
        },
        "downloads": -1,
        "filename": "pyochre-0.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "3f6df73d90d8c7c85796a2b8c0310d9c",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 9948,
        "upload_time": "2022-12-29T16:48:05",
        "upload_time_iso_8601": "2022-12-29T16:48:05.257782Z",
        "url": "https://files.pythonhosted.org/packages/f4/c7/9ab50ee45f008f9db6515c0c1ec53362ae0f8e46d82237a08dba71be5bb0/pyochre-0.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4b260e1bcdd0df43466d7cff6d71e38ab892c11a209ed7472edd59e75c14eff7",
          "md5": "e5b0a523ac38eb8a9a93f4c3306d0d52",
          "sha256": "4bb2e533d04031053732b145fe85648bfea236c82891f638dbc3ec9cfc7a7c77"
        },
        "downloads": -1,
        "filename": "pyochre-0.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "e5b0a523ac38eb8a9a93f4c3306d0d52",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 9201,
        "upload_time": "2022-12-29T16:58:46",
        "upload_time_iso_8601": "2022-12-29T16:58:46.396970Z",
        "url": "https://files.pythonhosted.org/packages/4b/26/0e1bcdd0df43466d7cff6d71e38ab892c11a209ed7472edd59e75c14eff7/pyochre-0.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "53437d675d330fde3fdcfa71cf0bee4e5e4357bf99d7d06d6b1d52c2dea063b4",
          "md5": "09b385d535215d740f345e7b7b180ccc",
          "sha256": "402f0a6e9b6fc6cdea4a582e6694704692fd598282112b8d29d6a38df9489f51"
        },
        "downloads": -1,
        "filename": "pyochre-0.0.3.tar.gz",
        "has_sig": false,
        "md5_digest": "09b385d535215d740f345e7b7b180ccc",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 9201,
        "upload_time": "2022-12-29T17:00:26",
        "upload_time_iso_8601": "2022-12-29T17:00:26.479035Z",
        "url": "https://files.pythonhosted.org/packages/53/43/7d675d330fde3fdcfa71cf0bee4e5e4357bf99d7d06d6b1d52c2dea063b4/pyochre-0.0.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "43b94dbe2bb106bc91035428c66b07cd2931d167248192e15aa7455dc8dbdd61",
          "md5": "28c2499239780a110c736f2e7b2f80bb",
          "sha256": "c75f506455860a336d256497e11ff3884866d007710d9580502d3e525aafb687"
        },
        "downloads": -1,
        "filename": "pyochre-0.0.4.tar.gz",
        "has_sig": false,
        "md5_digest": "28c2499239780a110c736f2e7b2f80bb",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 403739,
        "upload_time": "2023-01-02T01:25:06",
        "upload_time_iso_8601": "2023-01-02T01:25:06.010667Z",
        "url": "https://files.pythonhosted.org/packages/43/b9/4dbe2bb106bc91035428c66b07cd2931d167248192e15aa7455dc8dbdd61/pyochre-0.0.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "43b94dbe2bb106bc91035428c66b07cd2931d167248192e15aa7455dc8dbdd61",
        "md5": "28c2499239780a110c736f2e7b2f80bb",
        "sha256": "c75f506455860a336d256497e11ff3884866d007710d9580502d3e525aafb687"
      },
      "downloads": -1,
      "filename": "pyochre-0.0.4.tar.gz",
      "has_sig": false,
      "md5_digest": "28c2499239780a110c736f2e7b2f80bb",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 403739,
      "upload_time": "2023-01-02T01:25:06",
      "upload_time_iso_8601": "2023-01-02T01:25:06.010667Z",
      "url": "https://files.pythonhosted.org/packages/43/b9/4dbe2bb106bc91035428c66b07cd2931d167248192e15aa7455dc8dbdd61/pyochre-0.0.4.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}