{
  "info": {
    "author": "Pedro Luis Soto Santos",
    "author_email": "pepoluis712@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 4 - Beta",
      "Intended Audience :: Developers",
      "Intended Audience :: Education",
      "Intended Audience :: Science/Research",
      "License :: OSI Approved :: MIT License",
      "Natural Language :: English",
      "Natural Language :: Spanish",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3",
      "Topic :: Games/Entertainment :: Board Games",
      "Topic :: Scientific/Engineering :: Artificial Intelligence",
      "Topic :: Software Development :: Libraries :: Python Modules",
      "Typing :: Typed"
    ],
    "description": "# pyplAI\r\n\r\n## Introducción\r\nEsta biblioteca para Python es el resultado final de un Trabajo de Fin de Grado centrado en la implementación de algoritmos de *Monte Carlo Tree Search* (MCTS) y *minimax* para diferentes tipos de juegos de mesa, entre ellos, según clasifica la teoría de juegos, los juegos de información perfecta, como lo son *el ajedrez* o *las damas*, en los que en todo momento cualquier jugador puede ver toda la información del juego, como los posibles movimientos del rival, y juegos de información imperfecta, como lo son la mayoría de juegos de cartas como por ejemplo *el Uno* o *la brisca*, en el que los jugadores solo conocen información propia, como sus cartas, o información general del juego, como el estado de la mesa, pero desconocen la información del rival, como las cartas de los demás jugadores.\r\n\r\n### Juegos de Información Perfecta\r\n\r\nPara este tipo de juegos se han implementado los algoritmos de MCTS con UCT [[1]](#MCTS) y minimax con la técnica de poda de alfa-beta [[2]](#Minimax). Además, como ejemplos para ver el correcto uso de la biblioteca, se han creado diferentes juegos de mesa, entre ellos, *TicTacToe* (3 en raya), *Ultimate TicTacToe* [[3]](#UltimateTicTacToe) y *las damas*.\r\n\r\n### Juegos de Información Imperfecta\r\n\r\nPara este segundo tipo de juegos se han implementado dos algoritmos, el *Single Observer Information Set Monte Carlo Tree Search* [[4]](#ISMCTS) (SO-ISMCTS) y el *Multiple Observer Information Set Monte Carlo Tree Search* [[4]](#ISMCTS) (MO-ISMCTS). El primero de estos algoritmos genera un único árbol desde el punto de vista del jugador al que le toca jugar. Por otro lado, el segundo algoritmo crea un árbol para cada uno de los jugadores y agrupa las acciones que son indiferenciables desde el punto de vista de este jugador, es decir, si un jugador puede realizar varios movimientos que no aportarían información a los rivales, agrupa estos movimientos como si fuesen uno solo, creando un único nodo en el árbol de los jugadores rivales.\r\n\r\nUn ejemplo serían los juegos en los que un jugador intercambia una de las cartas de su mano con cualquier carta de la baraja, cuando el jugador efectúa este intercambio los demás jugadores no reciben ningún tipo de información sobre el intercambio de cartas, por lo que su conocimiento sobre el estado del juego no cambia. \r\n\r\nPara estos algoritmos también se han desarrollado varios juegos como ejemplos de uso de la biblioteca, aunque ambos algoritmos se pueden usar en todos los juegos de información imperfecta, se ha diferenciado entre juegos para el SO-ISMCTS y el MO-ISMCTS. Para el primer algoritmo se ha creado *el juego de la escoba*, *el Stratego* y *el blackJack*, y para el segundo se ha desarrollado *el holjjak* (juego de adivinar las canicas del rival) y *el phantom* (variante del 4 en raya en el que no se ven los movimientos del rival).\r\n\r\n## Manual de Uso\r\nEl primer paso necesario para poder usar esta biblioteca es descargarla. Se puede descargar la biblioteca desde la consola usando el comando: \r\n\r\n``` python\r\npip install pyplAI\r\n```\r\n\r\nTras esto, ya se puede importar en el archivo de Python del juego al que queramos implementarla.\r\n\r\n``` python\r\nimport pyplAI\r\n```\r\n\r\n### Clase sobre el Estado del Juego\r\nPara poder usar esta biblioteca es imprescindible que haya una clase que guarde la información necesaria sobre el estado del juego. Aunque se puede dar a esta clase el nombre que se desee, en este manual se utilizará una clase llamada *Juego* a modo de ejemplo.\r\n\r\n``` python\r\n  class Juego:\r\n          .\r\n          .\r\n          .\r\n```\r\n\r\n### Atributo Obligatorio *jugadorActual*\r\nDebido a que los algoritmos necesitan saber cuál es el jugador al cual le toca jugar en cada uno de los turnos, es obligatorio añadir un atributo *jugadorActual* en la clase del juego. Además, es muy importante que este atributo tenga este mismo nombre.\r\n\r\n``` python\r\n  class Juego:\r\n    def __init__(self):\r\n        self.jugadorActual = 1\r\n                .\r\n                .\r\n                .\r\n```\r\n\r\nEste atributo debe contener un valor numérico que representa el índice del jugador al que le toca jugar (empezando por 1). También, debe ir actualizándose conforme se avanza en el juego, por ejemplo, en el *3 en raya*, este atributo se debe iniciar con el valor 1, pero cuando el primer jugador realice su movimiento, se actualiza al valor 2, indicando que el segundo jugador es el que debe realizar su jugada.\r\n\r\nAdemás del atributo para identificar el jugador actual del estado del juego, esta clase deberá implementar ciertos métodos para poder interactuar y obtener información sobre el estado del juego. Algunos métodos son comunes para todos los algoritmos, mientras que otros algoritmos requieren de métodos específicos. Cabe destacar que estos métodos pueden ser nombrados de forma distinta a como se mostrará a continuación, pero es totalmente necesario que reciban los parámetros de entrada y devuelvan la salida tal y como se especifica en este manual.\r\n\r\n### Métodos Generales\r\n\r\nLos siguientes 4 métodos serán obligatorios para todos los algoritmos que se implementan en esta biblioteca:\r\n\r\n**•\tobtiene_movimientos(self):** Devolverá una lista con todos los movimientos posibles del jugador actual del estado del juego, es recomendable devolver estos movimientos en un orden aleatorio.\r\n\r\n``` python\r\n  class Juego:\r\n          .\r\n          .\r\n          .\r\n        def obtiene_movimientos(self):\r\n                    .\r\n                    .\r\n                    .\r\n            return movimientos\r\n```\r\n\r\n**•\taplica_movimiento(self, movimiento):** Aplicará el movimiento dado al estado del juego y devolverá el estado resultante (*self*).\r\n\r\n``` python\r\n  class Juego:\r\n          .\r\n          .\r\n          .\r\n        def aplica_movimiento(self, movimiento):\r\n                    .\r\n                    .\r\n                    .\r\n            return self\r\n```\r\n\r\n**•\tes_estado_final(self):** Comprueba el estado actual del juego, devolviendo *True* o *False* dependiendo de si es un estado final o no.\r\n\r\n``` python\r\n  class Juego:\r\n          .\r\n          .\r\n          .\r\n        def es_estado_final(self):\r\n                    .\r\n                    .\r\n                    .\r\n            return True\r\n              o\r\n            return False\r\n```\r\n\r\n**•\tgana_jugador(self, jugador):** Comprueba si el jugador dado gana el juego en el estado actual de este, devolviendo *True* en caso de que sea ganador, o *False* en caso contrario. La variable *jugador* debe ser un número entero positivo, y se debe situar en el rango de 1, para el primer jugador del juego, hasta *n*, siendo *n* el número total de jugadores.\r\n\r\n``` python\r\n  class Juego:\r\n          .\r\n          .\r\n          .\r\n        def gana_jugador(self, jugador):\r\n                    .\r\n                    .\r\n                    .\r\n            return True\r\n              o\r\n            return False\r\n```\r\n\r\n### Métodos SO/MO-ISMCTS\r\n\r\nAdemás de los 4 métodos anteriores, los algoritmos de *SO-ISMCTS* y *MO-ISMCTS* necesitan un método adicional para su uso, el cuál se explica a continuación:\r\n\r\n**•\tdeterminación(self):** Devuelve una determinación aleatoria del estado del juego, desde el punto de vista del jugador actual.\r\n\r\n``` python\r\n  class Juego:\r\n          .\r\n          .\r\n          .\r\n        def determinacion(self):\r\n                    .\r\n                    .\r\n                    .\r\n            return determinacion\r\n```\r\n\r\nPor ejemplo, para un juego de cartas en el que cada jugador tiene una mano, hay una mesa con cartas visibles, una pila de descartes y un mazo de robo inicial, el jugador actual no tiene conocimiento sobre las cartas del rival ni las cartas del mazo de robo, pero si sabe cuáles son sus cartas, las de la mesa y las que han sido mandadas a la pila de descartes, por lo que tiene la información sobre cuáles son las cartas restantes, pero aún no sabe donde se encuentran. \r\n\r\nCon esta información, este método debe dar un estado del juego en el que aleatoriamente se distribuyan las cartas que el jugador no tiene localizadas entre las zonas en las que no sabe que cartas hay, en este caso, las zonas serían las manos de los rivales y el mazo de robo.\r\n\r\n### Métodos MO-ISMCTS\r\n\r\nAdemás, para el funcionamiento del algoritmo *MO-ISMCTS* se necesitará otro método adicional:\r\n\r\n**•\tes_movimiento_visible(movimiento):** Este método, dado un movimiento, devuelve *True* si es un movimiento visible para los rivales, o *False* en caso contrario.\r\n\r\n``` python\r\n  class Juego:\r\n          .\r\n          .\r\n          .\r\n        def es_movimiento_visible(movimiento):\r\n                    .\r\n                    .\r\n                    .\r\n            return True\r\n              o\r\n            return False\r\n```\r\n\r\nPor ejemplo, un movimiento visible para los rivales sería jugar una carta de tu mano sobre la mesa, por lo que, haría saber a los rivales el lugar exacto de esa carta, cosa que antes no sabían. Sin embargo, un movimiento no visible sería intercambiar una carta de tu mano con el mazo de robo sin revelar ninguna de las dos. Esta acción no mostraría nueva información a ningún rival, ya que no se muestran las cartas y los rivales seguirán sin saber que cartas hay en tu mano ni que cartas hay en el mazo.\r\n\r\n### Métodos Minimax\r\n\r\nEn el caso del algoritmo de *minimax*, además de los 4 métodos generales, se necesita un método que devuelva una heurística sobre el estado del juego, es decir, que evalúe su estado para saber como de bueno es desde el punto de vista de un jugador dado:\r\n\r\n**•\theuristica(self, jugador):** Este método debe devolver un número entero que refleje una evaluación sobre como de bueno es el estado del juego para un jugador dado. Esta evaluación debe ser mayor cuanto mejor sea el estado del juego para este jugador.\r\n\r\n``` python\r\n  class Juego:\r\n          .\r\n          .\r\n          .\r\n        def heuristica(self, jugador):\r\n                    .\r\n                    .\r\n                    .\r\n            return evaluacion\r\n```\r\n\r\nPor ejemplo, para el juego de *las damas* una posible heurística sería contar el número de fichas del jugador y restarle el número de fichas del rival. Hay multitud de posibles heurísticas para cada uno de los juegos, y se debe tener un conocimiento sobre el juego para poder crear una buena heurística, ya que la heurística tendrá un gran peso a la hora de decidir cuál es el mejor movimiento.\r\n\r\nAl igual que en el método *gana_jugador*, el argumento *jugador* debe ser un número entero positivo, desde el 1, para el primer jugador, hasta *n*, para el último jugador, siendo *n* el número total de jugadores.\r\n\r\n### Constructor Algoritmo\r\n\r\nUna vez tengamos todos estos métodos solamente debemos llamar a la biblioteca y al constructor del algoritmo que se desee utilizar. A esta llamada le pasaremos como argumentos los métodos necesarios para el uso de este algoritmo junto con algunas otras variables que detallaremos a continuación:\r\n\r\n**•\tnumeroJugadores:** Este argumento es obligatorio para todos los algoritmos,  representará el número de jugadores que contiene el juego, siendo este un número entero mayor que cero.\r\n\r\n**•\ttiempoEjecucion:** Este argumento es común para todos los algoritmos de Monte Carlo, ya que, estos algoritmos necesitan un tiempo límite de ejecución antes de devolver el mejor movimiento encontrado. Este argumento debe ser un número real mayor que cero y representa el tiempo de ejecución en segundos.\r\n\r\n**•\tprofundidadBusqueda:** Este argumento solo es necesario en la llamada al constructor del algoritmo de *minimax*, y sirve para limitar la profundidad en el árbol de búsqueda. Este argumento debe ser un número entero mayor que cero.\r\n\r\nSabiendo todo esto ya podemos ver como se deben hacer las llamadas a la biblioteca y los constructores para cada uno de los tipos de algoritmos. Es muy importante que se siga el orden mostrado en los argumentos de entrada. Además, recordar que *Juego* es la clase de ejemplo que contiene la información sobre el estado del juego, como el atributo *jugadorActual*, y los métodos explicados anteriormente.\r\n\r\n**•\tMCTS:**\r\n\r\n``` python\r\n  mcts = pyplAI.MCTS(\r\n         Juego.aplica_movimiento,\r\n         Juego.obtiene_movimientos, \r\n         Juego.es_estado_final, \r\n         Juego.gana_jugador, \r\n         numeroJugadores, \r\n         tiempoEjecucion)\r\n```\r\n\r\n**•\tMinimax:**\r\n\r\n``` python\r\n  minimax = pyplAI.Minimax(\r\n           Juego.aplica_movimiento,\r\n           Juego.obtiene_movimientos, \r\n           Juego.es_estado_final, \r\n           Juego.gana_jugador, \r\n           Juego.heuristica,\r\n           numeroJugadores, \r\n           profundidadBusqueda)\r\n```\r\n\r\n**•\tSO-ISMCTS:**\r\n\r\n``` python\r\n  so_ismcts = pyplAI.SOISMCTS(\r\n              Juego.aplica_movimiento,\r\n              Juego.obtiene_movimientos, \r\n              Juego.es_estado_final, \r\n              Juego.gana_jugador, \r\n              Juego.determinacion,\r\n              numeroJugadores, \r\n              tiempoEjecucion)\r\n```\r\n\r\n**•\tMO-ISMCTS:**\r\n\r\n``` python\r\n  mo_ismcts = pyplAI.MOISMCTS(\r\n              Juego.aplica_movimiento,\r\n              Juego.obtiene_movimientos, \r\n              Juego.es_estado_final, \r\n              Juego.gana_jugador, \r\n              Juego.determinacion,\r\n              Juego.es_movimiento_visible,\r\n              numeroJugadores, \r\n              tiempoEjecucion)\r\n```\r\n\r\n**•\tModo *verbose*:**\r\n\r\nSi queremos ver algunos detalles cuando ejecutemos el algoritmo, se debe añadir un *True* como último argumento en la llamada al constructor. Este modo mostrará información útil del algoritmo por consola, como por ejemplo, tiempo de ejecución, número de nodos creados y visitados y demás características propias de cada uno de los algoritmos. Un ejemplo de como quedaría la creación del algoritmo de MCTS con este argumento extra sería el siguiente:\r\n\r\n``` python\r\n  mcts = pyplAI.MCTS(\r\n         Juego.aplica_movimiento,\r\n         Juego.obtiene_movimientos, \r\n         Juego.es_estado_final, \r\n         Juego.gana_jugador, \r\n         numeroJugadores, \r\n         tiempoEjecucion,\r\n         True)\r\n```\r\n\r\n### Ejecución Algoritmo\r\n\r\nUna vez tengamos el objeto del algoritmo que se quiere utilizar solamente se debe llamar a su método *ejecuta* y pasarle como argumento el objeto que contiene el estado actual del juego, esto devolverá el mejor movimiento encontrado durante el tiempo de computación dado, para los algoritmos de *Monte Carlo*, o la profundidad de búsqueda, en el caso del algoritmo *minimax*. A continuación, se mostrará el código de ejemplo en el que se usa el algoritmo de *MCTS* para obtener un movimiento y seguidamente aplicarlo al juego, obtiendo así un nuevo estado del juego:\r\n\r\n``` python\r\n  def main():\r\n      juego = Juego()\r\n      movimiento = mcts.ejecuta(juego)\r\n      juego = aplica_movimiento(movimiento)\r\n```\r\n\r\n\r\nEn caso de que el estado del juego no tenga ningún movimiento posible para aplicar los algoritmos devolverán *None*, y si solo hay un posible movimiento para aplicar, para ahorrar cálculos innecesarios, se devolverá el único movimiento posible.\r\n\r\nSi se tienen dudas sobre como integrar la biblioteca a juegos propios se recomienda ver los juegos del repositorio de *GitHub* ([*pyplAI*](https://github.com/plss12/pyplAI)) como ejemplos de uso. Este repositorio contiene la biblioteca y todos los juegos nombrados en la introducción de este manual, incluyendo las implementaciones de los algoritmos correspondientes con cada uno de ellos.\r\n\r\n## Contacto\r\n\r\nEn caso de tener alguna duda, idea o aportación sobre la biblioteca por favor contactar al siguiente correo: [pepoluis712@gmail.com](mailto:pepoluis712@gmail.com)\r\n\r\n## Referencias\r\n\r\n<a id=\"MCTS\"></a>\r\n[1] Cameron B. Browne, Edward Powley, Daniel Whitehouse, Simon M. Lucas, Peter I.Cowling, Philipp Rohlfshagen, Stephen Tavener, Diego Perez, Spyridon Samoth-rakis, and Simon Colton. A survey of monte carlo tree search methods. IEEETransactions on Computational Intelligence and AI in Games, 4(1):1–43, 2012. doi:10.1109/TCIAIG.2012.2186810. URL https://ieeexplore.ieee.org/document/6145622.\r\n\r\n<a id=\"Minimax\"></a>\r\n[2] Patricio Mendoza. Alpha-beta pruning algorithm: The intelligence behind strategygames. page 9, 2022. URL https://www.researchgate.net/publication/360872512.\r\n\r\n<a id=\"UltimateTicTacToe\"></a>\r\n[3] Eytan Lifshitz and David Tsurel. Ai approaches to ultimate tic-tac-toe. page 5, 2013. URL https://www.cs.huji.ac.il/w~ai/projects/2013/UlitmateTic-Tac-Toe/files/report.pdf.\r\n\r\n<a id=\"ISMCTS\"></a>\r\n[4] Peter I. Cowling, Edward J. Powley, and Daniel Whitehouse. Information setmonte carlo tree search. IEEE Transactions on Computational Intelligence and AIin Games, 4(2):120–143, 2012. doi: 10.1109/TCIAIG.2012.2200894. URL https://ieeexplore.ieee.org/document/6203567.\r\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/plss12/pyplAI",
    "keywords": "python,articial intelligence,AI,games,board games,minimax,alpha-beta,monte carlo,monte carlo tree search,UCT,game theory,information set,perfect information,imperfect information",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "pyplAI",
    "package_url": "https://pypi.org/project/pyplAI/",
    "platform": null,
    "project_url": "https://pypi.org/project/pyplAI/",
    "project_urls": {
      "Homepage": "https://github.com/plss12/pyplAI"
    },
    "release_url": "https://pypi.org/project/pyplAI/1.0.2/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "Biblioteca para Python con algoritmos de resolución de juegos de mesa (minimax, MCTS, SO-ISMCTS y MO-ISMCTS)",
    "version": "1.0.2",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17443520,
  "releases": {
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "02a0f83f920bdb54a674662e3568b620f26fca222e51e9458c8bfd8bec2c8178",
          "md5": "7786c2a83e22918b80ca044e6d5a9576",
          "sha256": "b47eea5f310bd5a7c74b0bfada27f19ceab7c88f5d22f1ace0f7f3a2f5b1262b"
        },
        "downloads": -1,
        "filename": "pyplAI-1.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "7786c2a83e22918b80ca044e6d5a9576",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 12106,
        "upload_time": "2023-03-18T14:06:02",
        "upload_time_iso_8601": "2023-03-18T14:06:02.650967Z",
        "url": "https://files.pythonhosted.org/packages/02/a0/f83f920bdb54a674662e3568b620f26fca222e51e9458c8bfd8bec2c8178/pyplAI-1.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d6ad31930a293f77bc07bd3093186345b5fa5bc254f29db5b13c866ce19c250f",
          "md5": "44ed39a283d900cf09de86cb68839d9b",
          "sha256": "b18760ef5e561145c9afae49830f1ff1ac4688c27abd3775b8f24f6ebf30d31b"
        },
        "downloads": -1,
        "filename": "pyplAI-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "44ed39a283d900cf09de86cb68839d9b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 18096,
        "upload_time": "2023-03-18T14:06:04",
        "upload_time_iso_8601": "2023-03-18T14:06:04.899283Z",
        "url": "https://files.pythonhosted.org/packages/d6/ad/31930a293f77bc07bd3093186345b5fa5bc254f29db5b13c866ce19c250f/pyplAI-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5fbce8b3511385f2fb6988a6f81c361a6bb14644088b55442316d2bf8ad107d6",
          "md5": "db8783377f6eed84cd76dacbc3d52149",
          "sha256": "bdc5ef6911cb8e02054e55cf83aae8e03fa7611d10f7298b8e01314e37e883e5"
        },
        "downloads": -1,
        "filename": "pyplAI-1.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "db8783377f6eed84cd76dacbc3d52149",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 12095,
        "upload_time": "2023-03-23T22:49:44",
        "upload_time_iso_8601": "2023-03-23T22:49:44.305449Z",
        "url": "https://files.pythonhosted.org/packages/5f/bc/e8b3511385f2fb6988a6f81c361a6bb14644088b55442316d2bf8ad107d6/pyplAI-1.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e89e3c8217ff9ebe5f1eb00f4bd7ae2805d86fa6fd12418971e29e612d5de16e",
          "md5": "33e0764515dfad9fd79af189816f79ed",
          "sha256": "6ec010c5caa8d8edcd1c7fe10fd4369f215a94390ab4c77e0385fbe89274fed4"
        },
        "downloads": -1,
        "filename": "pyplAI-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "33e0764515dfad9fd79af189816f79ed",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 18090,
        "upload_time": "2023-03-23T22:49:45",
        "upload_time_iso_8601": "2023-03-23T22:49:45.961946Z",
        "url": "https://files.pythonhosted.org/packages/e8/9e/3c8217ff9ebe5f1eb00f4bd7ae2805d86fa6fd12418971e29e612d5de16e/pyplAI-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0755ff3e126ed1783e23240224b173a8d55fa4173033f8f66f94af70e0d33bbe",
          "md5": "d872a5bd084233b3b1d4c0a7ac382d11",
          "sha256": "7f1a8158d145c8f684c1e6ea9e12abe8cbb3443692cd33040f429fcc88e16f27"
        },
        "downloads": -1,
        "filename": "pyplAI-1.0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "d872a5bd084233b3b1d4c0a7ac382d11",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 12049,
        "upload_time": "2023-03-25T17:27:59",
        "upload_time_iso_8601": "2023-03-25T17:27:59.036737Z",
        "url": "https://files.pythonhosted.org/packages/07/55/ff3e126ed1783e23240224b173a8d55fa4173033f8f66f94af70e0d33bbe/pyplAI-1.0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a2ed4704a237b9856457029b5f7c781d8e51f8bd0d28331362f4d5564328bd47",
          "md5": "fefd795ff2dab03b7f818ba468019297",
          "sha256": "528b9c4152abf8921ec63e17efa7332cc0f2c2206f4fe14c2802c9b9308bd1d2"
        },
        "downloads": -1,
        "filename": "pyplAI-1.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "fefd795ff2dab03b7f818ba468019297",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 18036,
        "upload_time": "2023-03-25T17:28:01",
        "upload_time_iso_8601": "2023-03-25T17:28:01.183029Z",
        "url": "https://files.pythonhosted.org/packages/a2/ed/4704a237b9856457029b5f7c781d8e51f8bd0d28331362f4d5564328bd47/pyplAI-1.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "0755ff3e126ed1783e23240224b173a8d55fa4173033f8f66f94af70e0d33bbe",
        "md5": "d872a5bd084233b3b1d4c0a7ac382d11",
        "sha256": "7f1a8158d145c8f684c1e6ea9e12abe8cbb3443692cd33040f429fcc88e16f27"
      },
      "downloads": -1,
      "filename": "pyplAI-1.0.2-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "d872a5bd084233b3b1d4c0a7ac382d11",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 12049,
      "upload_time": "2023-03-25T17:27:59",
      "upload_time_iso_8601": "2023-03-25T17:27:59.036737Z",
      "url": "https://files.pythonhosted.org/packages/07/55/ff3e126ed1783e23240224b173a8d55fa4173033f8f66f94af70e0d33bbe/pyplAI-1.0.2-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "a2ed4704a237b9856457029b5f7c781d8e51f8bd0d28331362f4d5564328bd47",
        "md5": "fefd795ff2dab03b7f818ba468019297",
        "sha256": "528b9c4152abf8921ec63e17efa7332cc0f2c2206f4fe14c2802c9b9308bd1d2"
      },
      "downloads": -1,
      "filename": "pyplAI-1.0.2.tar.gz",
      "has_sig": false,
      "md5_digest": "fefd795ff2dab03b7f818ba468019297",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 18036,
      "upload_time": "2023-03-25T17:28:01",
      "upload_time_iso_8601": "2023-03-25T17:28:01.183029Z",
      "url": "https://files.pythonhosted.org/packages/a2/ed/4704a237b9856457029b5f7c781d8e51f8bd0d28331362f4d5564328bd47/pyplAI-1.0.2.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}