{
  "info": {
    "author": "Marcel Segbers, Rob van Rooij",
    "author_email": "msegbers@gmail.com",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "# Pyrateshield\r\n\r\nAn application to perform complex radiation shielding calculations for nuclear medicine and radiology departments.\r\n\r\n![mainscreen](img/mainscreen.png)\r\n\r\n## Introduction\r\n\r\nPyrateshield is a python application that performs radiation shielding calculations for nuclear medicine and radiology departments in hospitals. The application has a user friendly graphical interface and no python coding or commandline intereactions are needed at all.\r\n\r\nThe application is intended to calculate the (necessary) radiation shielding in entire radiology and nuclear medicine departments. Nuclear Medicine sources, CT sources and Xray sources can be defined and positioned on a floorplan in the GUI.  Walls with a defined thickness and material can be drawn using the mouse. The radiation dose rate can be visualized as heatmaps and (dose) isocontours on the floorplan. Critical points can be added to calculate the exact dose rate in specific points. Critical point results can be easily exported to Excel.\r\n\r\n## Table of contents\r\n\r\n[toc]\r\n\r\n\r\n\r\n## Intended users \r\n\r\n(Medical) physicists and radiation protection officers who are working at a nuclear medicine or radiology department in a hospital. \r\n\r\n## Installation & getting started\r\n\r\n### Windows\r\n\r\nFor windows standalone executables are distributed. To obatain a standalone executable, check the Downloads section in the repository:\r\n\r\n[standalone windows executables](https://bitbucket.org/MedPhysNL/pyrateshield/downloads/)\r\n\r\n\r\n### Cross Platform\r\n\r\nUse 'pip install pyrateshield' to install the package in a python environment of your choice. Type 'pyrateshield' to start the application. Pyrateshield requires python version 3.8 or later. Python savy users can also install directly from our [repository](https://bitbucket.org/MedPhysNL/pyrateshield).\r\n\r\n\r\nWhen using an anaconda environment and having spyder installed within that environment may cause issues with spyder. Best practice is not to install pyrateshield and spyder within the same anaconda environment. A workaround could be reinstalling pyqt5 after installing pyrateshield('pip install pyqt5==version', with version the required version by spyder). \r\n\r\n### Examples\r\n\r\nPyrateshield projects can be saved as a .zip file. There are a few examples available on the repository. The example zip files can be obtained from the Downloads section in the repository:\r\n\r\n[examples](https://bitbucket.org/MedPhysNL/pyrateshield/downloads/)\r\n\r\nThere is no need to extract the .zip files. In pyrateshield select load from the toolbar and select the .zip file to open the project.\r\n\r\n### Legacy\r\n\r\nOlder version of pyrateshield use .psp files to store projects. They can still \r\nbe read by later version of pyrateshield and saved as the newer .zip files\r\n\r\n## Using Pyrateshield\r\n\r\n### Toolbar\r\n\r\nAt the top of pyrateshield is a toolbar with icons. Loading, Saving and adding elements is started from the toolbar. \r\n\r\n![toolbar](img/toolbar.png)\r\n\r\nBelow a brief explanations of all icons in the toolbar:\r\n\r\nItem|Description\r\n----|---\r\npyShield|Calculate a dosemap and display the dosemap over the floorplan with the pyshield engine\r\nRadtracer|The same but using the Radtracer engine\r\nNew|Start a brand new pyrateshield project\r\nImage|Load a bitmap image as floorplan\r\nFloorplan|Remove the displayed heatmap and show the (clean) floorplan\r\nReset|Reset Zooming and Panning to the default view\r\nPan|Pan the image by using the mouse (left click and hold)\r\nZoom|Draw a rectangular selection box on the floorplan to define the region to zoom in to\r\nMove|Move all pyrateshield objects (Wall, sources and critical points) while keeping the floorplan in place. Usefull to align objects with a new floorplan\r\nSource NM|Select and click on the floorplan to add a new Source NM. See section Source NM\r\nSource CT|Select and click on the floorplan to add a new Source CT. See section Source CT\r\nSource Xray|Select and click on the floorplan to add a new Source Xray. See section Source Xray\r\nWall|Select and draw a new wall on the floorplan (click and hold left mouse button, see section Wall)\r\nCritical Point|Select and click on the floorplan to add a new Critical Point. See section Critical Point\r\nDelete|Delete the selected / highlighted pyrateshield object from the floorplan (and project). Action cannot be undone(!)\r\nSnapshot|Take a snapshot of the floorplan (and dosemap if displayed) and save as a bitmap image\r\nLoad|Load a pyrateshield project file (.zip) from disk\r\nSave|Save pyrateshield project to disk\r\nSave As|Save pyrateshield project to disk and select (new) filename\r\nCalculator|Simple calculator to calculate the shielding properties of a wall with a single material and thickness. Useful for quick calculations and to inspect differences between the pyshield and Radtracer engine.\r\nDosemap Style|Styling properties for the dosemap that is displayed on top of the floorplan image\r\nIsotopes|Inspect the isotope definitions for pyrateshield (energies and abundances). New isotopes cannot be added at this moment.\r\n\r\n\r\n### Toolbox\r\n\r\nOn the left side of the interface a toolbox is displayed that allows inspecting and modifying properties of all pyrateshield objects. \r\n\r\n![toolbox](img/toolbox.png)\r\n\r\n\r\n\r\nBelow an explanation of all different objects and their properties.\r\n\r\n#### NM Sources\r\n\r\nBy clicking in the toolbar on Source NM icon a Nuclear Medicine source can be added to the floorplan. Click on the floorplan to position the new Nuclear Medicine Source.\r\n\r\nA Nuclear Medicine Source has the following properties:\r\n\r\nProperty|Description\r\n--------|-----------\r\nName| Name of the source \r\nNumber of exams| Number of times for which the source is present in the room (per year)\r\nActivity [MBq]| Activity of the Source in MBq\r\nIsotope| Isotope\r\nSelf shielding| Self shielding of source (None, Body or factor)\r\nFactor| Manual self selfshielding or correction factor (available when Self shielding is set to Factor)\r\nDuration [h]| Duration for which a source is present in the room\r\nApply decay correction| Correct for physical decay during duration for which the source is present\r\nClearance Model| Select biological clearance model name (See section Clearance)\r\nPosition| Position in cm of the source on the floorplan\r\nEnabled| When unchecked source is disabled and excluded from calculations\r\n\r\n#### Clearance\r\n\r\nClearance models are optional and mainly used to define a source that represents a therapy patient who stays overnight in a nuclear medicine therapy facility. The clearance model allows to correct for excretion of radioactivity.\r\n\r\nThe clearance model can be defined as an monoexponentional or biexponential model. Physical decay is always applied (if the decay correction property of the NM Source is checked). The exponentials can be split by a fraction or by a time. When split by fraction and  the fractions (or the single fraction for a monoexponential model) do not add up to 1, the remaining fraction is corrected for phsyical decay (if the decay correction property of the NM Source is checked). When the exponentials are split in time the first fraction will be integrated until the defined split time and the second fraction from split time. Integration is always stopped after source duration (see section NM Sources). By default a set of decay models are available that are prescribed int the Dutch guidelines ('werken met therapeutische hoeveelheden radionucliden').\r\n\r\nProperty|Description\r\n--------|-----------\r\nName| Name of the clearance model\r\nFraction 1| If applied the fraction (between 0 and 1) for the first exponential.\r\nHalflife [h]| The corresponding (biological) halflife for the first exponential\r\nFraction 1| If applied the fraction (between 0 and 1) for the second exponential.\r\nHalflife [h]| The corresponding (biological) halflife for the second exponential.\r\nSplit fractions by time| Set the time where both exponentials are split. When applied fraction 1 and fraction 2 are always 1.\r\n\r\nClick Add to add a new clearance model and click delete to delete the selected clearance model.\r\n\r\n\r\n#### Sources CT\r\n\r\nFor the calculation of CT sources a simple model for secondary scatter is implemented, based on Wallace et.al. 2012: Establishment of scatter factors for use in shielding calculations and risk assessment for computed tomography facilities. A single scatter factor of 0.36 uGy per unit of DAP (mGy cm) for body and 0.14 uGy/(mGy cm) for head is used for all directions, at 1 m from the scanner isocenter. To add a Source CT select the Source CT icon form the toolbar and click on the floorplan to add the source at that location.\r\n\r\nProperty|Description\r\n--------|-----------\r\nName| Name of the source \r\nkVp| The kVp setting of the CT\r\nNumber of exams| Number of times the exam is repeated (per year)\r\nBody part| The CTDI model (Head or Body) <reference needed>\r\nDLP [mGycm]| The dose length product for this exam in mGy cm\r\nPosition| Position in cm of the source on the floorplan\r\nEnabled| When unchecked source is disabled and excluded from calculations\r\n\r\n#### Sources Xray\r\n\r\nFor the calculation of Xray sources a simple model for secondary scatter is implemented, based on NCRP report 147 Fig. C.1. To add a Source Xray select the Source Xray icon form the toolbar and click on the floorplan to add the source at that location.\r\n\r\nProperty|Description\r\n--------|:----------\r\nName| Name of the source \r\nkVp| The kVp setting of the Xray machine\r\nNumber of exams| Number of times the exam is repeated (per year)\r\nDAP [mGycm2]| The dose area product for this exam in mGy cm2\r\nPosition| Position in cm of the source on the floorplan\r\nEnabled| When unchecked source is disabled and excluded from calculations\r\n\r\n#### Walls\r\n\r\nWalls are lines that can be drawn by selecting the Wall icon from the toolbar. Left click and hold left mouse button to start drawing the wall on the floorplan. Release the left mouse button to finish. \r\n\r\nProperty|Description\r\n--------|:----------\r\nShielding| The shielding assigned to this wall (see section shieldings)\r\nX1, Y1, X2, Y2| Position in cm of the source on the floorplan\r\n\r\nSelect a wall with the left mouse button on the floorplan. Subsequently use the right mouse button on one of the square walls for additional drawing options.\r\n\r\nAction| Description\r\n---------|----------------\r\nDelete| Delete selected wall\r\nCopy | Copies the wall (yaml) definition to clipboard as text (for debugging or advanced use)\r\nContinue Wall Here| Continue drawing of the wall from the selected wall ending\r\nSnap to: | Snap selected wall ending to the nearest wall ending in range\r\n\r\n#### Shieldings\r\n\r\nShieldings consist of one or two materials with a corresponding thickness. Shieldings are a preset and can be assigned to a wall (see section wall). A wall can therefore consist out of two different materials (e.g. lead and gypsum). When you change a shielding all the walls with the assigned shielding will also update\r\n\r\nProperty|Description\r\n--------|:----------\r\nName| Name of the shielding\r\nMaterial 1| Name of the first material (set to None to disable shielding)\r\nThickness 1 [cm] | Thickness of the first material\r\nMaterial 2| Name of the first material (set to None to disable shielding)\r\nThickness 2 [cm] | Thickness of the second material\r\nSelect Color| Select the color of the shielding (to show the walls with this shielding assigned)\r\nLinewidth [pt]| Line width of the shielding (to show the walls with this shielding assigned)\r\n\r\nClick on Add to add a new shielding defintion or click on delete to delete the shielding definition. Shieldings can only be deleted when there are no walls that have this shielding assigned.\r\n\r\n\r\n#### Materials\r\n\r\nThe material section shows the properties and implementation of the available materials in the Radtracer and pyshield engine. Materials can be added or modified to a limited extent. Radtracer has a limited set of materials available and pyshield has attenuation and buildup tables for an even more limited set of materials available. Pyshield for example uses the buildup table of Concrete for Concrete-Barite which is at best a rough approximation.\r\n\r\nProperty|Description\r\n--------|:----------\r\nName| Name of the material\r\nDensity [g/cm^3]| Density of the material in [g/cm^3]\r\nRadtracer Material| Material as defined in Radtracer (by default the same as the Name property)\r\nPyshield Attenuation Table| The attenuation table that pyshield will use\r\nPyshield Buildup Table| The buildup table that pyshield will use\r\n\r\nClick on Add to add a new material defintion or click on delete to delete the material definition. Materials can only be deleted when there are no shieldings that have this material assigned.\r\n\r\nChanging or adding materials is mostly usefull to accommodate for using materials with slightly different densities. Variations in density are handled well by both pyshield and Radtracer. The other options serve as main purpose to make the user aware of the approximations in pyshield.\r\n\r\n#### Critical points\r\n\r\nTo add a Critical Point select the Critical Point icon from the toolbar and click on the floorplan to add the critical point at that location. Critical Points are points for which the dose will be calculated in the Critical Point Report (see section Critical Point Report).\r\n\r\nProperty|Description\r\n--------|:----------\r\nName| Name of the critical point\r\nOccupancy Factor| Correction factor for occupancy. Use 1 to not correct for occupancy\r\nPosition| Position in cm of the source on the floorplan\r\nEnabled| When unchecked critical point is excluded from the critical point report \r\n\r\n\r\n\r\n#### Pixel Size [cm]\r\n\r\nA typical project starts with loading a floorplan image. The floorplan images are loaded as bitmap images and lack any information regarding scale. To define the scale on the floorplan the pixel size is set in cm, the real world length in cm that corresponds to one pixel of the bitmap image. The pixel size can be set by hand or by defining a line on the floorplan for which length the real world length in [cm] is used. For example the distance between columns.\r\n\r\nAny changes to the pixel size are applied after clicking confirm (!)\r\n\r\n##### Set Fixed\r\n\r\nProperty| Description\r\n---|---\r\nPixel size [cm]| Set the pixel size manually in cm\r\n\r\n##### Measure\r\n\r\nClick on Measure On Floorplan to select two points for which the real world distance in cm is known. After clicking on the button, click on the floorplan with the left mouse button to select the first point. Release the left mouse button and subsequently click on the second point.  \r\n\r\nProperty| Description\r\n---|---\r\nReal world distance [cm]| The known distance in cm in the real world\r\nDistance [pixels]| The distance in pixels between the selected points (read only)\r\nPixel size [cm]| The calculated pixel size in cm (read only)\r\n\r\n### Calculations\r\n\r\n#### Dosemap\r\n\r\nTo calculate a dosemap with isodose contours select the canvas tab and click on the pyShield or Radtracer icon in the toolbar. \r\n\r\n#### Critical points\r\n\r\nTo calculate the results for Critical Points select the Critical Point Report Tab. Use the Calculate Critical Points button to display the results in a table. The table can be exported to Excel using the Save To Excel button.\r\n\r\nThe table is not automatically updated (!) \r\n\r\nWhen changing anything in your project recalculate the critical point report explicitly by using the Calculate Critical Points button.\r\n\r\n## Implementation (pyshield and Radtracer)\r\n\r\nPyrateshield implements two independently developed engines to perform the dose calculations: pyShield and Radtracer. The main difference between these engines lies in the way in which photon fluence behind the barriers (i.e. transmission) due to NM sources is calculated. The conversion from photon fluence to dose is handled in a similar way for both engines.\r\n\r\nThe first, pyshield uses buildup and attenuation tables and calculates the dose rate behind a wall (or multiple walls) by calculating the contribution of each gamma ray defined for the isotope. \r\n\r\nRadtracer uses presimulated results for the available materials and isotopes using [MCNP](https://mcnp.lanl.gov), a Monte Carlo simulator for particle transport. \r\n\r\n\r\nDose rates due to Xray and CT sources are always handled in the same way, irrespective of whether pyshield or Radtracer is selected. The scatter fractions (i.e. DAP or DLP to scattered dose conversion) and the transmission parameters are obtained from literature.\r\n\r\n\r\n### Limitations (pyshield and Radtracer)\r\n\r\n#### Skyshine and multiple scatter\r\n\r\nFor nuclear medicine sources no secundary scatter contributions are included (skyshine). Skyshine cannot always be neglected. Skyshine heavily depends on the 3D geometry of the rooms. For Xray and CT sources only secondary radiation is included in the calculations (scatter from the body / object in the scanner). Primary radiation (leakage) or tertiary scatter is not included.\r\n\r\n#### Attenuation through multiple materials\r\n\r\nChanges in energy spectrum by transmission through multiple walls is ignored. If all walls through which the transmission takes place are of the same material, the thickness is summed first ensuring an accurate calculation. However when walls consist of different materials a (safe) over estimation of the transmission is calculated by multiplying the transmission for each material and thickness without taking changes in the spectrum into account. Since the changes to the spectrum are ignored it also does not matter through which wall the radiation is transmitted first. \r\n\r\n#### Self shielding\r\n\r\nPyrateshield has an option self shielding for Sources NM. Pyshield implements this by adding transmission through 10 cm of water for each point (or point in the dosemap). Since buildup in water can be considerable and changes in the energy spectrum (see limitation 3) are ignored the doserate might even increase when setting self shielding to body. For pyshield 10cm of water is for some isotopes a very inaccurate representation of the self shielding of a patient. It is preferred to set a manual self shielding factor for Sources NM. It also possible to use the calculator in the toolbar to calculate the transmission through e.g. 15 cm or 20 cm of water and use that factor as a manual self shielding factor. \r\n\r\nIn Radtracer, self shielding due to a patients body is implemented by surrounding the point source with a water filled shpere of radius 15 cm, prior to running the MCNP simulations. This ensures that buildup and hardening of the spectrum is properly accounted for. The obvious limitation of this method is that the assumption that a patient (and the activity distribution within the patient) can be estimated as a point source in a sphere might not be entirely accurate.\r\n\r\nDue to the very different implementation of self shielding for pyshield and radracer, large differences may occur (!)\r\n\r\n#### Materials\r\n\r\nPyshield has a limited set of tables for buildup and attenuation at present. Some materials are approximated by combining attenuation tables and buildup tables. The available materials are defined as follows in pyshield:\r\n\r\nMaterial|Attenuation Table|Buildup Table\r\n:-:|:-:|:-:\r\nLead|Lead|Lead\r\nConcrete|Concrete|Concrete\r\nWater|Water|Water\r\nConcrete-Barite|Concrete-Barite|Concrete\r\nGypsum|Gypsum|Concrete\r\nBrick|Brick|Concrete\r\n\r\nAttenuation tables are derived from [NIST XCOM](https://physics.nist.gov/PhysRefData/Xcom/html/xcom1.html). Buildup tables were published by Shimizu et. al. [1]\r\n\r\n#### Multiple gamma rays\r\n\r\nFor Radtracer, the entire esmission spectrum of the radio-isotope is simulated in MCNP. For a range of barrier thicknesses, the spectrum at a point behind the barrier is recorded and converted to an effective dose. These are stored in a lookup table which is used by Radtracer during execution.\r\n\r\nPyshield sums the contribution of each gammaray during each new calculation and therefore accurately accounts for multiple gamma rays. Pyshield neglects gammarays below 30 keV because no buildup data is available for these low energies. For unshielded sources with gamma rays below 30 keV differences between pyshield and Radtracer may be observed. When shielded these low energy gamma rays usually don't contribute to the dose.``\r\n\r\n## References\r\n\r\n[1] Shimizu A, Onda T, Sakamoto Y. Calculation of gamma-ray buildup factors up to depths of 100 mfp by the method of invariant embedding, (III) Generation of an improved data set. J Nucl Sci Technol 41: 413–424; 2004.\r\n\r\n\r\n\r\n## Contact \r\n\r\nDevelopers:\r\n\r\nMarcel Segbers, GUI architect and developer of pyshield, (m.segbers@erasmusmc.nl) \r\nRob van Rooij, Co-developer and developer of Radtracer, (r.vanrooij-3@umcutrecht.nl)\r\n\r\nFeature requests and bug reports please use the issue tracker of the repository:\r\n\r\nhttps://bitbucket.org/MedPhysNL/pyrateshield\r\n\r\n\r\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://bitbucket.org/MedPhysNL/pyrateShield",
    "keywords": "pyrateShield radiation radiology nuclear medicine",
    "license": "GNU GPLv3",
    "maintainer": "",
    "maintainer_email": "",
    "name": "pyrateShield",
    "package_url": "https://pypi.org/project/pyrateShield/",
    "platform": null,
    "project_url": "https://pypi.org/project/pyrateShield/",
    "project_urls": {
      "Homepage": "https://bitbucket.org/MedPhysNL/pyrateShield"
    },
    "release_url": "https://pypi.org/project/pyrateShield/1.0.54/",
    "requires_dist": null,
    "requires_python": ">=3.8",
    "summary": "Generate radiation-dose maps",
    "version": "1.0.54",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16834537,
  "releases": {
    "0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6d8c1e612082af4d9a592a6191f03a89495a5b8fc64e489a63924e295fa4c91f",
          "md5": "03ca1080501cd4f116a7f84abc95d7dd",
          "sha256": "8959e6110a50c138708f48037c58f1efb0ba7c0e107ef1d011af2c4d34c84d7f"
        },
        "downloads": -1,
        "filename": "pyrateShield-0.3.tar.gz",
        "has_sig": false,
        "md5_digest": "03ca1080501cd4f116a7f84abc95d7dd",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 1917496,
        "upload_time": "2021-10-27T11:24:34",
        "upload_time_iso_8601": "2021-10-27T11:24:34.880387Z",
        "url": "https://files.pythonhosted.org/packages/6d/8c/1e612082af4d9a592a6191f03a89495a5b8fc64e489a63924e295fa4c91f/pyrateShield-0.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b670b938fbfbad449103d66f60572962c3863fb6a7cf062aabb4006be2375c02",
          "md5": "e54cc59e8b9c5e6c3127ba59a39db823",
          "sha256": "67bd499d5d8e0279a5358b1eda585fd435b0f5d8e661be7dea396930f9a5b3a7"
        },
        "downloads": -1,
        "filename": "pyrateShield-1.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "e54cc59e8b9c5e6c3127ba59a39db823",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 1922808,
        "upload_time": "2022-04-29T13:50:14",
        "upload_time_iso_8601": "2022-04-29T13:50:14.594771Z",
        "url": "https://files.pythonhosted.org/packages/b6/70/b938fbfbad449103d66f60572962c3863fb6a7cf062aabb4006be2375c02/pyrateShield-1.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "612423cae584115dc145bae583958a5ce6340c4e77a1d39767bd076d24b865dc",
          "md5": "03e8f8cd387c5822b167a2564271a9bf",
          "sha256": "eb5737cfd6998a2f6e8edb2af3597f586250e4a93383b2c030272db040b4781a"
        },
        "downloads": -1,
        "filename": "pyrateShield-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "03e8f8cd387c5822b167a2564271a9bf",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 1978918,
        "upload_time": "2022-04-29T13:50:17",
        "upload_time_iso_8601": "2022-04-29T13:50:17.838623Z",
        "url": "https://files.pythonhosted.org/packages/61/24/23cae584115dc145bae583958a5ce6340c4e77a1d39767bd076d24b865dc/pyrateShield-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "01ac8b8df124a85835c1c51de7457e8c2916c45b66df55ff1c0a5f48fe82cb9c",
          "md5": "e7a417909c3731c7f45010c3399dedb2",
          "sha256": "84479d3eccea5286cf66c2e49b912b07be7391e886ee56c3f05e3ad6638b89c0"
        },
        "downloads": -1,
        "filename": "pyrateShield-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "e7a417909c3731c7f45010c3399dedb2",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 1980361,
        "upload_time": "2022-05-11T10:07:42",
        "upload_time_iso_8601": "2022-05-11T10:07:42.921688Z",
        "url": "https://files.pythonhosted.org/packages/01/ac/8b8df124a85835c1c51de7457e8c2916c45b66df55ff1c0a5f48fe82cb9c/pyrateShield-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8f8c4ebc9d37abfbfcb46e9a9837ae73619ec35153da0e6e9e5afe8c3c06d9f4",
          "md5": "1beb9ff15ee08198ed950cf4b9f60302",
          "sha256": "b91483943fa0c1ff53c2280086d2e40b6670a526d05ce8088b5e4c663ca7d1c9"
        },
        "downloads": -1,
        "filename": "pyrateShield-1.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "1beb9ff15ee08198ed950cf4b9f60302",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 1980652,
        "upload_time": "2022-05-12T12:03:42",
        "upload_time_iso_8601": "2022-05-12T12:03:42.050579Z",
        "url": "https://files.pythonhosted.org/packages/8f/8c/4ebc9d37abfbfcb46e9a9837ae73619ec35153da0e6e9e5afe8c3c06d9f4/pyrateShield-1.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ec237e3f517d421f01cb0507a971defbd05452f2ccf6bca2d5e5920d5b52da95",
          "md5": "fd196ec71012f71284f2c1c804ade9d1",
          "sha256": "450fc7c9f4be6c484f82c82911f5eb174dab0c8dfa9781e3d5afd25d95c8e14e"
        },
        "downloads": -1,
        "filename": "pyrateShield-1.0.3.tar.gz",
        "has_sig": false,
        "md5_digest": "fd196ec71012f71284f2c1c804ade9d1",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 1980681,
        "upload_time": "2022-05-12T14:07:38",
        "upload_time_iso_8601": "2022-05-12T14:07:38.169473Z",
        "url": "https://files.pythonhosted.org/packages/ec/23/7e3f517d421f01cb0507a971defbd05452f2ccf6bca2d5e5920d5b52da95/pyrateShield-1.0.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ed53bbd70b057c4a8740a41c886fcf28cd84431bde0db04b232b68610897038f",
          "md5": "812d15e7dd4872502e45792c643e25c0",
          "sha256": "661145954956bed2bc80ea7b01bfa7a9195ec23b4bd6f689cb5e3d19cf672ca9"
        },
        "downloads": -1,
        "filename": "pyrateShield-1.0.4.tar.gz",
        "has_sig": false,
        "md5_digest": "812d15e7dd4872502e45792c643e25c0",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 1992979,
        "upload_time": "2022-10-03T08:54:49",
        "upload_time_iso_8601": "2022-10-03T08:54:49.906986Z",
        "url": "https://files.pythonhosted.org/packages/ed/53/bbd70b057c4a8740a41c886fcf28cd84431bde0db04b232b68610897038f/pyrateShield-1.0.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.51": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ecd3fbf3d115a2ad361657809927302c7630046498b3b373b50006832cc50f4e",
          "md5": "1cc90a4793631ba2e29300d5e7fb0db9",
          "sha256": "83d4ac167d8e6a657c32ea3fcaedd4bec0277bc7fb43e34606fd67990c43332e"
        },
        "downloads": -1,
        "filename": "pyrateShield-1.0.51.tar.gz",
        "has_sig": false,
        "md5_digest": "1cc90a4793631ba2e29300d5e7fb0db9",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 1999546,
        "upload_time": "2022-11-11T11:53:33",
        "upload_time_iso_8601": "2022-11-11T11:53:33.193541Z",
        "url": "https://files.pythonhosted.org/packages/ec/d3/fbf3d115a2ad361657809927302c7630046498b3b373b50006832cc50f4e/pyrateShield-1.0.51.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.54": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a3173d82f36667c78f3094fb1af7f1b4728d24e11f7c1a2d51e5688be7b62825",
          "md5": "1f2cc720d7d9adc02bff9411bf16ee0f",
          "sha256": "275a540e60d12e2f65396ecafb723d7096a8c00d70ddd167379ba75c6d77a2fe"
        },
        "downloads": -1,
        "filename": "pyrateShield-1.0.54.tar.gz",
        "has_sig": false,
        "md5_digest": "1f2cc720d7d9adc02bff9411bf16ee0f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 2002106,
        "upload_time": "2023-02-13T08:48:02",
        "upload_time_iso_8601": "2023-02-13T08:48:02.449835Z",
        "url": "https://files.pythonhosted.org/packages/a3/17/3d82f36667c78f3094fb1af7f1b4728d24e11f7c1a2d51e5688be7b62825/pyrateShield-1.0.54.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "a3173d82f36667c78f3094fb1af7f1b4728d24e11f7c1a2d51e5688be7b62825",
        "md5": "1f2cc720d7d9adc02bff9411bf16ee0f",
        "sha256": "275a540e60d12e2f65396ecafb723d7096a8c00d70ddd167379ba75c6d77a2fe"
      },
      "downloads": -1,
      "filename": "pyrateShield-1.0.54.tar.gz",
      "has_sig": false,
      "md5_digest": "1f2cc720d7d9adc02bff9411bf16ee0f",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.8",
      "size": 2002106,
      "upload_time": "2023-02-13T08:48:02",
      "upload_time_iso_8601": "2023-02-13T08:48:02.449835Z",
      "url": "https://files.pythonhosted.org/packages/a3/17/3d82f36667c78f3094fb1af7f1b4728d24e11f7c1a2d51e5688be7b62825/pyrateShield-1.0.54.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}