{
  "info": {
    "author": "Lorenzo Rovigatti",
    "author_email": "lorenzo.rovigatti@uniroma1.it",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "Environment :: Console",
      "Intended Audience :: Science/Research",
      "License :: OSI Approved :: GNU General Public License v3 (GPLv3)",
      "Operating System :: OS Independent",
      "Programming Language :: Python"
    ],
    "description": "# pyrla\n\npyrla makes it easy to launch parallel processes that execute different commands. Its most common use case is having to run the same command in different directories ordered in a specific hierarchy (e.g. `Temperature_T/Pressure_P`, for several values of `P` and `T`). Perhaps the command should be invoked with folder-specific parameters. pyrla makes it easier to automatise this type of repetitive operations without having to resort to bash scripts or similar means. \nWith pyrla, you can choose the number of contemporary jobs and their working path, which can be automatically generated. \nIf the command you want to execute takes an input file as an argument (or if you want to have a bespoke file in each job's current directory), such an input file can be written on the fly or generated from an existent input file.\n\t\n## Usage\n\npyrla expects a single input file (see [Input file syntax](#input-file-syntax)). It also supports the following options:\n\n\t-d, --debug \n\t\tenable debug (verbose) mode. Useful for developers\n\t--ends-after n\n\t\trun the first n jobs only\n\t-h, --help\n\t\tshow a usage message\n\t--max-states n\n\t\tset the maximum number of states (jobs) that can be generated. Defaults to 100000\n\t-r, --dry-run\n\t\tshow a complete summary of the jobs that will run. Useful for testing input files\n\t-S, --summarise\n\t\tshow a synthetic summary of the run\n\t-s, --safe\n\t\tenable safe mode. No file or directory will be overwritten\n\t--start-from n\n\t\tstart jobs having an id >= n\n\t-v, --version\n\t\tshow the version of the program\n\t-w, --wait n\n\t\twait n seconds before starting the jobs (after the parsing of the input file)\n\n## Examples\n\nThe `pyrla/examples/` folder contains commented pyrla input files that can be used as starting points to build your own.\n\n## Input file syntax\n\n* Empty lines or lines starting with a hash sign (\\#) will not be considered. A well-formed line should look like 'key = value'. Spaces before and after key and value are stripped off.\n* Any text coming after a hash sign (\\#) will be discarded.\n* About the 'value' syntax:\n\t* in general if your value contains spaces then it will be considered as a 'special' value (a mathematical expression or a list of values, for examples). If you want to avoid this you have to put double quotes (\") around the whole value.\n\t* you can refer to other values by using the syntax $(key). The value of 'key' will be expanded at runtime. An example would be `T_$(T)`.\n\t* you can use mathematical expressions but you have to put them between ${ and }. An example would be `${2 + 3}`. You can also use complex functions (as long as they are defined in python's math module). An example would be `${log($(T)) + 0.2}`.\n\t* you can load a list of values from a file by using the syntax `key = LF filename`. Each row will be treated as an item of the list.\n\t* you can use complex sequences in a way similar to bash's seq or python's range but in a more flexible way. The actual syntax is: `F start T target V inc`. Of course start is the starting value while target is the final value (excluded from the sequence, like in C-style for loops) and inc is the action to be performed on start to go towards target. A simple example would be `T = F 0.1 T 0.4 V +0.1` which is equivalent `T = 0.1 0.2 0.3`. You can also have more complex sequences like `T = F 0.1 T 100 V \\*10`, which is equivalent to `T = 0.1 1 10`.\n\t* you can evaluate a bash command and assign its value to a pyrla variable by enclosing the command between $b{ and }. For example, `a = $b{echo \"prova\"}` would assign the value 'prova' to the key 'a' \n\t\t\n* There are some special keys used as 'keywords'. These are:\n\t* `DirectoryStructure`: structure of the directory where the `Execute` command should be executed. It can depend on other variables (for example one can have `DirectoryStructure = T_$(T)_Act_$(Activity)`). \n\t* `CopyFrom`: path (absolute or relative to the pyrla script launching directory) to the base configuration file to be changed. This key may not contain expressions or list of values.\n\t* `CopyTo`: name of the base configuration whose keys will be taken from InputFrom (and modified using the InputFromOverwrite). This file will be copied to the directory given by DirectoryStructure. If this key is missing then the file will have the same name as the CopyFrom\n\t* `CopyToWrite`: name of the keys that should be written in the CopyTo file (if a CopyFrom is specified and it contains any of these keys they will be overwritten).\n\t* `CopyObjects`: one or more paths (absolute or relative to the pyrla script launching directory) to be copied under each job's working directory.\n\t* `Execute`: the command to execute.\n\t* `PreExecute`: a command to be executed before `Execute`. If the command exits with a non-zero exit code no other command will be run.\n\t* `PostExecute`: a command that will be executed after `Execute` if and only if `Execute` exits with a zero exit code.\n\t* `Relaunch`: if True relaunch jobs that return non-zero exit codes. Note that only the `Execute` command gets re-launched.\n\t* `ContemporaryJobs`: maximum number of jobs to be executed together. This key may not contain expressions or list of values. If 0 then no max will be set. Defaults to 0.\n\t* `WaitingTime`: waiting time (in seconds) between job launches. Defaults to 2 seconds.\n\t* `Subdirectories`: one or more directories (separated by spaces) to be created from each job under the DirectoryStructure folder. An example: `Subdirectories = confs sus/special` will create two folders under the job's working directory (determined by `DirectoryStructure``): confs and sus. In addition, a directory called \"special\" under the sus folder will be created.\n\t* `Times`: how many times the jobs must be executed.\n\t* `InputSeparator`: a character or a string which is used to separate keys from values in the input file (the CopyFrom one). Default is the equal sign '='.\n\t* `Exclusive`: if True, no more than one job per directory can be executed.\n\t\t\n* The following built-in keys can be used in user-defined keys:\n\t* `JOB_ID`: expands to the current job's id, which is 0 for the first job, 1 for the second, etc.\n\t* `BASE_DIR`: the directory pyrla was launched from.\n\t\n* It is possible to have keys take specific values when one or more conditions are met. For example, `Delta = 0.2 @@ T = 0.1, Activity = 1e-5` will assign to Delta the value 0.2 for all those processes that have the two keys T and Activity take the values 0.1 and 1e-5, respectively. As of now, the only conditions available are comma-separated lists of specific values of keys.\n\t\t\n## Syntax of the CopyFrom file\n\npyrla supports different types of CopyFrom file. The type of file can be set by using the `InputType` key.\n\n### Default syntax\n\nBy default pyrla expects a file containing a list of `key = value` lines. In this case\n\n* A key listed under the `CopyToWrite` keyword will overwrite a value in the `CopyFrom` file if the `CopyFrom` file contains that same key in one of its `key = value` line. Here \"same\" is meant in a case sensitive way. The default separator is `=`. You can use the `InputSeparator` key in the input file to change the separator. \n* For each `CopyToWrite` key that is not in the `CopyFrom`, a `key = value` line will be appended at the end of the file.\n\n### LAMMPS input file\n\nIf `InputFile = LAMMPS` then pyrla will expect a LAMMPS input file. In this case\n\n* A key listed under the `CopyToWrite` keyword will overwrite a value in the `CopyFrom` file if the `CopyFrom` file contains a `variable key ...`. In this case the line will be replaced by `variable key equal value`.\n* Any `CopyToWrite` key that is not in the CopyFrom file will not be used (and a warning will be issued).\n\n### Jinja2 templates\n\nIf `InputFile = Jinja2` then pyrla will expect a [Jinja2](https://palletsprojects.com/p/jinja/) template file. In this case the values associated to the keys specified in CopyToWrite will be passed to the Jinja template. This feature requires the `jinja2` python package to be installed.\n\t\n## Acknowledgements\n\n* I took the idea of a python-based launcher from John Russo and his gotmilkneedpy\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/lorenzo-rovigatti/pyrla",
    "keywords": "",
    "license": "GNU GPL 3.0",
    "maintainer": "",
    "maintainer_email": "",
    "name": "pyrla",
    "package_url": "https://pypi.org/project/pyrla/",
    "platform": "",
    "project_url": "https://pypi.org/project/pyrla/",
    "project_urls": {
      "Homepage": "https://github.com/lorenzo-rovigatti/pyrla"
    },
    "release_url": "https://pypi.org/project/pyrla/0.1.0/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "A simple tool to launch multiple processes",
    "version": "0.1.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 11246447,
  "releases": {
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "946400aecb508688c643f8d0272f1cde3d32e8c033efc5120dd80269396959b5",
          "md5": "2547c2aad93b23111bf8eb1053c745df",
          "sha256": "a8a15d5203512fa7890b1fa23c05d78647d4e4efe3f7e7fa895797b61bbb005c"
        },
        "downloads": -1,
        "filename": "pyrla-0.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "2547c2aad93b23111bf8eb1053c745df",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 31628,
        "upload_time": "2021-08-22T21:42:53",
        "upload_time_iso_8601": "2021-08-22T21:42:53.390719Z",
        "url": "https://files.pythonhosted.org/packages/94/64/00aecb508688c643f8d0272f1cde3d32e8c033efc5120dd80269396959b5/pyrla-0.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "946400aecb508688c643f8d0272f1cde3d32e8c033efc5120dd80269396959b5",
        "md5": "2547c2aad93b23111bf8eb1053c745df",
        "sha256": "a8a15d5203512fa7890b1fa23c05d78647d4e4efe3f7e7fa895797b61bbb005c"
      },
      "downloads": -1,
      "filename": "pyrla-0.1.0.tar.gz",
      "has_sig": false,
      "md5_digest": "2547c2aad93b23111bf8eb1053c745df",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 31628,
      "upload_time": "2021-08-22T21:42:53",
      "upload_time_iso_8601": "2021-08-22T21:42:53.390719Z",
      "url": "https://files.pythonhosted.org/packages/94/64/00aecb508688c643f8d0272f1cde3d32e8c033efc5120dd80269396959b5/pyrla-0.1.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}