{
  "info": {
    "author": "Yihan Wang",
    "author_email": "Yihan.Wang@UTSouthwestern.edu",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# pySpade: Single cell Perturbation Analysis of Differential Expression\n\n## Overview\n_________\n`pySpade` is a user friendly tool to perform the whole transcriptome analysis of single cell perturbation dataset. With the direct output of Cellranger, `pySpade` utilizes hypergeomtric test to analyze the whole transcriptome differential expression and generates hits table csv file. User can use the table to do downstream processing like generating Manhattan plots (tutorial includes). Currently we support human genome.     \n\n## Requirement\n_________\n* Python (3.7 +)\n* Numpy (1.21 +)\n* Pandas (1.3.5 +)\n* Scipy (1.6.2 +)\n\n## Installation\n________\n`pySpade` can be installed with `pip`\n\n```shell\npip install pySpade\n```\n\n## Usage\n________\n```\n$pySpade\nusage: pySpade [-h]  ...\n\npySpade \nVersion: 0.0.1\n\noptional arguments:\n  -h, --help  show this help message and exit\n\nfunctions:\n  \n    process   process mapping output and reformat to downstream analysis.\n    explevel  check the average expression level of query genes in single cell matrix\n    fc        check the fold change of sgrna\n    DEobs     perform differential expression analysis of observe cells\n    DErand    perform differential expression analysis of random selection background\n    local     perform local hit analysis with obs and random background\n    global    perform global hit analysis with obs and random background\n    \n```\n\n* `process` : Process transcriptome output and sgrna output to remove experimental doublets sgrna outlier cells. Transcriptome matrix is from Cellranger output (outs folder). sgrna matrix column: cell barcodes consistent with transcriptome matrix, rows: sgrna sequence. The final output format is h5 file. The final output can be compressed to save disk space, but it may take more time to write the final output file.\n\n* `explevel` : Check the average expression level of query genes in single cell matrix. Input: processed transcriptome matrix from the `process` output, query genes list has to be txt file, genes are seperated with new line.\n\n* `fc` : Check the fold change of perturbed region and individual sgRNA for query region and gene. Input: processed transcriptome and sgrna matrix from the `process` output and sgrna dict file (perturbation region hg38 coordinates and the sgrna sequence targeting that region. Region and sgrnas separated by tab, and sgrnas separated by comma)\n\n* `DEobs` : Perfrom the genome wide differential expression analysis of all the perturbation regions. Input: processed transcriptome and sgrna matrix from the `process` output and sgrna dict file (perturbation region hg38 coordinates and the sgrna sequence targeting that region. Region and sgrnas separated by tab, and  sgrnas separated by comma). Output: up regulation p-value, downregulation p-value, fold change(compare with all the otehr cells) and average cpm.\n\n* `DErand` : Perfrom the genome wide differential expression analysis of 1000 random selection cells. There are two options for random selection: all cells with equal probability or probability based on sgrna number in the cells. User should specify the cell number to select randomly. It is recommended with either exact cell number or bins (with large amount of perturbation experiment in order to reduce computational overhead).\n\n* `local` : Using the observation p value and randomization bavckground p value to calculate the adjusted p value based on Gaussian distribution approximation. Local hits calculation includes the genes within plus and minus 2 Mb of the perturbation region. The output is a csv file with all hits information.\n\n* `global` : Using the observation p value and randomization background p value to calculate the adjusted p value based on Gaussian distribution approximation. The output is a csv file with all hits information. Cutoff for p value is -1 (ln), fold change is 10%. Users can apply more stringent cutoff for their own purpose. \n\n## Contributors\n_______\n* First Author: Yihan Wang `Yihan.Wang@UTSouthwestern.edu`\n* Corresponding Author: Gary Hon `Gary.Hon@UTSouthwestern.edu`\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/yihan1119/pySpade",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "pySpade",
    "package_url": "https://pypi.org/project/pySpade/",
    "platform": null,
    "project_url": "https://pypi.org/project/pySpade/",
    "project_urls": {
      "Homepage": "https://github.com/yihan1119/pySpade"
    },
    "release_url": "https://pypi.org/project/pySpade/0.0.1/",
    "requires_dist": null,
    "requires_python": ">=3.7",
    "summary": "Single cell Perturbation Analysis of Differential Expression",
    "version": "0.0.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16050567,
  "releases": {
    "0.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1418c48ee05c461d13da343b02daa487a0ca9fc856b80a38637a0fb7d6c3180c",
          "md5": "febdef2d1bb6ac97c06b6a95ab2b50cb",
          "sha256": "e4eeb7716a5b25fdcbfee88b5053250c7f28a5ed39c2e98196ba61fcd1c6d6fb"
        },
        "downloads": -1,
        "filename": "pySpade-0.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "febdef2d1bb6ac97c06b6a95ab2b50cb",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 689943,
        "upload_time": "2022-12-09T16:51:54",
        "upload_time_iso_8601": "2022-12-09T16:51:54.938006Z",
        "url": "https://files.pythonhosted.org/packages/14/18/c48ee05c461d13da343b02daa487a0ca9fc856b80a38637a0fb7d6c3180c/pySpade-0.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "1418c48ee05c461d13da343b02daa487a0ca9fc856b80a38637a0fb7d6c3180c",
        "md5": "febdef2d1bb6ac97c06b6a95ab2b50cb",
        "sha256": "e4eeb7716a5b25fdcbfee88b5053250c7f28a5ed39c2e98196ba61fcd1c6d6fb"
      },
      "downloads": -1,
      "filename": "pySpade-0.0.1.tar.gz",
      "has_sig": false,
      "md5_digest": "febdef2d1bb6ac97c06b6a95ab2b50cb",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7",
      "size": 689943,
      "upload_time": "2022-12-09T16:51:54",
      "upload_time_iso_8601": "2022-12-09T16:51:54.938006Z",
      "url": "https://files.pythonhosted.org/packages/14/18/c48ee05c461d13da343b02daa487a0ca9fc856b80a38637a0fb7d6c3180c/pySpade-0.0.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}