{
  "info": {
    "author": "Pol Feliu Cuberes",
    "author_email": "feliupol@gmail.com",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "# Cantata\n*Warning!* This is a work in progress, and it doesn't have proper testing done to it. Use at your own risk!\n\nThis Python module extracts information from CANdb Databases and generates C code for integration into embedded projects. The code is environment agnostic, it can be integrated into any MCU in theory. Example files to integrate it into STM32 using HAL from ST are included in this repo.\\\nThe candb library used for reading the dbc files ([cantools](https://cantools.readthedocs.io/en/latest/)) also accepts other formats, but it hasn't been tested.\n## Install\nYou can install the package from PyPi: https://pypi.org/project/python-cantata/\n```bash\npip install python-cantata\n```\nAlternatively it can be installed from the git repository. Cloning the project and installing the pipenv for development\n\n```bash\ngit clone https://github.com/polfeliu/cantata\ncd cantata\npip install pipenv #if you don't have pipenv...\npipenv install\npipenv shell\n```\n\n## Usage\nGenerating files from database is pretty simple, just create a python file and execute it every time you change the database. This script must import the module, load the database, process it, and the module will generate .c and .h files according to the choosen options.\nWhen creating the _cantata_ object a prefix must be passed, that will give the starting name of all objects in files (messages, signals, value tables...). All the prefixes in this readme are CAN1 for simplicity purposes.\nThis is important for ECU's that are connected to multiple buses, specially if objects in the databases share names.  \n\n```python\nfrom cantata import Cantata\ncan = Cantata(\"CAN1\") # create the object setting the prefix that will be used in all objects.\n#Handy if you have several networks\n\ncan.load('./test/CAN1.dbc')# Import database\n\nsrc = r'./test/STM32TestProject/Core/Src/' #Where Source files should be copied to\nhdr = r'./test/STM32TestProject/Core/Inc/' #Where Header files should be copied to\n\ncan.correctMinsMax() # Correct the minimums and maximums\ncan.process(node=\"Engine\") #Generate for the Node Engine\ncan.process() # you can also generate all messages and signals without specifying the node\n\ncan.genFiles(src=src, hdr=hdr);\ncan.reset() #you can reset the data to be able to generate a new Node in another place\n```\n\nThe function _process_ will extract the signals and frames of the database. The _node_ parameter passed indicates which node is the code for, meaning only the frames and signals necessary will be in the code. \n\nFrames transmitted by the ECU will only have send() methods. Frames received will only have receive().\\\nSignals will always have getValue() methods and only setValue() methods if they are TX. \\\nEven though RX messages may have signals that are not RX declared in the database but are actually received they won't have an object to access them, forcing you to keep the database consistent if you want to access the signals ;). \n\nIf no node is passed to the process function (``` can.process()```) the function will calculate all the frames signals and methods. \n\n### Settings\nThis library has a series of settings that are documented across this readme. They can be changed from the default ones by accessing the settings dictionary\n\n``` python\ncan.settings[\"CallbackLib\"] = \"STM32CANCallbacks\" #name of the library that implementes the Callback functions for this bus\n```\n\n### Mins and Max\nI've found that many databases tend to have the mins and maxs of signals not calculated (because in the CANdb++ editor you have to click a button to update them).\\\nTo prevent mysterious errors when executing the program I programmed a cool optional feature: When you process a signal it checks that the mins and max are correct. If a signal fails the program halts and prints an error.\\\nThis check can be disabled by setting _checkminmax_ to False on the settings\n\nThe function correctMinsMax() can be called before processing the node and it simply recalculates all the mins and maxs to the cache, so that when you call the process() function it doesn't fail.\nTo store the new mins and maxs to a .dbc file you can call the function ``can.save(\"file\")``.\n\n### Filters\nThe library calculates a standard ID and a extended ID hardware filters (filter and mask) for the RX messages of the node. This can be used to reduce the software load. The filters are declared in the header file\n\n```c\n// PassRatio: 67.0 %  // Messages that this ECU Reads\n// MatchedRatio: 67.0 %  // Messages that the Filters lets pass\n// Efficiency: 100.0 %  // Effiency of the filter (passRation/matchedRatio)\n\n#define CAN1_StandardFilter   0b01100000000\n#define CAN1_StandardMask     0b10010011000\n#define CAN1_ExtendedFilter   0b00000000000000000000000000000\n#define CAN1_ExtendedMask     0b11111111111111111111111111111\n```\nMore on CAN controller hardware filters: http://www.cse.dmu.ac.uk/~eg/tele/CanbusIDandMask.html\n\nIn the STM32CANCallbacks.c files there is an initialization of the CAN that includes the configuration of the bxCAN filters.\n\n## Structure\nThe library generates cantataCAN1.c and cantataCAN1.h files with structures and functions for the following objects.\n\n![alt text](https://github.com/polfeliu/cantata/raw/main/diagram.png)\n\n### Signals\nThe signal structure contains basic information of the signal provided by the database:\n* **length**: Length in bits of the signal\n* **(optional)byte_order**: Byte order represented with enumerated type of the signal big_endian or little endian\n* **(optional)unit**: Units of the signal (String)\n* **(optional)initial_value**: Initial value of the signal\n* **factor**: Factor to get physical value from raw value\n* **offset**: Offset to get physical value from raw value\n* **min**: Minimum physical value of the signal\n* **max**: Maximum physical value of the signal\n\nAnd also own elements of the library:\n* **value_type**: indicates in what type the raw signal will be stored\n* **raw**: stores the raw signal, can be used to get the raw value\n* **getValue**: pointer to function that returns the physical value according to the factor and offset\n* **setValue**: pointer to function that sets the raw value (with the physical value passed as an argument) according to the factor and offset\n* **setRaw**: pointer to function that sets the raw value\n* **(optional) sent**: Boolean that indicates if the signal value has been sent by the Interaction Layer.\n* **(optional) inactiveValue**: Indicates the signal inactive value if the interaction layer is activated and the sent type is IfActive \n```c\nstruct CAN1sig_SleepInd_t CAN1sig_SleepInd = {\n    .length = 1,\n    .byte_order = little_endian,\n    .value_type = Tbool,\n    .unit = \"\",\n    .initial_value = 0,\n    .factor = 1,\n    .offset = 0,\n    .min = 0,\n    .max = 1,\n    .raw = 0,\n    .getValue = CAN1sig_SleepInd_getValue,\n    .setValue = CAN1sig_SleepInd_setValue,\n    .setRaw = CAN1sig_SleepInd_setRaw,\n    .sent = true\n};\n```\n\n#### getValue\n```c\nsleep = CAN1sig_SleepInd.getValue();\n```\n#### setValue\n```c\nsat = CAN1sig_SleepInd.setValue(34);\n```\nsetValue checks if the value passed exceeds the signal maximum and minimum and saturates it accordingly. It also returns a boolean that informs if the value saturated.\n\n\n#### setRaw\n```c\nCAN1sig_SleepInd.setRaw(34);\n```\n\n#### Value Tables\nSignals can have Value tables associated to represent states, errors or others. These are automatically defined as enumerated types that are easily accessed. \n\nEnumerated datatypes can only have a code for each name, but value tables can have more than one. If this is the case the code generation will throw a warning and assign one of the possible values to the name.\n```c\ntypedef enum {\n    CAN1sig_StatusVT_Error=3,\n    CAN1sig_StatusVT_GoSleep=2,\n    CAN1sig_StatusVT_Running=1,\n    CAN1sig_StatusVT_WakeUp=0,\n}CAN1sig_StatusVT_t;\n```\nThey can be used with setValue and getValue methods\n```c\nCAN1sig_Status.setValue(CAN1sig_StatusVT_WakeUp);\n```\n\n\n### Frames\nFrames have similar structs with data from the database:\n* **ID**: Identifier of the message.   \n* **is_extended**: Boolean indicating if the indentifier is of extended format (equivalent to XTD)\n* **DLC**: Data Length Code declared in the database (for messages with DLC less or equal to 8, DLC=Number of bytes)\n\nAnd also own elements of the library:\n* **raw**: Holds the raw message with union of bytes and raw signals structs. This shouldn't be used by the application.\n* **send**:  packs all the signals to the frame raw parameter and calls CAN1_SendCallback() with the frame calculated (more on that later). Also reverses bits of big endian signals. \n* **receive**: unpacks the raw message and store the values of the signals to the signals raw parameter. Signals with big endian encoding are reversed on this process. \n* **on_receive** Pointer to function that is called every time a message is received.\n\nThe code generation for receive and send methods support both multiplexing and extended multiplexing.\n\nIf InteractionLayer is activated and the message contains a signal with send type with repetitions:\n* **repetitions**: Number of repetitions that are sent\n* **repetitions_left**: Number of repetitions that are left to send\n\nIf the network is of type CANFD (Attribute BusType = \"CAN FD\") the struct will also have:\n* **(optional)FDF**: Boolean Indicating if frame is of type Flexible Data Format\n* **(optional)BRS**: Boolean Indicating if data is at nominal rate or at data rate (Bit Rate Switch)\n\n```c\n// Comment: None\nstruct CAN1_MultiplexExample2_t CAN1_MultiplexExample2 = {\n    .ID = 0x301, //dec: 769\n    .is_extended = false,\n    .DLC = 8,\n    .send = CAN1_MultiplexExample2_send,\n    .repetitions = 5,\n    .repetitionsleft = 0,\n    .raw = {\n        .bytes = {0}\n    },\n};\n```\nsend and receive methods can be used like that:\n```c\nCAN1_NM_Engine.send()\n\nCAN1_NM_Engine.receive();\n```\nBefore receiving data the raw value of the message struct should be updated, this method is typically used from the ReceiveCallback and already takes care of that.\n\nSend Method can be used from the application to decide when to send each frame. Optionally you can use the Interaction Layer that sends them without the application's intervention.\n\nOn_receive can be used to notify the application that a particular message is received by declaring a custom function and bounding it to on_receive.\n\n```c\nvoid on_receive_MultiplexExample(){\n\tHAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);\n}\n\nvoid main(){\n\tCAN1_MultiplexExample.on_receive = &on_receive_MultiplexExample; // Bind custom function to on_receive function pointer\n    ...\n}\n```\n\n\n\n### CallBacks\n#### Receive\nThe library also defines a receive callback (*CAN1_ReceiveCallback*) that can be used to handle incoming messages and store them in the respective structures according to the ID (it also checks that consistency with DLC, is_extended, FDF and BRS).\nWhen the driver receives a message it should call this function with the appropiate parameters. This function is driver agnostic and it is generated in the cantata file.\n\nBoth Receive and Send Callbacks have the following parameters:\n* **data**: Array of bytes to be transmitted or received\n* **DLC**: Data Length Code. Indicates how many bytes are in the data frame. For messages with length less than 8 bytes DLC=length.\n* **ID**: Identifier of the frame.\n* **is_extended**: boolean indicating if identifier is of type extended\n\nIf the network is of type CANFD (Attribute BusType = \"CAN FD\") they will also have:\n* **FDF**: Boolean Indicating if frame is of type Flexible Data Format\n* **BRS**: Boolean Indicating if data is at nominal rate or at data rate (Bit Rate Switch)\n\n```c\nvoid CAN1_ReceiveCallback(uint8_t data[], uint8_t DLC, uint32_t ID, bool is_extended /*, bool FDF, bool BRS*/){\n    if((ID > 0x1FFFFFFF) & is_extended){\n        //invalid extended identifier\n    }else if((ID > 0x7FF) & !is_extended){\n        //invalid standard identifier\n    }\n\n    else if((ID==CAN1_FloatExample4.ID) & (is_extended==CAN1_FloatExample4.is_extended) & (DLC==CAN1_FloatExample4.DLC)){\n        memcpy(CAN1_FloatExample4.raw.bytes, data, sizeof CAN1_FloatExample4.raw.bytes);\n        CAN1_FloatExample4.receive();\n    }\n\n    else if((ID==CAN1_FloatExample3.ID) & (is_extended==CAN1_FloatExample3.is_extended) & (DLC==CAN1_FloatExample3.DLC)){\n        memcpy(CAN1_FloatExample3.raw.bytes, data, sizeof CAN1_FloatExample3.raw.bytes);\n        CAN1_FloatExample3.receive();\n    }\n```\n\nIn the STM32CANCallbacks files there is an example on how this function should be called on STM32 using HAL.\n#### Transmit\nYou should define a Transmit (*CAN1_SendCallback*) callback so that the messages are sent after being assembled. \\\nThis function will be called with the *data, DLC, ID, is_extended* parameters by each send() command.\\\nIf the network is of type CANFD they must also have FDF and BRS.\n\nAn example of this function is included in the STM32CANCallbacks files.\n## Interaction Layer\nOptionally, the Library can also generate FreeRTOS tasks for sending the messages and signals.\n\nThe Interaction Layer can be started and stopped by calling the functions.  \n```c\nCAN1_InteractionLayerStart();\nCAN1_InteractionLayerStop();\n```\nThese functions create and delete the tasks of the Interaction Layer Tasks respectively. \nThe tasks are created with a default stack depth. The stack usage is something that greatly depends and one may want to change it and tune it to improve resource utilization. \nThe default value can be overridden by defining each tasks stack depth with a #define macro\n```c\n#define vTaskInteractionLayer_CAN2_cyclic_100_Stack_Depth 300\n```\n\nThe test project with STM32 in this repository has examples of how the interaction layer works with a button.\n\nCyclic messages must be defined as so on the message attribute (GenMsgSendType) and signals of messages can have another GenSigSendType to have additional behaviour. Note that each message may contain several signals with different parameters and thus message may be sent more times than what is expected from one signals perspective.\n\nThe architecture that is generated for a database can be represented with the following diagram:\n![alt text](https://github.com/polfeliu/cantata/raw/main/InteractionLayerDiagram.png)\n\n### Cyclic\nMessages with attribute _GenMsgSendType = Cyclic_ are grouped by cyclic times and sent with the period set at _GenMsgCycleTime_ attribute\n\n![alt text](https://github.com/polfeliu/cantata/raw/main/test/Screenshots/Cyclic.png)\n\nMessage is sent no matter the state of the button\n### On Change\nSignals with attribute _GenSigSendType = OnChange_ send the messages they are assigned to whenever the raw value of the signal changes with .setValue() or .setRaw().\nNote that .setValue() computes factor and offset, and rounds off to integers. If the calculated raw value of the signal doesn't change the signal is not sent \n\n![alt text](https://github.com/polfeliu/cantata/raw/main/test/Screenshots/OnChange.png)\n\nExample: The state of the button is set to the signal constantly (at 50ms) and if the value changes the message is sent\n```\nCAN1sig_IdleRunning.setValue(button);\n```\n\n### On Change With Repetitions\nSignals with attribute _GenSigSendType = OnChangeWithRepetition_ send the messages similary as _OnChange_ but, after the value is changed (and sent) the signal is sent N times more at a fast rate, thus the message is sent N+1 times.\nThis fast rate is defined in the message attribute _GenMsgCycleTimeFast_ and number of times the message is sent is set with _GenMsgNrOfRepetition_.    \n![alt text](https://github.com/polfeliu/cantata/raw/main/test/Screenshots/OnChangeWithRepetitions.png)\n\nExample: Same as before\n\n### On Write\nSignals with attribute _GenSigSendType = OnWrite_ send the messages whenever the function .setValue() or .setRaw() are called, no matter if the value is set is the same.\n![alt text](https://github.com/polfeliu/cantata/raw/main/test/Screenshots/OnWrite.png)\n\nExample: Every time the button changes state the application writes the same value to the signal\n```c\nif(button != button_last){\n    CAN1sig_EngSpeed.setValue(1);\n}\n```\n\n### On Write With Repetitions\nSignals with attribute _GenSigSendType = OnWriteWithRepetition_ send the messages similarly as _OnWrite_ and after the message is sent the fast time for the repetitions is activated as described on **On Change With Repetitions**\n\n![alt text](https://github.com/polfeliu/cantata/raw/main/test/Screenshots/OnWriteWithRepetitions.png)\n\nExample: Same as before\n\n### If Active\nSignals with attribute _GenSigSendType = IfActive_ send the message whenever the signal has a value different than the set in the _GenSigInactiveValue_ attribute\n![alt text](https://github.com/polfeliu/cantata/raw/main/test/Screenshots/IfActive.png)\n\nExample: If the button is not pressed the signal is put in inactive value and thus is not sent. If not, an active value (1) is set to the signal.  \n```c\nif(button){\n    CAN1sig_ExSignal9.setValue(CAN1sig_ExSignal9.inactiveValue);\n}else{\n    CAN1sig_ExSignal9.setValue(1);\n}\n```\n\n### If Active With Repetitions\nSignals with attribute _GenSigSendType = IfActiveWithRepetitions_ send the messages similarly as _IfActive_. Whenever the signal takes the value of _GenSigInactiveValue_ the signal is sent N times more as **On Change With Repetitions**\n![alt text](https://github.com/polfeliu/cantata/raw/main/test/Screenshots/IfActiveWithRepetitions.png)\n\nExample: Same as before\n\n## FreeRTOS Atomicity and Critical Sections\nSee Chapter 7: https://www.freertos.org/fr-content-src/uploads/2018/07/161204_Mastering_the_FreeRTOS_Real_Time_Kernel-A_Hands-On_Tutorial_Guide.pdf\n\nTo guarantee atomicity and consistency of the signals and messages when using FreeRTOS, portENTER_CRITICAL() and portEXIT_CRITICAL() statements can be placed automatically on _send()_ and _receive()_ methods. These statements suspend the interrupts and scheduler and ensure that the messages are packed and unpacked without any instruction being done in the middle (like potentially modify part of a signal and corrupting its data). These statements can be activated with the setting _FreeRTOSCriticalSections_. If the Interaction Layer is activated this is automatically activated.\n\nWarning! portEnter_CRITICAL() and portEXIT_CRITICAL() cannot be called from an ISR. If the CAN_ReceiveCallback is directly called from the CAN interrupt and _FreeRTOSCriticalSections_ is activated the program will crash. Please use deferred interrupt processing on the callbacks to avoid this. On the STM32CANCallbacks there is an example on how to do this with Queues.\n\nNote that methods for signals **don't** have these statements. So you will have to take care of that for signals that are longer than the bit-width of the MCU architecture you are using.\n\n\n## Plot Signal Conversion\nThe Library also allows to create matplotlib plots of the signal conversion that will take place with `getValue()` and `setValue methods`.\n```python\ncan.plotSignalConversion(\"SignalExampleToPlot\")\n```\n![alt text](https://github.com/polfeliu/cantata/raw/main/plotSignalConversion.png)\n\nThe signal must be processed. So if the node parameter is passed to the process function the signal to be ploted must be a TX or RX signal.\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/polfeliu/cantata",
    "keywords": "sample setuptools development",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "python-cantata",
    "package_url": "https://pypi.org/project/python-cantata/",
    "platform": "",
    "project_url": "https://pypi.org/project/python-cantata/",
    "project_urls": {
      "Homepage": "https://github.com/polfeliu/cantata",
      "Source": "https://github.com/polfeliu/cantata"
    },
    "release_url": "https://pypi.org/project/python-cantata/1.3.1/",
    "requires_dist": [
      "aenum (==3.0.0)",
      "bitstruct (==8.11.1)",
      "cantools (==36.2.0)",
      "cogapp (==3.0.0)",
      "cycler (==0.10.0)",
      "matplotlib (==3.3.4)",
      "textparser (==0.23.0)",
      "windows-curses (==2.2.0)",
      "wrapt (==1.12.1)",
      "pyparsing (==2.4.7) ; python_version >= \"2.6\" and python_version not in \"3.0, 3.1, 3.2\"",
      "python-can (==3.3.4) ; python_version >= \"2.7\"",
      "python-dateutil (==2.8.1) ; python_version >= \"2.7\" and python_version not in \"3.0, 3.1, 3.2\"",
      "six (==1.15.0) ; python_version >= \"2.7\" and python_version not in \"3.0, 3.1, 3.2\"",
      "diskcache (==5.2.1) ; python_version >= \"3\"",
      "argparse-addons (==0.7.0) ; python_version >= \"3.6\"",
      "kiwisolver (==1.3.1) ; python_version >= \"3.6\"",
      "pillow (==8.1.0) ; python_version >= \"3.6\"",
      "numpy (==1.20.1) ; python_version >= \"3.7\""
    ],
    "requires_python": ">=3",
    "summary": "Python Tool to generate C structures and functions to access candb information",
    "version": "1.3.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 10092539,
  "releases": {
    "0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9cf2a389a37ac6b02c19f943fa54e4e7560ba86530b86480b08c5483832ab59b",
          "md5": "bee6d637a08a08a02e6bc898bb5d77f9",
          "sha256": "0f3f823f589115e215001e3c325f6b7cf5a55aae485690668f3abfda9c3c7623"
        },
        "downloads": -1,
        "filename": "python_cantata-0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "bee6d637a08a08a02e6bc898bb5d77f9",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3",
        "size": 25509,
        "upload_time": "2021-01-31T19:17:33",
        "upload_time_iso_8601": "2021-01-31T19:17:33.360641Z",
        "url": "https://files.pythonhosted.org/packages/9c/f2/a389a37ac6b02c19f943fa54e4e7560ba86530b86480b08c5483832ab59b/python_cantata-0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "96f488253a0c230243fafe687024dcde4f1e3d58a500ea18865486819db4c320",
          "md5": "85b20e299ab369d5c0339ce126e7bcc4",
          "sha256": "8b96765f9b2cf0fcb76b8ea49b0678511451149e6b31a9b4ec5418d039560cfa"
        },
        "downloads": -1,
        "filename": "python-cantata-0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "85b20e299ab369d5c0339ce126e7bcc4",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3",
        "size": 23203,
        "upload_time": "2021-01-31T19:17:35",
        "upload_time_iso_8601": "2021-01-31T19:17:35.209447Z",
        "url": "https://files.pythonhosted.org/packages/96/f4/88253a0c230243fafe687024dcde4f1e3d58a500ea18865486819db4c320/python-cantata-0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "708f634a3519aa931a0264c1623c9f1b852254930a37540d360cc91cca6b97e8",
          "md5": "0b660e179e34dc34c30c910525f3b3fd",
          "sha256": "5b1e2aa12c5b8d8a9cb5280024156c3a6b76b8a6d61667d483d0b02a19837344"
        },
        "downloads": -1,
        "filename": "python_cantata-0.1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "0b660e179e34dc34c30c910525f3b3fd",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3",
        "size": 25545,
        "upload_time": "2021-01-31T20:15:41",
        "upload_time_iso_8601": "2021-01-31T20:15:41.822572Z",
        "url": "https://files.pythonhosted.org/packages/70/8f/634a3519aa931a0264c1623c9f1b852254930a37540d360cc91cca6b97e8/python_cantata-0.1.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "51bc5e480abf24a76caeb03bcec166fed8104166e9385de0438a1b418320776c",
          "md5": "3afd64243a976ecb89c548d6059cf8d4",
          "sha256": "195ec6175086abd2011a195b011aaf274301a534818b4de484d8cc967485a429"
        },
        "downloads": -1,
        "filename": "python-cantata-0.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "3afd64243a976ecb89c548d6059cf8d4",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3",
        "size": 23252,
        "upload_time": "2021-01-31T20:15:43",
        "upload_time_iso_8601": "2021-01-31T20:15:43.336776Z",
        "url": "https://files.pythonhosted.org/packages/51/bc/5e480abf24a76caeb03bcec166fed8104166e9385de0438a1b418320776c/python-cantata-0.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "16a5bf96ede7e53f60a6ee8b28e91914d57fa6291737f156fbf50feb7e2e6671",
          "md5": "100ec5168a1e19cf00bf22c2569c4e93",
          "sha256": "93d1b1b5f23c2789da7c17b93a539951e5870166d0c0fdc7817a4f8b302bc57e"
        },
        "downloads": -1,
        "filename": "python_cantata-1.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "100ec5168a1e19cf00bf22c2569c4e93",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3",
        "size": 27058,
        "upload_time": "2021-02-05T16:40:12",
        "upload_time_iso_8601": "2021-02-05T16:40:12.932522Z",
        "url": "https://files.pythonhosted.org/packages/16/a5/bf96ede7e53f60a6ee8b28e91914d57fa6291737f156fbf50feb7e2e6671/python_cantata-1.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1855ac167d1b2db67a3dbf3fd8f1e7d348064cda18b58bb84bf8964420fea089",
          "md5": "a2ef16ca97e3578ff99bd8b12e83ec6b",
          "sha256": "c2fe3f3a3d7e91f23de60f25fed9b81e8269ade16c382ba615cd52fb79aaedc9"
        },
        "downloads": -1,
        "filename": "python-cantata-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "a2ef16ca97e3578ff99bd8b12e83ec6b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3",
        "size": 25727,
        "upload_time": "2021-02-05T16:40:14",
        "upload_time_iso_8601": "2021-02-05T16:40:14.607297Z",
        "url": "https://files.pythonhosted.org/packages/18/55/ac167d1b2db67a3dbf3fd8f1e7d348064cda18b58bb84bf8964420fea089/python-cantata-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a8741ca393ed440c8a8919a6c9a8120f4fbf003a88d75c21e1b54648168367c8",
          "md5": "4cd196bef6d03cf2aae709d83b1ef322",
          "sha256": "c76175f771026c941f2d0904a182ac35b3b92a0e4f8df1dbdc81798287cf67da"
        },
        "downloads": -1,
        "filename": "python_cantata-1.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "4cd196bef6d03cf2aae709d83b1ef322",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3",
        "size": 28075,
        "upload_time": "2021-02-26T21:33:19",
        "upload_time_iso_8601": "2021-02-26T21:33:19.283876Z",
        "url": "https://files.pythonhosted.org/packages/a8/74/1ca393ed440c8a8919a6c9a8120f4fbf003a88d75c21e1b54648168367c8/python_cantata-1.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "43e11ca2d1dbb37060f54cd49a83a558d72baaf840312917b644a7c9f6369768",
          "md5": "7397267801f4cc995eaffe2cb6240878",
          "sha256": "c785a6c7a59a5a2bbb3848100a36f7bfcacc04875ee098db92399e9340787bee"
        },
        "downloads": -1,
        "filename": "python-cantata-1.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "7397267801f4cc995eaffe2cb6240878",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3",
        "size": 27588,
        "upload_time": "2021-02-26T21:33:20",
        "upload_time_iso_8601": "2021-02-26T21:33:20.910909Z",
        "url": "https://files.pythonhosted.org/packages/43/e1/1ca2d1dbb37060f54cd49a83a558d72baaf840312917b644a7c9f6369768/python-cantata-1.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.2.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "cec292584edee7af544f19a0d23bc925a8f6fefac7b580800bbbd5fed6010835",
          "md5": "4d31cb04fbf5b8c438094fb499a9ce3c",
          "sha256": "6f214239e849ee0c0ebccb6bf695685b7ff7c896777773098e33ac2eb500dcd6"
        },
        "downloads": -1,
        "filename": "python_cantata-1.2.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "4d31cb04fbf5b8c438094fb499a9ce3c",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3",
        "size": 28909,
        "upload_time": "2021-03-01T15:39:42",
        "upload_time_iso_8601": "2021-03-01T15:39:42.991923Z",
        "url": "https://files.pythonhosted.org/packages/ce/c2/92584edee7af544f19a0d23bc925a8f6fefac7b580800bbbd5fed6010835/python_cantata-1.2.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "396760b8962cc634966a3dad23085260e2c3c75806ade2be13fdd13d7c7e93e6",
          "md5": "9c4034f6d62abecf3472be8421cc0b5a",
          "sha256": "a99a9acbc8c7402aaaa6c369483efea86e569d759218bc0e805338f0d9902f20"
        },
        "downloads": -1,
        "filename": "python-cantata-1.2.0.tar.gz",
        "has_sig": false,
        "md5_digest": "9c4034f6d62abecf3472be8421cc0b5a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3",
        "size": 28502,
        "upload_time": "2021-03-01T15:39:44",
        "upload_time_iso_8601": "2021-03-01T15:39:44.239596Z",
        "url": "https://files.pythonhosted.org/packages/39/67/60b8962cc634966a3dad23085260e2c3c75806ade2be13fdd13d7c7e93e6/python-cantata-1.2.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.3.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1558822217112c9d713d197d8ab99850af205c33d2453e8b82af6757918c034e",
          "md5": "274b9aec30e03d14313950acb880f451",
          "sha256": "44a6dedcf2fba2b86cc62bf76ba439241a39254cd5a1e4ac8c377fe61dc166ea"
        },
        "downloads": -1,
        "filename": "python_cantata-1.3.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "274b9aec30e03d14313950acb880f451",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3",
        "size": 28935,
        "upload_time": "2021-04-17T12:09:58",
        "upload_time_iso_8601": "2021-04-17T12:09:58.823084Z",
        "url": "https://files.pythonhosted.org/packages/15/58/822217112c9d713d197d8ab99850af205c33d2453e8b82af6757918c034e/python_cantata-1.3.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8275d81edcc178a440560b7bfb10e1f7a68a6484de56396f5d49bb8ba6629667",
          "md5": "49ffd832162f8f113bc1cfc75c6d5171",
          "sha256": "3b092451e1f36ade0af0f5d5b6edaacbfd6ddc17a8bd1b167b800eb0f231a027"
        },
        "downloads": -1,
        "filename": "python-cantata-1.3.0.tar.gz",
        "has_sig": false,
        "md5_digest": "49ffd832162f8f113bc1cfc75c6d5171",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3",
        "size": 28711,
        "upload_time": "2021-04-17T12:10:00",
        "upload_time_iso_8601": "2021-04-17T12:10:00.397275Z",
        "url": "https://files.pythonhosted.org/packages/82/75/d81edcc178a440560b7bfb10e1f7a68a6484de56396f5d49bb8ba6629667/python-cantata-1.3.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.3.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "eb9af25c81bba6f29851911923326e6ad48288ca8d82b302d68e61ff3999b52b",
          "md5": "b9f054147cb895e2907de696a31ab532",
          "sha256": "cac6e16c1d98e4b7afd9c8af9ee23fc668af348f9d12439f07511e68cacd0d2f"
        },
        "downloads": -1,
        "filename": "python_cantata-1.3.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "b9f054147cb895e2907de696a31ab532",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3",
        "size": 28954,
        "upload_time": "2021-04-17T12:14:37",
        "upload_time_iso_8601": "2021-04-17T12:14:37.357899Z",
        "url": "https://files.pythonhosted.org/packages/eb/9a/f25c81bba6f29851911923326e6ad48288ca8d82b302d68e61ff3999b52b/python_cantata-1.3.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a268bf480b483e9002aaf9a9a362de98f99837009e30957b86e326878c2e9632",
          "md5": "95113cf9a49057476fa4e2812c72e259",
          "sha256": "d7c5dbad6fcc66427633a498107b9d7c31f0f2fe3dd9ac639ffd68e73cd93f65"
        },
        "downloads": -1,
        "filename": "python-cantata-1.3.1.tar.gz",
        "has_sig": false,
        "md5_digest": "95113cf9a49057476fa4e2812c72e259",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3",
        "size": 28729,
        "upload_time": "2021-04-17T12:14:38",
        "upload_time_iso_8601": "2021-04-17T12:14:38.878878Z",
        "url": "https://files.pythonhosted.org/packages/a2/68/bf480b483e9002aaf9a9a362de98f99837009e30957b86e326878c2e9632/python-cantata-1.3.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "eb9af25c81bba6f29851911923326e6ad48288ca8d82b302d68e61ff3999b52b",
        "md5": "b9f054147cb895e2907de696a31ab532",
        "sha256": "cac6e16c1d98e4b7afd9c8af9ee23fc668af348f9d12439f07511e68cacd0d2f"
      },
      "downloads": -1,
      "filename": "python_cantata-1.3.1-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "b9f054147cb895e2907de696a31ab532",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3",
      "size": 28954,
      "upload_time": "2021-04-17T12:14:37",
      "upload_time_iso_8601": "2021-04-17T12:14:37.357899Z",
      "url": "https://files.pythonhosted.org/packages/eb/9a/f25c81bba6f29851911923326e6ad48288ca8d82b302d68e61ff3999b52b/python_cantata-1.3.1-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "a268bf480b483e9002aaf9a9a362de98f99837009e30957b86e326878c2e9632",
        "md5": "95113cf9a49057476fa4e2812c72e259",
        "sha256": "d7c5dbad6fcc66427633a498107b9d7c31f0f2fe3dd9ac639ffd68e73cd93f65"
      },
      "downloads": -1,
      "filename": "python-cantata-1.3.1.tar.gz",
      "has_sig": false,
      "md5_digest": "95113cf9a49057476fa4e2812c72e259",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3",
      "size": 28729,
      "upload_time": "2021-04-17T12:14:38",
      "upload_time_iso_8601": "2021-04-17T12:14:38.878878Z",
      "url": "https://files.pythonhosted.org/packages/a2/68/bf480b483e9002aaf9a9a362de98f99837009e30957b86e326878c2e9632/python-cantata-1.3.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}