{
  "info": {
    "author": "Maria Sopena, Joana Llaurado, Othmane Hayoun",
    "author_email": "",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "[![made-with-python](https://img.shields.io/badge/Made%20with-Python-1f425f.svg)](https://www.python.org/)\n[![GitHub license](https://img.shields.io/github/license/Naereen/StrapDown.js.svg)](https://github.com/mariasr3/pytprot/blob/main/LICENSE.txt)\n\n# pyprot: PPI-based multicomplex builder\n\n**pytprot** is a web-app and command-line Python3 package to build protein multicomplexes from binary chain interactions.\n\n*Joana Llauradó, Maria Sopena, Othmane Hayoun*\n\n\n\n- [pyprot: PPI-based multicomplex builder](#pyprot-ppi-based-multicomplex-builder)\n  - [0. Pre-requisites](#0-pre-requisites)\n  - [1. Installation](#1-installation)\n      - [1.3. Through PyPi (Recommended)](#13-through-pypi-recommended)\n      - [1.2. Through github](#12-through-github)\n  - [2. Module structure](#2-module-structure)\n    - [2.1. Script detail: The different pytprot submodules](#21-script-detail-the-different-pytprot-submodules)\n  - [3. The pytprot pipeline](#3-the-pytprot-pipeline)\n  - [4. How to use *pytprot*: A quick tutorial](#4-how-to-use-pytprot-a-quick-tutorial)\n    - [4.1. Running pytprot from command line](#41-running-pytprot-from-command-line)\n      - [4.1.1. Example 1: 1GZX, interacting chains input](#411-example-1-1gzx-interacting-chains-input)\n      - [4.1.2. Example 2: 6GMH, multicomplex input](#412-example-2-6gmh-multicomplex-input)\n      - [4.1.2. Example 3: 3T72, a RMN-based input](#412-example-3-3t72-a-rmn-based-input)\n      - [4.1.2. Example 4: 6OM3, an example of a multicomplex made of assymmetric units](#412-example-4-6om3-an-example-of-a-multicomplex-made-of-assymmetric-units)\n    - [4.2. Running pytprot from Dash](#42-running-pytprot-from-dash)\n\n## 0. Pre-requisites\n\nIn order to run **pytprot**, it is compulsory to have a Python3 interpreter, and strongly recommended to have any biomolecule visualization software, such as Chimera or ICM. This module relies heavily on the **biopython** Python module, so it is also strongly advised to download said module.\n\n## 1. Installation\n\n#### 1.3. Through PyPi (Recommended)\n\nWe have added our module into PyPi to make it even easier to install. In this case, you only have to execute the following command on your terminal:\n\n```\npip3 install pytprot\n\n```\n\nFor Unix users, _pytprot_ can run without specifically invoking the Python3 interpreter with:\n\n```\nchmod +x ./path/to/pytprot/pytprot.py\n\n```\n\nOnce this is done, we can just run _pytprot_ from any directory within the system with:\n\n```\npytprot.py -i input/path -o output/path \n\n```\n\nWith, this, the package and its dependencies will be automatically installed within your PYTHONPATH, where all the pytprot folder, with the examples and the corresponding scripts, will be installed.\n\n#### 1.2. Through github\n\nFirst, you have to copy the GitHub repository to a given folder, move into it, and execute the `setup.py` file.\n\n```\ngit clone https://github.com/mariasr3/pytprot.git\ncd pytprot\nsudo python3 setup.py install\n\n```\nUsing the `chmod` command, as explained in Section 1.1., will allow for running _pytprot_ from any directory.\n\n\n\n## 2. Module structure\n\nThe `pytprot` module consists of the following folders:\n\n* dash_example_files: Contains example inputs for when *pytprot* is run from Dash.\n* pyptrot: Contains the different Python scripts that allow the module to run properly. These will be explained later-on.\n* pytprot.egg-info: Information folder formed after the compilation of the module.\n* example_files: Contains example inputs for when *pytprot* is run from command-line.\n\nAnd the following files:\n* LICENSE.txt: Contains the MIT license for the distribution of the *pytprot* module source code.\n* README.md: MarkDown document that contains the Tutorial, and some biological information background.\n* setup.py: Python script that contains the information needed in order to install the package.\n\n### 2.1. Script detail: The different pytprot submodules\n\nWithin the `pytprot` folder, we find the different scripts that, altogether form the whole package. These are:\n\n- **__init__.py**: The *init* script that indicates which scripts from this same folder have to be loaded.\n- **pytprot.py**: The main module of the script, where the actual scripting pipeline is layed-down. This includes the checking for correct inputs, the processing of the input interacting chains or macrocomplex, the building of the macrocomplex and saving the structure. All the functions employed in this script are imported from the other scripts within the folder.\n- **inputfunctions.py**: The module with which the inputs will be processed in order to end up having a common Python dictionary object.\n- **chainfunctions.py**: The module with which the similar chains are found.\n- **modelfunctions.py**: The module with which the actual model is built.\n- **parser.py**: The *argparser* module script. Allocates the different command-line arguments.\n- **pytprot_dash.py**: This script allows for opening the Dash pytprot app. The pipeline is similar to that of the main script, and it also references the different function scripts.\n\n\nNevertheless, a more detailed explanation of all the submodels, and their corresponding functions, is detailed on the Theory.pdf.\n\n\n\n## 3. The pytprot pipeline\n\nThe *pytprot* module follows a specific pipeline in order to build the models.\n\n1. **Input recognition**: In order for it to correctly work, *pytprot* only allows a specific type of input files. It has to be a folder with one or more PDB files. If there is only one PDB file, it is understood as a macrocomplex, independently of its filename. If there is a list of PDB files, these are understood to be interacting chain pairs, which have to be named as 1gzx_A_B.pbd or 1gzx_A_ED.pdb, referring to the structure name (1gzx) and the pair of chains (A and B), or the pair of interacting protein-double-DNA chains (A and ED). The stoichiometry input file is also read at this point. This **.txt** must also have a specific format.\n \n2. **Chain processing**: Given a macrocomplex, it is broken into single chains in order to obtain the interacting chains¹, based on the distance at which there is a contact between chains and the number of contacts. At this point, the program also checks and deletes redundant interactions². If a set of interacting chains is already provided, this step is not needed. After this, the program searches for similar chains, that is, chains with a sequence identity higher than 95%, as these will be the ones that will allow for superimposition.\n\n3. **Model building**: If a stoichiometry file is provided, it checks if it is actually correct or not. If it is not, the program will proceed with the model building without the stoichiometry, and a warning message is raised. Then, it takes into account the information from the similar chains, all the provided chains, the stoichiometry (if provided) in order to build the model. This is an iterative process that adds pairs to the model if one chain of the pair finds a similar chain within the model. Then, it superimposes both pairs, obtains a rotran matrix, and applies it to the interacting chain pair to the one superimposed. If there are no clashes at 1.9 Å with any chain of the model, it is added. This is repeated until all the provided interacting chain pairs are checked.\n\nThe model is then saved with a specific filename that includes the model name, the number of chains and the timestamp.\n\n\n\n\n(1) Here, **interacting chains** refers to a distance of 12 Å and 8 number of contacts to consider two chains to be interacting, by default, although this can be changed.\n(2) **Redundant chains** are pairs of interacting chains that have one common similar chain, and the other pair of chains produce clashes between them, at a 1.9 Å distance.\n\n\n\n## 4. How to use *pytprot*: A quick tutorial\n\n### 4.1. Running pytprot from command line\n\nTo run the module, you need to execute the main script (**pytprot.py**), located in the *pytprot* folder, found after installation. In order to view the different command-line arguments, we can execute:\n\n```\npython3 /path/to/pytprot.py -h (or --help)\n\n```\n\nWhich will display the following arguments:\n\n- **-i INFILE or --input-directory INFILE**: Required. The user must provide a directory which contains the input files. **NOTE**: Said input files need to follow the correct naming convention. If not, these will not be accepted by the program.\n- **-s or --stoichiometry**: Optional. The user can handle an input **.txt file** with the model stoichiometry. It also has to follow a specific structure, as shown in the sample stoichiometry file in the package directory.\n- **-f or --force**: Optional. It forces the creation of an output directory. If it already exists, the contents of said directory are overwritten.\n- **-o OUTDIR or --output-directory OUTDIR**: Required. The user must provide an ouput directory where the output files will be stored. If the output directory already exists, and the \"force\" flag has not been activated, the program will terminate.\n- **-v or --verbose**: Optional. It prints in the terminal some information about the process. \n- **-m or --macrocomplex**: Optional. If the input file is a macrocomples, the user should use this option to indicate it. \n- **-d or --contact_dist**: Optional. Only employed if the macrocomplex flag is active. By default the distance between the CA backbone of two chains to consider they are interacting is set to 12 Å. \n- **-cn or --contact_num**: Optitonal. Only employed if the macrocomplex flag is active. By default there needs to be a minimum of 8 residues to interact at a distance *d* between two chains to interact.\n\n#### 4.1.1. Example 1: 1GZX, interacting chains input\n\nIn order to show the basic functioning of the program, we will use the [1gzx](https://www.rcsb.org/structure/1GZX) structure, which is the T-state haemoglobin, which is a hetero-4-mer. As an input, we have three .pdb files with interacting chains (1gzx_A_B.pdb, 1gzx_A_C.pdb, 1gzx_A_D.pdb) provided by our teachers, within a folder named \"1gzx\", and a stoichiometry file (1gzx_stoichiometry.txt). We will assume that pytprot is being executed from the installation folder named *pytprot*.\n\nIn order to run pytprot, we will need to open the terminal and write:\n\n```\npython3 ./pytprot/pytprot.py -i ./example_files/1gzx -o ./example_output_files -s ./example_files/1gzx_stoichiometry.txt -f -v \n\n```\nHere, the PDB files allocated in the 1gzx folder will be read, and the final built model will be stored in the \"example_output_files\" folder. As the forcing flag (**-f**) is activated, the output will be stored in the output folder, even if it already exists. As the **-v** verbose flag is activated, the progress of the program will be printed on command-line. After the program runs, the program will exit, and the output file will be available for analysis. \n\nNote that, if the stoichiometry file is not available, we can just run it without the stoichiometry flag:\n\n```\npython3 ./pytprot/pytprot.py -i ./example_files/1gzx -o ./example_output_files -f -v \n\n```\n\nThis process is identical, even for larger proteins that also contain DNA.\n\n**Note**: All these input and output files for 1gzx are included in the package in order to show the correct naming format for the PDB files and the specific format of the stoichiometry file.\n\n\n#### 4.1.2. Example 2: 6GMH, multicomplex input\n\nIn order to also show how the program can work with macrocomplexes, we will use [**6gmh**](https://www.rcsb.org/structure/6gmh), which is the structure for the Activated Transcription Complex Pol II, and a hetero-20-mer, that we have retrieved from the PDB. Here, we will only use one file, \"6gmh.pdb\", in a folder named \"6gmh\", and a stoichiometry file, \"6gmh_stoichiometry.txt\". We will assume that pytprot is being executed from the installation folder named *pytprot*. \n\nTo run it:\n\n```\npython3 ./pytprot/pytprot.py -i ./example_files/6gmh -o ./example_output_files -s ./example_files/6gmh_stoichiometry.txt -f -v -m -d 8 -nc 5\n\n```\n\nWe have indicated the input, output file and the **-f** flag the same way as before. As this is a macrocomplex, we will need to indicate the **-m** flag. Within the macrocomplex processsing, we can indicate a specific contact distance (Å) with **-d** and a specific number of contacts with **-nc**. For this example, we will assume two chains to be interacting if there are 5 or more contacts at 8 Å between their CA backbone. As the **-v** flag is set, when running the program, we will see the processing information on the Terminal. After it finishes running, the output model will be saved with a timestamp and the number of chains that the model has, in the provided output folder.\n\n\nWe will also present some relevant cases in which _pytprot_ can struggle to model a specific macrocomplex, and the possible workarounds.\n\n#### 4.1.2. Example 3: 3T72, a RMN-based input\n\nIf we want to model the DNA-transcription Activation Subcomplex of _E. coli_, which is [3T72](https://www.rcsb.org/structure/3T72), _pytprot_ will most likely produce an error related to the chain ID's. This is a consequence of the input model having many more than 52 chains named differently, which is the maximum that _pytprot_ can take (See Theory & Analysis). Instead, what we can use for modelling is any of the **Biological assemblies**, also available to download from its PDB page. With this one, we are able to perfectly reconstruc it with _pytprot_:\n\n<img src=\"./images/3T72_1.png\" alt=\"3T72 complex\" width=\"300\">\n\n\n#### 4.1.2. Example 4: 6OM3, an example of a multicomplex made of assymmetric units\n\nAnother limitation of the program is that it cannot correctly model for proteins whose Biological Assembly is composed of the combination of different. For example, for the Orc1 BAH domain (in complex with a nucleosome), which is [6OM3](https://www.rcsb.org/structure/6OM3) from PDB. If we download the PDB, it contains two assymmetric units, which form the actual biological assembly. _pytprot_ can, without indicating the stoichiometry, provide a model that contains both subunits, although wrongly placed:\n\n<img src=\"./images/6om3_complete_nostoich.png\" alt=\"6om3 complex\" width=\"400\">\n\n\nWith the way _pytprot_ fetches the stoichiometry, it is not possible to correctly build the model. Nevertheless, if we download one the asymmetric units, which are found in its same PDB page, it can be almost perfectly built with _pytprot_, whenever stoichiometry is provided.\n\n\n**Note**: A more detailed analysis of different models built with _pytprot_ is available in the **Theory & Analysis.pdf**.\n\n\n### 4.2. Running pytprot from Dash\n\nThe other option to run *pytprot* is through a local Dash app, which provides a more user-friendly GUI. In order to launch the the app, we need to execute in the terminal:\n\n```\n\npython3 /path/to/pytprot/pytprot_dash.py\n\n```\n\nThis will prompt, on the command line, a link that, when clicked, will open a tab in your default browser, that looks like this:\n\n![pytprot Dash GUI](./images/pytprot.png)\n\n\n\n\nUsing the app is quite simple, we will first need to upload the corresponding PDB and stoichiometry files (*It is advisable to upload them all at once*). It automatically detects, depending on the number of files, if the input is a set of interacting chain-pairs or a macrocomplex. If it is the latter case, we can also indicate the contact distance or the number of contacts in the **Multicomplex assembly parameters**. \n\n**NOTE:** The contact distance and number of contact parameters, if different from the default ones, must be indicated **before** uploading the files.\n\nThe **Upload information** window shows some basic information regarding the input files.\n\nAfter processing the model, its filename will appear under the **Models built** section. In order to access it, we will need to retrieve it from the \"app_uploaded_files/built_models\" folder located in the current working directory, or through the link that Dash returns after building the model.",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/mariasr3/pytprot",
    "keywords": "",
    "license": "LICENSE.txt",
    "maintainer": "",
    "maintainer_email": "",
    "name": "pytprot",
    "package_url": "https://pypi.org/project/pytprot/",
    "platform": "",
    "project_url": "https://pypi.org/project/pytprot/",
    "project_urls": {
      "Homepage": "https://github.com/mariasr3/pytprot"
    },
    "release_url": "https://pypi.org/project/pytprot/1.0.1/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "Macrocomplex builder from PPIs",
    "version": "1.0.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 10078859,
  "releases": {
    "0.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c375d10add4481ab420164e743456b473e596244dc034a08609575a0c5422f0a",
          "md5": "57bf88fc78948c5b886de90c82213548",
          "sha256": "d04b9fa213540dbd7a4d1ffb8a06bdd4b9accb4d7258b518e5a34cd286987dfb"
        },
        "downloads": -1,
        "filename": "pytprot-0.5.tar.gz",
        "has_sig": false,
        "md5_digest": "57bf88fc78948c5b886de90c82213548",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 15844,
        "upload_time": "2021-03-16T18:32:07",
        "upload_time_iso_8601": "2021-03-16T18:32:07.688508Z",
        "url": "https://files.pythonhosted.org/packages/c3/75/d10add4481ab420164e743456b473e596244dc034a08609575a0c5422f0a/pytprot-0.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.51": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e950e2a5aaebd396571847c8dd45b3d00954b455465b27ce35d14508a41d4f77",
          "md5": "d9312e3cadfdfb6f6ad5dc55964695e2",
          "sha256": "7696bbae0eeecd03d8958c7ce17477e51fddbf3da70224cb5f3fb7dca192557e"
        },
        "downloads": -1,
        "filename": "pytprot-0.51.tar.gz",
        "has_sig": false,
        "md5_digest": "d9312e3cadfdfb6f6ad5dc55964695e2",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 15823,
        "upload_time": "2021-03-17T10:00:55",
        "upload_time_iso_8601": "2021-03-17T10:00:55.141955Z",
        "url": "https://files.pythonhosted.org/packages/e9/50/e2a5aaebd396571847c8dd45b3d00954b455465b27ce35d14508a41d4f77/pytprot-0.51.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.52": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e05c1764e112964c1a8687dafc53698464fc4c14f458da5011d20a6427dd729b",
          "md5": "21b536b400708dbae07df75e81102fdf",
          "sha256": "d438ec383da4ad4261129ff2a39cae46687aada4230792047b7fa8eb1409d3a8"
        },
        "downloads": -1,
        "filename": "pytprot-0.52.tar.gz",
        "has_sig": false,
        "md5_digest": "21b536b400708dbae07df75e81102fdf",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 18212,
        "upload_time": "2021-03-20T15:28:15",
        "upload_time_iso_8601": "2021-03-20T15:28:15.555195Z",
        "url": "https://files.pythonhosted.org/packages/e0/5c/1764e112964c1a8687dafc53698464fc4c14f458da5011d20a6427dd729b/pytprot-0.52.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e015254428c38b15a3dc3ca4c140912b114dee4c8ab47049eb60ae52cfad577d",
          "md5": "ba9fba3d1c6e7444657a7d10720c77cc",
          "sha256": "84e8fbc921ceb676447889a4a504208d13cb61b160323b395bed57bdecd424d6"
        },
        "downloads": -1,
        "filename": "pytprot-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "ba9fba3d1c6e7444657a7d10720c77cc",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 30188,
        "upload_time": "2021-04-15T22:17:12",
        "upload_time_iso_8601": "2021-04-15T22:17:12.064733Z",
        "url": "https://files.pythonhosted.org/packages/e0/15/254428c38b15a3dc3ca4c140912b114dee4c8ab47049eb60ae52cfad577d/pytprot-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4a3a8bec3142ffb8de1c285ddccd183a85dec40cb1d773d21b84c006471548a5",
          "md5": "a1d98972c195cc1479500ed37c57de64",
          "sha256": "dc2b813fa931bdb32a37be60c4c71893cc8223ed5de646fe3a50a904391926e0"
        },
        "downloads": -1,
        "filename": "pytprot-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "a1d98972c195cc1479500ed37c57de64",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 29972,
        "upload_time": "2021-04-15T22:40:42",
        "upload_time_iso_8601": "2021-04-15T22:40:42.859135Z",
        "url": "https://files.pythonhosted.org/packages/4a/3a/8bec3142ffb8de1c285ddccd183a85dec40cb1d773d21b84c006471548a5/pytprot-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "4a3a8bec3142ffb8de1c285ddccd183a85dec40cb1d773d21b84c006471548a5",
        "md5": "a1d98972c195cc1479500ed37c57de64",
        "sha256": "dc2b813fa931bdb32a37be60c4c71893cc8223ed5de646fe3a50a904391926e0"
      },
      "downloads": -1,
      "filename": "pytprot-1.0.1.tar.gz",
      "has_sig": false,
      "md5_digest": "a1d98972c195cc1479500ed37c57de64",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 29972,
      "upload_time": "2021-04-15T22:40:42",
      "upload_time_iso_8601": "2021-04-15T22:40:42.859135Z",
      "url": "https://files.pythonhosted.org/packages/4a/3a/8bec3142ffb8de1c285ddccd183a85dec40cb1d773d21b84c006471548a5/pytprot-1.0.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}