{
  "info": {
    "author": "Åukasz Dudziak",
    "author_email": "l.dudziak@samsung.com",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "# pyworkers\n\nPyWorkers is a (relatively) small library wrapping and extending standard `threading` and `multiprocessing` libraries to provide things such as:\n - uniform API,\n - support for both graceful and forceful termination,\n - out-of-the-box support for running the target function multiple times,\n - lightweight support for RPC.\n\nSee the following sections for more details:\n - [Motivation and basic functionality](#motivation-and-basic-functionality)\n - [Requirements](#requirements)\n - [Installation](#installation)\n - [Generating documentation](#generating-documentation)\n - [Running tests](#running-tests)\n - [Usage examples](#usage-examples)\n - [Contributing](#contributing)\n - [Reporting issues](#reporting-issues)\n - [License](#license)\n\n## Motivation and basic functionality\nBoth `threading` and `multiprocessing` are great standard python packages enabling developers to quickly create and manage parallel applications by running different parts of their code in separate threads and processes respectively.\nThis is done with convenient API which mostly remains consistent between them.\nHowever, as the libraries are designed to provide relatively low-level functionality, in order to be suitable for as many use-cases as possible, some things are left unaddressed.\nPyWorkers tries to provide higher-level abstraction specialized towards running expensive functions which may take significant time to finish (in terms of hours) and potentially become unresponsive during their execution.\nIn order to do that and maximize usage of available computational resources, the library includes functionality allowing its users to seamlessly interchange and mix threads, processes and remote processes (RPC) as different ways of parallelizing their workloads, as well as enhances managing them.\nUnlike `multiprocessing.dummy`, which also tries to provide uniform API between threads and processes, PyWorkers extends it by supporting remote execution and improves by implementing the exact same set of methods between all three types of workers (e.g. `DummyProcess` from `multiprocessing` does not support `terminate`, threads and processes use different names for their identifiers - `ident` and `pid` respectively - etc.).\n\nThe following is a quick summary of all the enhancements the library provides.\n\n### Uniform API\nEach worker, regardless of its underlying running mechanism, implements the same set of methods and attributes: `wait`, `terminate`, `is_alive`, `host`, `pid`, `tid`, `id`, `close` (and others) while at the same time trying to make sure their behaviour is consistent with other implementations.\n\nFor more details please see the API documentation.\n\n### Graceful termination\n`terminate` is available as a way of abnormally finishing execution of a worker. Unlike its relative from `multiprocessing`, the function provided by this library will first try to gracefully finish execution of the target function by raising a `WorkerTerminateError` exception in the target worker, thus allowing it to release all allocated resources etc. The time a worker is given to finish can be controlled by `timeout` parameter - if the worker hasn't finished by the time it passes, the function will then switch to forceful termination using `os.kill` with `SIGTERM` signal on Linux or `TerminateProcess` on Windows.\n\n\n### Out-of-the-box support for consumers (persistent workers)\nIn addition to running the target function once (like in the standard libraries), PyWorkers includes a set of specialized classes which make it easier to run the function multiple times, processing incoming arguments in a streaming manner.\nThis type of execution is primarily useful when processing data using the producer-consumer paradigm and is conveniently supported by the means of `Pool` class (similar to the one from `multiprocessing` package).\nUnlike the standard package, PyWorkers exposes consumer classes directly, making them usable in contexts where `Pool` object is not desired.\nAlso, the pool supports different workers types mixed together and, in case when termination of workers is requested, by default tries to soft-terminate them first (following semantics of `terminate` as implemented in the library).\n\n\n### Lightweight RPC\nThis is done in the most lightweight and simple way possible, while meeting the behavioural requirements (e.g., support for soft termination).\nPlease note that the goal of this package is not to compete with some mature, production-grade RPC solutions but rather to give developers an easy way to switch from local to remote execution while prototyping or experimenting with their code.\nWe use plain TCP connections and (de)serialize any workload with standard `pickle`, which we extend a little bit to allow users to customize serialization of their objects for remote execution (this extension is not-invasive, meaning that any code that is not aware of it will run as if the extension was not there).\n\nOur RPC implementation requires our server (`pyworkers.remote_server`) to run on the target machine - if you want to spawn a server ad-hoc on the target host, rather than keeping it running as a service etc., you can use our convenient `pyworkers.remote_server.tmp_ssh_server` function that creates and destroys a server. The method is intended to be used via Python's context manager API.\n\n> **Note:** As the name of the method suggests, you need to be able to ssh to the server. This method basically creates and interacts with an `ssh` process, taking input from the `stdin` of the parent process and capturing output of the `ssh` command into a buffer that can be read by the caller.\n\n## Requirements\n - Python3.6\n\nNo 3rd-party packages are used to provide core functionality, only standard `threading`, `multiprocessing` (including `multiprocessing.connection`), `socket`, `os`, `signal`, `pickle` and others.\n\n`gitpython` is optional and provides additional versioning information if using the package via developer-mode installation with pip (see below).\\\n`setproctitle` is optional and allows changing names of processes and threads created with `pyworkers`, changing of names can be disabled/enabled on a per-worker basis.\n\n### Tested with:\n - Ubuntu 18.04\n - Windows 10\n - WSL running Ubuntu 18.04\n\n## Installation\nClone this repo, then using your desired version of `pip` run:\n```bash\npip install .\n```\nfrom the root folder of this repo. If not using any environment virtualization tools, run the above command using `sudo` or with an extra `--user` argument passed to `pip` in order to install it in your user's local directory.\n\nThe above command will install the package by copying it to the python's `site-packages` folder - therefore, the installed version will not be synchronized with the changes you make in the cloned repo. In other words, each time you make changes, you will have to re-run the `pip install` command to make those changes visible in the installed package.\n\nAlternatively, the package can be installed in a *developer mode* using the `-e` switch:\n```bash\npip install -e .\n```\n\n## Generating documentation\n> **Note:** The documentation is still in the early phase.\n> Although quite a lot of thing has already been documented, there are some which are still missing, formatting might be broken at some places, and putting it all together might also require some extra work.\n\nTo automatically generate API documentation for the library, make sure `sphinx` and `sphinx_rtd_theme` are installed first.\nYou can easily install them with `pip`:\n```bash\npip install sphinx sphinx_rtd_theme\n```\n\n> **Note:** `sphinx_rtd_theme` is only required if you want to use the readthedocs theme (the default one for this project).\n> You can change the theme used by modifying your `docs/source/conf.py` file.\n\nAfter installing `sphinx`, simply go to `docs/` and execute `make html`.\nYour newly generated documentation should be available at `docs/build/index.html`.\n\n## Running tests\nThe project uses standard `unittest` Python package for testing, the tests are stored within `tests/` subdirectory and follow the `*_test.py` naming convention.\nThe easiest way to run them is to navigate towards the root directory of this repo and from there run:\n```bash\npython3 -m unittest discover -v -s \".\" -p \"*_test.py\"\n```\nAlternatively, one can use VS Code with the provided `settings.json` from `.vscode` folder which configures the tests to be runnable from within the tests tab inside a VS Code window (using an analogical command to the above).\nEach test file should also be runnable by its own.\n\n## Usage examples\n> **Tip:** You can find these examples under `docs/examples`!\n\n```python\nfrom pyworkers.thread import ThreadWorker\nfrom pyworkers.process import ProcessWorker\nfrom pyworkers.remote import RemoteWorker\n\ndef foo(x):\n    return x**2\n\nif __name__ == '__main__':\n    tw = ThreadWorker(target=foo, args=(1,))\n    tw.wait()\n\n    pw = ProcessWorker(target=foo, args=(2,))\n    pw.wait()\n\n    rw = RemoteWorker(target=foo, args=(3,), host=('127.0.0.1', 60006))\n    rw.wait()\n\n    print(tw.result, pw.result, rw.result)\n```\n\nShould print `1, 4, 9`.\n\nPlease note that there's no extra `start` method which needs to be called after a worker is created. Instead, the constructor automatically spawns a worker to make sure that the object is valid (e.g. pid) as soon as it is created.\n\n> **Note:** The remote worker in this example assumes that there is a remote server running locally on the TCP port 60006. This server can be created programmatically by including the following code (creates a child process):\n> ```python\n> ...\n> from pyworkers.remote_server import spawn_server\n> \n> if __name__ == '__main__':\n>     server = spawn_server(('127.0.0.1', 60006)) # returns ProcessWorker!\n>     try:\n>         ...\n>     finally:\n>         server.terminate()\n> ```\n> or run as a standalone process by executing the `pyworkers.remote_server` module:\n> ```bash\n> python3 -m pyworkers.remote_server -v --addr 127.0.0.1 --port 60006\n> ```\n> It is also possible to run the server programatically in the calling thread by using `RemoteServer` class from `pyworkers.remote_server` directly, instead of using it via `spawn_server` and `RemoteServerProcess`, but care should be taken when doing so as `accept` (which is called on the server socket) is tricky to interrupt.\n\nThe same can be achieved without necessity of hardcoding the workers' types as one could instead use values from the `WorkerType` enum together with a factory classmethod `Worker.create`.\n\n```python\nfrom pyworkers.worker import Worker, WorkerType\n\ndef foo(x):\n    return x**2\n\nif __name__ == '__main__':\n    workers = []\n    for wtype, x in zip(WorkerType, range(1, 4)):\n        kwargs = {\n            'target': foo,\n            'args': (x, )\n        }\n        if wtype is WorkerType.REMOTE:\n            kwargs['host'] = ('127.0.0.1', 60006)\n\n        worker = Worker.create(wtype, **kwargs)\n        workers.append(worker)\n\n    results = []\n    for worker in workers:\n        worker.wait()\n        results.append(worker.result)\n\n    print(results)\n```\n\nThe code above should print the same result as the previous one.\n\n> **Note:** the `Worker` class is the base class for all workers types.\n> The shared API is defined within it.\n\n> **Note:** although in the example we only set 'host' argument for remote workers, this extra check is not required. Following the principle of having a uniform API, all workers accept this argument but local workers (processes and threads) will simply ignore it.\n\n### Handling errors\n\nIf an error happens when running the target function, the `result` field of the worker which failed will be set to `None` and instead `error` will hold the exception object which caused the failure.\nFor example:\n\n```python\nfrom pyworkers.process import ProcessWorker\n\ndef suicide(x):\n    raise RuntimeError('How is one supposed to live on this miserable world where x = {}?'.format(x))\n\nif __name__ == '__main__':\n    pw = ProcessWorker(target=suicide, args=(2,))\n    pw.wait()\n    print(pw.result)\n    print(pw.has_error)\n    print(pw.error)\n```\n\nThe above code should print:\n```\n<Exception reported from the child process>\nNone\nTrue\nHow is one supposed to live on this miserable world where x = 2?\n```\n\n> **Note:** Although in almost all cases if an error happened the `error` field of a worker should be not None, it is possible for the worker to die due to a reason which is not reported via a Python exception.\n> In that case, `has_error` will be set to `True` but `error` can be `None` (example of such situation could be when a child process is killed with SIGKILL signal on Linux).\n> Therefore, it is better to test `has_error` field instead of `error` if a guarantee about erroneous exit is desired.\n\n### Persistent Workers\nIf it is desired to run the target function multiple times without the overhead of creating new workers every time, it is possible to use their persistent variations.\n\nPersistent workers take the target function as an argument when they are created (like standard workers) but will wait for the incoming arguments until they are `close`d, returning results to the caller via a dedicated queue/pipe/socket and the standard `worker.result` (common for all workers) field will eventually hold the total number of times the worker has executed its function (which should be the same as the number of elements in the results queue).\nA new call to the function, with new arguments, can be done by using the `.enqueue` method.\nTo maintain consistent behaviour with other workers, `.result` attribute is only set after the worker has finished the entirety of its work, which for persistent workers means that all enqueued arguments have been processed and the worker has been closed.\nUnlike the final `.result`, results of individual calls can be obtained as soon as they are available (i.e., the worker does not have to be closed) using either `.get_next_result` (which can be blocking or not) or a higher-level `.get_results_iter` - see documentation for more information!\n\nJust like with ordinary workers, it is possible to create persistent workers using their classes directly (`PersistentThreadWorker`, `PersistentProcessWorker` and `PersistentRemoteWorker`) or by using the factory classmethod `PersistentWorker.create`.\nFor example:\n\n```python\nfrom pyworkers.persistent import PersistentWorker, WorkerType\n\nimport itertools\n\ndef foo(x):\n    return x**2\n\nif __name__ == '__main__':\n    workers = []\n    for wtype in WorkerType:\n        kwargs = { 'target': foo }\n        if wtype is WorkerType.REMOTE:\n            kwargs['host'] = ('127.0.0.1', 60006)\n\n        worker = PersistentWorker.create(wtype, **kwargs)\n        workers.append(worker)\n\n    for worker, x in zip(itertools.cycle(workers), range(10)):\n        worker.enqueue(x)\n\n    results = []\n    for worker in workers:\n        worker.wait()\n        print(worker.result, list(worker.results_iter()))\n```\n\nExpected output:\n```\n4 [0, 9, 36, 81]\n3 [1, 16, 49]\n3 [4, 25, 64]\n```\n\n> **Note:** persistent workers can be restarted by the user if it is desired to, e.g., free some resources that might accumulate over long periods of time (a good example might be some GPU memory that will not get deallocated as long as a process is running).\n> Restarting is done by completely removing any underlying entities (such as processes) and creating new one in their place, encapsulated within the same Python object and using the same arguments as those used by the original worker.\n\n### Pool\nIf multiple workers are used to execute the same function, it is possible to use a single-producer multiple-consumer pattern that we implement with our `Pool` class.\nThe `Pool` class is very similar to its equivalent from the standard `multiprocessing` package, so we hope that the core idea is rather self-explanatory.\nUnlike the standard process pool, our class allows mixing different worker types, supports callbacks for high customizability, and gives the user more control over the lifetime of workers (e.g., when processing of an input sequence has finished, the workers will not be killed and the user is free to start processing a new input sequence).\n\nThe basic usage is showed in the example below:\n\n```python\nfrom pyworkers.pool import Pool\nfrom pyworkers.worker import WorkerType\n\ndef foo(x):\n    return x**2\n\nif __name__ == '__main__':\n    p = Pool(foo, name='Simple Pool')\n    with p:\n        for wtype in WorkerType:\n            kwargs = {} # note that the target function is now passed to the Pool object!\n            if wtype is WorkerType.REMOTE:\n                kwargs['host'] = ('127.0.0.1', 60006)\n\n            p.add_worker(wtype, **kwargs)\n\n        for w in p.workers:\n            print(w.userid, w.is_alive()) # userid can be set by the user to any value in the worker's construct, by default it is an index of the worker within the Pool\n\n        results = p.run(iter(range(10)))\n        # workers are still alive as long as we are within the `with pool` block!\n        # let restart them and run some more things\n        p.restart_workers()\n        results.extend(p.run(iter(range(10, 20))))\n\n    for w in p.workers:\n        # not workers should be dead\n        print(w.userid, w.is_alive(), w.result)\n\n    print(sorted(results))\n\n```\n\nExpected output (similar to):\n\n```\n0 True\n1 True\n2 True\n0 False 4\n1 False 4\n2 False 2\n[0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, 361]\n```\n\n> **Note:** At the moment, the `Pool` object only supports persistent workers but they can be restarted manually by user (e.g., as in the example above).\n\n> **Note:** More advanced usage of the `Pool` object actually allows to customize what function different workers will execute.\n> However, a care should be taken in those cases as different workers might expect different types/number of arguments - to support cases like that,\n> instead of giving a simple iterator to `Pool.run`, we can pass a callable that, when given a particular worker, should return suitable arguments for it.\n\n> **Note:** As can be seen in this example, restarting workers resets their `.result` counter, therefore the last values in each line printed by `print(w.userid, w.is_alive(), w.result)` should add up only to 10. Without `p.restart_workers()` they should sum to 20.\n\n### More examples\n\nFor more examples, consider looking at the tests defined in the `tests/` subfolder!\n\n## Contributing\n\nAll contributions are welcome, please open a pull request with your changes!\n\nIf a substantial change is accepted and merged into the codebase the author might be asked to own contributed pieces of code and become responsible for reviewing/maintaining those parts.\nLack of commitment to fulfil this obligation might result in reverting any changes, arbitrary changes of ownership, or any other actions deemed necessary to allow for healthy development of the package.\n\nWhen making your changes, please follow the coding style used throughout the project (PEP-8).\n\n## Reporting issues\n\nPlease open an issue on GitHub and provide minimal failing example, together with information about the specific version of the package (ideally git commit), Python version and OS used.\n\n## License\n\nThe package is released under Apache License 2.0.\nSee LICENSE file for more information.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "https://github.com/SamsungLabs/pyworkers",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/SamsungLabs/pyworkers",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "pyworkers",
    "package_url": "https://pypi.org/project/pyworkers/",
    "platform": null,
    "project_url": "https://pypi.org/project/pyworkers/",
    "project_urls": {
      "Download": "https://github.com/SamsungLabs/pyworkers",
      "Homepage": "https://github.com/SamsungLabs/pyworkers"
    },
    "release_url": "https://pypi.org/project/pyworkers/1.0.2.post1/",
    "requires_dist": null,
    "requires_python": ">=3.6.0",
    "summary": "Library providing abstraction over different types of parallel jobs: threads, processes and remote processes.",
    "version": "1.0.2.post1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17513243,
  "releases": {
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1997926f13e58b0ec012e9861c2cca033bfb76bddcbf084ec249a29e0a3a4e71",
          "md5": "42a73ef6b2ecd8bc7f72be91eb275a95",
          "sha256": "5d1d9ec9c55f217f383ddc8c311a14583d339328a38d65183475de3d3df28318"
        },
        "downloads": -1,
        "filename": "pyworkers-1.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "42a73ef6b2ecd8bc7f72be91eb275a95",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6.0",
        "size": 61070,
        "upload_time": "2022-06-13T13:55:01",
        "upload_time_iso_8601": "2022-06-13T13:55:01.966364Z",
        "url": "https://files.pythonhosted.org/packages/19/97/926f13e58b0ec012e9861c2cca033bfb76bddcbf084ec249a29e0a3a4e71/pyworkers-1.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "65bf086447b3cddeceb3384dac6d337211d5d1b766280a1dec77b7dfd74f23bf",
          "md5": "ac34b54fddbe9fc2bbeb83ff0dd2586f",
          "sha256": "c5f98ff23c552a59415e2c7187a5bb8b6cdfedae5007e63e319ec2ea35291ab8"
        },
        "downloads": -1,
        "filename": "pyworkers-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "ac34b54fddbe9fc2bbeb83ff0dd2586f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6.0",
        "size": 52962,
        "upload_time": "2022-06-13T13:55:03",
        "upload_time_iso_8601": "2022-06-13T13:55:03.870559Z",
        "url": "https://files.pythonhosted.org/packages/65/bf/086447b3cddeceb3384dac6d337211d5d1b766280a1dec77b7dfd74f23bf/pyworkers-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ccc3021844c9c0bb34cb5f79c88de2c74376182d488b3e5826df60a08bbe44d8",
          "md5": "3ea551965160d70d985164a30fc7161d",
          "sha256": "15edad06fba69d145fd3cdc20596012a61bc4bb0d3b0d52e8e74870bcd0c080f"
        },
        "downloads": -1,
        "filename": "pyworkers-1.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "3ea551965160d70d985164a30fc7161d",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6.0",
        "size": 61081,
        "upload_time": "2022-09-12T13:41:47",
        "upload_time_iso_8601": "2022-09-12T13:41:47.616579Z",
        "url": "https://files.pythonhosted.org/packages/cc/c3/021844c9c0bb34cb5f79c88de2c74376182d488b3e5826df60a08bbe44d8/pyworkers-1.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "494f401f66394c4667281452f45c4a20359ba57be8fdb1dabbeb1338f0837c6a",
          "md5": "aa9957fe1e33d7ee11506c62f9505b8a",
          "sha256": "c6afed5dfb6796a976758bae8cfb1f95eb5e7a2a358526b9922be4ed1f8c4da8"
        },
        "downloads": -1,
        "filename": "pyworkers-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "aa9957fe1e33d7ee11506c62f9505b8a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6.0",
        "size": 53006,
        "upload_time": "2022-09-12T13:41:49",
        "upload_time_iso_8601": "2022-09-12T13:41:49.339110Z",
        "url": "https://files.pythonhosted.org/packages/49/4f/401f66394c4667281452f45c4a20359ba57be8fdb1dabbeb1338f0837c6a/pyworkers-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ba8d29d3ccfd9b26c96b47bae822a6b36a45c5e272c1a9dc37c5c995c6a5b98d",
          "md5": "5e430b147296bc8345e3f32b01d2b852",
          "sha256": "d2580e62ce7cc9945d123410b249438f93f28607b8aa1a5aafd523029ef1bb3b"
        },
        "downloads": -1,
        "filename": "pyworkers-1.0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "5e430b147296bc8345e3f32b01d2b852",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6.0",
        "size": 61284,
        "upload_time": "2023-03-27T22:45:41",
        "upload_time_iso_8601": "2023-03-27T22:45:41.823517Z",
        "url": "https://files.pythonhosted.org/packages/ba/8d/29d3ccfd9b26c96b47bae822a6b36a45c5e272c1a9dc37c5c995c6a5b98d/pyworkers-1.0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e12b1696e34c19c8e43f412fc0b45a5c6ab24bc620479cc7bc4def3976a0b57e",
          "md5": "83fd81d5a9bae382b9eb8dd5e592cd2e",
          "sha256": "07cf5fbbf50e5bb3894c34f3ec0c2879fb965d7ecf988e80b0187ac91a1a79de"
        },
        "downloads": -1,
        "filename": "pyworkers-1.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "83fd81d5a9bae382b9eb8dd5e592cd2e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6.0",
        "size": 54087,
        "upload_time": "2023-03-27T22:45:44",
        "upload_time_iso_8601": "2023-03-27T22:45:44.279493Z",
        "url": "https://files.pythonhosted.org/packages/e1/2b/1696e34c19c8e43f412fc0b45a5c6ab24bc620479cc7bc4def3976a0b57e/pyworkers-1.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.2.post1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8fd9913559c14201b423a9226c072481bce16348e29bc161622a1978ca8d1ea3",
          "md5": "ce68ca7daaa25ef41f9b3cf8c4dcec34",
          "sha256": "8f13abc1a29301128916eaff84867d9aec33765ab6eec9c91471a83f7fc1d130"
        },
        "downloads": -1,
        "filename": "pyworkers-1.0.2.post1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "ce68ca7daaa25ef41f9b3cf8c4dcec34",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6.0",
        "size": 61552,
        "upload_time": "2023-03-30T16:37:17",
        "upload_time_iso_8601": "2023-03-30T16:37:17.342812Z",
        "url": "https://files.pythonhosted.org/packages/8f/d9/913559c14201b423a9226c072481bce16348e29bc161622a1978ca8d1ea3/pyworkers-1.0.2.post1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "8fd9913559c14201b423a9226c072481bce16348e29bc161622a1978ca8d1ea3",
        "md5": "ce68ca7daaa25ef41f9b3cf8c4dcec34",
        "sha256": "8f13abc1a29301128916eaff84867d9aec33765ab6eec9c91471a83f7fc1d130"
      },
      "downloads": -1,
      "filename": "pyworkers-1.0.2.post1-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "ce68ca7daaa25ef41f9b3cf8c4dcec34",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6.0",
      "size": 61552,
      "upload_time": "2023-03-30T16:37:17",
      "upload_time_iso_8601": "2023-03-30T16:37:17.342812Z",
      "url": "https://files.pythonhosted.org/packages/8f/d9/913559c14201b423a9226c072481bce16348e29bc161622a1978ca8d1ea3/pyworkers-1.0.2.post1-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}