{
  "info": {
    "author": "Grégoire Martignon, Vianney Taquet, Damien Hervault, Adam Makhlouf",
    "author_email": "amakhlouf@quantmetry.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: BSD License",
      "Programming Language :: Python :: 3.9"
    ],
    "description": ".. -*- mode: rst -*-\n\n|GitHubActionTestBadge|_ |ReadTheDocsBadge|_ |GitHubActionPublishBadge|_ |PyPiBadge|_\n\n.. |GitHubActionTestBadge| image:: https://github.com/simai-ml/how-to-opensource/actions/workflows/test.yml/badge.svg\n.. _GitHubActionTestBadge: https://github.com/simai-ml/how-to-opensource/actions\n\n.. |ReadTheDocsBadge| image:: https://readthedocs.org/projects/how-to-opensource/badge\n.. _ReadTheDocsBadge: https://how-to-opensource.readthedocs.io/en/latest\n\n.. |GitHubActionPublishBadge| image:: https://github.com/simai-ml/how-to-opensource/actions/workflows/publish.yml/badge.svg\n.. _GitHubActionPublishBadge: https://github.com/simai-ml/how-to-opensource/actions\n\n.. |PyPiBadge| image:: https://img.shields.io/pypi/v/QM-How-to-Opensource\n.. _PyPiBadge: https://pypi.org/project/QM-How-to-Opensource/\n\nBBL - Publier un package en open-source en dix étapes clés\n==========================================================\n\nQuelles sont les étapes indispensables pour publier un package Python en open-source ? Depuis l’écriture d’un code propre et la rédaction de la documentation, jusqu’aux tests d’intégration continue et au processus de packaging, nous passerons en revue les dix points clés pour une publication d’un package Python en open-source. Pour ce faire, nous prendrons l’exemple d’un toy model que nous publierons sur github et pypi en moins de deux heures.\n\nSommaire\n========\n\nVoici les 10 bonnes pratiques de développement open-source détaillées ci-après dans ce tutoriel : \n\n1. **Mettre en place un dépôt GitHub,** soit à partir de zéro, soit en forkant un dépôt existant\n2. **Encapsuler les fonctions dans un module** facile à importer et renseignant un numéro de version\n3. **Documenter les fonctions avec une dosctring et un doctest.** La docstring sera automatiquement publié en ligne et le doctest automatiquement exécuté pendant l'intégration continue.\n4. **Ecrire vos fonctions avec déclaration de types.** C'est une habitude facile à prendre qui génère automatiquement des tests unitaires statiques avec MyPy_.\n5. **Créer des tests unitaires avec un objectif de couverture de 100%.** La paramétrisation des tests avec ``pytest.xmark.parametrize`` permet de générer des tests très rapidement.\n6. **Implémenter une intégration continue du code.** Sur GitHub, le standard est d'utiliser des GitHub Actions. Pensez à toujours tester votre code sur Windows.\n7. **Générer une documentation semi-automatique avec Sphinx_.** L'API de votre package est automatiquement documentée si vous avez écrit les docstrings à l'avance. Il ne reste plus qu'à rédiger les parties importantes et les messages à faire passer aux utilisateurs. Les exemples sont un bon moyen d'accompagner la montée en compétences rapide des utilisateurs.\n8. **Déployer la documentation de manière continue avec ReadTheDocs_.** Le déploiement continu doit se déclencher a minima à chaque pull request.\n9. **Packager votre module avec le fichier ``setup.py``.** Ce fichier est la pierre angulaire de la publication sur PyPi_. Les numéros de version sont plus facile à gérer avec bump2version_.\n10. **Déployer votre package de manière continue avec les release GitHub** et les actions correspondantes. Vous pouvez cacher votre mot de passe PyPi_ par un système de tokens.\n\nPré-requis\n==========\n\n1. Avoir un compte GitHub\n2. Faire un **Fork** du dépôt (bouton en haut à droite de GitHub)\n3. Avoir une installation locale de conda\n\nSi vous n'avez pas de conda installé : téléchargez l'installeur Conda_ ou exécutez les commandes suivantes:\n\n.. code:: shell-session\n\n  $ wget https://repo.anaconda.com/miniconda/Miniconda3-py39_4.9.2-MacOSX-x86_64.sh -O miniconda.sh\n  $ chmod +x miniconda.sh\n  $ bash miniconda.sh\n\nAttention à bien accepter la demande d'initialisation.\n\nExercice n°1: Mise en place de l'environnement\n==============================================\n\nClonez votre dépôt forké.\n\n.. code:: shell-session\n\n  $ git clone https://github.com/COMPTE/how-to-opensource.git\n\nInstallez et activez l'EnvConda_ de développement, environnement qui nous servira à développer le code, la documentation et les tests:\n\n.. code:: shell-session\n\n  cd how-to-opensource\n  conda env create -f environment.dev.yml\n  conda activate how_to_opensource\n\nCréer une branche de travail et supprimez la correction :\n\n.. code:: shell-session\n\n  git checkout -b work\n  chmod +x start.sh\n  ./start.sh\n  git add .\n  git commit -m \"start exercises\"\n  git push origin work\n\nVous pouvez commencer !\n\nExercice n°2: Création d'un module et d'une fonction\n====================================================\n\nNous allons maintenant créer dans le Module_ ``how_to_opensource`` une nouvelle fonction calculant la somme de deux vecteurs.\nPour cela créez le fichier ``how_to_opensource/core.py`` et créez une nouvelle fonction ``add_two_vectors`` qui va, comme son\nnom l'indique, effectuer une addition de deux vecteurs grâce à ``numpy.add``.\n\nAfin de pouvoir importer la fonction, vous devez définir les redirections d'imports dans le fichier ``how_to_opensource/__init__.py``.\n\n.. code:: python\n\n  from .core import add_two_vectors\n  from ._version import __version__\n  __all__ = [\"add_two_vectors\", \"__version__\"]\n\nLa première ligne de code vous permet de faire directement\n\n.. code:: python\n\n  from how_to_opensource import add_two_vectors\n\nau lieu de \n\n.. code:: python\n\n  from how_to_opensource.core import add_two_vectors\n\nLa ligne ``__all__ = ...`` permet à la fonction d'être importée avec la syntaxe ``from how_to_opensource import *``.\n\nEnfin, nous anticipons d'ores et déjà le packaging en introduisant un numéro de version dans le fichier ``_version.py`` qui contient une seule ligne de code : ``__version__ = \"0.0.1\"``.\n\nIl est maintenant possible de tester interactivement la méthode :\n\n.. code:: python\n\n  import numpy as np\n  from how_to_opensource import add_two_vectors\n  add_two_vectors(np.ones(2), np.ones(2))\n\nou la version du package : \n\n.. code:: python\n\n  import how_to_opensource\n  print(how_to_opensource.__version__)\n\nSi vous voulez vérifier la syntaxe de votre code, vous pouvez exécuter la commande :\n\n.. code:: shell-session\n\n  $ flake8 how_to_opensource\n\n**CORRECTION :**\n\n.. code:: shell-session\n\n  git checkout master how_to_opensource/__init__.py how_to_opensource/core.py how_to_opensource/_version.py\n\n\nExercice n°3: Typing\n====================\n\nUne pratique courante pour rendre plus robuste un package consiste à utiliser le typing pour tout ou une partie du code. \nSi l'interpréteur python ne vérifie pas ces types à l'exécution, le langage python propose néanmoins le vocabulaire et la grammaire\nnécessaire à la définition de ces types par l'intermédiaire du module Typing_.\nTypez maintenant les définitions de ``add_two_vectors`` et de sa fonction de test. Il est aussi possible d'ajouter un test à\nl'exécution pour valider que les entrées se conforment au type attendu. Enfin lancez l'analyseur statique de code le second statique utilisant MyPy_.\n\n.. code:: shell-session\n\n  $ mypy how_to_opensource --strict\n\n**CORRECTION :**\n\n.. code:: shell-session\n\n  git checkout master how_to_opensource/core.py mypy.ini\n\n\nExercice n°4: Documentation de la fonction\n==========================================\n\nNumpydoc_ propose une méthode de documentation efficace. Ajoutez une documentation à ``add_two_vectors`` spécifiant ses paramètres,\nsa sortie et en y incluant une DocTest_. Lancez ensuite la procédure de test en incluant cette fois le test de la documentation.\n\n.. code:: shell-session\n\n  $ pytest -vs --doctest-modules --cov-branch --cov=how_to_opensource --pyargs how_to_opensource\n\n**CORRECTION :** \n\n.. code:: shell-session\n\n  git checkout master how_to_opensource/core.py\n\n\nExercice n°5: Création d'un test unitaire\n=========================================\n\nIl convient maintenant de tester cette fonction avec PyTest_. Une méthode standard pour élargir rapidement le domaine testé est\nd'utiliser Parameterize_ pour paramétriser les fonctions de test.\nDans ``how_to_opensource/tests/test_core.py`` ajoutez une fonction de test validant le bon fonctionnement de ``add_two_vectors``\nen testant différentes dimensions de vecteurs. Lancez maintenant le test en générant les métriques validant que vos tests couvrent bien le code:\n\n.. code:: shell-session\n\n  $ pytest -vs --cov-branch --cov=how_to_opensource --pyargs how_to_opensource\n\n**CORRECTION :** ``git checkout master how_to_opensource/tests/test_core.py``\n\n\nExercice n°6: Intégration continue du code\n==========================================\n\nAfin d'assurer un niveau de qualité constant, particulièrement dans le cas d'un projet opensource avec de multiples contributeurs, il est\nindispensable d'automatiser le processus d'intégration des changements réalisés. C'est à ce point que répond l'intégration continue.\nSe basant sur la description d'un pipeline incluant build, test et déploiement, les outils d'integration continue, par exemple\nGitHubActions_ ou TravisCI_ en permettent l'automatisation. Cela apporte les valeurs suivantes:\n\n- minimiser la charge de travail pour les concepteurs\n- supprimer les erreurs arrivant dans toute action \"à la main\"\n- réduire le temps nécessaire à la détection et l'analyse de problèmes car chaque changement est validé unitairement\n- réduire le temps de cycle pour la livraison de nouvelles fonctionnalités tout en en améliorant la qualité\n\nNous allons utiliser les GitHub actions, pour cela rendez vous sur l'onglet **Actions** de la page GiHub de votre projet.\nPour créer notre workflow d'intégration continue nous allons partir du template **Python Package using Anaconda**, disponible après avoir\ncliqué sur **Setup this workflow**. Créez le fichier ``test.yml`` dans le dossier ``.github/workflows``, copiez le template proposé par GitHub\npuis modifiez ensuite les étapes du workflow pour coller aux éléments définis précédemment:\n\n- déploiement sur Python 3.9 , Python 3.8, Ubuntu et Windows\n- installation de flake8, mypy, numpy, et pytest-cov\n- tester le linting, le typing et les tests unitaires\n\nUne fois le fichier créé poussé sur le dépôt, vous pouvez suivre l'execution du pipeline depuis l'interface de GitHub.\nUn mail vous sera automatiquement envoyé en fin d'execution pour vous informer des résultats.\n\n**CORRECTION :** ``git checkout master .github/workflows/test.yml``\n\n\nExercice n°7: Génération de la documentation\n============================================\n\nAvoir une documentation à jour est indispensable autant pour les utilisateurs que pour les contributeurs.\nAfin de faciliter la création et la maintenance de celle-ci nous allons utiliser Sphinx_. Le quick start de Sphinx permet l'initialisation rapide des éléments nécessaires.\n\n.. code:: shell-session\n\n  $ sphinx-quickstart doc\n\nNote: il n'est pas nécessaire de séparer les répertoires sources et build dans notre cas simple.\n\nPour générer la documentation il vous suffit maintenant d'exécuter le script nouvellement créé:\n\n.. code:: shell-session\n\n  $ cd doc\n  $ make html\n\nLa documentation a été générée dans le repertoire ``doc/_build``, vous pouvez la consulter dans votre navigateur web, elle est belle, mais vide.\nEn plus de la rédaction que vous ne manquerez pas d'ajouter, il est important de capitaliser sur la documentation écrite à l'exercice n°4.\nPour ce faire, il faut d'abord modifier le fichier **doc/conf.py** pour ajouter ``'sphinx.ext.autodoc'``, ``'sphinx.ext.napoleon'``, et ``'sphinx_autodoc_typehints'``\nà la liste des extensions. \nIl faut également définir la version du package:\n\n.. code:: python \n\n  release = 0.0.1\n\nEnfin, il faut ajouter la documentation automatique du module dans ``doc/index.rst`` qui sera par ailleurs le point d'entrée de toute rédaction additionnelle:\n\n.. code::\n\n  .. automodule:: how_to_opensource\n     :members:\n\nAfin de permettre de trouver le module et d'activer la prise en compte des types, ajoutez les lignes suivantes au fichier ``doc/conf.py``:\n\n.. code:: python\n\n  import sys\n  sys.path.append('../')\n  napoleon_use_param = True\n\nUne méthode efficace pour enrichir la documentation consiste à ajouter des exemples que l'on met en valeur à l'aide de SphinxGallery_.\nDans ``doc/conf.py``, ajoutez l'extension ``'sphinx_gallery.gen_gallery'``, puis définissez la configuration de la galerie:\n\n.. code:: python\n\n  sphinx_gallery_conf = {\n    'examples_dirs': '../examples',   # path to your example scripts\n    'gallery_dirs': 'auto_examples',  # path to where to save gallery generated output\n  }\n\nEnfin il est nécessaire d'inclure cette galerie à la racine de la documentation, dans ``doc/index.rst`` ajoutez son inclusion:\n\n.. code::\n\n  .. toctree::\n    :maxdepth: 2\n\n    auto_examples/index\n\nPour créer un exemple qui s'affichera dans la doc, vous devez simplement créer un script python dans le répertoire ``examples``. Par exemple :\n\n.. code:: python\n\n  \"\"\"\n  ===========\n  Toy Example\n  ===========\n  L'exemple le plus simple que l'on puisse imaginer.\n  \"\"\"\n\n  from how_to_opensource import add_two_vectors\n  add_two_vectors([12.5, 26.1], [7.5, 3.9])\n\nLe dossier ``examples`` tout juste créé doit s'accompagner d'un fichier ``README.rst`` avec un titre comme:\n\n.. code::\n\n  Exemples avancés\n  ================\n\nVous pouvez alors reconstruire la doc avec `make html` et vérifier que votre documentation est belle !\n\n.. code:: shell-session\n\n  open doc/_build/html/index.html\n\n**CORRECTION :** ``git checkout master doc examples``\n\n\nExercice n°8: Déploiement continu de la documentation\n=====================================================\n\nPour diffuser cette documentation il est nécessaire de la publier sur un site publique, par exemple en utilisant ReadTheDocs_.\nCe dernier réalisera les tâches définies dans le fichier ``.readthedocs.yml``, ajoutez donc ce fichier au dépôt avec le contenu suivant:\n\n.. code::\n\n    version: 2\n\n    build:\n      image: latest\n\n    conda:\n      environment: environment.dev.yml\n\n    sphinx:\n      builder: html\n      configuration: doc/conf.py\n      fail_on_warning: false\n\nEnsuite, créez un compte gratuit sur ReadTheDocs_ en utilisant votre login GitHub.\n\nUne fois inscrit et connecté, importez votre projet GitHub (attention à ajouter votre trigramme à l'url du projet par souci d'unicité).\n\nAprès avoir soigneusement choisi la branche et la version, lancez la compilation. Suivez son bon déroulement et vérifiez que la documentation produite est conforme à vos attentes.\n\nPour automatiser la compilation de la doc à chaque pull request, allez ensuite dans Admin > Paramètres avancés et cochez la case \"Build pull requests for this project\". \nIl faut également connecter vos comptes GitHub et ReadTheDocs par un webhook comme suit :\n\n1. sur votre compte ReadTheDocs, allez dans Admin > Integrations > Add integration > GitHub incoming webhook\n2. sur votre repo GitHub, allez dans Settings > Webhooks > Add webhook > copier l'URL \"payload URL\" de readthedocs.\n\nEt voilà ! Votre documentation se reconstruit automatiquement à chaque pull request !\n\n**CORRECTION :** ``git checkout master .readthedocs.yml``\n\n\nExercice n°9: Packaging\n=======================\n\nDe façon à offrir une API claire à l'ensemble des modules de notre projet (certes il n'y en a qu'un en l'état mais cela est voué à changer),\nil est utile de créer un package_ qui permet d'avoir un espace de nommage encapsulant les modules et variables, et diffusable directement sur PyPi_.\nPour cela, il est nécessaire d'ajouter un fichier ``setup.py`` à notre projet, et de le définir, vous pouvez pour cela partir de ce tutoriel_.\n\nVoici un exemple de fichier ``setup.py``, ce sont essentiellement des descripteurs qui s'afficheront tels quels sur PyPi_.\n\n**IMPORTANT :** chaque package doit avoir un nom unique sur PyPi_, qui est déduit du paramètre ``name``. Pensez-bien à ajouter votre trigramme dans le ``name`` pour que chacun puisse publier son package sans conflit de noms.\n\n.. code:: python\n\n  import os\n  from setuptools import setup\n\n\n  def read(fname):\n      return open(os.path.join(os.path.dirname(__file__), fname)).read()\n\n\n  setup(\n      name=\"QM How to Opensource by TRIGRAMME\",\n      version=\"0.0.1\",\n      author=\"Grégoire Martignon, Vianney Taquet, Damien Hervault\",\n      author_email=\"gmartignon@quantmetry.com\",\n      description=\"A Quantmetry tutorial on how to publish an opensource python package.\",\n      license=\"BSD\",\n      keywords=\"example opensource tutorial\",\n      url=\"http://packages.python.org/how_to_opensource\",\n      packages=['how_to_opensource'],\n      install_requires=[\"numpy>=1.20\"],\n      extras_require={\n          \"tests\": [\"flake8\", \"mypy\", \"pytest-cov\"],\n          \"docs\": [\"sphinx\", \"sphinx-gallery\", \"sphinx_rtd_theme\", \"numpydoc\"]\n      },\n      long_description=read('README.rst'),\n      classifiers=[\n          \"License :: OSI Approved :: BSD License\",\n          \"Programming Language :: Python :: 3.9\"\n      ],\n  )\n\nIl ne vous reste plus qu'à construire votre package\n\n.. code:: shell-session\n\n  $ python setup.py sdist bdist_wheel\n\nCela crée trois répertoires : ``dist``, ``build`` et ``QM_How_to_Opensource.egg-info``.\n\nLe ``egg-info`` est une simple collection de fichiers texte purement informatifs, et le ``dist`` est le contenu de ce qui sera hébergé sur PyPi_.\n\nSi vous voulez vérifier que votre `README.rst` est sans erreur, vous pouvez exécuter la commande \n\n.. code:: shell-session\n\n  $ twine check dist/*\n\n**N.B.** Cette commande vérifie le contenu du répertoire ``dist``. En conséquence, si vous modifiez le ``README.rst``, il faut exécuter à nouveau la commande ``python setup.py sdist`` pour faire un nouveau check.\n\nDernier élément d'un package open-source: la license. Elles sont toutes disponibles sur OpenSourceInitiative_, il suffit de la copier-coller dans le fichier `LICENSE` et de remplacer les noms des auteurs et la date !\n\nPour un projet open-source entièrement libre, la license new BSD-3 est courante en machine learning..\n\nNotre package est maintenant en place, prêt à être publié et ouvert à sa communauté d'utilisateurs et de contributeurs. Il est nécessaire de donner à ses deux populations les outils dont ils ont besoin.\nUne accessibilité simple et maîtrisée pour les premiers, de clarté sur les règles de leur engagement pour les seconds.\n\nDans la mesure où ce nom de version va se retrouver à plusieurs endroits (``setup.py``, ``doc/conf.py``, ...), et pour ne pas risquer d'erreurs dans le maintien en cohérence de cette information à plusieurs endroits, il est possible d'utiliser bump2version_. Pour cela créez un fichier ``.bumpversion.cfg`` à la racine du projet, ce dernier va définir dans quel fichier remplacer automatiquement le numéro de version. Ajoutez-y le contenu ci-dessous et assurez vous que tous les fichiers contiennent initialement les mêmes numéros de version, par la suite ils seront mis à jour automatiquement :\n\n.. code::\n\n  [bumpversion]\n  current_version = 0.0.1\n  commit = True\n  tag = True\n\n  [bumpversion:file:setup.py]\n  search = version=\"{current_version}\"\n  replace = version=\"{new_version}\"\n\n  [bumpversion:file:how_to_opensource/_version.py]\n  search = __version__ = \"{current_version}\"\n  replace = __version__ = \"{new_version}\"\n\n  [bumpversion:file:doc/conf.py]\n  search = release = \"{current_version}\"\n  replace = release = \"{new_version}\"\n\nVous pouvez désormais incrémenter le numéro de version avec ``bumpversion``.\nTrois choix sont possibles pour l'incrémentation du numéro de version: patch, minor, et major. Nous choisissons ici d'incrémenter le \"patch\":\n\n.. code:: shell-session\n\n  $ bumpversion patch\n  $ git push --tags\n\nVotre publication sur PyPi_ se fait simplement avec la commande :\n\n.. code:: shell-session\n\n  $ twine upload dist/*\n\nAttention, cette commande nécessite un identifiant et un mot de passe, il faut donc vous créer un compte au préalable sur PyPi_.\n\n**CORRECTION :** ``git checkout master setup.py LICENSE .bumpversion.cfg``\n\nExercice n°10: déploiement continu\n==================================\n\nMaintenant nous allons mettre en place la publication automatique sur PyPi_ après chaque release officielle de votre package. \nLe but est de déclencher automatiquement, à la publication d'une nouvelle release depuis GitHub, la publication de la nouvelle version du package vers PyPi.\nCela signifie donc que le workflow GitHub devra se connecter à votre compte PyPi_. \nPour ne pas avoir à mettre en clair les éléments nécessaires à cette authentification dans votre dépôt, il existe un mécanisme permettant de se connecter à\nPyPi sur base d'un token, et de stocker ce token en tant qu'élément secret dans le dépôt GitHub.\nPour cela, une fois connecté sur PyPi:\n\n- Rendez-vous sur la page *Account Settings* et descendez jusqu'à la section *API Tokens*. \n\n- Cliquez sur *Add Token*, donnez lui un nom, par exemple *how-to-opensource* et donnez lui accès au scope complet. \n\n- Copiez le token généré et gardez cette page ouverte au cas où.\n\n- Dans une autre fenêtre, rendez vous sur votre dépôt GitHub à la page *Settings*, section *Secrets*.\n\nAppelez le PYPI_API_TOKEN et collez dans le champ *Value* le token copié depuis PyPi_.\n\nNous pouvons maintenant mettre en place le workflow de publication automatique, pour cela:\n\n- Rendez vous dans l'onglet *Actions* du projet GitHub et cliquez sur *New workflow*.\n\n- Choisissez le template *Publish Python Package*, renommez le fichier ``publish.yml``, spécifiez la version 3.9 de python et confirmez l'ajout du workflow.\n\nPour déclencher le workflow, allez sur la page principale du dépôt GitHub, à droite, cliquez sur Releases. Vous devriez voir tous les tags poussés jusqu'à présent. Choisissez le dernier et cliquez sur \"Edit tag\". Pensez à bien pointer sur la branche ``work``. Cliquez ensuite sur \"Publish release\". L'action de publication s'est normalement déclenchée dans l'onglet GitHub Actions. Une fois terminée, vous pouvez vérifier que la mise à jour sur PyPi_ s'est bien déroulée.\n\nEnfin il convient d'ajouter de documenter les règles de contribution et d'usage du package. Pour cela rendez vous dans la page **Insights/Community** de GitHub. Cette dernière fournit un moyen simple d'initier les documents nécessaires.\n\nVous pouvez également naviguer dans l'onglet Insights > Community de github et remplir votre projet avec des template d'issue, pull request ou codes de conduite.\n\n**IMPORTANT :** Vous avez déjà publié une version de votre package à l'étape précédente. Pour republier une nouvelle version, vous être obligé de \"bumper\" la version à nouveau :\n\n.. code:: shell-session\n\n  $ bumpversion patch\n  $ git push --tags\n\n**CORRECTION :** ``git checkout master .github/workflows/publish.yml``\n\nRécapitulatif\n=============\n\nVoici les 10 bonnes pratiques de développement open-source: \n\n1. **Mettre en place un dépôt GitHub,** soit à partir de zéro, soit en forkant un dépôt existant\n2. **Encapsuler les fonctions dans un module** facile à importer et renseignant un numéro de version\n3. **Documenter les fonctions avec une dosctring et un doctest.** La docstring sera automatiquement publié en ligne et le doctest automatiquement exécuté pendant l'intégration continue.\n4. **Ecrire vos fonctions avec déclaration de types.** C'est une habitude facile à prendre qui génère automatiquement des tests unitaires statiques avec MyPy_.\n5. **Créer des tests unitaires avec un objectif de couverture de 100%.** La paramétrisation des tests avec ``pytest.xmark.parametrize`` permet de générer des tests très rapidement.\n6. **Implémenter une intégration continue du code.** Sur GitHub, le standard est d'utiliser des GitHub Actions. Pensez à toujours tester votre code sur Windows.\n7. **Générer une documentation semi-automatique avec Sphinx_.** L'API de votre package est automatiquement documentée si vous avez écrit les docstrings à l'avance. Plus qu'à rédiger les parties importantes et les messages à faire passer aux utilisateurs. Les exemples sont un bon moyen d'accompagner la montée en compétences rapide des utilisateurs.\n8. **Déployer la documentation de manière continue avec ReadTheDocs_.** Le déploiement continu doit se déclencher a minima à chaque pull request.\n9. **Packager votre module avec le fichier ``setup.py``.** Ce fichier est la pierre angulaire de la publication sur PyPi_. Les numéros de version sont plus facile à gérer avec bump2version_.\n10. **Déployer votre package de manière continue avec les release GitHub** et les actions correspondantes. Vous pouvez cacher votre mot de passe PyPi_ par un système de tokens.\n\nBONUS: Gestion du dépôt sur le long terme\n=========================================\n\nQuelques bonnes pratiques de gestion du dépôt sur le long terme :\n\n* Tout problème ou amélioration du code doit faire l'objet d'une issue avant une pull request. Les pull request doivent être reliées aux issues qu'elles résolvent.\n* Tout incrément de code doit passer par des pull request revue par une personne tierce\n* L'onglet GitHub Projects vous permets d'organiser les issues sous formes de cartes simili-Trello, et rend publique votre feuille de route de développement.\n* Il est recommandé d'ajouter deux fichiers de documentation à votre repo : un ``CONTRIBUTING.md`` qui renseigne les contributeurs éventuels sur l'art et la manière de faire des pull request pour ce projet, et un ``RELEASE_CHECKLIST.md`` récapitulant toutes les étapes de vérification avant publication sur PyPi_. Vous trouverez un exemple sur MAPIE_.\n\nBonus: Badges\n=============\n\nNotre intégration continue est maintenant en place. Afin de donner une vue de synthèse de son execution et de donner confiance aux utilisateurs potentiels quand à la qualité du package, il est possible d'ajouter des badges qui donneront un status à jour de l'execution de l'intégration continue.\nIl faut pour cela, ajoutez dans le README situé à la racine du dépôt les liens suivants:\n\n.. code::\n\n  |GitHubActionTestBadge|_ |ReadTheDocsBadge|_ |GitHubActionPublishBadge|_ |PyPiBadge|_\n\n  .. |GitHubActionTestBadge| image:: https://github.com/simai-ml/how-to-opensource/actions/workflows/test.yml/badge.svg\n  .. _GitHubActionTestBadge: https://github.com/simai-ml/how-to-opensource/actions\n\n  .. |ReadTheDocsBadge| image:: https://readthedocs.org/projects/how-to-opensource/badge\n  .. _ReadTheDocsBadge: https://how-to-opensource.readthedocs.io/en/latest\n\n  .. |GitHubActionPublishBadge| image:: https://github.com/simai-ml/how-to-opensource/actions/workflows/publish.yml/badge.svg\n  .. _GitHubActionPublishBadge: https://github.com/simai-ml/how-to-opensource/actions\n\n  .. |PyPiBadge| image:: https://img.shields.io/pypi/v/QM-How-to-Opensource\n  .. _PyPiBadge: https://pypi.org/project/QM-How-to-Opensource/\n\n.. _Conda: https://docs.conda.io/en/latest/miniconda.html\n.. _EnvConda: https://conda.io/projects/conda/en/latest/user-guide/tasks/manage-environments.html\n.. _Module: https://docs.python.org/3/tutorial/modules.html\n.. _PyTest: https://docs.pytest.org/en/6.2.x/\n.. _Parameterize: https://docs.pytest.org/en/6.2.x/parametrize.html\n.. _Numpydoc: https://numpydoc.readthedocs.io/en/latest/format.html\n.. _DocTest: https://docs.python.org/3/library/doctest.html\n.. _Typing: https://docs.python.org/3/library/typing.html\n.. _TravisCI: https://travis-ci.com/\n.. _MyPy: http://mypy-lang.org/\n.. _Sphinx: https://www.sphinx-doc.org/en/master/index.html\n.. _ReadTheDocs: https://readthedocs.org/\n.. _SphinxGallery: https://sphinx-gallery.github.io/stable/getting_started.html\n.. _GitHubActions: https://github.com/features/actions\n.. _package: https://docs.python.org/3/tutorial/modules.html#packages\n.. _tutoriel: https://packaging.python.org/guides/distributing-packages-using-setuptools/\n.. _OpenSourceInitiative: https://opensource.org/licenses/BSD-3-Clause\n.. _bump2version: https://github.com/c4urself/bump2version\n.. _PyPi: https://pypi.org/account/register/\n.. _MAPIE: https://github.com/simai-ml/MAPIE\n\n\n",
    "description_content_type": "text/x-rst",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "http://packages.python.org/how_to_opensource",
    "keywords": "example opensource tutorial",
    "license": "BSD",
    "maintainer": "",
    "maintainer_email": "",
    "name": "QM-How-to-Opensource-AMA",
    "package_url": "https://pypi.org/project/QM-How-to-Opensource-AMA/",
    "platform": "",
    "project_url": "https://pypi.org/project/QM-How-to-Opensource-AMA/",
    "project_urls": {
      "Homepage": "http://packages.python.org/how_to_opensource"
    },
    "release_url": "https://pypi.org/project/QM-How-to-Opensource-AMA/0.0.3/",
    "requires_dist": [
      "numpy (>=1.20)",
      "sphinx ; extra == 'docs'",
      "sphinx-gallery ; extra == 'docs'",
      "sphinx-rtd-theme ; extra == 'docs'",
      "numpydoc ; extra == 'docs'",
      "flake8 ; extra == 'tests'",
      "mypy ; extra == 'tests'",
      "pytest-cov ; extra == 'tests'"
    ],
    "requires_python": "",
    "summary": "A Quantmetry tutorial on how to publish an opensource python package.",
    "version": "0.0.3",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 10796332,
  "releases": {
    "0.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1ede020cfee0a4fe8e69c84f7dd196b43af8849404477a189977937578d2c88c",
          "md5": "fa015bda68caa05c6510818f8615d8d3",
          "sha256": "1828651d19b06cf68f17991d3087279cd5bef3901d07bc1920df85012b892326"
        },
        "downloads": -1,
        "filename": "QM_How_to_Opensource_AMA-0.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "fa015bda68caa05c6510818f8615d8d3",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 11430,
        "upload_time": "2021-07-01T11:32:15",
        "upload_time_iso_8601": "2021-07-01T11:32:15.344342Z",
        "url": "https://files.pythonhosted.org/packages/1e/de/020cfee0a4fe8e69c84f7dd196b43af8849404477a189977937578d2c88c/QM_How_to_Opensource_AMA-0.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f1e4b417dc83c61d4b1691933ed7bc2479181ea9e7b9e5e24fecf5d19879940a",
          "md5": "f5c79173924e3b57b9097bdad9d05dd2",
          "sha256": "a6b3b6d7a9dd280e714a609a429579ac02f28aba16dacae84f04511289e7cf5f"
        },
        "downloads": -1,
        "filename": "QM How to Opensource AMA-0.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "f5c79173924e3b57b9097bdad9d05dd2",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 26416,
        "upload_time": "2021-07-01T11:32:17",
        "upload_time_iso_8601": "2021-07-01T11:32:17.838779Z",
        "url": "https://files.pythonhosted.org/packages/f1/e4/b417dc83c61d4b1691933ed7bc2479181ea9e7b9e5e24fecf5d19879940a/QM%20How%20to%20Opensource%20AMA-0.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7d4495d5722773e4390c5ee38f265b3dfadfc5e03e0d3e291f6a44b76b7685e0",
          "md5": "b123f66ee16fbe339f7a895b84a979a9",
          "sha256": "20a9f3cde4688f76f9510cb4fb86c30f1b42218640decb65a175f61f4c228e21"
        },
        "downloads": -1,
        "filename": "QM_How_to_Opensource_AMA-0.0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "b123f66ee16fbe339f7a895b84a979a9",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 11429,
        "upload_time": "2021-07-01T11:35:30",
        "upload_time_iso_8601": "2021-07-01T11:35:30.642181Z",
        "url": "https://files.pythonhosted.org/packages/7d/44/95d5722773e4390c5ee38f265b3dfadfc5e03e0d3e291f6a44b76b7685e0/QM_How_to_Opensource_AMA-0.0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7e6eeb7e87264fa84a59407fdf396b6cbf601f5899b7f5b91b27a442bdd3bb37",
          "md5": "e8b14f92dff62b1178a9ac4eb2b85f6f",
          "sha256": "77ce3b2100d78474e8b42241f1a7f8ff6178931a6eb03aa94133c91d44a70f66"
        },
        "downloads": -1,
        "filename": "QM How to Opensource AMA-0.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "e8b14f92dff62b1178a9ac4eb2b85f6f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 26436,
        "upload_time": "2021-07-01T11:35:32",
        "upload_time_iso_8601": "2021-07-01T11:35:32.664496Z",
        "url": "https://files.pythonhosted.org/packages/7e/6e/eb7e87264fa84a59407fdf396b6cbf601f5899b7f5b91b27a442bdd3bb37/QM%20How%20to%20Opensource%20AMA-0.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "46f74c57ef3c5fe52f0448335d61063405e7da51d3f9aa9a172b4c06c2447c38",
          "md5": "20f6486ec9315740edd005c7826ac23f",
          "sha256": "e7f0915b5de5cd4be5e344ddff5d27bfe6050bc149b2fe39b30757a92fb76eea"
        },
        "downloads": -1,
        "filename": "QM_How_to_Opensource_AMA-0.0.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "20f6486ec9315740edd005c7826ac23f",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 11430,
        "upload_time": "2021-07-01T11:55:35",
        "upload_time_iso_8601": "2021-07-01T11:55:35.317181Z",
        "url": "https://files.pythonhosted.org/packages/46/f7/4c57ef3c5fe52f0448335d61063405e7da51d3f9aa9a172b4c06c2447c38/QM_How_to_Opensource_AMA-0.0.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6567dfc44730ef4d174584c27c1185c6aec1c0a5cb03f249642e528bcfd19318",
          "md5": "f9593b49f70f10dd4b01481f53e8137e",
          "sha256": "1394e6e449045de9bf1c852faf550cba30cee461175693bad3c1d736f6e059df"
        },
        "downloads": -1,
        "filename": "QM How to Opensource AMA-0.0.3.tar.gz",
        "has_sig": false,
        "md5_digest": "f9593b49f70f10dd4b01481f53e8137e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 26395,
        "upload_time": "2021-07-01T11:55:36",
        "upload_time_iso_8601": "2021-07-01T11:55:36.500092Z",
        "url": "https://files.pythonhosted.org/packages/65/67/dfc44730ef4d174584c27c1185c6aec1c0a5cb03f249642e528bcfd19318/QM%20How%20to%20Opensource%20AMA-0.0.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "46f74c57ef3c5fe52f0448335d61063405e7da51d3f9aa9a172b4c06c2447c38",
        "md5": "20f6486ec9315740edd005c7826ac23f",
        "sha256": "e7f0915b5de5cd4be5e344ddff5d27bfe6050bc149b2fe39b30757a92fb76eea"
      },
      "downloads": -1,
      "filename": "QM_How_to_Opensource_AMA-0.0.3-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "20f6486ec9315740edd005c7826ac23f",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 11430,
      "upload_time": "2021-07-01T11:55:35",
      "upload_time_iso_8601": "2021-07-01T11:55:35.317181Z",
      "url": "https://files.pythonhosted.org/packages/46/f7/4c57ef3c5fe52f0448335d61063405e7da51d3f9aa9a172b4c06c2447c38/QM_How_to_Opensource_AMA-0.0.3-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "6567dfc44730ef4d174584c27c1185c6aec1c0a5cb03f249642e528bcfd19318",
        "md5": "f9593b49f70f10dd4b01481f53e8137e",
        "sha256": "1394e6e449045de9bf1c852faf550cba30cee461175693bad3c1d736f6e059df"
      },
      "downloads": -1,
      "filename": "QM How to Opensource AMA-0.0.3.tar.gz",
      "has_sig": false,
      "md5_digest": "f9593b49f70f10dd4b01481f53e8137e",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 26395,
      "upload_time": "2021-07-01T11:55:36",
      "upload_time_iso_8601": "2021-07-01T11:55:36.500092Z",
      "url": "https://files.pythonhosted.org/packages/65/67/dfc44730ef4d174584c27c1185c6aec1c0a5cb03f249642e528bcfd19318/QM%20How%20to%20Opensource%20AMA-0.0.3.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}