{
  "info": {
    "author": "Jan Andre Reuter",
    "author_email": "j.reuter@fz-juelich.de",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# QtSLIX -- A graphical user interface for the Scattered Light Imaging ToolboX\n\n## Introduction\n*Scattered Light Imaging (SLI)* is a novel neuroimaging technique that allows to explore the substructure of nerve fibers, especially in regions with crossing nerve fibers, in whole brain sections with micrometer resolution ([Menzel et al. (2020)](https://arxiv.org/abs/2008.01037)). \nBy illuminating histological brain sections from different angles and measuring the transmitted light under normal incidence, characteristic light intensity profiles (SLI profiles) can be obtained which provide crucial information such as the directions of crossing nerve fibers in each measured image pixel. \n\nTo analyze the Scattered Light Imaging measurements, a toolbox named [*Scattered Light Imaging ToolboX (SLIX)*](https://www.github.com/3d-pli/slix) was implemented &ndash; \nan open-source Python package that allows a fully automated evaluation of SLI measurements and the generation of different parameter maps. \nThe purpose of SLIX is twofold: First, it allows to transform the raw data of SLI measurements (SLI image stack) to human-readable parameter maps that can be used for further analysis and interpreted by researchers. \nTo this end, SLIX also contains functions to visualize the resulting parameter maps, e.g. as colored vector maps. \nSecond, the results of SLIX can be processed further for use in tractography algorithms. \nFor example, the resulting fiber direction maps can be stored as angles or as unit vectors, which can be used as input for streamline tractography algorithms ([Nolden et al. (2019)](https://doi.org/10.1007/978-3-658-25326-4_17)).\n\nHowever, not everyone is familiar with the command line or the Python programming language and might not be able to use SLIX. \nThis package is designed to be used as a graphical user interface only allowing users unfamiliar with the command line to easily perform the necessary steps to analyze SLI measurements. \nAlmost all available options of the command line are also available in the graphical user interface. Users are able to run the analysis pipeline, visualize their results and cluster the parameter maps.\n\n## Install instructions\n### Requirements\n**QtSLIX** requires the following packages:\n- Python 3.6 or higher\n- PyQt5\n- NumPy\n- SLIX v2.4.0 or higher\n- Matplotlib\n\n**SLIX** itself requires the following packages:\n- Python 3.6 or higher\n- Tifffile\n- Nibabel\n- h5py\n- Pillow\n- Numba\n- Matplotlib\n- tqdm\n- SciPy\n- Imagecodecs\n\nTo use GPU acceleration, **SLIX** requires the following packages:\n- CuPy >= v8.0.0\n\nIt is advised to use a system with the following minimal requirements:\n- Operating System: Windows, Linux, MacOS\n- Python version: Python 3.6+\n- Processor: At least four threads if executed on CPU only\n- RAM: 8 GiB or more\n- (optional GPU: NVIDIA GPU supported by CUDA 9.0+)\n\n### Installation of QtSLIX\n##### How to clone QtSLIX (for further work)\n```bash\ngit clone git@github.com:3d-pli/QtSLIX.git\ncd QtSLIX\n\n# A virtual environment is recommended:\npython3 -m venv venv\nsource venv/bin/activate\n\npip3 install -r requirements.txt\n```\n\n##### How to install QtSLIX as Python package\n```bash\n# Install via PyPi\npip install QtSLIX\n\n# Install after cloning locally\ngit clone git@github.com:3d-pli/QtSLIX.git\ncd QtSLIX\npip install .\n```\n\n##### Run QtSLIX locally\n\n```bash\ngit clone git@github.com:3d-pli/QtSLIX.git\ncd QtSLIX\npython3 bin/main.py \n\n# alternatively, after installation of SLIX\npip3 install QtSLIX\nQtSLIX\n```\n\n## Running the application\n### Starting the application\n\nTo start the application, just run the following command in a command line interface:\n```bash\n# If you installed QtSLIX as a Python package:\nQtSLIX\n\n# Else, if you installed QtSLIX locally:\npython3 bin/main.py\n```\n\n### General interface\n<img src=\"https://github.com/3d-pli/QtSLIX/blob/main/assets/Interface_On_Open.png?raw=true\" width=\"720\">\n\nWhen opening the program for the first time, you will be greeted with the interface shown in the figure above. \nThe menu bar only contains a help option where things like the license and a link to the repository are stored.\n\nBelow that menu bar, a list of available analysis steps is shown. The application will always start in the \n`Parameter Generator` tab. In the following, we will only discuss the available tabs with their functions.\n\n### Parameter Generator\nThe `Parameter Generator` tab allows you to generate parameter maps for the analysis of SLI measurements. \nThe available options mostly match those of the command line program `SLIXParameterGenerator` which gets installed\nwhen you install the package `SLIX`. You can see the command line options [here](https://github.com/3d-pli/SLIX/blob/master/README.md#generation-of-parameter-maps).\n\nThe left area is a preview window of a loaded measurement. When using one of the buttons `Measurement` or `Folder`, you will be able to open a SLI measurement.\nThe preview window will then show the loaded measurement as seen below.\n\n<img src=\"https://github.com/3d-pli/QtSLIX/blob/main/assets/Interface_Parameter_Generator_Loaded_Measurement.png?raw=true\" width=\"720\">\n\nThere is a scroll bar below the measurement which can be used to scroll through all the measurement angles.\nThis way, one can ensure that the correct measurement is loaded and no image contains wrong information.\n\nThe right side then allows to select the parameters that should be generated. \nIf a measurement with an angular step size other than 15° is loaded, it might be helpful to enable the \n**Filtering** option. When enabled, you are able to choose between the **Fourier** and **Savitzky-Golay** filters.\nThe two number fields allow you to choose the window size and the polynomial order for the Savitzky-Golay filter or\nthe cutoff frequency and smoothing for the Fourier filter.\n\nThe **Parameter Maps** section contains a number of check boxes which allow you to select which parameters should be generated.\nThe resulting parameter maps are explained in detail in the SLIX repository. You can find the explanation [here](https://github.com/3d-pli/SLIX/blob/master/README.md#resulting-parameter-maps).\n\nThe other option section contains a number of options that are not directly related to the parameter generation.\nFor example, you can choose a correction angle for the direction which will change the resulting direction angle.\nEnabling the detailed option will result in 3D images of some parameter maps which might be helpful for further analysis.\nThe **Use GPU** option will enable the use of a GPU for the calculation of the parameter maps. \nThis might be helpful if you have a GPU and you want to speed up the calculation. However, the calculations are pretty memory intensive.\nTherefore, the program might throw an error message if the memory is not sufficient.\n\nClick on the `Generate` button to generate the parameter maps. A save dialog will open where you can choose where to save the parameter maps.\nThe file names are generated based on the input file name / input folder name. The extension of the file is automatically added and defaults to `.tiff` in the current version.\nA progress bar will show the progress of the calculation. You are able to use the graphical user interface in the meantime.\n\n<img src=\"https://github.com/3d-pli/QtSLIX/blob/main/assets/Interface_Parameter_Generation_Generate.png?raw=true\" width=\"720\">\n\n### Visualization\nThe second available tab in the interface covers the visualization of resulting parameter maps. \nThe general interface can be seen below.\n\n<img src=\"https://github.com/3d-pli/QtSLIX/blob/main/assets/Interface_Visualization_On_Open.png?raw=true\" width=\"720\">\n\nThe right side has three options to visualize or show parameter maps:\n1. **FOM**: Visualize up to four direction maps as a fiber orientation map\n2. **Vector**: Visualize the direction maps as unit vectors on top of an SLI measurement or parameter map\n3. **Parameter Map**: Visualize the parameter maps as a color map\n\n#### FOM\nA fiber orientation map is a map of the direction of the fibers in the image. \nEach pixel gets assigned a color based on the direction and inclination angle of the fibers in the underlying image.\nThis method for visualizing fiber orientation maps is described in [this paper](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3248698/).\nA direct example can be found [here](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3248698/figure/F5/?report=objectonly).\nThere are different ways to visualize the direction maps.\nQtSLIX supports all implemented variants offered by SLIX. For the available SLIX options, look [here](https://github.com/3d-pli/slix#visualization-of-parameter-maps).\n\nWhen clicking on **Open Directions**, a dialog will open where you can choose the direction maps to visualize. \nAfter choosing the files, you can choose between the following color maps:\n1. **RGB**: The direction is visualized as a red, green and blue color. The red and green channel are used for the in-plane direction. The blue channel is used for the inclination angle.\n2. **HSVBlack**: The direction color is visualized as the hue of the HSV color space. The saturation is set to 1 and the value is determined by the inclination angle.\n3. **HSVWhite**: The direction color is visualized as the hue of the HSV color space. The saturation is determined by the inclination angle and the value is set to 1.\n4. **HSVBlack_r**: Same as HSVBlack. However, the direction angle is flipped (180° - dir).\n5. **HSVWhite_r**: Same as HSVWhite. However, the direction angle is flipped (180° - dir).\n\nBoth the saturation and value channel can also be used to weight the generated color map. \nIf you want to use the saturation channel, you can use the checkmark next to *Weight FOM by Saturation* and load a parameter map which will be used for weighting.\nThe parameter map will get normalized to a range of 0-1 to ensure that the color map is in the correct range.\nThe same procedure holds true for the value channel.\n\nClicking on the **Generate** button will generate the FOM and show a preview on the left side of the interface.\nThis might take a while depending on the image size. The graphical user interface will freeze during the calculation.\n\nAfter the calculation is finished, the result can also be saved using the **Save** button. \nThe button is grayed out until at least a preview was generated.\nUsing the **Save** option will open a save dialog where you can choose where to save the FOM.\nBoth the *.tiff* and *.h5* file format are supported.\n\n#### Vector\n\nSimilar to the fiber orientation map, vectors can be used to visualize the direction maps on top of an SLI measurement or parameter map.\nThe vectors will be shown as lines with a defined with and length. The color of the lines is determined by the direction angles and will follow the color spaces of the fiber orientation map.\nThe general interface can be seen below.\n\n<img src=\"https://github.com/3d-pli/QtSLIX/blob/main/assets/Interface_Visualization_Vector.png?raw=true\" width=\"720\">\n\nHere the background image can be loaded by clicking on the **Open Background Image** button. \nIn addition, the vector length can be weighted by using a parameter map which will be normalized to a range of 0-1. \n\nParameters like **Alpha** or **Thinout** will be used to control the appearance of the vector and will result in the same results you expect when using the command line options of SLIX.\n\n| Argument       | Function                                                                                                                                                                                                                                                                                                                |\n|----------------|-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| `Alpha`        | Factor for the vectors which will be used during visualization. A higher value means that the vectors will be more visible. (Value range: 0 -- 1)                                                                                                                                                                       |\n| `Thinout`      | Thin out vectors by an integer value. A thinout of 20 means that both the x-axis and y-axis are thinned by a value of 20. Default = 20                                                                                                                                                                                  |\n| `Scale`        | Increases the scale of the vectors. A higher scale means that the vectors in the resulting image are longer. This can be helpful if many pixels of the input image are empty but you don't want to use the thinout option to see results. If the scale option isn't used, the vectors are scaled by the thinout option. |\n| `Vector width` | Change the default vector width shown in the resulting image. This can be useful if only a small number of vectors will be shown (for example when using a large thinout)                                                                                                                                               |\n| `Threshold`    | When using the thinout option, you might not want to get a vector for a lonely vector in the base image. This parameter defines a threshold for the allowed percentage of background pixels to be present. If more pixels than the threshold are background pixels, no vector will be shown. (Value range: 0 -- 1)      |\n| `Dpi`          | Set the image DPI value for Matplotlib. Smaller values will result in a lower resolution image which will be written faster. Larger values will need more computation time but will result in clearer images. Default = 1000dpi                                                                                         |\n| `Distribution` | Instead of using each n-th vector for the visualization (determined by the median vector), instead show all vectors on top of each other. Note: Low alpha values (around 1/alpha) are recommended. The threshold parameter is disabled when enabling the distribution.                                                  |\n\nLike with the FOM, clicking on **Generate** will generate the vector image and show a preview of the result.\nPlease keep in mind that the calculation of the vector image can take a while, especially when using the distribution option.\nThe graphical user interface will freeze in the meantime.\n\nUsing the **Save** option will open a save dialog where you can choose where to save the FOM.\nBoth the *.tiff* and *.h5* file format are supported.\n\n#### Parameter map\n\nThe last available tab contains the simple visualization of parameter maps. \nThe user is able to load a parameter map using the ... option. \nLoading a parameter map automatically shows it on the left side in the image preview.\nUsing a drop-down menu, the user can select Matplotlib color space used for the visualization.\nThe user is then able to save to colorized parameter map using the **Save preview** option.\n\nCurrently, there is no support for a colorized legend next to the parameter map. \nThis feature may be explored in the future.\n\nA preview of the view is shown below.\n\n<img src=\"https://github.com/3d-pli/QtSLIX/blob/main/assets/Interface_Visualization_Parameter.png?raw=true\" width=\"720\">\n\n### Clustering\n\nThe last available tab contains the clustering of a measurement based on the generated parameter maps.\nKeep in mind that, just like with the normal version of `SLIXCluster`, optional parameter maps like **Min** and **Max** \nmight be required to ensure that all clustering steps can function as expected.\n\n<img src=\"https://github.com/3d-pli/QtSLIX/blob/main/assets/Interface_Visualization_Cluster.png?raw=true\" width=\"720\">\n\nClicking on the **Folder** option will open a folder selection dialog. Here, all needed files need to be located.\nJust like in the parameter map, the user can select the Matplotlib color space used for the visualization.\n\nUsing the four checkboxes below, the user can select which classification masks shall be generated. Unlike the preview, \nthe results will not be colorized and will instead be saved as an 8-bit image where each number corresponds to a classification.\nFor more information which classification numbers correspond to which masks, please refer to the [SLIXCluster documentation](https://github.com/3d-pli/SLIX#cluster-parameters)\n\nClicking on **Save** will generate and save all checked masks. The user can select the folder where all files will be saved.\nThe filenames will be based on the parameter map names.\n\n\n## Authors\n- Jan André Reuter\n\n## References\n|                                                                                                                                                                                                                |                                                                                                                                                              |\n|:--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------:|--------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| [![](https://www.fz-juelich.de/SharedDocs/Bilder/INM/INM-1/DE/PLI/PLI-GruppenLogo.png?__blob=thumbnail)](https://www.fz-juelich.de/inm/inm-1/EN/Forschung/Fibre%20Architecture/Fibre%20Architecture_node.html) | [Fiber Architecture - INM1 - Forschungszentrum Jülich](https://www.fz-juelich.de/inm/inm-1/EN/Forschung/Fibre%20Architecture/Fibre%20Architecture_node.html) |\n|                                                 [![](https://sos-ch-dk-2.exo.io/public-website-production/img/HBP.png)](https://www.humanbrainproject.eu/en/)                                                  | [Human Brain Project](https://www.humanbrainproject.eu/en/)                                                                                                  |\n\n## Acknowledgements\nThis open source software code was developed in part or in whole in the Human Brain Project, funded from the European Union’s Horizon 2020 Framework Programme for Research and Innovation under the Specific Grant Agreement No. 785907 and 945539 (\"Human Brain Project\" SGA2 and SGA3). The project also received funding from the Helmholtz Association port-folio theme \"Supercomputing and Modeling for the Human Brain\".\n\n## License\nThis software is released under MIT License\n```\nCopyright (c) 2021-2022 Forschungszentrum Jülich / Jan André Reuter.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.python input parameters -i -o\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n```\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/3d-pli/QtSLIX",
    "keywords": "",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "QtSLIX",
    "package_url": "https://pypi.org/project/QtSLIX/",
    "platform": "",
    "project_url": "https://pypi.org/project/QtSLIX/",
    "project_urls": {
      "Homepage": "https://github.com/3d-pli/QtSLIX"
    },
    "release_url": "https://pypi.org/project/QtSLIX/1.0.2/",
    "requires_dist": [
      "PyQt5",
      "matplotlib",
      "numpy",
      "SLIX (>=2.4.0)"
    ],
    "requires_python": ">=3.6",
    "summary": "QtSLIX is an expansion to the Scattered Light Imaging ToolboX by adding a graphical user interface.",
    "version": "1.0.2",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 12696672,
  "releases": {
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7b244ff9b5c876e6a6fac081e7d2bb595c0b94ecacff2e7bd08a0d7e161abc58",
          "md5": "e268c0133cbb6e3bd077e001bfb8e63b",
          "sha256": "11f70548b05e802ac498c7945f4897696c9bcf3510405782a25126278b532e6a"
        },
        "downloads": -1,
        "filename": "QtSLIX-1.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "e268c0133cbb6e3bd077e001bfb8e63b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 27437,
        "upload_time": "2022-01-06T10:04:17",
        "upload_time_iso_8601": "2022-01-06T10:04:17.674669Z",
        "url": "https://files.pythonhosted.org/packages/7b/24/4ff9b5c876e6a6fac081e7d2bb595c0b94ecacff2e7bd08a0d7e161abc58/QtSLIX-1.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "adaa6db9f13d52f692ab5dbe80595c960f402bc64ad9211fbbaf6da3bb30e5f0",
          "md5": "cf3c30fd671669aa4cf85abd643874fd",
          "sha256": "3139e8fde383c9da64b50cce7c89953df7f826ce18a80b7b1c2de7c574626c61"
        },
        "downloads": -1,
        "filename": "QtSLIX-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "cf3c30fd671669aa4cf85abd643874fd",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 35123,
        "upload_time": "2022-01-06T10:04:19",
        "upload_time_iso_8601": "2022-01-06T10:04:19.001068Z",
        "url": "https://files.pythonhosted.org/packages/ad/aa/6db9f13d52f692ab5dbe80595c960f402bc64ad9211fbbaf6da3bb30e5f0/QtSLIX-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.0.post1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b44f2b8d5352b4b4a1012aca94c2b7f0ab53807d1fd047182733b3394f47b806",
          "md5": "4d8cadf931030264aedc342d84905b5d",
          "sha256": "58789889646110856cce2154e2e7767692a5d6c59d049b5a01ada76ef570c88d"
        },
        "downloads": -1,
        "filename": "QtSLIX-1.0.0.post1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "4d8cadf931030264aedc342d84905b5d",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 27544,
        "upload_time": "2022-01-06T10:13:12",
        "upload_time_iso_8601": "2022-01-06T10:13:12.946681Z",
        "url": "https://files.pythonhosted.org/packages/b4/4f/2b8d5352b4b4a1012aca94c2b7f0ab53807d1fd047182733b3394f47b806/QtSLIX-1.0.0.post1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "43d0447c92defbb546ab45f0c3d6af89f61dc1135010cb64643f8e9bb44265e7",
          "md5": "a60f9688bb67554c51144a47484b4377",
          "sha256": "171a0a13c8ff0c5a6a143c2956d9886982d2b26e1d2788e669ebe186c57eb1b4"
        },
        "downloads": -1,
        "filename": "QtSLIX-1.0.0.post1.tar.gz",
        "has_sig": false,
        "md5_digest": "a60f9688bb67554c51144a47484b4377",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 35265,
        "upload_time": "2022-01-06T10:13:14",
        "upload_time_iso_8601": "2022-01-06T10:13:14.335746Z",
        "url": "https://files.pythonhosted.org/packages/43/d0/447c92defbb546ab45f0c3d6af89f61dc1135010cb64643f8e9bb44265e7/QtSLIX-1.0.0.post1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "334c6b8c9518e6da15fdc0dbdf8e215a0ecad4cc8467806b3c37cb2e7feb9a52",
          "md5": "d0a759d498fc4b40ef729ca2712fe1c9",
          "sha256": "0e0823c900b1b99346a592be97f9a4058189e8fe1b4f218cec63ffd196efdfdb"
        },
        "downloads": -1,
        "filename": "QtSLIX-1.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "d0a759d498fc4b40ef729ca2712fe1c9",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 27569,
        "upload_time": "2022-01-06T10:27:07",
        "upload_time_iso_8601": "2022-01-06T10:27:07.016277Z",
        "url": "https://files.pythonhosted.org/packages/33/4c/6b8c9518e6da15fdc0dbdf8e215a0ecad4cc8467806b3c37cb2e7feb9a52/QtSLIX-1.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a5a7490518a629a54e00b440e268d2c9ede245053409ca67d4bfe871a35f1da1",
          "md5": "f35bcc39513b5d1305c49a2acdd03ed1",
          "sha256": "f6b95e7fbe8b780e91445548f8b746712e48851add794d22a8c9c95c91646f75"
        },
        "downloads": -1,
        "filename": "QtSLIX-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "f35bcc39513b5d1305c49a2acdd03ed1",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 35377,
        "upload_time": "2022-01-06T10:27:08",
        "upload_time_iso_8601": "2022-01-06T10:27:08.059406Z",
        "url": "https://files.pythonhosted.org/packages/a5/a7/490518a629a54e00b440e268d2c9ede245053409ca67d4bfe871a35f1da1/QtSLIX-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "17caf82445aa777c77f0bdbcb40e70ce8141520d375a0057589490ea70aa6b10",
          "md5": "82145f916ec8168b4d17baffb537cb81",
          "sha256": "3473a03b53f09b714eb9d5734c5f5519ad28e63faafc7b7b5f7209c21ea9acc3"
        },
        "downloads": -1,
        "filename": "QtSLIX-1.0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "82145f916ec8168b4d17baffb537cb81",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 27750,
        "upload_time": "2022-01-26T09:29:47",
        "upload_time_iso_8601": "2022-01-26T09:29:47.970729Z",
        "url": "https://files.pythonhosted.org/packages/17/ca/f82445aa777c77f0bdbcb40e70ce8141520d375a0057589490ea70aa6b10/QtSLIX-1.0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8edf715e7016f0e82a7a67a367250359c77f45704015d565d349f4266b0be16f",
          "md5": "d36c3a8ec250175d62117b6e49959f14",
          "sha256": "476955f8ab1bf6e8ca0a9d17678aff4f30559e0aff0863a730bc7cf06b78c290"
        },
        "downloads": -1,
        "filename": "QtSLIX-1.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "d36c3a8ec250175d62117b6e49959f14",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 35530,
        "upload_time": "2022-01-26T09:29:49",
        "upload_time_iso_8601": "2022-01-26T09:29:49.514497Z",
        "url": "https://files.pythonhosted.org/packages/8e/df/715e7016f0e82a7a67a367250359c77f45704015d565d349f4266b0be16f/QtSLIX-1.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "17caf82445aa777c77f0bdbcb40e70ce8141520d375a0057589490ea70aa6b10",
        "md5": "82145f916ec8168b4d17baffb537cb81",
        "sha256": "3473a03b53f09b714eb9d5734c5f5519ad28e63faafc7b7b5f7209c21ea9acc3"
      },
      "downloads": -1,
      "filename": "QtSLIX-1.0.2-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "82145f916ec8168b4d17baffb537cb81",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6",
      "size": 27750,
      "upload_time": "2022-01-26T09:29:47",
      "upload_time_iso_8601": "2022-01-26T09:29:47.970729Z",
      "url": "https://files.pythonhosted.org/packages/17/ca/f82445aa777c77f0bdbcb40e70ce8141520d375a0057589490ea70aa6b10/QtSLIX-1.0.2-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "8edf715e7016f0e82a7a67a367250359c77f45704015d565d349f4266b0be16f",
        "md5": "d36c3a8ec250175d62117b6e49959f14",
        "sha256": "476955f8ab1bf6e8ca0a9d17678aff4f30559e0aff0863a730bc7cf06b78c290"
      },
      "downloads": -1,
      "filename": "QtSLIX-1.0.2.tar.gz",
      "has_sig": false,
      "md5_digest": "d36c3a8ec250175d62117b6e49959f14",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 35530,
      "upload_time": "2022-01-26T09:29:49",
      "upload_time_iso_8601": "2022-01-26T09:29:49.514497Z",
      "url": "https://files.pythonhosted.org/packages/8e/df/715e7016f0e82a7a67a367250359c77f45704015d565d349f4266b0be16f/QtSLIX-1.0.2.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}