{
  "info": {
    "author": "Kaiguang Zhao",
    "author_email": "zhao.1423@osu.edu",
    "bugtrack_url": null,
    "classifiers": [
      "Intended Audience :: Science/Research",
      "License :: OSI Approved :: MIT License",
      "Programming Language :: Python",
      "Programming Language :: Python :: 3.10",
      "Programming Language :: Python :: 3.11",
      "Programming Language :: Python :: 3.7",
      "Programming Language :: Python :: 3.8",
      "Programming Language :: Python :: 3.9",
      "Topic :: Scientific/Engineering",
      "Topic :: Scientific/Engineering :: Artificial Intelligence",
      "Topic :: Scientific/Engineering :: Atmospheric Science",
      "Topic :: Scientific/Engineering :: Hydrology"
    ],
    "description": "# Rbeast: A Python package for Bayesian changepoint detection and time series decomposition\n\n \n####  BEAST (Bayesian Estimator of Abrupt change, Seasonality, and Trend) is a fast, generic Bayesian model averaging algorithm to decompose time series or 1D sequential data into individual components, such as abrupt changes, trends, and periodic/seasonal variations, as described in <ins>[Zhao et al. (2019)](https://go.osu.edu/beast2019)</ins>. BEAST is useful for *changepoint detection (e.g., breakpoints, structural breaks, regime shifts, or anomalies), trend analysis, time series decomposition (e.g., trend vs seasonality), time series segmentation, and interrupted time series analysis*. See a list of <a href=\"#publicationid\"> selected studies using BEAST </a>.\n\n**Quick Installation**\n> BEAST was impemented in C/C++ but accessible from  R, Python, and Matlab.  Run the following to install:\n\n* Python:   **`pip install Rbeast`**   \n* Matlab:  **`eval(webread('http://b.link/rbeast',weboptions('cert','')))`**  \n* R lang:  **`install.packages(\"Rbeast\")`** \n\n\n   \n**Quick Usage**\n\n> One-liner code for Python, Matlab and R. Check below or [github.com/zhaokg/Rbeast](https://github.com/zhaokg/Rbeast) for more details.\n```\n# Python example\nimport Rbeast as rb; (Nile, Year)=rb.load_example('nile'); o=rb.beast(Nile,season='none'); rb.plot(o)\n\n# Matlab example\nload('Nile'); o = beast(Nile, 'season','none'); plotbeast(o)\n\n# R example\nlibrary(Rbeast); data(Nile); o = beast(Nile); plot(o)\n```\n\n\n\n## Installation for Python\n\n<p  align=\"left\">   \n <a href= \"https://github.com/zhaokg/Rbeast\"> <img src=\"https://img.shields.io/static/v1?style=plastic&logo=github&label=see also&message=github.com/zhaokg/Rbeast&color=brightgreen\" height=\"20\"></a>\n</p> \n\nA package **`Rbeast`** has been deposited here at PyPI: https://pypi.org/project/Rbeast/. Run the command below in a console to install:\n \n  ```python\n    pip install Rbeast\n  ```\n  Currently, a binary wheel file was built only for Windows and Python 3.8. For other OS platforms or Python versions, the installation requires a compiler to build the package from the C/C++ code, which is a hassle-free process in Linux (requiring gcc) or Mac (requiring xcode). If you want to force the installation from the source, please run:\n  \n  ```python\n  pip install Rbeast --no-binary :none:\n  ```\n \n  If needed, contact Kaiguang Zhao (zhao.1423@osu.edu) to help build the package for your specific OS platforms and Python versions.\n\n ## Run and test Rbeast in Python\n\nImport the Rbeast package as `rb`:\n  ```python\nimport Rbeast as rb\n  ```\nThe first example is annual streamflow of the River Nile, starting from Year 1871. As annual observations, it has no periodic component (i.e., `season='none'`).\n  ```python\nnile, year = rb.load_example('nile')\no          = rb.beast( nile, start=1871, season='none')\nrb.plot(o, title='Annual streamflow of the Nile River')\nrb.print(o)\no  # see a list of output fields in the output variable o\n```\n  ![](  https://github.com/zhaokg/Rbeast/raw/master/Python/Nile.png)\n\n The second example is a monthly time series of the Google Search popularity of `beach` over the US. This time series is reguarly-spaced (i.e., deltat=`1 month` =`1/12 year`); it has a cyclyic component with a period of 1 year (e.g., freq = `period / deltat` =  1 year / 1 month = 1/(1/12) = 12).\n \n > We follow R's terminology to use `freq` to refer to the number of data points per `period` -- freq = period/deltaT; apparently, this differs from the standard definiton in physics -- freq = 1/period.\n  ```python\nbeach, year = rb.load_example('beach')\no = rb.beast(beach, start= 2004, deltat=1/12, freq =12)\nrb.plot(o)\nrb.print(o)\n  ```\n  ![](  https://github.com/zhaokg/Rbeast/raw/master/Python/beach.png)\n  The third example is a stack of 484 satellite NDVI images over time, with a spatial dimenion of 10 rows x 20 cols: Each pixel is an irregular time series of 484 NDVI values with periodic variations at a period of 1.0 year. When running, BEAST will first aggragate the irregular time series into regular ones at a specified time interaval of `deltat` (in this example, we choose `deltat`=`1/12 year` =`1 month`, but you may choose other intervals, depending on the needs).\n\n  ```python \nndvi, year, datestr = rb.load_example('ndvi')\n\nmetadata      = rb.args()         # create an empty object to stuff the attributes: \"metadata  = lambda: None\" also works\nmetadata.isRegular      = False   # data is irregularly-spaced\nmetadata.time           = year    # times of individulal images/data points: the unit here is fractional year (e.g., 2004.232)\nmetadata.deltaTime      = 1/12    # regular interval used to aggregate the irregular time series (1/12 = 1/12 year = 1 month)\nmetadata.period         = 1.0     # the period is 1.0 year, so freq= 1.0 /(1/12) = 12 data points per period\nmetadata.whichDimIsTime = 1       # the dimension of the input ndvi is (484,10,20): which dim refers to the time. whichDimIsTime is a 1-based index  \n\no = rb.beast123(ndvi, metadata, [], [], []) # beast123(data, metadata, prior, mcmc, extra): default values used if not supplied\n\nrb.print(o[5, 11])                 # print the (6-th row, 12-th col) pixel: Python uses 0-based indices.\nrb.plot(o[5, 11])                  #  plot the (6-th row, 12-th col) pixel: Python uses 0-based indices.\n\nfigure, axes = rb.plot(o[5, 11])   # plot the (6-th row, 12-th col) pixel:  Python uses 0-based indices.\nrb.plot( o[5, 12], fig = figure)   # plot the (6-th row, 13-th col) pixel: Setting fig=figure will use the existing figure to plot\n  ```\n\nBelow is another way to supply the time info:\n    \n  ```python \nndvi, year, datestr = rb.load_example('ndvi')\n\nmetadata      = lambda: None         # create an empty object to stuff the attributes: \"metadata  = rb.args()  \" also works\nmetadata.isRegular      = False      # data is irregularly-spaced\nmetadata.time           = rb.args( ) # create an empty object to stuff the 'datestr' and 'strfmt' attributes\nmetadata.time.datestr   = datestr    # datestr is a list of file names （e.g., s2_ndvi_2018-01-03.tif) that contain the date info\nmetadata.time.strfmt    = 'xx_xxxx_YYYY-mm-dd.xxx'  # the format used to extract the year (YYYY), month (mm), and day (dd) from the strings\nmetadata.deltaTime      = 1/12    # regular interval used to aggregate the irregular time series (1/12 = 1/12 year = 1 month)\nmetadata.period         = 1.0     # the period is 1.0 year, so freq= 1.0 /(1/12) = 12 data points per period\nmetadata.whichDimIsTime = 1       # the dimension of the input ndvi is (484,10,20): which dim refers to the time. whichDimIsTime is a 1-based index  \n\n\nextra = rb.args(                             # a set of options to specify the outputs or computational configurations\n                 dumpInputData    = True,    # make a copy of the aggregated input data in the beast ouput\n                 numThreadsPerCPU = 2,       # Paralell  computing: use 2 threads per cpu core\n                 numParThreads    = 0       # `0` means using all CPU cores: total num of ParThreads = numThreadsPerCPU * core Num           \n                )                 \n\no = rb.beast123(ndvi, metadata, [], [], extra) # beast123(data, metadata, prior, mcmc, extra): default values used for prior and mcmc if missing\n\n\n\n ```\n   \n\n## Description\nInterpretation of time series data is affected by model choices. Different models can give different or even contradicting estimates of patterns, trends, and mechanisms for the same data–a limitation alleviated by the Bayesian estimator of abrupt change,seasonality, and trend (BEAST) of this package. BEAST seeks to improve time series decomposition by forgoing the \"single-best-model\" concept and embracing all competing models into the inference via a Bayesian model averaging scheme. It is a flexible tool to uncover abrupt changes (i.e., change-points), cyclic variations (e.g., seasonality), and nonlinear trends in time-series observations. BEAST not just tells when changes occur but also quantifies how likely the detected changes are true. It detects not just piecewise linear trends but also arbitrary nonlinear trends. BEAST is applicable to real-valued time series data of all kinds, be it for remote sensing, finance, public health, economics, climate sciences, ecology, and hydrology. Example applications include its use to identify regime shifts in ecological data, map forest disturbance and land degradation from satellite imagery, detect market trends in economic data, pinpoint anomaly and extreme events in climate data, and unravel system dynamics in biological data. Details on BEAST are reported in [Zhao et al. (2019)](https://go.osu.edu/beast2019). The paper is available at https://go.osu.edu/beast2019.\n\n## Reference\n* Zhao, K., Wulder, M. A., Hu, T., Bright, R., Wu, Q., Qin, H., Li, Y., Toman, E., Mallick B., Zhang, X., & Brown, M. (2019). [Detecting change-point, trend, and seasonality in satellite time series data to track abrupt changes and nonlinear dynamics: A Bayesian ensemble algorithm.](https://go.osu.edu/beast2019) Remote Sensing of Environment, 232, 111181. (the BEAST paper) \n\n* Zhao, K., Valle, D., Popescu, S., Zhang, X. and Mallick, B., 2013. [Hyperspectral remote sensing of plant biochemistry using Bayesian model averaging with variable and band selection](https://www.academia.edu/download/55199778/Hyperspectral-biochemical-Bayesian-chlorophyll-carotenoid-LAI-water-content-foliar-pigment.pdf). Remote Sensing of Environment, 132, pp.102-119. (the mcmc sampler used for BEAST)\n\n* Hu, T., Toman, E.M., Chen, G., Shao, G., Zhou, Y., Li, Y., Zhao, K. and Feng, Y., 2021. [Mapping fine-scale human disturbances in a working landscape with Landsat time series on Google Earth Engine](https://pages.charlotte.edu/gang-chen/wp-content/uploads/sites/184/2021/05/Hu_2021_BEAST-HF-s.pdf). ISPRS Journal of Photogrammetry and Remote Sensing, 176, pp.250-261. (an application paper)\n\n\n----\n<a name=publication></a>\n\n<h2 id=\"publicationid\"> Selected publications using BEAST/Rbeast  </h2> \n \n Despite being published originally for ecological and enviornmental applications, BEAST is developed as a generic tool applicable to time series or time-series-like data arising from all disciplines. BEAST is not a heuristic algorithm but a rigorous statistical model. Below is a short list of peer-reviewed pulications that used BEAST for statistical data analysis.\n \n| Discipline | Publication Title |\n| --- | --- |\n| Remote Sensing| *Li, J., Li, Z., Wu, H., and You, N., 2022. [Trend, seasonality, and abrupt change detection method for land surface temperature time-series analysis: Evaluation and improvement](https://www.sciencedirect.com/science/article/pii/S0034425722003285?casa_token=wj-jESXHBrQAAAAA:MPS5ThIzaw2Tvveml2fKYPzVmul24NTF11uGZpeBMTOfwtdA_hpx2OSwGR7686QPiN5xO1pHKQ). Remote Sensing of Environment, 10.1016/j.rse.2022.113222*|\n| Hydraulic Engineering | *Xu, X., Yang, J., Ma, C., Qu, X., Chen, J. and Cheng, L., 2022. Segmented modeling method of dam displacement based on BEAST time series decomposition. Measurement, 202, p.111811.* |\n| Environmental Sciences| *Nickerson, S., Chen, G., Fearnside, P., Allan, C.J., Hu, T., de Carvalho, L.M. and Zhao, K., 2022. [Forest loss is significantly higher near clustered small dams than single large dams per megawatt of hydroelectricity installed in the Brazilian Amazon](https://iopscience.iop.org/article/10.1088/1748-9326/ac8236/meta). Environmental Research Letters.*|\n|   Population Ecology  | *Henderson, P. A. (2021). [Southwood's Ecological Methods (5th edition)](https://www.google.com/books/edition/Southwood_s_Ecological_Methods/snEhEAAAQBAJ?hl=en&gbpv=1&pg=PA473&printsec=frontcover). Oxford University Press., page 475-476*|\n|Political Science|*Reuning, K., Whitesell, A. and Hannah, A.L., 2022. [Facebook algorithm changes may have amplified local republican parties](https://journals.sagepub.com/doi/full/10.1177/20531680221103809). Research & Politics, 9(2), p.20531680221103809.*|\n|  Climate Sciences|*Duke, N.C., Mackenzie, J.R., Canning, A.D., Hutley, L.B., Bourke, A.J., Kovacs, J.M., Cormier, R., Staben, G., Lymburner, L. and Ai, E., 2022. [ENSO-driven extreme oscillations in mean sea level destabilise critical shoreline mangroves—An emerging threat](https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000037). PLOS Climate, 1(8), p.e000003*|\n| Finance|*Candelaria, Christopher A., Shelby M. McNeill, and Kenneth A. Shores. (2022). What is a School Finance Reform? Uncovering the ubiquity and diversity of school finance reforms using a Bayesian changepoint estimator.(EdWorkingPaper: 22-587). Retrieved from Annenberg Institute at Brown University: https://doi.org/10.26300/4vey-3w10*|\n| Public health|*Linnell, K., Fudolig, M., Schwartz, A., Ricketts, T.H., O'Neil-Dunne, J.P., Dodds, P.S. and Danforth, C.M., 2022. [Spatial changes in park visitation at the onset of the pandemic](https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0000766). arXiv preprint arXiv:2205.15937.*|\n|Biometerology|*Li, Y., Liu, Y., Bohrer, G., Cai, Y., Wilson, A., Hu, T., Wang, Z. and Zhao, K., 2022. [Impacts of forest loss on local climate across the conterminous United States: Evidence from satellite time-series observations](https://www.sciencedirect.com/science/article/pii/S0048969721047264?casa_token=X9fIQLvFlXcAAAAA:0nk-D2dV1cXmaIxJ7Tp79sx16npj5kgkDFjM4N2roh_akQyIfIkRaHfxPjPtp5v5dGWo-GFBcA). Science of The Total Environment, 802, p.149651.*|\n| Applied Math|*Ferguson, Daniel, and François G. Meyer. [Probability density estimation for sets of large graphs with respect to spectral information using stochastic block models](https://arxiv.org/abs/2207.02168). arXiv preprint arXiv:2207.02168 (2022).*|\n| Hydrology | *Zohaib, M. and Choi, M., 2020. [Satellite-based global-scale irrigation water use and its contemporary trends](https://www.sciencedirect.com/science/article/pii/S0048969720302291?casa_token=pPXP5Q9glsMAAAAA:QBZq1T9FXB3JgnHwM9ug1sIDSMd2u7Jl4L2qA0fCvCwtAGcB_WhAbgTjEZBO9B_WXxtu7WKarA). Science of The Total Environment, 714, p.136719.* |\n| Energy Engineering |*Lindig, S., Theristis, M. and Moser, D., 2022. Best practices for photovoltaic performance loss rate calculations. Progress in Energy, 4(2), p.022003.*|\n|Virology|*Shen, L., Sun, M., Song, S., Hu, Q., Wang, N., Ou, G., Guo, Z., Du, J., Shao, Z., Bai, Y. and Liu, K., 2022. [The impact of anti-COVID19 nonpharmaceutical interventions on hand, foot, and mouth disease—A spatiotemporal perspective in Xi'an](https://onlinelibrary.wiley.com/doi/abs/10.1002/jmv.27715?casa_token=9mLRmQ7JqRIAAAAA:E2IR7q-3EqsidsYVEwiQBfJo5K5Hqx3mxKfsyZOW_ZMcWmD94B7hox6p7d9KCboZS87OZVAVj5RZHUY), northwestern China. Journal of medical virology.*|\n| Pharmaceutical Sciences|*Patzkowski, M.S., Costantino, R.C., Kane, T.M., Nghiem, V.T., Kroma, R.B. and Highland, K.B., 2022. Military Health System Opioid, Tramadol, and Gabapentinoid Prescription Volumes Before and After a Defense Health Agency Policy Release. Clinical Drug Investigation, pp.1-8.*|\n| Geography|*Cai, Y., Liu, S. and Lin, H., 2020. Monitoring the vegetation dynamics in the Dongting Lake Wetland from 2000 to 2019 using the BEAST algorithm based on dense Landsat time series. Applied Sciences, 10(12), p.4209.*|\n| Oceanography|*Pitarch, J., Bellacicco, M., Marullo, S. and Van Der Woerd, H.J., 2021. [Global maps of Forel–Ule index, hue angle and Secchi disk depth derived from 21 years of monthly ESA Ocean Colour Climate Change Initiative data](https://essd.copernicus.org/articles/13/481/2021/). Earth System Science Data, 13(2), pp.481-490.*|\n|Photovoltaics|*Micheli, L., Theristis, M., Livera, A., Stein, J.S., Georghiou, G.E., Muller, M., Almonacid, F. and Fernández, E.F., 2021. Improved PV soiling extraction through the detection of cleanings and change points. IEEE Journal of Photovoltaics, 11(2), pp.519-526.*|\n|Climate Sciences|*White, J.H., Walsh, J.E. and Thoman Jr, R.L., 2021. [Using Bayesian statistics to detect trends in Alaskan precipitation](https://rmets.onlinelibrary.wiley.com/doi/abs/10.1002/joc.6946?casa_token=9axTmIRMPBsAAAAA:1rFQAEjswrqRaHwXt4GleEtbsiZUbOTwk4zk9C5mCm9STPCvdSe5nnc1pgYxfuc6t7sZZ4jsS05K06Q). International Journal of Climatology, 41(3), pp.2045-2059.*|\n|Field Hydrology|*Merk, M., Goeppert, N. and Goldscheider, N., 2021. [Deep desiccation of soils observed by long-term high-resolution measurements on a large inclined lysimeter](https://hess.copernicus.org/articles/25/3519/2021/). Hydrology and Earth System Sciences, 25(6), pp.3519-3538.*|\n|Forest Ecology|*Moreno-Fernández, D., Viana-Soto, A., Camarero, J.J., Zavala, M.A., Tijerín, J. and García, M., 2021. Using spectral indices as early warning signals of forest dieback: The case of drought-prone Pinus pinaster forests. Science of The Total Environment, 793, p.148578.*|\n|Atmospheric Sciences|*Tingwei, C., Tingxuan, H., Bing, M., Fei, G., Yanfang, X., Rongjie, L., Yi, M. and Jie, Z., 2021. Spatiotemporal pattern of aerosol types over the Bohai and Yellow Seas observed by CALIOP. Infrared and Laser Engineering, 50(6), p.20211030.*|\n|Terrestrial ecology|*Dashti, H., Pandit, K., Glenn, N.F., Shinneman, D.J., Flerchinger, G.N., Hudak, A.T., de Graaf, M.A., Flores, A., Ustin, S., Ilangakoon, N. and Fellows, A.W., 2021. [Performance of the ecosystem demography model (EDv2. 2) in simulating gross primary production capacity and activity in a dryland study area](https://www.sciencedirect.com/science/article/pii/S0168192320303725?casa_token=01dOFp15Vg4AAAAA:NpXogEEWfNjgkR-jzE5fItgIlqDh5Ll-cdwQihcibCRiWbOiXwEE_WQ3YtAQFjQ_B9t4W2T8og). Agricultural and Forest Meteorology, 297, p.108270.*|\n|Environmental Engineering|*Bainbridge, R., Lim, M., Dunning, S., Winter, M.G., Diaz-Moreno, A., Martin, J., Torun, H., Sparkes, B., Khan, M.W. and Jin, N., 2022. Detection and forecasting of shallow landslides: lessons from a natural laboratory. Geomatics, Natural Hazards and Risk, 13(1), pp.686-704.*|\n|Hydrology|*Yang, X., Tian, S., You, W. and Jiang, Z., 2021. Reconstruction of continuous GRACE/GRACE-FO terrestrial water storage anomalies based on time series decomposition. Journal of Hydrology, 603, p.127018.*|\n|Landscape Ecology|*Adams, B.T., Matthews, S.N., Iverson, L.R., Prasad, A.M., Peters, M.P. and Zhao, K., 2021. Spring phenological variability promoted by topography and vegetation assembly processes in a temperate forest landscape. Agricultural and Forest Meteorology, 308, p.108578.*|\n\n \n\n## Reporting Bugs or getting help\n\nBEAST is distributed as is and without warranty of suitability for application. The one distributed above is still a beta version, with potential room for further improvement. If you encounter flaws with the software (i.e. bugs) please report the issue. Providing a detailed description of the conditions under which the bug occurred will help to identify the bug, you can directly email its maintainer Dr. Kaiguang Zhao at <zhao.1423@osu.edu>. Alternatively, Use the [Issues tracker](https://github.com/zhaokg/Rbeast/issues) on GitHub to report issues with the software and to request feature enhancements. \n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/zhaokg/Rbeast",
    "keywords": "changepoint,structural breaks,time series decompositiontime series analysis,trend analysis",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "Rbeast",
    "package_url": "https://pypi.org/project/Rbeast/",
    "platform": null,
    "project_url": "https://pypi.org/project/Rbeast/",
    "project_urls": {
      "Homepage": "https://github.com/zhaokg/Rbeast"
    },
    "release_url": "https://pypi.org/project/Rbeast/0.1.13/",
    "requires_dist": [
      "numpy",
      "matplotlib (>=2.2.0)"
    ],
    "requires_python": ">=3.5",
    "summary": "Bayesian changepoint detection and time series decomposition",
    "version": "0.1.13",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 15694893,
  "releases": {
    "0.1.13": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d4992ae4c248a55dc3ff2fec3e4c313b61907a535e2437f3abd7b7fd8057aab5",
          "md5": "1ac76f10b61855e8823448a92a1c4ff7",
          "sha256": "8ae7ce506c13832bbc683fb8381695f5a1e1ac37f73d5bc32890763cae6647f2"
        },
        "downloads": -1,
        "filename": "Rbeast-0.1.13-cp310-cp310-win_amd64.whl",
        "has_sig": false,
        "md5_digest": "1ac76f10b61855e8823448a92a1c4ff7",
        "packagetype": "bdist_wheel",
        "python_version": "cp310",
        "requires_python": ">=3.5",
        "size": 374506,
        "upload_time": "2022-11-08T06:45:26",
        "upload_time_iso_8601": "2022-11-08T06:45:26.490793Z",
        "url": "https://files.pythonhosted.org/packages/d4/99/2ae4c248a55dc3ff2fec3e4c313b61907a535e2437f3abd7b7fd8057aab5/Rbeast-0.1.13-cp310-cp310-win_amd64.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c45c566a6a17e2162608ddc804b7c7188c6634bf4192baf04a390c0bf320e6b1",
          "md5": "d34867aaf0d047cb08913d744e8c6d5d",
          "sha256": "8e02b20e69a1e46124831667663ea558ad11247f65e940b66df4dece02397dc9"
        },
        "downloads": -1,
        "filename": "Rbeast-0.1.13-cp311-cp311-win_amd64.whl",
        "has_sig": false,
        "md5_digest": "d34867aaf0d047cb08913d744e8c6d5d",
        "packagetype": "bdist_wheel",
        "python_version": "cp311",
        "requires_python": ">=3.5",
        "size": 374500,
        "upload_time": "2022-11-08T07:09:24",
        "upload_time_iso_8601": "2022-11-08T07:09:24.137356Z",
        "url": "https://files.pythonhosted.org/packages/c4/5c/566a6a17e2162608ddc804b7c7188c6634bf4192baf04a390c0bf320e6b1/Rbeast-0.1.13-cp311-cp311-win_amd64.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "465004ee883cee8ebe9ced57d78f5e335730ce0cebb4b2ee45911201d964265c",
          "md5": "bd7eff0ddecb2be53354c3b1232055c8",
          "sha256": "8d7fe17334bb722daad13286e6786d4000fdf7d5fb6a190d3811c0387fa4ab35"
        },
        "downloads": -1,
        "filename": "Rbeast-0.1.13-cp38-cp38-win_amd64.whl",
        "has_sig": false,
        "md5_digest": "bd7eff0ddecb2be53354c3b1232055c8",
        "packagetype": "bdist_wheel",
        "python_version": "cp38",
        "requires_python": ">=3.5",
        "size": 372342,
        "upload_time": "2022-10-05T03:11:27",
        "upload_time_iso_8601": "2022-10-05T03:11:27.344346Z",
        "url": "https://files.pythonhosted.org/packages/46/50/04ee883cee8ebe9ced57d78f5e335730ce0cebb4b2ee45911201d964265c/Rbeast-0.1.13-cp38-cp38-win_amd64.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c56be6f0ef94f64ac4f8a6fecfebda48f668d3003beafd0b228be6074d3e5acb",
          "md5": "718b4fd7a153e2463530e839f084f26e",
          "sha256": "bc285cbb5683c93ea10cf3f37ca57e1a2f6b6a639ff927cfded10ec84b911faf"
        },
        "downloads": -1,
        "filename": "Rbeast-0.1.13.tar.gz",
        "has_sig": false,
        "md5_digest": "718b4fd7a153e2463530e839f084f26e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.5",
        "size": 507855,
        "upload_time": "2022-10-05T03:11:30",
        "upload_time_iso_8601": "2022-10-05T03:11:30.192372Z",
        "url": "https://files.pythonhosted.org/packages/c5/6b/e6f0ef94f64ac4f8a6fecfebda48f668d3003beafd0b228be6074d3e5acb/Rbeast-0.1.13.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "d4992ae4c248a55dc3ff2fec3e4c313b61907a535e2437f3abd7b7fd8057aab5",
        "md5": "1ac76f10b61855e8823448a92a1c4ff7",
        "sha256": "8ae7ce506c13832bbc683fb8381695f5a1e1ac37f73d5bc32890763cae6647f2"
      },
      "downloads": -1,
      "filename": "Rbeast-0.1.13-cp310-cp310-win_amd64.whl",
      "has_sig": false,
      "md5_digest": "1ac76f10b61855e8823448a92a1c4ff7",
      "packagetype": "bdist_wheel",
      "python_version": "cp310",
      "requires_python": ">=3.5",
      "size": 374506,
      "upload_time": "2022-11-08T06:45:26",
      "upload_time_iso_8601": "2022-11-08T06:45:26.490793Z",
      "url": "https://files.pythonhosted.org/packages/d4/99/2ae4c248a55dc3ff2fec3e4c313b61907a535e2437f3abd7b7fd8057aab5/Rbeast-0.1.13-cp310-cp310-win_amd64.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "c45c566a6a17e2162608ddc804b7c7188c6634bf4192baf04a390c0bf320e6b1",
        "md5": "d34867aaf0d047cb08913d744e8c6d5d",
        "sha256": "8e02b20e69a1e46124831667663ea558ad11247f65e940b66df4dece02397dc9"
      },
      "downloads": -1,
      "filename": "Rbeast-0.1.13-cp311-cp311-win_amd64.whl",
      "has_sig": false,
      "md5_digest": "d34867aaf0d047cb08913d744e8c6d5d",
      "packagetype": "bdist_wheel",
      "python_version": "cp311",
      "requires_python": ">=3.5",
      "size": 374500,
      "upload_time": "2022-11-08T07:09:24",
      "upload_time_iso_8601": "2022-11-08T07:09:24.137356Z",
      "url": "https://files.pythonhosted.org/packages/c4/5c/566a6a17e2162608ddc804b7c7188c6634bf4192baf04a390c0bf320e6b1/Rbeast-0.1.13-cp311-cp311-win_amd64.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "465004ee883cee8ebe9ced57d78f5e335730ce0cebb4b2ee45911201d964265c",
        "md5": "bd7eff0ddecb2be53354c3b1232055c8",
        "sha256": "8d7fe17334bb722daad13286e6786d4000fdf7d5fb6a190d3811c0387fa4ab35"
      },
      "downloads": -1,
      "filename": "Rbeast-0.1.13-cp38-cp38-win_amd64.whl",
      "has_sig": false,
      "md5_digest": "bd7eff0ddecb2be53354c3b1232055c8",
      "packagetype": "bdist_wheel",
      "python_version": "cp38",
      "requires_python": ">=3.5",
      "size": 372342,
      "upload_time": "2022-10-05T03:11:27",
      "upload_time_iso_8601": "2022-10-05T03:11:27.344346Z",
      "url": "https://files.pythonhosted.org/packages/46/50/04ee883cee8ebe9ced57d78f5e335730ce0cebb4b2ee45911201d964265c/Rbeast-0.1.13-cp38-cp38-win_amd64.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "c56be6f0ef94f64ac4f8a6fecfebda48f668d3003beafd0b228be6074d3e5acb",
        "md5": "718b4fd7a153e2463530e839f084f26e",
        "sha256": "bc285cbb5683c93ea10cf3f37ca57e1a2f6b6a639ff927cfded10ec84b911faf"
      },
      "downloads": -1,
      "filename": "Rbeast-0.1.13.tar.gz",
      "has_sig": false,
      "md5_digest": "718b4fd7a153e2463530e839f084f26e",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.5",
      "size": 507855,
      "upload_time": "2022-10-05T03:11:30",
      "upload_time_iso_8601": "2022-10-05T03:11:30.192372Z",
      "url": "https://files.pythonhosted.org/packages/c5/6b/e6f0ef94f64ac4f8a6fecfebda48f668d3003beafd0b228be6074d3e5acb/Rbeast-0.1.13.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}