{
  "info": {
    "author": "Vincent Morello",
    "author_email": "vmorello@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: MacOS :: MacOS X",
      "Operating System :: Unix",
      "Programming Language :: C",
      "Programming Language :: Python :: 3.6",
      "Programming Language :: Python :: 3.7",
      "Programming Language :: Python :: 3.8",
      "Programming Language :: Python :: 3.9",
      "Topic :: Scientific/Engineering :: Astronomy"
    ],
    "description": "[![arXiv](http://img.shields.io/badge/astro.ph-2004.03701-B31B1B.svg)](https://arxiv.org/abs/2004.03701)   ![License](https://img.shields.io/badge/License-MIT-green.svg)   ![Python versions](https://img.shields.io/pypi/pyversions/riptide-ffa.svg)   [![Build Status](https://travis-ci.com/v-morello/riptide.svg?branch=master)](https://travis-ci.com/v-morello/riptide)   [![codecov](https://codecov.io/gh/v-morello/riptide/branch/master/graph/badge.svg)](https://codecov.io/gh/v-morello/riptide)\n\n# riptide\n\n__riptide__ (\"sea**r**ch**i**ng for **p**ulsars in the **ti**me **d**omain\") is a pulsar searching package implementing the Fast Folding Algorithm (FFA), the theoretically optimal search method for periodic signals. Its interface is entirely in python while the core algorithms are implemented in C. riptide provides:  \n\n* A library of functions and classes to use interactively to process dedispersed time series  \n* A pipeline executable to process a set of DM trials and output a list of candidate files and other useful data products  \n\n## Citation\n\nIf using ``riptide`` contributes to a project that leads to a scientific publication, please cite the article:  \n[\"Optimal periodicity searching: Revisiting the Fast Folding Algorithm for large scale pulsar surveys\"](https://arxiv.org/abs/2004.03701)\n\n\n## Sensitivity of the FFA\n\nThe article covers the topic of the FFA's sensitivity in theory, here is a practical example on a faint source. Below is an L-band observation of [PSR J1932-3655](https://www.atnf.csiro.au/people/joh414/ppdata/1932-3655.html) from the [SUPERB survey](https://arxiv.org/abs/1706.04459), significantly offset from the true position of the source. The first plot was obtained by folding the observation using the known ephemeris of the pulsar with [PSRCHIVE](http://psrchive.sourceforge.net/). This is one of the faintest known pulsar instances identifiable in the survey.\n\n![psrchive_plot](images/J1932-3655_psrchive_small.png \"PSRCHIVE direct ephemeris folding\")  \n\nAnd below is a blind detection of the pulsar, running `riptide` on the same observation:  \n![riptide_plot](images/J1932-3655_blind_detection.png \"riptide blind detection\")\n\n\n## Documentation\n\nA quickstart guide, a pipeline configuration tutorial and the full API documentation can be found [here](https://riptide-ffa.readthedocs.io).\n\n## Installation\n\nThe easiest method is to use pip install, which pulls the latest release from the python package index and installs all required dependencies:\n```\npip install riptide-ffa\n```\n\nThe alternative is to clone the repository, especially if you want the absolute latest version:\n```bash\ngit clone https://github.com/v-morello/riptide\n```\n\nAnd then in the base directory of `riptide` run\n\n```bash\nmake install\n```\n\nThis simply runs ``pip install`` in [editable mode](https://pip.pypa.io/en/latest/reference/pip_install/#editable-installs), which means you can freely edit the code. It also installs any required dependencies with ``pip`` that are not present already. The installer also adds links to two command-line apps in your python environment using [console_scripts entry points](https://python-packaging.readthedocs.io/en/latest/command-line-scripts.html):  \n\n* `rffa`: The full end-to-end pipeline to search multiple DM trials, see below for details on how to use it.\n* `rseek`: A lightweight app to search a single time series and print significant candidates found, useful for quick data checks.\n\nYou may check that it all works by typing:  \n```\nrffa -h\nrseek -h\n```\nAnd you should see the full help of both applications.\n\n\n\n\n\n\n# Changelog\nAll notable changes to this project will be documented in this file.\n\nThe format is based on [Keep a Changelog](https://keepachangelog.com/en/1.0.0/),\nand this project adheres to [Semantic Versioning](https://semver.org/spec/v2.0.0.html).\n\n## 0.2.4 - 2022-02-03\n\nThis version fixes a bug where all the functions in the python bindings to the C++ code (exposed in `riptide.libcpp` on the Python side) assume that their input numpy arrays are contiguous in memory. In practice, passing a column slice of a two-dimensional `float32` array to `fast_running_median` was found to produce incorrect results: the rather than reading `data[:, col_index]`, the code read `data[0, col_index:col_index+num_cols]`. The issue would only trigger on the `float32` type, because otherwise an implicit copy (contiguous in memory) of the input was created.\n\nThanks to Akshay Suresh for finding the bug and reporting it.\n\n### Fixed\n- All C++ functions in `python_bindings.cpp` now explicitly check that all input arrays are contiguous in memory, and throw `std::invalid_argument` otherwise (maps to `ValueError` in Python).\n- The size equality check of the input arrays for the `rollback` function in `python_bindings.cpp` is now correct\n\n### Added\n- `running_median` function that wraps its counterpart in the C++ library. It ensures that the array passed to it is contiguous in memory, and if not, makes a temporary contiguous copy before doing so.\n- Unit test that checks the correctness of `running_median` on non-contiguous data slices.\n- The `riptide` module now exposes the functions `running_median` and `fast_running_median`. Document how boundary conditions are handled in running median calculation. Added entries for both functions in the documentation, in Kernel Functions section.\n\n### Changed\n- Renamed the file `running_median.py` to `running_medians.py` to avoid name collisions.\n\n\n## 0.2.3 - 2021-08-01\n\n### Updated\n- Packaging is now PEP 517/518 compliant\n- Using `setuptools-scm` instead of `versioneer` (which is not maintained anymore) for automatic versioning\n\n\n## 0.2.2 - 2021-07-24\n\n### Added\n- Added full documentation and readthedocs integration. The docs can be found [here](https://riptide-ffa.readthedocs.io).\n- Fixed typos in docstrings, extra docstrings for `Periodogram` class\n\n### Updated\n- Base Dockerfile on python:3.8, ensure all tests pass during the build\n\n### Fixed\n- It is now possible to specify period ranges so that the data are searched at their raw resolution (no downsampling). This corresponds to choosing period range parameters such that `period_min = bins_min x tsamp`. In this case, the code would previously raise an error saying that it could not downsample the data with a factor equal to 1, which was not the intended behaviour.\n- Fixed an issue where the C++ functions `check_trial_widths` and `check_stdnoise` would systematically throw an exception regardless of their input arguments. The issue was occurring with `gcc 8.3.0` on some systems, and appears to have been caused by said functions having a return type `bool` while they actually did not return anything. The functions have `void` return type now.\n\n\n## 0.2.1 - 2020-10-27\n\n### Added\n- Limited support for X-ray and Gamma time series in PRESTO inf/dat format. `TimeSeries.from_presto_inf()` will now correctly read these. However, a warning will be issued when doing so, because `riptide` is currently designed to process data where the background noise is Gaussian. **Be aware that processing high-energy data may produce junk results.**\n\n### Fixed\n- Docstring of `TimeSeries.generate()` was missing the `period` parameter\n\n\n## 0.2.0 - 2020-08-10\n\n**This release contains significant improvements and additions but breaks compatibility with** `v0.1.x`.\n\n### Changed\n- The `ffa_search()` function now only returns two values: the de-reddened `TimeSeries` that was actually searched, and a `Periodogram` object. The `ProcessingPlan` class has been removed.\n- Clean rewrite of all kernels in C++. Python bindings for said kernels are now generated with `pybind11` which requires a lot less boilerplate code. Kernel functions can imported in python from the `riptide.libcpp` submodule.\n- The python function `get_snr()` has been renamed `boxcar_snr()`\n- Moved unit tests to `riptide/tests` so they can be packaged with the rest of the module\n\n\n### Added\n- The `Periodogram` returned by `ffa_search` now has a `foldbins` member, which is the number of phase bins that were used when folding the data for a particular trial period. Using this information, the pipeline now returns the *true* duty cycle of the candidates; it was previously returning only an estimate equal to `width / bins_avg` where `width` was the best pulse width in bins, and `bins_avg = (bins_min + bins_max) / 2`.\n- `running_median()` function in C++, it is around 8x faster than its former python counterpart.\n- Tests for `running_median()`\n- Tests for `boxcar_snr()`\n- DM trial selection by the pipeline is now considerably faster\n- The pipeline now infers the observing min/max frequencies and the number of channels from the input data if possible. It is now recommended to leave the fields `fmin`, `fmax`, and `nchans` blank in the pipeline configuration file. It is necessary to specify these values only when the dedispersed time series data format (e.g. SIGPROC) does not contain that information.\n- In the pipeline configuration file, the minimum and maximum trial DM fields can also be left blank. If so, the minimum and/or maximum DMs of the search are determined by the DM trials available to process.\n- Added careful validation of the pipeline configuration file (using the `schema` library). The pipeline will raise an exception early in the processing if the configuration is invalid, with a helpful error message.\n- Can now run the unit test suite from python code or IPython by calling `riptide.test()`\n\n### Removed\n- Removed `ProcessingPlan` class. It used to be passed to the old C function that was computing the periodogram. Its job is now directly performed by the new C++ function `periodogram()`.\n- Removed old C kernels\n\n\n## 0.1.5 - 2020-05-23\n\n### Changed\n- `find_peaks()` now always returns peaks in decreasing S/N order\n\n### Added\n- `rseek` command-line application that searches a single dedispersed time series and prints a list of significant peaks found\n\n\n## 0.1.4 - 2020-05-03\n\nThis version reduces RAM usage significantly. Trial periods are now stored as double precision floats.\n\n### Fixed\n- Trial periods are now stored as *double* precision floats (`double` in C, `float` in python). When searching very long time series (several hours) and short trial periods, single precision floats were inaccurate enough that small groups of consecutive period trials erroneously ended up having the exact same value. Incorrect detection periods would propagate down the pipeline, and `Candidate` objects could end up being folded with a period slightly offset from the true value.\n\n### Changed\n- The pipeline worker sub-processes now get passed a *file path* to a time series as an input, rather than a full `TimeSeries` object, which saves the cost of communicating a lot of data between processes\n- The buffers used for downsampling and FFA transforming the data when calculating periodograms are now given the smallest possible size. They only need to hold `N / f` data points, where `N` is the number of samples in the raw time series, and `f` the first downsampling factor in the search plan. Buffers were previously given a size of `N` which was often wasteful.\n\n### Added\n- Added option to save pipeline logs to file\n\n\n## 0.1.3 - 2020-04-27\n\n### Fixed\n- Fixed a rare but serious bug in the C function downsample() where the code would attempt to read one element beyond the end of the input array. This would happen only when the downsampling factor was such that `nsamp_input / dsfactor` was exactly an integer. This would cause the last sample in the output to have an absurd value, or a segmentation fault.\n- Fixed a crash in the pipeline that would occur when significant peak clusters were found, but none had a S/N that would exceed the `candidate_filters.snr_min` configuration parameter. Turning the resulting empty list of clusters into a CSV would then fail. \n- Fixed a related problem where clusters whose S/N was below `candidate_filters.snr_min` were not saved to the CSV file, which was not the intended behaviour.\n\n### Added\n- Unit test suite, to be improved and expanded\n- Travis CI\n- Codecov integration\n\n\n## 0.1.2 - 2020-04-15\n\n### Fixed\n- `Metadata` is now correctly carrying the \"tobs\" attribute for TimeSeries loaded from SIGPROC data. This was causing a cryptic error when processing SIGPROC dedispersed time series with the pipeline.\n\n### Added\n- Can now read and process 8-bit SIGPROC data\n- Can now read SIGPROC header keys of boolean type. In particular the \"signed\" key (which defines the signedness of 8-bit SIGPROC data) is now supported by default.\n\n\n## 0.1.1 - 2020-04-08\n\n### Fixed\n- Module should now properly install on OSX, where some C compilation options had to be adapted. `numpy.ctypeslib` also expects shared libraries to have a `.dylib` extension on OSX rather than the linux standard `.so`\n\n\n## 0.1.0 - 2020-04-08\n\n**This release contains major improvements and additions but breaks compatibility with** `v0.0.x`. If you have any ongoing large-scale searches or projects, stick with the older release you were using. Other users should **definitely** use this new version.\n\n### Fixed\n- Ensure that each subprocess spawned by the pipeline consumes only one CPU, as initially intended to achieve optimal CPU usage. In previous versions, some `numpy` functions would attempt to run on all CPUs at once which was detrimental. As a result the pipeline is now considerably faster.\n- The impact of downsampling by a non-integer factor on the noise variance is now correctly dealt with when normalizing the output S/N values. Refer to the paper for details. The difference should be negligible, except when downsampling the original input data by factors close to 1.\n- The Makefile used to build the C sources does not explicitly set `CC=gcc` anymore. The default system compiler will now be used instead. `gcc` will be used by default if the environment variable `CC` is undefined.\n\n### Changed\n- Clean rewrite of peak detection algorithm. It uses the same method as before, but the arguments of the `find_peaks()` function have changed. See docstring.\n- Now using JSON instead of HDF5 as the data product file format. This is vastly easier to maintain and future-proof. Read/write speed and file sizes remain similar.\n- Clean rewrite of the pipeline, which has been improved and runs faster, see below for all related changes.\n    - Improved DM trial selection, now uses a method similar to PRESTO's `DDPlan` to achieve the least expensive DM space coverage\n    - Input de-reddening and normalisation is now common to all search period sub-ranges, further improving pipeline run time\n    - Harmonic flagging is now always performed\n    - Removing harmonics from the output candidate list is now optional\n    - Added option to produce all candidate plots at the end of the pipeline run\n    - Candidate plots look nicer\n    - Saving candidate files and plots is done with multiple CPUs and runs faster\n    - The pipeline configuration file keywords / schema has been adjusted to match all pipeline changes, see example provided and documentation\n- `Candidate` class has been refactored, its attribute and method names have changed\n- Changed name of high level FFA transforms to `ffa1()` and `ffa2()`. \n- Updated signal generation functions so that the 'amplitude' parameter now represents the expected true signal-to-noise ratio\n\n### Added\n- `TimeSeries` now has a `fold()` method that returns a numpy array representing either sub-integrations or a folded profile\n- Timing of all pipeline stages\n- Dynamic versioning using the `versioneer` module. In python, the current version is accessible via `riptide.__version__`\n- Added `ffafreq()` and `ffaprd()` to generate list of FFA transform trial freqs / periods.\n\n### Removed\n- Removed the `SubIntegrations` class which added unneeded complexity, sub-integrations are now represented as a 2D numpy array\n\n\n## 0.0.3 - 2019-11-30\n### Added\n- Full docstring for `ffa_search()`\n\n### Changed\n- Cleaner and faster FFA C kernels, which have been moved to separate files\n- Slight optimisation to S/N calculation, where only the best value across all pulse phases is normalized, instead of normalizing at every phase trial\n- S/N calculation separated into smaller functions\n- Removed OpenMP multithreading from S/N calculation, it was slower in most usual cases. The benefits were visible only for very large input data. As a result, `ffa_search()` does not accept the 'threads' keyword anymore, and the 'threads' keyword has also been removed from the pipeline configuration files (in the 'search' section). Parallelism only happens at the TimeSeries level, i.e. one process per TimeSeries.\n\n### Fixed\n- Reinstated the `--fast-math` compilation option that had been accidentally removed in v0.0.2. The code is now much faster.\n\n\n## 0.0.2 - 2019-11-05\n### Added\n- `riptide` is now properly packaged with a `setup.py` script. Updated installation instructions in `README.md`\n- Updated Dockerfile. Build docker image with `make docker` command.\n\n### Fixed\n- When normalising TimeSeries, use a float64 accumulator when calculating mean and variance. This avoid saturation issues on data with high values, e.g. from 8-bit Parkes UWL observations.\n\n### Changed\n- Improved candidate plots: docstring for `Candidate` class, DM unit on plots, option to subtract the baseline value of the profile before displaying it, option to plot the profile as either a bar or line chart.\n\n## 0.0.1 - 2018-10-25\n### Added\n- First stable release of riptide. This is the version that will be run on the LOTAAS survey.\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/v-morello/riptide",
    "keywords": "",
    "license": "MIT License",
    "maintainer": "",
    "maintainer_email": "",
    "name": "riptide-ffa",
    "package_url": "https://pypi.org/project/riptide-ffa/",
    "platform": "",
    "project_url": "https://pypi.org/project/riptide-ffa/",
    "project_urls": {
      "Homepage": "https://github.com/v-morello/riptide"
    },
    "release_url": "https://pypi.org/project/riptide-ffa/0.2.4/",
    "requires_dist": null,
    "requires_python": ">=3.6",
    "summary": "Pulsar searching with the Fast Folding Algorithm (FFA)",
    "version": "0.2.4",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 12776049,
  "releases": {
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b0b1c97575dc8a3adf6dda6f9ff506cda1bc5f0db8e399e9d0b80074c8b2d7e1",
          "md5": "6c2955c4e68d393d4e6f07666736f576",
          "sha256": "8feb6246d477c31ac28c0306e0f8be6d18779ab6d787eb7c2d41dad70934c879"
        },
        "downloads": -1,
        "filename": "riptide-ffa-0.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "6c2955c4e68d393d4e6f07666736f576",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 78097,
        "upload_time": "2020-04-08T08:48:17",
        "upload_time_iso_8601": "2020-04-08T08:48:17.294685Z",
        "url": "https://files.pythonhosted.org/packages/b0/b1/c97575dc8a3adf6dda6f9ff506cda1bc5f0db8e399e9d0b80074c8b2d7e1/riptide-ffa-0.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8f6a3a18ed2c2e2171cf43603df336a90722a39e9761b1f1859c4e08e6864c3b",
          "md5": "b87b1b131d72dbab4d29ef768dc42a21",
          "sha256": "1c4656b2a9b0f10a930a8e9db4a4290e994730f197dde8974b30cb629264352f"
        },
        "downloads": -1,
        "filename": "riptide-ffa-0.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "b87b1b131d72dbab4d29ef768dc42a21",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 80050,
        "upload_time": "2020-04-08T18:43:04",
        "upload_time_iso_8601": "2020-04-08T18:43:04.319853Z",
        "url": "https://files.pythonhosted.org/packages/8f/6a/3a18ed2c2e2171cf43603df336a90722a39e9761b1f1859c4e08e6864c3b/riptide-ffa-0.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e8c43fa7d704d7f0239a207cddbf9355c69f2ee30c4eac4205ab451469d44388",
          "md5": "679b948f05ba82c83cff754e1bd9c621",
          "sha256": "e04843960c0c1dacfdd3446096bb92a358b343677a679b2265c3c5cc142363c5"
        },
        "downloads": -1,
        "filename": "riptide-ffa-0.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "679b948f05ba82c83cff754e1bd9c621",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 78963,
        "upload_time": "2020-04-15T11:53:31",
        "upload_time_iso_8601": "2020-04-15T11:53:31.212655Z",
        "url": "https://files.pythonhosted.org/packages/e8/c4/3fa7d704d7f0239a207cddbf9355c69f2ee30c4eac4205ab451469d44388/riptide-ffa-0.1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "54f52119e6a2fb28e2fa3f0d5412bfdd3212f4d589fe8c213347aa3b1d5bdad4",
          "md5": "88e87e97ddc9cfe614551b9df52d9c0c",
          "sha256": "8aa78755da74698509e0f455ffd3ba3a5cfdbb4cf70363d163c30485007f0338"
        },
        "downloads": -1,
        "filename": "riptide-ffa-0.1.3.tar.gz",
        "has_sig": false,
        "md5_digest": "88e87e97ddc9cfe614551b9df52d9c0c",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 85903,
        "upload_time": "2020-04-27T15:00:43",
        "upload_time_iso_8601": "2020-04-27T15:00:43.824390Z",
        "url": "https://files.pythonhosted.org/packages/54/f5/2119e6a2fb28e2fa3f0d5412bfdd3212f4d589fe8c213347aa3b1d5bdad4/riptide-ffa-0.1.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0956cc6729a1b3be8f9c10cde65ddcf1e62a76dfbb11d342c474eb5bed171086",
          "md5": "73c6060a8f93d9d0f432c635a311cc56",
          "sha256": "552dc0f3c6ee6c6108ae807af5211f4f525ecc7da0eb7fd9cd6e2220bc4b1d47"
        },
        "downloads": -1,
        "filename": "riptide-ffa-0.1.4.tar.gz",
        "has_sig": false,
        "md5_digest": "73c6060a8f93d9d0f432c635a311cc56",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 874643,
        "upload_time": "2020-05-03T18:34:24",
        "upload_time_iso_8601": "2020-05-03T18:34:24.348716Z",
        "url": "https://files.pythonhosted.org/packages/09/56/cc6729a1b3be8f9c10cde65ddcf1e62a76dfbb11d342c474eb5bed171086/riptide-ffa-0.1.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a1810557061a63028901bd3b067612bc90a662a694027c652747acf964cf654b",
          "md5": "9e4b00c6d96e7944fca856b8199318b3",
          "sha256": "15a58b783b03e811d33cb890b3c79dd7d7b88c1e91a5b14aa714937a69166f57"
        },
        "downloads": -1,
        "filename": "riptide-ffa-0.1.5.tar.gz",
        "has_sig": false,
        "md5_digest": "9e4b00c6d96e7944fca856b8199318b3",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 617442,
        "upload_time": "2020-05-23T08:58:55",
        "upload_time_iso_8601": "2020-05-23T08:58:55.059315Z",
        "url": "https://files.pythonhosted.org/packages/a1/81/0557061a63028901bd3b067612bc90a662a694027c652747acf964cf654b/riptide-ffa-0.1.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0d3adcb0adffd86faeff2bd6ab5bb4afde6654d2f593de4f5126d8dbbb7a6e3a",
          "md5": "a7dfbc9cc25264501611a30294acdbaf",
          "sha256": "d61b574c856873d7a856c970c588a8b93604a211bcd635c770cc2db40bed21fd"
        },
        "downloads": -1,
        "filename": "riptide-ffa-0.2.0.tar.gz",
        "has_sig": false,
        "md5_digest": "a7dfbc9cc25264501611a30294acdbaf",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 811522,
        "upload_time": "2020-08-10T11:14:35",
        "upload_time_iso_8601": "2020-08-10T11:14:35.127430Z",
        "url": "https://files.pythonhosted.org/packages/0d/3a/dcb0adffd86faeff2bd6ab5bb4afde6654d2f593de4f5126d8dbbb7a6e3a/riptide-ffa-0.2.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e7259e60447788c2dfe9a350ad0ebf691c8b082c6cee53d3741a766f34c8c7a1",
          "md5": "68ffbe51a21fb8fbedf53920b504b1dd",
          "sha256": "7ece6f2672d94b7e7850c417359115d8c943ade2b15d24b462817eaeb0113309"
        },
        "downloads": -1,
        "filename": "riptide-ffa-0.2.1.tar.gz",
        "has_sig": false,
        "md5_digest": "68ffbe51a21fb8fbedf53920b504b1dd",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 812659,
        "upload_time": "2020-10-27T14:09:23",
        "upload_time_iso_8601": "2020-10-27T14:09:23.055033Z",
        "url": "https://files.pythonhosted.org/packages/e7/25/9e60447788c2dfe9a350ad0ebf691c8b082c6cee53d3741a766f34c8c7a1/riptide-ffa-0.2.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4daca635fab4cfc3b3c4a77b497f2d0900498a7888d84922a8910803a1150fce",
          "md5": "c4b591cd8512aba46104da0fb17ebb10",
          "sha256": "82824fc28f333519355a84723e69667ec196b11cc2b5b49d9e9c490f1958b41b"
        },
        "downloads": -1,
        "filename": "riptide-ffa-0.2.2.tar.gz",
        "has_sig": false,
        "md5_digest": "c4b591cd8512aba46104da0fb17ebb10",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 89140,
        "upload_time": "2021-07-24T18:18:01",
        "upload_time_iso_8601": "2021-07-24T18:18:01.519864Z",
        "url": "https://files.pythonhosted.org/packages/4d/ac/a635fab4cfc3b3c4a77b497f2d0900498a7888d84922a8910803a1150fce/riptide-ffa-0.2.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8e3b067a81a9639a6f35b9b7af21f67b8899d2ab15749dbc16bd943fb5db1853",
          "md5": "62a5c484527af731883de9d5d6c59748",
          "sha256": "f7b810751537b82b05e05647cd4ee505adc4e3427a131986c4cc664fbc506fcd"
        },
        "downloads": -1,
        "filename": "riptide-ffa-0.2.3.tar.gz",
        "has_sig": false,
        "md5_digest": "62a5c484527af731883de9d5d6c59748",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 75592,
        "upload_time": "2021-08-01T18:15:06",
        "upload_time_iso_8601": "2021-08-01T18:15:06.446779Z",
        "url": "https://files.pythonhosted.org/packages/8e/3b/067a81a9639a6f35b9b7af21f67b8899d2ab15749dbc16bd943fb5db1853/riptide-ffa-0.2.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d8647f2523d5bc0330abf85f4c2958d52797d5e0c0949d5ecc17964cda820964",
          "md5": "169339f0faeb1e2acb2aa493cb1c1106",
          "sha256": "3f117bbe37c40e481a3bfe24cbcc9852650f376184804834e113e837ac74b0ae"
        },
        "downloads": -1,
        "filename": "riptide-ffa-0.2.4.tar.gz",
        "has_sig": false,
        "md5_digest": "169339f0faeb1e2acb2aa493cb1c1106",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 77629,
        "upload_time": "2022-02-03T13:01:50",
        "upload_time_iso_8601": "2022-02-03T13:01:50.015484Z",
        "url": "https://files.pythonhosted.org/packages/d8/64/7f2523d5bc0330abf85f4c2958d52797d5e0c0949d5ecc17964cda820964/riptide-ffa-0.2.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "d8647f2523d5bc0330abf85f4c2958d52797d5e0c0949d5ecc17964cda820964",
        "md5": "169339f0faeb1e2acb2aa493cb1c1106",
        "sha256": "3f117bbe37c40e481a3bfe24cbcc9852650f376184804834e113e837ac74b0ae"
      },
      "downloads": -1,
      "filename": "riptide-ffa-0.2.4.tar.gz",
      "has_sig": false,
      "md5_digest": "169339f0faeb1e2acb2aa493cb1c1106",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 77629,
      "upload_time": "2022-02-03T13:01:50",
      "upload_time_iso_8601": "2022-02-03T13:01:50.015484Z",
      "url": "https://files.pythonhosted.org/packages/d8/64/7f2523d5bc0330abf85f4c2958d52797d5e0c0949d5ecc17964cda820964/riptide-ffa-0.2.4.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}