{
  "info": {
    "author": "Herbert Kociemba",
    "author_email": "kociemba@t-online.de",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: GNU General Public License v3 or later (GPLv3+)",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# RubiksCube-OptimalSolver\r\n## Overview \r\nThis project tried to find out if an optimal solver for Rubik's cube in Python makes any sense. An optimal solver has to generate\r\nin principle all possible solving maneuvers with increasing length until a solution is found. Since the increase of the\r\nmaneuver length by 1 increases the number of maneuvers by a factor of about 13.3 the computation of all maneuvers of\r\nlength 17 or 18 - which will be necessary for the majority of cube positions - is not possible.  \r\n\r\nPruning tables give you some heuristics value for each position how many moves there are *at least*\r\nstill necessary to solve that position. If you are searching for 17 move solutions for example and you generated the\r\nfirst 10 moves of a potential solution you may stop if the pruning table tells you that you need at least 8 more moves.\r\nSo with a good heuristics you have to generate only much shorter maneuvers in most cases.  \r\n\r\nThe time to optimally solve a cube then depends on two factors:\r\n1. The quality of the pruning table which increases with the number of its entries and hence with its size.  \r\n2. The number of positions ('nodes') generated per second.\r\n\r\nKorf 1997 (Finding Optimal Solutions to Rubik’s Cube Using Pattern Databases) used a Sun Ultra-Spare Model 1 workstation\r\nand was the first who computed optimal solutions to 10 random cubes. The pruning tables had a size of about 80 MB and \r\nthe program generated about 700,000 nodes/s. The number of nodes for a full depth 17 search which had to be generated\r\nwere about 120,000,000,000 and the computation took 2 days.\r\n\r\nMichael Reid 1997 https://www.cflmath.com/Rubik/optimal_solver.html proposed a superior method. He used the\r\npruning table for the first phase of the two-phase algorithm. Since the target group of phase 1 exhibits 16-fold \r\nsymmetry of the D4h point group the corresponding pruning table also can be compressed by a factor about 16. \r\nMoreover, it is possible to apply this pruning table simultaneously in three directions which increases the quality of\r\nthe heuristics. \r\n## Speeding up Python\r\nIt became clear that using Reid's approach with a pruning table size of 34 MB is not best suited for Python.\r\nToday's hardware with several GB of RAM allows the usage of a 794 MB pruning table (24 times larger) which can compensate the\r\nrelative slowness of the Python interpreter. We get a speedup by a factor of about 7 in this way.   \r\n\r\nThis bigger pruning table belongs to a target subgroup where the four UD-slice edges are not only in their slice but\r\nalso in their correct position. The edge and corner orientation also have to be 0, like in the phase 1 subgroup.\r\nThe bigger pruning table also can be applied in three directions and the intersection of the three subgroups is the\r\ngroup where only the corner permutations still are not fixed.\r\n\r\nAnother performance boost is given by the replacement of the standard CPython with PyPy (https://www.pypy.org/) which\r\nhas a Just-in-Time compiler and gives an additional speedup by a factor of about 13. We strongly recommend to use PyPy,\r\nthe combined overall performance boost factor then is about 100. \r\n\r\n\r\n## Usage\r\nThe package is published on PyPI and can be installed with\r\n\r\n```$ pip install RubikOptimal``` \r\n\r\nor using PyPy \r\n\r\n```$ pypy3 -m pip install RubikOptimal```\r\n\r\nOnce installed, you can import the module optimal.solver into your code:\r\n\r\n```python\r\n>>> import optimal.solver as sv\r\n```\r\nThere are several tables which must be created, but only on the first run. These need about 955 MB of disk space, and it\r\ntakes about 8 hour or even longer to create them with CPython and about 15 minutes with PyPy, depending on the used \r\nhardware.\r\nBut only with these computational relative expensive tables the algorithm works highly effective and will find optimal\r\nsolutions to Rubik's cube in a decent time.\r\n\r\nA cube is defined by its cube definition string. A solved cube has the string 'UUUUUUUUURRRRRRRRRFFFFFFFFFDDDDDDDDDLLLLLLLLLBBBBBBBBB'.   \r\n```python\r\n>>> cubestring = 'DUUBULDBFRBFRRULLLBRDFFFBLURDBFDFDRFRULBLUFDURRBLBDUDL'\r\n```\r\nSee https://github.com/hkociemba/RubiksCube-TwophaseSolver/blob/master/enums.py for the exact  format.\r\n```python\r\n>>> sv.solve(cubestring)\r\n```\r\nThis optimally solves the cube described by the definition string. After a couple of minutes (using PyPy) we get\r\n```python\r\n'U1 B2 D3 B3 R3 L3 U1 L2 B2 R1 D3 R3 B1 L3 U2 B2 R1 D3 (18f*)'\r\n```\r\nU, R, F, D, L and B denote the Up, Right, Front, Down, Left and Back face of the cube. 1, 2, and 3 denote a 90°, 180°\r\nand 270° clockwise rotation of the corresponding face. (18f*) means that the solution has 18 moves in the face turn\r\nmetric and the star indicates that it is an optimal solution.\r\n\r\nYou also have the possibility to solve a cube not to the solved position but to some favorite pattern represented by\r\ngoalstring.\r\n```python\r\n>>> sv.solveto(cubestring,goalstring)\r\n```\r\nwill find an optimal solution for this transformation.   \r\n\r\nYou can test the performance of the algorithm on your machine with something similar to\r\n```python\r\n>>> import optimal.performance as pf\r\n>>> pf.test(10)\r\n```\r\nThis will for example generate 10 random cubes and gives information about the solving process. \r\n***\r\nA little GUI-program may help to define the cube definition string interactively and run the solver. It seems to work\r\nwith PyPy (and we recommend using PyPy for performance reasons) without problems.\r\n```python\r\n>>> import optimal.client_gui\r\n```\r\n\r\n![](gui.jpg \"\")\r\n***\r\n## Performance results\r\n\r\nWe solved 10 random cubes with PyPy (pypy3). All computations were done on a Windows 10 machine with an AMD Ryzen 7 3700X 3.59 GHz.\r\n\r\n#### Table creation time (to be performed only once)\r\nPyPy: 13 minutes  \r\nCPython:  8 hours   \r\n\r\n#### Solving statistics for 10 random cubes using PyPy\r\nThe optimal solving time was in a range between 37 s and 1167 s, the total time for the 10 cubes was 3841 s. The average\r\noptimal solving length was 17.80\r\n\r\n1. FDDLURBFDRFRLRDFBRLDBRFFBBLURDBDLLFBUUDDLUFULFBRLBRUUU  \r\ndepth 15 done in 0.75 s, 1290873 nodes generated, about 1720935 nodes/s  \r\ndepth 16 done in 7.06 s, 17831301 nodes generated, about 2524572 nodes/s  \r\ndepth 17 done in 98.06 s, 245464971 nodes generated, about 2503158 nodes/s  \r\ndepth 18 done in 231.27 s, 574900111 nodes generated, about 2485881 nodes/s  \r\ntotal time: 337.39 s, nodes generated: 839588899  \r\nR1 U2 L1 U2 L2 B2 R2 D3 L3 B2 U1 F3 B1 D1 R3 L1 F3 U1 (18f*)  \r\n\r\n\r\n2. FFDFUUBBDRBFLRRLUURDBFFUBBBURDBDFFDLULURLDDLLLRRUBDFLR  \r\ndepth 15 done in 0.99 s, 1928430 nodes generated, about 1957598 nodes/s  \r\ndepth 16 done in 9.92 s, 25418349 nodes generated, about 2561791 nodes/s  \r\ndepth 17 done in 130.17 s, 334597977 nodes generated, about 2570428 nodes/s  \r\ndepth 18 done in 33.42 s, 88752397 nodes generated, about 2655580 nodes/s  \r\ntotal time: 174.86 s, nodes generated: 450855850  \r\nU1 R3 B3 R2 F3 R2 L3 D2 B1 D1 F2 L3 B3 D3 L1 F2 D3 L2 (18f*)  \r\n\r\n\r\n3. BLRBUDDLBUFULRUURBBDLDFBDLLLUFUDFRURRRLDLBFRFFFUBBRDFD  \r\ndepth 15 done in 1.25 s, 3311061 nodes generated, about 2648637 nodes/s  \r\ndepth 16 done in 15.28 s, 39782112 nodes generated, about 2603184 nodes/s  \r\ndepth 17 done in 186.5 s, 485952603 nodes generated, about 2605643 nodes/s  \r\ndepth 18 done in 60.28 s, 150996678 nodes generated, about 2504876 nodes/s  \r\ntotal time: 263.44 s, nodes generated: 680347653  \r\nU1 D2 B1 L2 B3 L2 B2 R3 D3 F3 U3 R3 D1 L3 F3 L1 F3 B3 (18f*)  \r\n\r\n\r\n4. DULDULDDLFUBDRFBBRRRDDFBURLFUURDLRBUFLBLLFBBLDFRRBFFUU  \r\ndepth 15 done in 0.8 s, 1853697 nodes generated, about 2325551 nodes/s  \r\ndepth 16 done in 10.13 s, 24440712 nodes generated, about 2413874 nodes/s  \r\ndepth 17 done in 25.59 s, 63001023 nodes generated, about 2461545 nodes/s  \r\ntotal time: 36.58 s, nodes generated: 89445969  \r\nR1 F1 R2 L2 U1 B1 D3 B2 L1 F3 U2 L3 F2 L1 D3 F2 U3 (17f*)  \r\n\r\n\r\n5. DBDBUFURUBLFBRLFFLFDRRFUBLDDDRBDURUUBDLDLFULRLRLUBFBRF  \r\ndepth 15 done in 0.55 s, 1335570 nodes generated, about 2441181 nodes/s  \r\ndepth 16 done in 7.5 s, 18770952 nodes generated, about 2502760 nodes/s  \r\ndepth 17 done in 103.77 s, 260113815 nodes generated, about 2506756 nodes/s  \r\ndepth 18 done in 1055.2 s, 2624360711 nodes generated, about 2487065 nodes/s  \r\ntotal time: 1167.05 s, nodes generated: 2904680714  \r\nL1 D1 L2 U2 F1 U1 D2 F2 U1 R1 F1 B1 R2 U3 R1 F1 U3 F3 (18f*)  \r\n\r\n\r\n6. RBBRURRDLDFLLRUUFDDLBFFFRDLUBFBDUFBFBDFRLDRUBULDLBULRU  \r\ndepth 15 done in 0.55 s, 1374786 nodes generated, about 2512861 nodes/s  \r\ndepth 16 done in 7.39 s, 19053294 nodes generated, about 2577870 nodes/s  \r\ndepth 17 done in 101.86 s, 262000026 nodes generated, about 2572181 nodes/s  \r\ndepth 18 done in 34.55 s, 90387572 nodes generated, about 2616358 nodes/s  \r\ntotal time: 144.38 s, nodes generated: 372925295  \r\nU1 F2 U3 D1 F2 L1 B3 D2 F1 R1 D3 L2 D1 F2 D1 B3 U3 F3 (18f*)  \r\n\r\n\r\n7. UDLRURDBBDFUBRLFDRBLRBFUFLURULRDBFDUBDLFLRLUDBFRFBUFLD  \r\ndepth 15 done in 0.58 s, 1491219 nodes generated, about 2579517 nodes/s  \r\ndepth 16 done in 8.09 s, 20304783 nodes generated, about 2508591 nodes/s  \r\ndepth 17 done in 108.34 s, 276363516 nodes generated, about 2550818 nodes/s  \r\ndepth 18 done in 53.97 s, 137953480 nodes generated, about 2556157 nodes/s  \r\ntotal time: 171.05 s, nodes generated: 436229374  \r\nU1 D2 R3 L3 B2 R2 D1 L1 D1 F3 U2 D2 R1 B1 U1 D1 F2 D2 (18f*)  \r\n\r\n\r\n8. BRFRULFUBUFLLRBBRRULLLFBBDDDFLBDULRFRDRULDFURDFUDBFDBU  \r\ndepth 15 done in 0.44 s, 1050312 nodes generated, about 2397425 nodes/s  \r\ndepth 16 done in 6.11 s, 15184191 nodes generated, about 2485504 nodes/s  \r\ndepth 17 done in 88.06 s, 217674717 nodes generated, about 2471804 nodes/s  \r\ndepth 18 done in 1050.7 s, 2611603965 nodes generated, about 2485577 nodes/s  \r\ntotal time: 1145.34 s, nodes generated: 2845590837  \r\nL3 B2 D1 B2 U1 L3 U1 L2 U1 R1 U2 B1 D1 L3 F2 R1 F3 R3 (18f*)  \r\n\r\n\r\n9. FUBFUBBBDRLDFRFBDRURBBFUUDUFLRUDRFFURLLULDLRLLBDRBLFDD    \r\ndepth 15 done in 0.63 s, 1561818 nodes generated, about 2498509 nodes/s  \r\ndepth 16 done in 8.23 s, 20984124 nodes generated, about 2548442 nodes/s  \r\ndepth 17 done in 83.0 s, 211311256 nodes generated, about 2545916 nodes/s  \r\ntotal time: 91.91 s, nodes generated: 233985349  \r\nL1 B2 U1 D1 R1 F1 B1 D2 L3 U2 D1 F3 U2 F3 U1 R1 B2 (17f*)  \r\n\r\n\r\n10. BRLLUFLDRBUUURLDUFURDDFBLLFDFLLDRRFRRUFBLFFBBBBUDBDURD  \r\ndepth 15 done in 0.59 s, 1500297 nodes generated, about 2525327 nodes/s  \r\ndepth 16 done in 8.08 s, 20394183 nodes generated, about 2524626 nodes/s  \r\ndepth 17 done in 110.7 s, 275572329 nodes generated, about 2489292 nodes/s  \r\ndepth 18 done in 189.89 s, 483624333 nodes generated, about 2546851 nodes/s  \r\ntotal time: 309.31 s, nodes generated: 781208901  \r\nU3 R2 B2 U2 B3 D3 L1 D1 L2 U2 D2 R3 U1 D1 R3 D1 B3 U1 (18f*)  \r\n\r\nAnd because you can bet that you never will see a random cube which needs 20 moves (the chance is in the order of \r\n1/10^11) we add the solving information for the \"superflip\" where  all edges and corners are in position but all edges\r\nare flipped. This was the first position which was proved to need 20 moves. It takes about 7 hours to find the 20 move\r\nsolution with our solver.\r\n\r\nsuperflip: UBULURUFURURFRBRDRFUFLFRFDFDFDLDRDBDLULBLFLDLBUBRBLBDB   \r\ndepth 14 done in 0.24 s, 185949 nodes generated, about 790936 nodes/s   \r\ndepth 15 done in 1.02 s, 2734515 nodes generated, about 2693838 nodes/s   \r\ndepth 16 done in 10.95 s, 35007363 nodes generated, about 3196115 nodes/s   \r\ndepth 17 done in 150.14 s, 442849923 nodes generated, about 2949558 nodes/s   \r\ndepth 18 done in 1978.36 s, 5537992239 nodes generated, about 2799286 nodes/s   \r\ndepth 19 done in 24197.75 s, 68794215435 nodes generated, about 2843000 nodes/s   \r\ndepth 20 done in 88.06 s, 234395758 nodes generated, about 2661680 nodes/s   \r\ntotal time: 26426.64 s, nodes generated: 75047390029   \r\nU1 R1 U2 R1 F2 L1 U2 R1 F3 B3 R2 D1 R3 L1 U2 F2 D2 F1 R2 D1 (20f*)\r\n\r\nAnd here the optimal solve for the hardest position from https://www.cube20.org/ which takes about 3 hours:  \r\n\r\nRBFLURBFLBUUFRBBDDRUURFLRDDBFLLDRRBFFUUBLFFDDLUULBRLDD  \r\ndepth 14 done in 0.08 s, 13425 nodes generated, about 171895 nodes/s  \r\ndepth 15 done in 0.3 s, 277653 nodes generated, about 934544 nodes/s  \r\ndepth 16 done in 2.17 s, 5247552 nodes generated, about 2415889 nodes/s  \r\ndepth 17 done in 35.17 s, 91161960 nodes generated, about 2591883 nodes/s  \r\ndepth 18 done in 596.05 s, 1481591235 nodes generated, about 2485695 nodes/s  \r\ndepth 19 done in 9230.55 s, 23094251484 nodes generated, about 2501937 nodes/s  \r\ndepth 20 done in 1846.67 s, 4750476338 nodes generated, about 2572453 nodes/s  \r\ntotal time: 11710.99 s, nodes generated: 29423019926  \r\nU1 R3 L3 F2 U1 B3 R2 D1 R2 U1 F2 U1 F1 L3 F2 B1 D3 R3 U2 F1 (20f*)\r\n\r\n#### Conclusion:\r\nOptimally solving Rubik's Cube with Python using the standard CPython interpreter is not recommended.\r\nWith PyPy and the 794 MB pruning table the computation for optimally solving a Rubik's cube in Python is done within \r\nminutes up to a couple of hours (for the rare and difficult 20 move positions) .\r\n\r\n\r\n\r\n \r\n \r\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/hkociemba/RubiksCube-OptimalSolver",
    "keywords": "'Rubik's Cube,Rubik,cube,solver,optimal,algorithm,Kociemba'",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "RubikOptimal",
    "package_url": "https://pypi.org/project/RubikOptimal/",
    "platform": null,
    "project_url": "https://pypi.org/project/RubikOptimal/",
    "project_urls": {
      "Bug Tracker": "https://github.com/hkociemba/RubiksCube-OptimalSolver/issues",
      "Homepage": "https://github.com/hkociemba/RubiksCube-OptimalSolver"
    },
    "release_url": "https://pypi.org/project/RubikOptimal/1.1.0/",
    "requires_dist": null,
    "requires_python": ">=3.4",
    "summary": "A package to optimally solve Rubik's cube.",
    "version": "1.1.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 15787430,
  "releases": {
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3e4568c48d8663fd0f37452cf59b0c128f1c54f2215dd1c8cc9b4867625cefcd",
          "md5": "8d7570b50967959a85136f8a4fa98f51",
          "sha256": "362aa6dbf1fb99f2f20cbfb49a4d757a178ec9d471961944c3fa7f8913e048de"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "8d7570b50967959a85136f8a4fa98f51",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.4",
        "size": 38145,
        "upload_time": "2021-12-13T00:50:54",
        "upload_time_iso_8601": "2021-12-13T00:50:54.451190Z",
        "url": "https://files.pythonhosted.org/packages/3e/45/68c48d8663fd0f37452cf59b0c128f1c54f2215dd1c8cc9b4867625cefcd/RubikOptimal-1.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "545c97ce5592ce025ddf4008f6cf7c862c209b4c8464c0c8bcf5e911c1926a5b",
          "md5": "e9aaa34a5206fc7a2cc04211cd2759ab",
          "sha256": "94215f7a6dbed39b608fe392eb961d6419e780b530e59c67b6f83ddb48fcc965"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "e9aaa34a5206fc7a2cc04211cd2759ab",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.4",
        "size": 34900,
        "upload_time": "2021-12-13T00:50:55",
        "upload_time_iso_8601": "2021-12-13T00:50:55.932408Z",
        "url": "https://files.pythonhosted.org/packages/54/5c/97ce5592ce025ddf4008f6cf7c862c209b4c8464c0c8bcf5e911c1926a5b/RubikOptimal-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a58df73862d09f95356e1febdadd7fc162b17ffd77167b7d23f7e0375e32a1c4",
          "md5": "7063e8cb86d4c115a7aa9018bc39d02c",
          "sha256": "37285c43343a8522924ff264626f970379b1bc94f47d58798afae33d8a53bcc8"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "7063e8cb86d4c115a7aa9018bc39d02c",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.4",
        "size": 38155,
        "upload_time": "2021-12-13T13:04:50",
        "upload_time_iso_8601": "2021-12-13T13:04:50.117080Z",
        "url": "https://files.pythonhosted.org/packages/a5/8d/f73862d09f95356e1febdadd7fc162b17ffd77167b7d23f7e0375e32a1c4/RubikOptimal-1.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "73b6f85d2adaa4614206cd695f3c14af3b89a95a2a22bfb568f32b302bf9c613",
          "md5": "35632550cf6aa8edfa3047ba9548fb4e",
          "sha256": "cb1fb93a7a994fd4af94063ae09c3d94cf07621dc837f67de7acf90eb8d37a7e"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "35632550cf6aa8edfa3047ba9548fb4e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.4",
        "size": 34913,
        "upload_time": "2021-12-13T13:04:51",
        "upload_time_iso_8601": "2021-12-13T13:04:51.374708Z",
        "url": "https://files.pythonhosted.org/packages/73/b6/f85d2adaa4614206cd695f3c14af3b89a95a2a22bfb568f32b302bf9c613/RubikOptimal-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0ea4345412df64bed42005dbfb519b7d4d6ad360bc7edefb00ce9149e95d240a",
          "md5": "858b4a5cfffb572b9a4231848d71d566",
          "sha256": "6c0b32e99007e95dd1aa2106f780abb6fc845e4fc33503d35e3c6e054fd15aa7"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "858b4a5cfffb572b9a4231848d71d566",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.4",
        "size": 36935,
        "upload_time": "2021-12-21T10:54:21",
        "upload_time_iso_8601": "2021-12-21T10:54:21.765393Z",
        "url": "https://files.pythonhosted.org/packages/0e/a4/345412df64bed42005dbfb519b7d4d6ad360bc7edefb00ce9149e95d240a/RubikOptimal-1.0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8b59b2f9ad788d8471a0f4b3bdcb07a5815df0b37b602f68a7ae0195e2a13201",
          "md5": "26bd358d11608d8c0e54c809bdfbaa86",
          "sha256": "0dd3af2e33c1f29cd2af5b9e2e8e692510682bc8bdd775bdb48d94efff55a92b"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "26bd358d11608d8c0e54c809bdfbaa86",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.4",
        "size": 33615,
        "upload_time": "2021-12-21T10:54:23",
        "upload_time_iso_8601": "2021-12-21T10:54:23.012442Z",
        "url": "https://files.pythonhosted.org/packages/8b/59/b2f9ad788d8471a0f4b3bdcb07a5815df0b37b602f68a7ae0195e2a13201/RubikOptimal-1.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9ff8e710bdf29fc1b87410f438fdb63d735ac78efa3fe6e9a9227bdeeaa67632",
          "md5": "ae7ae48dd895bc8305feaf272d352aaf",
          "sha256": "93118784a95548c603389adce2e22d30b1f917b40b6d64dcf6ea1e3376bc9449"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.0.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "ae7ae48dd895bc8305feaf272d352aaf",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.4",
        "size": 38379,
        "upload_time": "2021-12-21T12:47:33",
        "upload_time_iso_8601": "2021-12-21T12:47:33.664622Z",
        "url": "https://files.pythonhosted.org/packages/9f/f8/e710bdf29fc1b87410f438fdb63d735ac78efa3fe6e9a9227bdeeaa67632/RubikOptimal-1.0.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ee5b6459d11bde3dee12b1dbfb6c40619dc77a12d266aaf69c8712291e54a728",
          "md5": "62ca7b99f24d3b4c75dcfbd6e630ac2f",
          "sha256": "f509690dd96705b7395bdd171a53defaaae2c4164e6ed3f56f521e8d24478f08"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.0.3.tar.gz",
        "has_sig": false,
        "md5_digest": "62ca7b99f24d3b4c75dcfbd6e630ac2f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.4",
        "size": 35284,
        "upload_time": "2021-12-21T12:47:35",
        "upload_time_iso_8601": "2021-12-21T12:47:35.729506Z",
        "url": "https://files.pythonhosted.org/packages/ee/5b/6459d11bde3dee12b1dbfb6c40619dc77a12d266aaf69c8712291e54a728/RubikOptimal-1.0.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b7d66f8e4a346a9d997d83034449281fc9b00fabcc2f46a3583475b2018ce5b2",
          "md5": "83e23328a8a1c336b9aabdb4a5190b3b",
          "sha256": "f951d1198023bce40762b2ad19d29d8dd0a81786b082e8f7b8c93c0e2af650da"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.0.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "83e23328a8a1c336b9aabdb4a5190b3b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.4",
        "size": 38215,
        "upload_time": "2021-12-21T22:53:14",
        "upload_time_iso_8601": "2021-12-21T22:53:14.147613Z",
        "url": "https://files.pythonhosted.org/packages/b7/d6/6f8e4a346a9d997d83034449281fc9b00fabcc2f46a3583475b2018ce5b2/RubikOptimal-1.0.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ee669e21351855c26a182062f7c32ed5b99a9337a485f3a896e97a1d04afaaa3",
          "md5": "e9dcab676a3fa0e238fe8f541fb40c5a",
          "sha256": "12b40cbd85758f4b52f8905424020f83e798eff67c68e92aea6fa85e882cfae9"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.0.4.tar.gz",
        "has_sig": false,
        "md5_digest": "e9dcab676a3fa0e238fe8f541fb40c5a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.4",
        "size": 35059,
        "upload_time": "2021-12-21T22:53:15",
        "upload_time_iso_8601": "2021-12-21T22:53:15.661794Z",
        "url": "https://files.pythonhosted.org/packages/ee/66/9e21351855c26a182062f7c32ed5b99a9337a485f3a896e97a1d04afaaa3/RubikOptimal-1.0.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a8888b032da74fc04b1f9534dcf37d025f8dff95ff6ab4d03ee5175211af4c00",
          "md5": "e365290a1a15685885ba2d6cd794d7ac",
          "sha256": "ccbcb2518ed58950fc1734fc2a7ee2ad35696fcc2ff7142adb8cf41e05cef7e3"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.0.5-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "e365290a1a15685885ba2d6cd794d7ac",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.4",
        "size": 37685,
        "upload_time": "2021-12-22T02:07:19",
        "upload_time_iso_8601": "2021-12-22T02:07:19.298728Z",
        "url": "https://files.pythonhosted.org/packages/a8/88/8b032da74fc04b1f9534dcf37d025f8dff95ff6ab4d03ee5175211af4c00/RubikOptimal-1.0.5-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1fba0a3d2fbbe9b06b138cb76bb0883270f2e36ae135123edd58577df33046b2",
          "md5": "19977467e4e4f45234f389fabd83b8e4",
          "sha256": "4dd5ec4871f31aeab8ad460c9c3c9a8a88a64d57f85f927a8a2afbc528c18bec"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.0.5.tar.gz",
        "has_sig": false,
        "md5_digest": "19977467e4e4f45234f389fabd83b8e4",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.4",
        "size": 34586,
        "upload_time": "2021-12-22T02:07:20",
        "upload_time_iso_8601": "2021-12-22T02:07:20.667156Z",
        "url": "https://files.pythonhosted.org/packages/1f/ba/0a3d2fbbe9b06b138cb76bb0883270f2e36ae135123edd58577df33046b2/RubikOptimal-1.0.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "55bc36261c04c902ac5be07c7d68bb9dd745b40f1730dbae4b6e62d2bc9dd3f4",
          "md5": "69abfab7f160ac9235860bfd05835d3d",
          "sha256": "0dabe7a7b7f3845d72fd0b65c1519ec762cb20da1755c779f7ab96a1e8efdf74"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.0.6-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "69abfab7f160ac9235860bfd05835d3d",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.4",
        "size": 40038,
        "upload_time": "2021-12-23T13:51:50",
        "upload_time_iso_8601": "2021-12-23T13:51:50.133956Z",
        "url": "https://files.pythonhosted.org/packages/55/bc/36261c04c902ac5be07c7d68bb9dd745b40f1730dbae4b6e62d2bc9dd3f4/RubikOptimal-1.0.6-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6e3c46ac8631c14ac88a083392f52a46e8e696edf6d26fc0034f54da7aad3c2f",
          "md5": "514882469d82697f0e9f74f63a6400de",
          "sha256": "57b238aa362512c60601bda778777a005f6e7dbe1c64af8eb0a3790f4d386781"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.0.6.tar.gz",
        "has_sig": false,
        "md5_digest": "514882469d82697f0e9f74f63a6400de",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.4",
        "size": 36659,
        "upload_time": "2021-12-23T13:51:52",
        "upload_time_iso_8601": "2021-12-23T13:51:52.105845Z",
        "url": "https://files.pythonhosted.org/packages/6e/3c/46ac8631c14ac88a083392f52a46e8e696edf6d26fc0034f54da7aad3c2f/RubikOptimal-1.0.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.7": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4404caec8a4444f52a212fab7461031c41d958d7609f0a724e732b2c8be868bb",
          "md5": "45a8147f9594b58752b452020ab4441f",
          "sha256": "17fa4d4131b719cb0489abac6765e00c824fc7610dbd585302cd798e2ebfe896"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.0.7-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "45a8147f9594b58752b452020ab4441f",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.4",
        "size": 40036,
        "upload_time": "2021-12-23T13:59:02",
        "upload_time_iso_8601": "2021-12-23T13:59:02.610402Z",
        "url": "https://files.pythonhosted.org/packages/44/04/caec8a4444f52a212fab7461031c41d958d7609f0a724e732b2c8be868bb/RubikOptimal-1.0.7-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e04c8abed059fd8d6741e8f008b3ff6de03df68ec93c91ed1da0c73c4fffbbc7",
          "md5": "735a714afaed0b4595236f3d9ebd40f1",
          "sha256": "5b30be1e1d1c415a6c6a03cfb1db635e7c18793134e9523667d28b871f17dca3"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.0.7.tar.gz",
        "has_sig": false,
        "md5_digest": "735a714afaed0b4595236f3d9ebd40f1",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.4",
        "size": 36651,
        "upload_time": "2021-12-23T13:59:04",
        "upload_time_iso_8601": "2021-12-23T13:59:04.289673Z",
        "url": "https://files.pythonhosted.org/packages/e0/4c/8abed059fd8d6741e8f008b3ff6de03df68ec93c91ed1da0c73c4fffbbc7/RubikOptimal-1.0.7.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.8": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "78b5c50b17be43dfec59cd176a25703ccc80a77f3c9c7eeed8cc3cb56c88f981",
          "md5": "331c530674d6fc0a6598c006811e1a6c",
          "sha256": "be3574a4178ba06c531ea13287f704aafa0ca3807dba2b86a64a4532e5901108"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.0.8-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "331c530674d6fc0a6598c006811e1a6c",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.4",
        "size": 40031,
        "upload_time": "2021-12-23T14:01:52",
        "upload_time_iso_8601": "2021-12-23T14:01:52.461430Z",
        "url": "https://files.pythonhosted.org/packages/78/b5/c50b17be43dfec59cd176a25703ccc80a77f3c9c7eeed8cc3cb56c88f981/RubikOptimal-1.0.8-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "279e8f0a656a60707279af1994ac683d1db7120401c45e5f07cc58a576d4683c",
          "md5": "7080774f91c0fb3d2e00b45c57ef08de",
          "sha256": "269d1cdce3245602f2884e2054faa203ff19983ff5a94fec487015209fcdd193"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.0.8.tar.gz",
        "has_sig": false,
        "md5_digest": "7080774f91c0fb3d2e00b45c57ef08de",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.4",
        "size": 36648,
        "upload_time": "2021-12-23T14:01:53",
        "upload_time_iso_8601": "2021-12-23T14:01:53.658636Z",
        "url": "https://files.pythonhosted.org/packages/27/9e/8f0a656a60707279af1994ac683d1db7120401c45e5f07cc58a576d4683c/RubikOptimal-1.0.8.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.9": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1c8940fe8fbe5f6c878a0ebb01ab08ea9a3e5809e5f2ee2caa4c23c0080b3ca9",
          "md5": "5426a3c7130d0b45541e320e62d0b672",
          "sha256": "4912da0f381b426ef3f4d2b3275f4037909367bc62ed40485e25b0f430f6a6ae"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.0.9-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "5426a3c7130d0b45541e320e62d0b672",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.4",
        "size": 40516,
        "upload_time": "2022-11-16T11:03:43",
        "upload_time_iso_8601": "2022-11-16T11:03:43.795649Z",
        "url": "https://files.pythonhosted.org/packages/1c/89/40fe8fbe5f6c878a0ebb01ab08ea9a3e5809e5f2ee2caa4c23c0080b3ca9/RubikOptimal-1.0.9-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ccb7775b65a72e8bf3955e66fd47d9863890ca85412ac2a2c5709ce424538d98",
          "md5": "47deaa11399324a5f56db03b0d42f2fb",
          "sha256": "6c9e0b042091633db3768d560967c89793b16eb674411695740cea2e7094ee0e"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.0.9.tar.gz",
        "has_sig": false,
        "md5_digest": "47deaa11399324a5f56db03b0d42f2fb",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.4",
        "size": 37404,
        "upload_time": "2022-11-16T11:03:45",
        "upload_time_iso_8601": "2022-11-16T11:03:45.857807Z",
        "url": "https://files.pythonhosted.org/packages/cc/b7/775b65a72e8bf3955e66fd47d9863890ca85412ac2a2c5709ce424538d98/RubikOptimal-1.0.9.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "54f548b860bd9b4141f40e1332f25ffb0d58723ca0a3796e83d05f77a952ec11",
          "md5": "ce82443fe12918451d767f07f60ff712",
          "sha256": "c569e511dd9f9d2714030e0907186f4aec1849021793a539cf3c339c6feee61b"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "ce82443fe12918451d767f07f60ff712",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.4",
        "size": 40516,
        "upload_time": "2022-11-16T11:15:50",
        "upload_time_iso_8601": "2022-11-16T11:15:50.285677Z",
        "url": "https://files.pythonhosted.org/packages/54/f5/48b860bd9b4141f40e1332f25ffb0d58723ca0a3796e83d05f77a952ec11/RubikOptimal-1.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f5cdcdedad3245357fd675fb2a8e61bc88c0bbc630083d558a5013948f782adf",
          "md5": "cfbc37628cb36631b385f6802b884b24",
          "sha256": "31315913fc43c73da1992d547365df5c701dd293d8a2dfdf09e1ea270a103fd3"
        },
        "downloads": -1,
        "filename": "RubikOptimal-1.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "cfbc37628cb36631b385f6802b884b24",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.4",
        "size": 37395,
        "upload_time": "2022-11-16T11:15:52",
        "upload_time_iso_8601": "2022-11-16T11:15:52.475303Z",
        "url": "https://files.pythonhosted.org/packages/f5/cd/cdedad3245357fd675fb2a8e61bc88c0bbc630083d558a5013948f782adf/RubikOptimal-1.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "54f548b860bd9b4141f40e1332f25ffb0d58723ca0a3796e83d05f77a952ec11",
        "md5": "ce82443fe12918451d767f07f60ff712",
        "sha256": "c569e511dd9f9d2714030e0907186f4aec1849021793a539cf3c339c6feee61b"
      },
      "downloads": -1,
      "filename": "RubikOptimal-1.1.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "ce82443fe12918451d767f07f60ff712",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.4",
      "size": 40516,
      "upload_time": "2022-11-16T11:15:50",
      "upload_time_iso_8601": "2022-11-16T11:15:50.285677Z",
      "url": "https://files.pythonhosted.org/packages/54/f5/48b860bd9b4141f40e1332f25ffb0d58723ca0a3796e83d05f77a952ec11/RubikOptimal-1.1.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "f5cdcdedad3245357fd675fb2a8e61bc88c0bbc630083d558a5013948f782adf",
        "md5": "cfbc37628cb36631b385f6802b884b24",
        "sha256": "31315913fc43c73da1992d547365df5c701dd293d8a2dfdf09e1ea270a103fd3"
      },
      "downloads": -1,
      "filename": "RubikOptimal-1.1.0.tar.gz",
      "has_sig": false,
      "md5_digest": "cfbc37628cb36631b385f6802b884b24",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.4",
      "size": 37395,
      "upload_time": "2022-11-16T11:15:52",
      "upload_time_iso_8601": "2022-11-16T11:15:52.475303Z",
      "url": "https://files.pythonhosted.org/packages/f5/cd/cdedad3245357fd675fb2a8e61bc88c0bbc630083d558a5013948f782adf/RubikOptimal-1.1.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}