{
  "info": {
    "author": "National Institute of Standards and Technology",
    "author_email": "gary.howarth@nist.gov",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "Intended Audience :: Science/Research",
      "License :: Public Domain",
      "Programming Language :: Python :: 3.8"
    ],
    "description": "# SDNist v2.1: Deidentified Data Report Tool\n\n## [SDNist is the offical software package for engaging in the NIST Collaborative Research Cycle](https://pages.nist.gov/privacy_collaborative_research_cycle)\n\nWelcome! SDNist v2.1 is a python package that provides benchmark data and evaluation metrics for deidentified data generators. This version of SDNist supports using the [NIST Diverse Communities Data Excerpts](https://github.com/usnistgov/SDNist/tree/main/nist%20diverse%20communities%20data%20excerpts), a geographically partioned, limited feature data set.\n\nThe deidentified data report evaluates utility and privacy of a given deidentified dataset and generates a summary quality report with performance of a deidentified dataset enumerated and illustrated for each utility and privacy metric.\n\n[Preview sample reports produced by the tool here.](https://github.com/usnistgov/SDNist/tree/main/sdnist/report/sample-reports)\n\nThis tool is being actively developed. Please (raise an Issue)[https://github.com/usnistgov/SDNist/issues]  if you catch a bug or would like have feature suggestions. \n\n\n### Project Team  \n**Karan Bhagat**, *Knexus Research* - Developer *sdnist.report* package  \n\n**Christine Task**, *Knexus Research* - Project technical lead\n\n**Gary Howarth**, *NIST* - Project PI [gary.howarth@nist.gov](mailto:gary.howarth@nist.gov)\n\n### Reporting Issues\nHelp us improve the package and this guide by reporting issues [here](https://github.com/usnistgov/SDNist/issues).\n\n### Temporal Map Challenge Environment\n\nSDNist v2.0 and above does not support the Temporal Map Challenge environment.\n\nTo run the testing environment from the [*NIST PSCR Differential Privacy Temporal Map Challenge*](https://www.nist.gov/ctl/pscr/open-innovation-prize-challenges/past-prize-challenges/2020-differential-privacy-temporal) for the Chicago Taxi data sprint or the American Community Survey sprint, please go to the the [Temporal Map Challenge assets repository](https://github.com/usnistgov/Differential-Privacy-Temporal-Map-Challenge-assets).\n\n\nSetting Up the SDNIST Report Tool\n------------------------\n\n### Brief Setup Instructions\n\nSDNist v2.1 requires Python version 3.7 or greater. If you have installed a previous version of the SDNist library, we recommend uninstalling or installing v2.1 in a virtual environment. v2.1 can be installed via [Release 2.1](https://github.com/usnistgov/SDNist/releases/tag/v2.1.1). The NIST Diverse Community Exceprt data will download on the fly.\n\n\n### Detailed Setup Instructions\n\n1. The SDNist Report Tool is a part of the sdnist Python library that can be installed on a user’s MAC OS, Windows, or Linux machine.\n\n\n2. The sdnist library requires Python version 3.7 or greater to be installed on the user's machine. Check whether an installation exists on the machine by executing the following command in your terminal on Mac/Linux or powershell on Windows:\n   ```\n    c:\\\\> python -V\n   ```\n    If Python is already installed, the above command should return the currently installed version. If Python is not found or the version is below 3.7, then you can download Python from the [Python website](https://www.python.org/downloads/).\n\n\n3.  Create a local directory/folder on the machine to set up the SDNist library. This guide assumes the local directory to be sdnist-project; an example of a complete file path is c:\\\\sdnist-project:\n    ```\n    c:\\\\sdnist-project>     \n    ```\n\n4.  Download the sdnist installable wheel (sdnist-2.1.1-py3-none-any.whl) from the Github: [Release 2.1](https://github.com/usnistgov/SDNist/releases/download/v2.1.1/sdnist-2.1.1-py3-none-any.whl).\n\n\n5.  Move the downloaded sdnist-2.1.1-py3-none-any.whl file to the sdnist-project directory.\n\n\n6.  Using the terminal on Mac/Linux or powershell on Windows, navigate to the sdnist-project directory.\n\n\n7.  In the already-opened terminal or powershell window, execute the following command to create a new Python environment. The sdnist library will be installed in this newly created Python environment:\n\n    ```\n    c:\\\\sdnist-project> python -m venv venv\n    ```\n\n8. The new Python environment will be created in the sdnist-project directory, and the files of the environment should be in the venv directory. To check whether a new Python environment was created successfully, use the following command to list all directories in the sdnist-project directory, and make sure the venv directory exists.\n\n    **MAC OS/Linux:**\n    ```\n    sdnist-project> ls\n    ```\n    **Windows:**\n    ```\n    c:\\\\sdnist-project> dir\n    ```\n\n9. Now activate the Python environment and install the sdnist library into it.\n\n    **MAC OS/Linux:**\n    ```\n    sdnist-project> . venv/bin/activate\n    ```\n    The python virtual environment should now be activated. You should see environment name (**venv** in this case) appended to the terminal prompt as below:  \n    ```\n    (venv) sdnist-project>\n    ```\n\n    **Windows:**\n    ```\n    c:\\\\sdnist-project> . venv/Scripts/activate\n    ```\n    The python virtual environment should now be activated. You should see environment name (**venv** in this case) appended to the command/powershell prompt as below:  \n    ```\n    (venv) c:\\\\sdnist-project>\n    ```\n\n    On Windows, a few users may encounter the following error if their machines are new (executing scripts is disabled by default on some Windows machines):\n    ```\n    C:\\\\sdnist-project\\\\venv\\\\Scripts\\\\Activate.ps1 cannot be loaded because running scripts is disabled on this system.\n    ```\n    Run the following command to let Windows execute scripts:\n    ```\n    Set-ExecutionPolicy -ExecutionPolicy RemoteSigned -Scope LocalMachine\n    ```\n\n\n10. Per step 5 above, the sdnist-2.1.1-py3-none-any.whl file should already be present in the sdnist-project directory. Check whether that is true by listing the files in the sdnist-project directory.\n\n      **MAC OS/Linux:**\n       ```\n       (venv) sdnist-project> ls\n       ```\n      **Windows:**\n       ```\n       (venv) c:\\\\sdnist-project> dir\n       ```\n       The sdnist-2.1.1-py3-none-any.whl file should be in the list printed by the above command; otherwise, follow steps 4 and 5 again to download the .whl file.\n\n\n11. Install sdnist Python library:\n       ```\n       (venv) c:\\\\sdnist-project> pip install sdnist-2.1.1-py3-none-any.whl\n       ```\n\n\n12. Installation is successful if executing the following command outputs a help menu for the sdnist.report package:\n       ```\n       (venv) c:\\\\sdnist-project> python -m sdnist.report -h\n       ```\n       Output:\n       ```\n        usage: __main__.py [-h] [--labels LABELS] [--data-root DATA_ROOT]\n                           PATH_DEIDENTIFIED_DATASET TARGET_DATASET_NAME\n\n        positional arguments:\n          PATH_DEIDENTIFIED_DATASET\n                                Location of deidentified dataset (csv or parquet\n                                file).\n          TARGET_DATASET_NAME   Select name of the target dataset that was used to\n                                generated given deidentified dataset.\n\n        options:\n          -h, --help            show this help message and exit\n          --labels LABELS       This argument is used to add meta-data to help\n                                identify which deidentified data was was evaluated in\n                                the report. The argument can be a string that is a\n                                plain text label for the file, or it can be a file\n                                path to a json file containing [label, value] pairs.\n                                This labels will be included in the printed report.\n          --data-root DATA_ROOT\n                                Path of the directory to be used as the root for the\n                                target datasets.\n\n        Choices for Target Dataset Name:\n          [DATASET NAME]        [FILENAME]\n          MA                    ma2019\n          TX                    tx2019\n          NATIONAL              national2019\n       ```\n\n\n13. These instructions install sdnist into a virtual environment. The virtual environment must be activated (step 9) each time a new terminal window is used with sdnist.\n\n\nGenerate Data Quality Report\n---------------------------\n\n1.  The sdnist.report package requires a path to the deidentified dataset file and the name of the target dataset from which the deidentified dataset file will be created. Following is the command line usage of the sdnist.report package:\n      ```\n      python -m sdnist.report PATH_DEINDETIFIED_DATASET TARGET_DATSET_NAME\n      ```\n\n      The above command is just an example usage signature of the package. Steps 3 through 5 show the actual commands to run the tool, where the parameter PATH_DEIDENTIFIED_DATASET is replaced with the path of the deidentified dataset file on the your machine, and the parameter TARGET_DATASET_NAME is replaced with one of the bundled dataset names (MA, TX, or NATIONAL).\n\n      A deidentified dataset file can be anywhere on your machine. You only need the path of the file to pass it as an argument to the sdnist.report package. For illustration purposes, this guide assumes an example deidentified dataset file named syn_tx.csv is generated from the bundled dataset file named TX that is present in the sdnist-project directory. You can also use the bundled toy deidentified datasets for generating some toy evaluation reports using the sdnist.report package by following steps 5 and 6 in the next section, Setup Data for SDNIST Report Tool.\n\n     The sdnist.report packages come bundled with three target datasets: MA, TX, and NATIONAL. If these datasets are not available locally, the package will download them automatically when you run any one of the commands in steps 3 through 5 for the first time. In case of any trouble while downloading the datasets, please refer to the next section, Setup Data for SDNIST Report Tool.\n\n\n2.  If you have closed the terminal or the powershell window that was used for the tool setup, open a new one, and after navigating the to sdnist-project directory, run the activate script as explained in step 9 of the Setup SDNIST Report Tool section.\n\n\n3.  Use the following command to generate a data quality report for the example deidentified dataset (syn_tx.csv) that is generated using the bundled dataset TX:\n      ```\n      (venv) c:\\\\sdnist-project> python -m sdnist.report syn_tx.csv TX\n      ```\n      At the completion of the process initiated by the above command, an .html report will open in the default web browser on your machine. Likewise, .html report files will be available in the reports directory created automatically in the sdnist-project directory.\n\n\n4.  Use the following command to generate a data quality report for the example deidentified dataset (syn_ma.csv) that is generated using the bundled dataset MA:\n      ```\n      (venv) c:\\\\sdnist-project> python -m sdnist.report syn_ma.csv MA\n      ```\n\n\n5.  Use the following command to generate a data quality report for the example deidentified dataset (syn_national.csv) that is generated using the bundled dataset NATIONAL:\n      ```\n      (venv) c:\\\\sdnist-project> python -m sdnist.report syn_national.csv NATIONAL\n      ```\n6.  SDNist 2.1 allow users to add labels for the deidentified dataset used to generate report:\n    * To add single string label to the report, use command line option **--labels** followed by a string as given in the following example command:\n      ```\n      (venv) c:\\\\sdnist-project> python -m sdnist.report syn_national.csv NATIONAL --labels used_epsilon_1\n      ```\n      This is how the string label *used_epsilon_1* will appear in the report:\n      ![string label in report](readme_resource/string_label.png)\n    * To add multiple string labels to the report, use command line option **--labels** followed by a path to the json file containing labels:\n      ```\n      (venv) c:\\\\sdnist-project> python -m sdnist.report syn_national.csv NATIONAL --labels example_labels.json\n      ```\n      Where example_labels.json can be:\n      ```\n        {\n          \"epsilon\": \"1\",\n          \"delta\": \"10^-5\",\n          \"created on\": \"March 3, 2023\",\n          \"deidentification method\": \"example_method\"\n        }\n      ```\n      This is how the *example_labels.json* will appear in the report:\n     ![multiple labels in report](readme_resource/multiple_labels.png)\n7.  The following are all the parameters offered by the sdnist.report package:\n\n     - **PATH_DEIDENTIFIED_DATASET**: The absolute or relative path to the deidentified dataset .csv or parquet file. If the provided path is relative, it should be relative to the current working directory. This guide assumes the current working directory is sdnist-project.\n     - **TARGET_DATASET_NAME**: This should be the name of one of the datasets bundled with the sdnist.report package. It is the name of the dataset from which the input deidentified dataset is generated, and it can be one of the following:\n       - MA\n       - TX\n       - NATIONAL\n\n     - **--data-root**: The absolute or relative path to the directory containing the bundled dataset, or the directory where the bundled dataset should be downloaded to if it is not available locally. The default directory is set to **diverse_community_excerpts_data**.\n     - **--labels**: This argument is used to add meta-data to help identify which deidentified data was was evaluated in the report.  The argument can be a string that is a plain text label for the file, or it can be a file path to a json file containing label, value pairs. \n\nSetup Data for SDNIST Report Tool\n---------------------------------\n\n1.  The sdnist.report package comes with built-in datasets. The package will automatically download the datasets from Github if they are not already available locally on your machine. You should see following message on your terminal or powershell window when the datasets are downloaded by the sdnist.report package:\n      ```\n      (venv) c:\\\\sdnist-project> python -m sdnist.report syn_tx.csv TX\n\n      Downloading all SDNist datasets from:  \n      https://github.com/usnistgov/SDNist/releases/download/v2.1.1/diverse_communities_data_excerpts.zip ...  \n      ...5%, 47352 KB, 8265 KB/s, 5 seconds elapsed\n      ```\n\n      Follow the next subsection, Download Data Manually, if the sdnist.report package is unable to download the datasets.\n\n\n2. All the datasets required by the sdnist.report package are installed into the sdnist _toy _data directory, which should be now present inside the sdnist-project directory. sdnist _toy _data is also a data root directory. You can use some other directory as a data root by providing the –data-root argument to the sdnist.report package. If you provide a –data-root argument with a path, the sdnist.report package will look for datasets in the data root directory you have specified, and the package will download it if it is not present in the data root.\n\n\n3. The sdnist.report package also needs a deidentified dataset that it can evaluate against its original counterpart. Since the sdnist.report package comes bundled with the datasets, the deidentified dataset should be generated using the bundled datasets.\n\n   You can download a copy of the datasets from Github [Diverse Communities Data Excerpts](https://github.com/usnistgov/SDNist/tree/main/nist%20diverse%20communities%20data%20excerpts). This copy is similar to the one bundled with the sdnist.report package, but it contains more documentation and a description of the datasets.\n\n\n4. You can download the toy deidentified datasets from Github [Sdnist Toy Deidentified Dataset](https://github.com/usnistgov/SDNist/releases/download/v2.1.1/toy_deidentified_data.zip). Unzip the downloaded file, and move the unzipped toy_deidentified_dataset directory to the sdnist-project directory.\n\n\n5. Each toy deidentified dataset file is generated using the [Diverse Communities Data Excerpts](https://github.com/usnistgov/SDNist/releases/download/v2.1.1/diverse_communities_excerpts_data.zip). The syn_ma.csv, syn_tx.csv, and syn_national.csv deidentified dataset files are created from target datasets MA (ma2019.csv), TX (tx2019.csv), and NATIONAL(national2019.csv), respectively. You can use one of the toy deidentified dataset files for testing whether the sdnist.report package is installed correctly on your system.\n\n\n6. Use the following commands for generating reports if you are using a toy deidentified dataset file:\n\n   For evaluating the Massachusetts dataset:\n   ```\n   (venv) c:\\\\sdnist-project> python -m sdnist.report toy_deidentified_data/syn_ma.csv MA\n   ```\n\n   For evaluating the Texas dataset:\n   ```\n   (venv) c:\\\\sdnist-project> python -m sdnist.report toy_deidentified_data/syn_tx.csv TX\n   ```\n\n   For evaluating the national dataset:\n   ```\n   (venv) c:\\\\sdnist-project> python -m sdnist.report toy_deidentified_data/syn_national.csv NATIONAL\n   ```\n\n7.  A deidentified dataset can be a .csv or a parquet file, and the path of this file is required\nby the sdnist.report package to generate a data quality report.\n\n\nDownload Data Manually\n----------------------\n\n1.  If the sdnist.report package is not able to download the datasets, you can download them from Github [Diverse Communities Data Excerpts](https://github.com/usnistgov/SDNist/releases/download/v2.1.1/diverse_communities_data_excerpts.zip).\n3.  Unzip the **diverse_community_excerpts_data.zip** file and move the unzipped **diverse_community_excerpts_data** directory to the **sdnist-project** directory.\n4.  Delete the **diverse_community_excerpts_data.zip** file once the data is successfully extracted from the zip.\n\nCiting SDNist Deidentified Data Report Tool\n-------------------------------------------\n\nIf you publish work that utilizes the SDNist Deidentified Data Tool, please cite the software. Citation recommendation:  \n> Task C., Bhagat K., and Howarth G.S. (2023), SDNist v2: Deidentified Data Report Tool, \n> National Institute of Standards and Technology, \n> https://doi.org/10.18434/mds2-2943    \n(NOTE: DOI is not yet active, but should be by 1 APR 2023).\n\nCredits \n----------\n\n- [Christine Task](mailto:christine.task@knexusresearch.com) - Project technical lead - christine.task@knexusresearch.com\n- [Karan Bhagat](https://github.com/kbtriangulum) - Contributor\n- [David Lee](https://www.linkedin.com/in/david-lee-13872922/) - Documentation\n- [Gary Howarth](https://www.nist.gov/people/gary-howarth) - Project PI - gary.howarth@nist.gov\n\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/usnistgov/SDNist",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "sdnist",
    "package_url": "https://pypi.org/project/sdnist/",
    "platform": null,
    "project_url": "https://pypi.org/project/sdnist/",
    "project_urls": {
      "Homepage": "https://github.com/usnistgov/SDNist"
    },
    "release_url": "https://pypi.org/project/sdnist/2.1.1/",
    "requires_dist": [
      "jinja2 (>=3)",
      "loguru (>=0.6)",
      "matplotlib (>=3)",
      "numpy (>=1)",
      "pandas (>=1)",
      "pyarrow (>=7)",
      "requests (>=2)",
      "scikit-learn (>=1)",
      "scipy (>=1)",
      "tqdm (>=4)",
      "colorama (>=0.4)"
    ],
    "requires_python": "",
    "summary": "SDNist: Deidentified Data Report Generator",
    "version": "2.1.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17337833,
  "releases": {
    "0.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "733a1ca307b878944595100b2d319ad04f7e683b0feec1dae94ad9350bf3be31",
          "md5": "afcb828c49a7368ddd84decd64fa5b50",
          "sha256": "7186bce04e853f8ba0fb921a17a3417b77a2e6b16df8540d0a57e697a3f53c7c"
        },
        "downloads": -1,
        "filename": "sdnist-0.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "afcb828c49a7368ddd84decd64fa5b50",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 1047,
        "upload_time": "2021-11-12T15:35:09",
        "upload_time_iso_8601": "2021-11-12T15:35:09.616972Z",
        "url": "https://files.pythonhosted.org/packages/73/3a/1ca307b878944595100b2d319ad04f7e683b0feec1dae94ad9350bf3be31/sdnist-0.0.1-py3-none-any.whl",
        "yanked": true,
        "yanked_reason": "Depreciated"
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "935782d6e67132757afc3d01020cd6f6e490f570a791f00fdaa21f500a4984fc",
          "md5": "30f3871c71cd9a569cb04fcbd594d3af",
          "sha256": "788d2b7c75f67ac15813fb86171bf75928082c90b4f31b9d0026b36b9a24bfa6"
        },
        "downloads": -1,
        "filename": "sdnist-0.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "30f3871c71cd9a569cb04fcbd594d3af",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 846,
        "upload_time": "2021-11-12T15:35:11",
        "upload_time_iso_8601": "2021-11-12T15:35:11.047868Z",
        "url": "https://files.pythonhosted.org/packages/93/57/82d6e67132757afc3d01020cd6f6e490f570a791f00fdaa21f500a4984fc/sdnist-0.0.1.tar.gz",
        "yanked": true,
        "yanked_reason": "Depreciated"
      }
    ],
    "1.2.7": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9ba89ed6c43131d2ef849ffe28c815a48ea254eca283385408387a60d0fb73a6",
          "md5": "4cb6955042f6e928de174f1eb422a73b",
          "sha256": "8894b486bca91e4b613de486fa4cb8262f6ac0242581801bdba8178fd9525a67"
        },
        "downloads": -1,
        "filename": "sdnist-1.2.7-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "4cb6955042f6e928de174f1eb422a73b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 21466,
        "upload_time": "2022-01-26T21:36:12",
        "upload_time_iso_8601": "2022-01-26T21:36:12.324962Z",
        "url": "https://files.pythonhosted.org/packages/9b/a8/9ed6c43131d2ef849ffe28c815a48ea254eca283385408387a60d0fb73a6/sdnist-1.2.7-py3-none-any.whl",
        "yanked": true,
        "yanked_reason": "depreciated"
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b229c789a4a8bcd48a827086ecc4a69bb14e35c1329a20a2037a9664a97c6a8a",
          "md5": "7e97d9654f789df9954e8cf5eb751187",
          "sha256": "24ef89a681b9018a65b2c68766c48efae995ba9135535df0fe005af04b4b14d6"
        },
        "downloads": -1,
        "filename": "sdnist-1.2.7.tar.gz",
        "has_sig": false,
        "md5_digest": "7e97d9654f789df9954e8cf5eb751187",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 21134,
        "upload_time": "2022-01-26T21:36:13",
        "upload_time_iso_8601": "2022-01-26T21:36:13.548360Z",
        "url": "https://files.pythonhosted.org/packages/b2/29/c789a4a8bcd48a827086ecc4a69bb14e35c1329a20a2037a9664a97c6a8a/sdnist-1.2.7.tar.gz",
        "yanked": true,
        "yanked_reason": "depreciated"
      }
    ],
    "1.2.8": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d024cdce25476249de076e744c206d7d73b096def589d2636907f6a3b7511f69",
          "md5": "af4df6f4fba40360ae72d4072636488b",
          "sha256": "c21864fc6b8cf2f798e4924eec8865936782a3a3e69ff99c21f8ce8c6e3ec42e"
        },
        "downloads": -1,
        "filename": "sdnist-1.2.8-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "af4df6f4fba40360ae72d4072636488b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 21741,
        "upload_time": "2022-02-01T16:10:13",
        "upload_time_iso_8601": "2022-02-01T16:10:13.713069Z",
        "url": "https://files.pythonhosted.org/packages/d0/24/cdce25476249de076e744c206d7d73b096def589d2636907f6a3b7511f69/sdnist-1.2.8-py3-none-any.whl",
        "yanked": true,
        "yanked_reason": "depreciated"
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2981318404c6815a6a5753243405098ba99e0c818d367275e849a6a5b6a11b33",
          "md5": "b620e6f2832904a4c282c7b230eea78f",
          "sha256": "bb66d479f19154eef64e6ace9401747c04e63a6a56c9d26d1b2379ae888dc65a"
        },
        "downloads": -1,
        "filename": "sdnist-1.2.8.tar.gz",
        "has_sig": false,
        "md5_digest": "b620e6f2832904a4c282c7b230eea78f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 21255,
        "upload_time": "2022-02-01T16:10:15",
        "upload_time_iso_8601": "2022-02-01T16:10:15.088602Z",
        "url": "https://files.pythonhosted.org/packages/29/81/318404c6815a6a5753243405098ba99e0c818d367275e849a6a5b6a11b33/sdnist-1.2.8.tar.gz",
        "yanked": true,
        "yanked_reason": "depreciated"
      }
    ],
    "1.4.0b2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b76c3ca469b77399cc8b5c8f8d90ee7feb95d2cf21aa0fbc86ca4d8dc1c19041",
          "md5": "80150188b09e1ae103236ed3df03661f",
          "sha256": "ae180acd3fe2bd01828fba35d3996e25672d69f459a12da8bd03b3ccc1853adc"
        },
        "downloads": -1,
        "filename": "sdnist-1.4.0b2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "80150188b09e1ae103236ed3df03661f",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 65394,
        "upload_time": "2022-09-06T16:58:55",
        "upload_time_iso_8601": "2022-09-06T16:58:55.140128Z",
        "url": "https://files.pythonhosted.org/packages/b7/6c/3ca469b77399cc8b5c8f8d90ee7feb95d2cf21aa0fbc86ca4d8dc1c19041/sdnist-1.4.0b2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "38f232550b40cae2e590cdb184b8c4d63953eb239968f4794e85bdbee05d7b36",
          "md5": "8409e0f35d9a8bd0df5131a8780dd4d6",
          "sha256": "ef507334d3ee9c42ad5c51692664a65ea69603df194d8824d4a4d1a90094ce88"
        },
        "downloads": -1,
        "filename": "sdnist-1.4.0b2.tar.gz",
        "has_sig": false,
        "md5_digest": "8409e0f35d9a8bd0df5131a8780dd4d6",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 56080,
        "upload_time": "2022-09-06T16:58:56",
        "upload_time_iso_8601": "2022-09-06T16:58:56.823540Z",
        "url": "https://files.pythonhosted.org/packages/38/f2/32550b40cae2e590cdb184b8c4d63953eb239968f4794e85bdbee05d7b36/sdnist-1.4.0b2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.4.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5db9a5d4468a922ea7874d01b12ac268f89c51f68def1505597c1408ab853cda",
          "md5": "1df04a8f8644f1aa659638d72e676a26",
          "sha256": "7920ad8d3478c2c878c471ce1f31691ed81c83c9609cb40a5a1f142c809313a4"
        },
        "downloads": -1,
        "filename": "sdnist-1.4.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "1df04a8f8644f1aa659638d72e676a26",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 65330,
        "upload_time": "2022-09-06T17:37:10",
        "upload_time_iso_8601": "2022-09-06T17:37:10.059306Z",
        "url": "https://files.pythonhosted.org/packages/5d/b9/a5d4468a922ea7874d01b12ac268f89c51f68def1505597c1408ab853cda/sdnist-1.4.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0d4f539035191a6c47ea376918feec2998867c88588ba8e403ed20f231674642",
          "md5": "431094aaa1f1d2a6c0bc6a4cb2c9735b",
          "sha256": "e93d2796093a0267f26b39472ee21faca9a2d0bf30814318fdee94adba907cbf"
        },
        "downloads": -1,
        "filename": "sdnist-1.4.1.tar.gz",
        "has_sig": false,
        "md5_digest": "431094aaa1f1d2a6c0bc6a4cb2c9735b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 55963,
        "upload_time": "2022-09-06T17:37:12",
        "upload_time_iso_8601": "2022-09-06T17:37:12.088415Z",
        "url": "https://files.pythonhosted.org/packages/0d/4f/539035191a6c47ea376918feec2998867c88588ba8e403ed20f231674642/sdnist-1.4.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "867ceb7c91532e6dfe44cdccf666ddef0a82ea4224c45ef84a072623e76689a3",
          "md5": "145905251dcdf7c69cf3ef9ed5a1d16f",
          "sha256": "e3344c3642db55aac986f9438b7707fb1b1f7a3748c83b5f965902b2147d3a4d"
        },
        "downloads": -1,
        "filename": "sdnist-2.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "145905251dcdf7c69cf3ef9ed5a1d16f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 71085,
        "upload_time": "2023-02-28T14:51:14",
        "upload_time_iso_8601": "2023-02-28T14:51:14.905041Z",
        "url": "https://files.pythonhosted.org/packages/86/7c/eb7c91532e6dfe44cdccf666ddef0a82ea4224c45ef84a072623e76689a3/sdnist-2.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "866ef3a98767df279e4dba12ba5ffae29fbdd675eb9ea816b6eeb99700e03d86",
          "md5": "3db37a80eae9b05a6e0b15bc401cb491",
          "sha256": "e226ac0f24a2c6416bd9e9ab2d8fd20cedbfc418b9c27eeef4e8970d786ad082"
        },
        "downloads": -1,
        "filename": "sdnist-2.1.1-2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "3db37a80eae9b05a6e0b15bc401cb491",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 88242,
        "upload_time": "2023-03-17T18:06:11",
        "upload_time_iso_8601": "2023-03-17T18:06:11.349632Z",
        "url": "https://files.pythonhosted.org/packages/86/6e/f3a98767df279e4dba12ba5ffae29fbdd675eb9ea816b6eeb99700e03d86/sdnist-2.1.1-2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "450d52fe9c49bf07f47c166767c2fe54b6de142cf65223c8cb7ffbfff35339af",
          "md5": "d5b8da251e73c124086d9cbecb216eba",
          "sha256": "0e5d58a1569e1d850e277e6bbb62eaee0a31f16d1cad13ce5e4e8c7123cf35db"
        },
        "downloads": -1,
        "filename": "sdnist-2.1.1-2.tar.gz",
        "has_sig": false,
        "md5_digest": "d5b8da251e73c124086d9cbecb216eba",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 77008,
        "upload_time": "2023-03-17T18:06:12",
        "upload_time_iso_8601": "2023-03-17T18:06:12.996109Z",
        "url": "https://files.pythonhosted.org/packages/45/0d/52fe9c49bf07f47c166767c2fe54b6de142cf65223c8cb7ffbfff35339af/sdnist-2.1.1-2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "866ef3a98767df279e4dba12ba5ffae29fbdd675eb9ea816b6eeb99700e03d86",
        "md5": "3db37a80eae9b05a6e0b15bc401cb491",
        "sha256": "e226ac0f24a2c6416bd9e9ab2d8fd20cedbfc418b9c27eeef4e8970d786ad082"
      },
      "downloads": -1,
      "filename": "sdnist-2.1.1-2-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "3db37a80eae9b05a6e0b15bc401cb491",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 88242,
      "upload_time": "2023-03-17T18:06:11",
      "upload_time_iso_8601": "2023-03-17T18:06:11.349632Z",
      "url": "https://files.pythonhosted.org/packages/86/6e/f3a98767df279e4dba12ba5ffae29fbdd675eb9ea816b6eeb99700e03d86/sdnist-2.1.1-2-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "450d52fe9c49bf07f47c166767c2fe54b6de142cf65223c8cb7ffbfff35339af",
        "md5": "d5b8da251e73c124086d9cbecb216eba",
        "sha256": "0e5d58a1569e1d850e277e6bbb62eaee0a31f16d1cad13ce5e4e8c7123cf35db"
      },
      "downloads": -1,
      "filename": "sdnist-2.1.1-2.tar.gz",
      "has_sig": false,
      "md5_digest": "d5b8da251e73c124086d9cbecb216eba",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 77008,
      "upload_time": "2023-03-17T18:06:12",
      "upload_time_iso_8601": "2023-03-17T18:06:12.996109Z",
      "url": "https://files.pythonhosted.org/packages/45/0d/52fe9c49bf07f47c166767c2fe54b6de142cf65223c8cb7ffbfff35339af/sdnist-2.1.1-2.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}