{
  "info": {
    "author": "Lei Hu",
    "author_email": "hulei@pmo.ac.cn",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 4 - Beta",
      "Environment :: Console",
      "Intended Audience :: Science/Research",
      "Natural Language :: English",
      "Programming Language :: Python :: 3 :: Only",
      "Programming Language :: Python :: 3.7",
      "Topic :: Scientific/Engineering :: Astronomy"
    ],
    "description": "..  image:: https://github.com/thomasvrussell/sfft/blob/master/docs/sfft_logo_gwbkg.png\n\nPackage Description\n-------------------\n\n.. image:: https://zenodo.org/badge/DOI/10.5281/zenodo.6576426.svg\n   :target: https://doi.org/10.5281/zenodo.6576426\n.. image:: https://img.shields.io/pypi/v/sfft.svg\n    :target: https://pypi.python.org/pypi/sfft\n    :alt: Latest Version\n.. image:: https://static.pepy.tech/personalized-badge/sfft?period=total&units=international_system&left_color=grey&right_color=orange&left_text=Downloads\n :target: https://pepy.tech/project/sfft\n.. image:: https://static.pepy.tech/personalized-badge/sfft?period=month&units=international_system&left_color=grey&right_color=yellow&left_text=Downloads/month\n    :target: https://pepy.tech/project/sfft\n.. image:: https://img.shields.io/badge/python-3.7-green.svg\n    :target: https://www.python.org/downloads/release/python-370/\n.. image:: https://img.shields.io/badge/License-MIT-blue.svg\n    :target: https://opensource.org/licenses/MIT\n|\nSaccadic Fast Fourier Transform (SFFT) is an algorithm for image subtraction in Fourier space. SFFT brings about a remarkable improvement of computational performance of around an order of magnitude compared to other published image subtraction codes. \n\n..  image:: https://github.com/thomasvrussell/sfft/blob/master/docs/sfft_subtract_speed.png\n\nTo get a clear picture of our method, we summarize a variety of features from different perspectives for SFFT and other existing image subtraction methods.\n\n..  image:: https://github.com/thomasvrussell/sfft/blob/master/docs/sfft_features.png\n\nInstallation\n-----------\nOne can install the latest stable version of sfft from pip (recommended): ::\n    \n    pip install sfft\n\nOr alternatively, install any desired version of sfft from Github `<https://github.com/thomasvrussell/sfft>`_: ::\n\n    python setup.py install\n\nsfft has the following three backends to perform the image subtraction.\n\n.. [#] **NumPy backend** : sfft will totally run on the CPU devices. NO GPU devices and CUDA dependencies are required for this backend.\n.. [#] **PyCUDA backend** : The core functions of sfft are written in `PyCUDA <https://github.com/inducer/pycuda>`_ and `Scikit-Cuda <https://github.com/lebedov/scikit-cuda>`_. Users need to install PyCUDA and Scikit-Cuda according to their CUDA version to enable this backend. Note this backend require GPU device(s) with double-precision support.\n.. [#] **CuPy backend** : The core functions of sfft are written in `CuPy <https://github.com/cupy/cupy>`_. Users need to install CuPy according to their CUDA version to enable this backend. Note this backend require GPU device(s) with double-precision support.\n\n- CUDA 11: E.g, you may enable the CuPy backend for CUDA 11.5 via: ::\n\n    pip install cupy-cuda115  # CuPy backend\n\n- CUDA 10: E.g, you may enable the GPU backends (i.e., PyCUDA backend and CuPy backend) for CUDA 10.1 via: ::\n\n    pip install pycuda==2020.1 scikit-cuda==0.5.3  # PyCUDA backend\n    pip install cupy-cuda101                       # CuPy backend\n                   \n**Additional Remarks**: CuPy backend is faster than PyCUDA backend, while it consumes more GPU memory. Generally, I strongly recommend users to adopt CuPy backend as long as it does not incur GPU out-of-memory issue. Note that PyCUDA backend is still not compatiable with CUDA 11.\n\nDependencies\n-----------\n\nYou need further to install additional astronomical software for sfft.\n\n- `SExtractor <https://github.com/astromatic/sextractor>`_: SExtractor is required for sfft preprocessing, as it enables sfft to determine a proper pixel mask over the input image-pair before the image subtraction (this is critical for a more reasonable parameter-solving). Note that we have wrapped SExtractor into a Python module ``sfft.utils.pyAstroMatic.PYSEx`` so that one can trigger SExtractor within Python (please type help(``sfft.utils.pyAstroMatic.PYSEx``) to find its usage). As an AstrOmatic software, you can install SExtractor following `<https://www.astromatic.net/software/sextractor/>`_, or alternatively, install via conda: ::\n\n    conda install -c conda-forge astromatic-source-extractor\n\n- `SWarp <https://github.com/astromatic/swarp>`_ (optional): This is not required for sfft subtraction itself. However, it is normally necessary to align the input image-pair before image subtraction. We have additionally wrapped SWarp into a Python module ``sfft.utils.pyAstroMatic.PYSWarp`` so that you can align images in a more Pythonic way (please type help(``sfft.utils.pyAstroMatic.PYSWarp``) to find its usage). As an AstrOmatic software, you can install SWarp following `<https://www.astromatic.net/software/swarp/>`_, or alternatively, install via conda: ::\n\n    conda install -c conda-forge astromatic-swarp\n\nQuick start guide\n-----------\nWe have prepared several examples in the test directory so that you can familar with the usage of the main functions in our software:\n\n.. [*] **sfft subtraction for crowded field** : The example in subdirectory named subtract_test_crowded_flavor. We use crowded-flavor-sfft (module ``sfft.EasyCrowdedPacket``) to perform image subtraction for ZTF M31 observations. More detailed explanations of this module, see help(``sfft.EasyCrowdedPacket``).\n\n.. [*] **sfft subtraction for sparse field** : The example in subdirectory named subtract_test_sparse_flavor. We use sparse-flavor-sfft (module ``sfft.EasySparsePacket``) to perform image subtraction for CTIO-4m DECam observations. More detailed explanations of this module, see help(``sfft.EasySparsePacket``).\n\n- **IMPORTANT NOTICE: the input images of sparse-flavor-sfft should be SKY-SUBTRACTED!** One can make use of SExtractor to subtract the sky background, which has been also wrapped in this package, please use the module ``sfft.utils.SExSkySubtract`` and type help(``sfft.utils.SExSkySubtract``) to find its usage. There is an additional example in subtract_test_sparse_flavor (see directory prepare_data_example), that shows how to prepare the input image pair for sparse-flavor-sfft by ``sfft.utils.SExSkySubtract`` for sky subtraction and ``sfft.utils.pyAstroMatic.PYSWarp`` for image alignment, respecitvely.\n\n- Our software provides two flavors for image subtraction, crowded-flavor-sfft and sparse-flavor-sfft, to accommodate the situations for the crowded and sparse fields, respectively. The two flavors actually follow the same routine for image subtraction and differ only in ways of masking the data. \n\n- Proper image-masking is required in the current version of SFFT to identify the pixels that are not correctly modeled by SFFT (hereafter, distraction pixels), e.g., saturated sources, casual cosmic rays and moving objects, bad CCD pixels, optical ghosts, and even the variable objects and transients themselves. The pre-subtraction processing for image-masking is referred to as **preprocessing** in sfft.\n\n- Our software provides a generic and robust function to perform **preprocessing** of the data, which has been extensively tested with data from various transient surveys. When you run crowded-flavor-sfft and sparse-flavor-sfft, sfft actually performs the generic **preprocessing** for image-masking and do the sfft subtraction subsequently. \n\n- More specificially, the built-in preprocessing in sfft consists of two steps: [1] identify the distraction pixels in the input image-pair [2] create the masked version of the input image-pair via replacing the identified distraction pixels by proper flux values. In sparse-flavor-sfft, we designed a source-selection based on SExtractor catalogs and identify the unselected regions as distraction pixels. Given that the input images are required to be sky-subtracted in sparse-flavor-sfft, we simply replace the distraction pixels by zeros; In crowded-flavor-sfft, we only identify the pixels contaminated by saturated sources as distraction pixels using SExtractor, and then replace the distraction pixels by local background flux. \n\nCustomized usage\n-----------\n\nThe built-in **preprocessing** in sfft (based on SExtractor) is only designed to provide a safe and generic approach which can adapt to diverse imaging data. In contrast to the high speed of the image subtraction, the computing performance of the built-in **preprocessing** is much less remarkable (says, 10 times more computing time). Given a particular time-domain program, we do believe there is plenty of room for further optimization of the computing expense on the **preprocessing**. The two suggestions below might be helpful for users who would like to incorporate sfft in their pipeline efficiently:\n\n- For sparse-flavor-sfft, the built-in **preprocessing** performs a source-selection based on SExtractor catalogs and then create the masked images for subsequent subtraction. To optimize the overall computing expense of the pipeline, one can make use of the SExtractor products already generated in the preceding modules (e.g., astrometric calibration) for the source-selection (which is much faster than SExtractor) of sfft. It will avoid repeated SExtractor photometry and reduce computing time significantly.\n\n- For crowded-flavor-sfft, the built-in **preprocessing** only mask the saturation-contaminated pixels using SExtractor. When data quality masks for the observed imaging data are available in a survey program, one can instead identify the invalid pixels using the data quality masks and mask them by local background. Hence, the built-in **preprocessing** can be totally skipped.\n\nBesides, we encourage users to design dedicated image-masking strategies for their survey programs to unleash the great power of sfft subtraction!\n\nOur software provides a customized module which allows users to feed their own image-masking results, i.e., the module only perform the sfft subtraction. In this test, you would see the lightning fast speed of sfft subtraction on GPU devices!\n\n.. [*] **customized sfft subtraction** : The example in subdirectory named subtract_test_customized. The test data is the same as those for crowded-flavor-sfft (ZTF-M31 observations), however, the built-in automatic image-masking has been skipped by using given customized masked images as inputs. Such *pure* version of sfft is conducted by the module ``sfft.CustomizedPacket``. More detailed explanations of the module: help(``sfft.CustomizedPacket``).\n\n**Additional Remarks**: If you are using GPU backends and you have a queue of observations to be processed, the first time in the loop of sfft subtraction can be very slow, and runtime is going to be stable after the first time. This might be due to some unknown initialization process in GPU devices. You can find in above test that the GPU warming-up is quite slow. Fortunately, this problem can be esaily solved by running a trivial subtraction (e.g., on empty images) in advance and making the pipe waiting for the subsequent observations (see above test).\n\nParallel Computing\n-----------\n\nWe have also developed modules to optimize the overall computing performance of sparse-flavor-sfft and crowded-flavor-sfft for the cases when you need to deal with multiple tasks simultaneously.\n\n- In a particular time-domain survey, one may need to process a large set of image-pairs simultaneously. Assume that you have Nt tasks which should be processed by a computing platform with Nc CPU threads and Ng GPU devices. Generally, Nt >> Ng and Nc >> Ng. \n\n    E.g., Nt = 61 (A DECam exposure with CCDs), Nc = 40 (A CPU with 40 threads), and Ng = 1 (A Tesla A100 available).\n\n- Note that we generally need to avoid multiple tasks using one GPU at the same time (GPU out-of-memory issue). That is to say, we CANNOT simply trigger a set of sfft functions (e.g., ``sfft.EasySparsePacket``) to process a large set of image-pairs simultaneously.\n\n- Since version 1.1, sfft has allowed for multiple tasks without conflicting GPU usage, by using the modules ``sfft.MultiEasySparsePacket`` for sparse-flavor-sfft and ``sfft.MultiEasyCrowdedPacket`` for crowded-flavor-sfft, respectively. Please see the directory test/subtract_test_multiprocessing to find the examples. Note that ONLY the CuPy backend is supported in multiprocessing mode.\n\nRemarks on the direction of image subtraction\n-----------\n\nThere is a universal argument named -ForceConv to control the direction of image subtraction, which works on all image subtraction modules in sfft.\n\n- 'AUTO' means sfft will determine the direction of image subtraction automatically according to the estimated FWHM of reference image and science image. The image which has smaller FWHM will be convolved in the image subtraction to avoid deconvolution. After comparing the FWHM, 'AUTO' becomes 'REF' or 'SCI' (see below). One can get to know which image is eventually convolved in image subtraction from the primary header of the difference image (see the keyword 'CONVD'). This mode does not supported in the Customized module ``sfft.CustomizedPacket``.\n\n- 'REF' means sfft will convolve the reference image and DIFF = SCI - Convolved_REF. As a result, the psf and flux zero-point of difference image is consistent with the unconvolved image, i.e., the science image. One can perform PSF / Aperture photometry on the transients on difference image as if it is an object living in the science image: using the same psf model / aperture and magnitude zeropoint.\n\n- 'SCI' means sfft will convolve the reference image and DIFF = Convolved_SCI - REF. Consequently, the psf and flux zero-point of difference image is consistent with the unconvolved image, i.e., the reference image. One can perform PSF / Aperture photometry on the transients on difference image as if it is an object living in the reference image: using the same psf model / aperture and magnitude zeropoint (but of course, not including the observation date!).\n\nNote that a transient on science image is always a positive signal on difference image whatever -ForceConv is.\n\nAdditional Function\n-----------\n\nWe also present a decorrelation module to whiten the background noise of the difference image.\n\n.. [*] **difference noise decorrelation** : The example in subdirectory named difference_noise_decorrelation. We use noise-decorrelation toolkit (module ``sfft.utils.DeCorrelationCalculator``) to whiten the background noise on difference image. In this test, the difference image is generated from image subtraction (by sfft) between a coadded reference image and a coadded science image, each stacked from 5 DECam individual observations with PSF homogenization (by sfft). The toolkit can be also applied to whiten a coadded image as long as convolution is involved in the stacking process.\n\n\nComments on Backward Compatiablity\n-----------\n\nWe have tried our best to ensure the backward compatiablity, however, the rule was sometimes overrided in the development of sfft, e.g., some arguments might be deprecated in higher version of sfft. Users might get errors when they use old scripts but update sfft to a higher version. To solve the problem, I have been maintaining the test scripts on Github to make sure they can always work for the lastest version of sfft. You can also find the change log of arguments in the test scripts. \n\nWhat's new\n-----------\n\n- The preprocessing in sparse-flavor-sfft is refined using an additional rejection of mild varaibles since version 1.3.0. [Lei, Aug 19, 2022]\n\n- The sfft is now optimized for multiple tasks since version 1.1.0. [Lei, May 24, 2022]\n\n- A few argument-names have been changed since version 1.1.0, please see the test scripts. [Lei, May 24, 2022]\n\n- Locking file is removed since version 1.1.0, as I found it unreliable in our tests, i.e., -GLockFile is removed. [Lei, May 24, 2022]\n\n- The trial subtraction for refinement is removed since version 1.1.0. However, I add a post-subtraction check to search anomalies on the difference image using the same logic. One can feed the coordinates of the anomalies to sfft again as Prior-Banned sources to refine the subtraction (see -XY_PriorBan in ``sfft.MultiEasySparsePacket``). [Lei, May 24, 2022]\n\nTodo list\n-----------\n\n- Incorporate the separate functions (in the folder beta4spline) for spline form sfft into the unified sfft functions. Note that only Numpy backend is currently available and the spline form is very memory-consuming. [Lei, July 6, 2022]\n\n- Write a detailed documentation for sfft! [Lei, May 24, 2022]\n\n- We notice that SExtractor may have been called to perform astrometric calibration before image subtraction. It is definitely not wise to run SExtractor again in sfft, I need to develop a module which allows users to feed SExtractor products as inputs of sfft, which will significantly reduce the preprocessing time in sfft. [Lei, May 24, 2022]\n\n- The multiprocessing mode is expected to accomondate multiple GPU devices, however, the function has not tested on such a multi-GPUs platform. [Lei, May 24, 2022]\n\n- Add a function for optimizing sfft on a given computing platform with multiple CPU threading and one/multiple GPU card(s). This would be very useful to reduce the overall time cost when users have a large set of image-pairs to be processed simultaneously (e.g., serve for DECam, each exposure produces 61 CCD images). [Lei, May 20, 2022] **[ALREADY DONE]**\n\nCommon issues\n-----------\n\n- If your Python environment already has some version of llvmlite (a package required by NumPy backend) before installing sfft. The setup.py in sfft cannot properly update llvmlite to the desired version, then you may get errors related to Numba or llvmlite. If so, please manually install llvmlite by: ::\n\n    pip install llvmlite==0.36.0 --ignore-installed\n\nDevelopment\n-----------\nThe latest source code can be obtained from\n`<https://github.com/thomasvrussell/sfft>`_.\n\nWhen submitting bug reports or questions via the `issue tracker \n<https://github.com/thomasvrussell/sfft/issues>`_, please include the following \ninformation:\n\n- OS platform.\n- Python version.\n- CUDA, PyCUDA and CuPy version.\n- Version of sfft.\n\nCiting\n------\n\n*Image Subtraction in Fourier Space. Hu, L., Wang, L., Chen, X., & Yang, J. 2022, The Astrophysical Journal, 936, 157*\n\nArxiv link: `<https://arxiv.org/abs/2109.09334>`_.\n\nApJ Publication link: `<https://doi.org/10.3847/1538-4357/ac7394>`_.\n\nRelated DOI: 10.3847/1538-4357/ac7394",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "https://github.com/thomasvrussell/sfft",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "",
    "license": "MIT Licence",
    "maintainer": "Lei Hu",
    "maintainer_email": "hulei@pmo.ac.cn",
    "name": "sfft",
    "package_url": "https://pypi.org/project/sfft/",
    "platform": null,
    "project_url": "https://pypi.org/project/sfft/",
    "project_urls": {
      "Download": "https://github.com/thomasvrussell/sfft"
    },
    "release_url": "https://pypi.org/project/sfft/1.3.4/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "Image Subtraction in Fourier Space",
    "version": "1.3.4",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 15252515,
  "releases": {
    "1.0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c56458ceeae5505a8b9ff5839e9570b61eb7599b1654f901ea911a2c20b5a042",
          "md5": "854ccbe35b1c5a64072d1d40e5f32683",
          "sha256": "4321b2c2f3e3e5211a2818fab5e7bb77b3700b2bb8ccd9192a9eada2659ab845"
        },
        "downloads": -1,
        "filename": "sfft-1.0.3.tar.gz",
        "has_sig": false,
        "md5_digest": "854ccbe35b1c5a64072d1d40e5f32683",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 75888,
        "upload_time": "2021-09-22T15:21:39",
        "upload_time_iso_8601": "2021-09-22T15:21:39.630077Z",
        "url": "https://files.pythonhosted.org/packages/c5/64/58ceeae5505a8b9ff5839e9570b61eb7599b1654f901ea911a2c20b5a042/sfft-1.0.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b453b478a9efa292a63252698675d38d51a4ada3753f67d89032442ac1894fd7",
          "md5": "3d8d274e4cf012f3debdb75f0feb7f05",
          "sha256": "95ec6641bf45b813b815d1bd8fa8382bed0241f111d8cb05cab1d36ec24b1373"
        },
        "downloads": -1,
        "filename": "sfft-1.0.6.tar.gz",
        "has_sig": false,
        "md5_digest": "3d8d274e4cf012f3debdb75f0feb7f05",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 78521,
        "upload_time": "2022-04-15T04:03:06",
        "upload_time_iso_8601": "2022-04-15T04:03:06.328280Z",
        "url": "https://files.pythonhosted.org/packages/b4/53/b478a9efa292a63252698675d38d51a4ada3753f67d89032442ac1894fd7/sfft-1.0.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3c9b2990cd6b13b1940ea40e9a4fac34cda416ba13ebf25b254edec8280d34b6",
          "md5": "dc366bb745a6d71844d2d924802b90f0",
          "sha256": "f176bf01556128c0f9cf4587bc445ed0cc6bce3fe592a913380264101175c2c0"
        },
        "downloads": -1,
        "filename": "sfft-1.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "dc366bb745a6d71844d2d924802b90f0",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 89413,
        "upload_time": "2022-05-24T10:56:21",
        "upload_time_iso_8601": "2022-05-24T10:56:21.123863Z",
        "url": "https://files.pythonhosted.org/packages/3c/9b/2990cd6b13b1940ea40e9a4fac34cda416ba13ebf25b254edec8280d34b6/sfft-1.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.2.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8847b4bc7b01ee587de1b3290ee0d06db375e4a5f53173787088201ae73f4006",
          "md5": "df4374d367c2c1b78d06fb2a85fd0c43",
          "sha256": "1d33c7be3a77fe797e027ea39194b95bef3fd5a484f6e48aab4ea1a5aedacc3d"
        },
        "downloads": -1,
        "filename": "sfft-1.2.2.tar.gz",
        "has_sig": false,
        "md5_digest": "df4374d367c2c1b78d06fb2a85fd0c43",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 100984,
        "upload_time": "2022-07-19T12:53:34",
        "upload_time_iso_8601": "2022-07-19T12:53:34.147501Z",
        "url": "https://files.pythonhosted.org/packages/88/47/b4bc7b01ee587de1b3290ee0d06db375e4a5f53173787088201ae73f4006/sfft-1.2.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.2.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "228c9a69c21369b802ff6d771df9ec9079ebd40bd634d18dbf1ee95835acff6a",
          "md5": "2da62f590eb0cdb62f491483324a08a9",
          "sha256": "67748484d82515dd830bbab403a4c37771bc19497be908681f64771b31ba0520"
        },
        "downloads": -1,
        "filename": "sfft-1.2.3.tar.gz",
        "has_sig": false,
        "md5_digest": "2da62f590eb0cdb62f491483324a08a9",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 101167,
        "upload_time": "2022-07-20T10:13:33",
        "upload_time_iso_8601": "2022-07-20T10:13:33.207628Z",
        "url": "https://files.pythonhosted.org/packages/22/8c/9a69c21369b802ff6d771df9ec9079ebd40bd634d18dbf1ee95835acff6a/sfft-1.2.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.2.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a8f00029e81b1fc65823050214b3256d558826a062f7bba7a00614b588a3dc58",
          "md5": "164f5f57106926a839704e3291a232b3",
          "sha256": "ecb521627cab95972837edc6abd7edb34adfc42113f88f188348533b3bf4413c"
        },
        "downloads": -1,
        "filename": "sfft-1.2.4.tar.gz",
        "has_sig": false,
        "md5_digest": "164f5f57106926a839704e3291a232b3",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 101152,
        "upload_time": "2022-07-21T12:47:04",
        "upload_time_iso_8601": "2022-07-21T12:47:04.888459Z",
        "url": "https://files.pythonhosted.org/packages/a8/f0/0029e81b1fc65823050214b3256d558826a062f7bba7a00614b588a3dc58/sfft-1.2.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.3.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2dfb2dff28d054034a8c399cfac8d4780551c3015f8ca5d6278ecfba26ba4d9e",
          "md5": "ed9ef2457740c0178b7051fdacbe09dc",
          "sha256": "4c4d8d83064e5bb19e8b63ec6e43c82551946673a9290e27e02cc514d19d13e0"
        },
        "downloads": -1,
        "filename": "sfft-1.3.0.tar.gz",
        "has_sig": false,
        "md5_digest": "ed9ef2457740c0178b7051fdacbe09dc",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 109520,
        "upload_time": "2022-08-19T09:05:44",
        "upload_time_iso_8601": "2022-08-19T09:05:44.292678Z",
        "url": "https://files.pythonhosted.org/packages/2d/fb/2dff28d054034a8c399cfac8d4780551c3015f8ca5d6278ecfba26ba4d9e/sfft-1.3.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.3.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4a32f13392b3cc292ac48a9a70dfdb43ca4c2b9a3adecf92b91278fa1290411c",
          "md5": "3e047b282553675fd56451b0e9326124",
          "sha256": "309b8ecfcbaf741827a308b29ef8a1ffacc96c854e845d94d0a77c490d0e6097"
        },
        "downloads": -1,
        "filename": "sfft-1.3.1.tar.gz",
        "has_sig": false,
        "md5_digest": "3e047b282553675fd56451b0e9326124",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 110229,
        "upload_time": "2022-08-21T06:15:14",
        "upload_time_iso_8601": "2022-08-21T06:15:14.962172Z",
        "url": "https://files.pythonhosted.org/packages/4a/32/f13392b3cc292ac48a9a70dfdb43ca4c2b9a3adecf92b91278fa1290411c/sfft-1.3.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.3.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "509d2075c7a9371f77798a635fdf9c811a83b73fe47de94f96afbff7f9e025b2",
          "md5": "5ecb69b252963eee47ce0903199a7ef7",
          "sha256": "b5a9d6bface5096db56460382b487d351aadbbb56b0e6f353b180f8969406267"
        },
        "downloads": -1,
        "filename": "sfft-1.3.2.tar.gz",
        "has_sig": false,
        "md5_digest": "5ecb69b252963eee47ce0903199a7ef7",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 109989,
        "upload_time": "2022-08-22T04:47:06",
        "upload_time_iso_8601": "2022-08-22T04:47:06.165745Z",
        "url": "https://files.pythonhosted.org/packages/50/9d/2075c7a9371f77798a635fdf9c811a83b73fe47de94f96afbff7f9e025b2/sfft-1.3.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.3.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "27345af90ad6fba53c098d3d513922d89e8b39a37c9437fc87e25e7728e0a9ea",
          "md5": "b255408ea8f2893ce4b0d3788ed66cf4",
          "sha256": "fdb8748e036824e9fe72211c8e07fde4f5d5a54406850797873e7bd361aa050b"
        },
        "downloads": -1,
        "filename": "sfft-1.3.3.tar.gz",
        "has_sig": false,
        "md5_digest": "b255408ea8f2893ce4b0d3788ed66cf4",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 106880,
        "upload_time": "2022-09-04T02:05:01",
        "upload_time_iso_8601": "2022-09-04T02:05:01.025917Z",
        "url": "https://files.pythonhosted.org/packages/27/34/5af90ad6fba53c098d3d513922d89e8b39a37c9437fc87e25e7728e0a9ea/sfft-1.3.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.3.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8ac41d71287dab19554f7dd7da69987bf7eed5e4021214ffe207628bf72ff3f7",
          "md5": "4dd4c79880851e4df6565de4da3bd9c4",
          "sha256": "cf786fc9708854fd0ad28591add5102ff3aeb54b7e71453443e0d415c43488d1"
        },
        "downloads": -1,
        "filename": "sfft-1.3.4.tar.gz",
        "has_sig": false,
        "md5_digest": "4dd4c79880851e4df6565de4da3bd9c4",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 111398,
        "upload_time": "2022-09-29T11:06:54",
        "upload_time_iso_8601": "2022-09-29T11:06:54.799730Z",
        "url": "https://files.pythonhosted.org/packages/8a/c4/1d71287dab19554f7dd7da69987bf7eed5e4021214ffe207628bf72ff3f7/sfft-1.3.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "8ac41d71287dab19554f7dd7da69987bf7eed5e4021214ffe207628bf72ff3f7",
        "md5": "4dd4c79880851e4df6565de4da3bd9c4",
        "sha256": "cf786fc9708854fd0ad28591add5102ff3aeb54b7e71453443e0d415c43488d1"
      },
      "downloads": -1,
      "filename": "sfft-1.3.4.tar.gz",
      "has_sig": false,
      "md5_digest": "4dd4c79880851e4df6565de4da3bd9c4",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 111398,
      "upload_time": "2022-09-29T11:06:54",
      "upload_time_iso_8601": "2022-09-29T11:06:54.799730Z",
      "url": "https://files.pythonhosted.org/packages/8a/c4/1d71287dab19554f7dd7da69987bf7eed5e4021214ffe207628bf72ff3f7/sfft-1.3.4.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}