{
  "info": {
    "author": "",
    "author_email": "Pavel Demin <pavel.demin@appsilon.com>, Kamil Żyła <kamil@appsilon.com>",
    "bugtrack_url": null,
    "classifiers": [
      "Programming Language :: Python :: 3"
    ],
    "description": "# Semantic UI in Shiny-for-Python\n\n![stability-alpha](https://img.shields.io/badge/stability-alpha-f4d03f.svg)\n\n_Create rich web applications in PyShiny using styles and components from Semantic UI._\n\n## Demo applications and examples\n\n- Semantic Components Showcase\n  - [Live Demo](https://connect.appsilon.com/py_shiny_semantic/)\n  - [Source Code](https://github.com/Appsilon/py_shiny_semantic_examples/tree/main/semantic-components)\n- T-Test Simulation Clone\n  - [Live Demo](https://connect.appsilon.com/py_shiny_ttest)\n  - [Source Code](https://github.com/Appsilon/py_shiny_semantic_examples/tree/main/semantic-ttest)\n\n## About the project\n\nThis is an early [Shiny-for-Python](https://shiny.rstudio.com/py/) implementation of [the official community fork of Semantic UI](https://fomantic-ui.com/).\n\nThe repository contains a python package `shiny_semantic` and a PyShiny application (found in `example` folder) that serves as a simple demo of the implemented components.\n\nThe application is deployed on RSConnect and can be found at https://connect.appsilon.com/py_shiny_semantic/.\n\n## About Fomantic UI\n\n[Fomantic UI](https://fomantic-ui.com/) is a well-maintained community fork of a more widely known and mature [Semantic UI](https://semantic-ui.com/). This project uses JS, CSS and icons from Fomantic UI while referring to the name of the original library.\n\nThe structure of `shiny_semantic` follows the one of Fomantic UI -- this way users may easily refer to corresponding sections in the original documentation to learn about possible classes, styles and behaviors of the components.\n\n## How to install\n\n`shiny_semantic` is available from the official [PyPI distribution](https://pypi.org/project/shiny-semantic), and can be installed using pip. Please remember, that it is considered to be best practice to install packages in isolated virtual environments (see the next section).\n\n```\npip install shiny_semantic\n```\n\nThis will install both `shiny` and `shiny_semantic` - it is enough to start creating a Shiny application in Python.\n\n## Development\n\nIn this project we used only those python tools that already come with a standard python distribution and should be immediately available to the developers. For package management we used `pip`, for virtual environment we used `venv`, and for unit tests we used `unittest`.\n\nPlease note, that some systems (e.g. macOS) have Python installed by default, and it may be accessible with `python3` rather than just `python`. As soon as you init and source a venv, you will be able to call python with just `python`.\n\nTo start development, run the following command:\n\n```shell\npython -m venv .venv # creates virtual environment\nsource .venv/bin/activate # activates virtual environment\npip install -e \".[dev]\n```\n\nThis project uses [pre-commit](https://pre-commit.com/) to ensure the quality of code style. Once the dependencies are restored, run the following command once:\n\n```shell\npre-commit install\n```\n\nTo run the app in the hot-reload mode (the app automatically reloads every time it detects changes in the python source code), run the following command:\n\n```\nshiny run --reload example\n```\n\n## How to update the package\n\nThis project leverages [bumpver](https://github.com/mbarkhau/bumpver) to handle package versioning. To make sure that `bumpver` works, run the following commands:\n\n```shell\npip install bumpver\nbumpver update --patch --dry --no-fetch\n```\n\nThis should provide the developer with a preview of changed lines across multiple files - where package version is mentioned. When local updates are fininshed, the developer might run:\n\n```shell\nbumpver update --patch # or --minor or --major, depending on the PR goal\n```\n\nThis command will change the abovementioned string versions, create a commit with \"bump version\" message, create a git tag and will push changes to the remote. Developers will find a new version under \"Releases\" section on the Github page.\n\n## How to build and publish the package\n\n```shell\npip install build twine\n\n# It is best to remove local dist folder, so that `twine` is not confused on which version to use\nrm -rf dist\n\npython -m build\ntwine check dist/*\n\n# Currently, the package is published by pavel.demin@appsilon.com\ntwine upload dist/*\n```\n\n## How to update the Fomantic components\n\nThe easiest way to replace the Fomantic assets with the new ones, is as follows:\n\n1. Navigate to https://www.jsdelivr.com/package/npm/fomantic-ui. This resource is recommended by the Fomantic team - it contains the latest version of the library files\n2. Download the entire folder as a _.tgz_ archive\n3. Unpack the archive\n4. Find _dist_ folder, grab the minimized versions of CSS and JS files and move them into _shiny_semantic/www/semantic/_\n5. In the same _dist_ folder, locate the _themes_ subfolder - open it\n6. Move the _default_ folder into _shiny_semantic/www/semantic/themes_ - this way Fomantic JS and CSS will be able to seamlessly pick up fonts and icons.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "shiny,semantic,web",
    "license": "GNU LESSER GENERAL PUBLIC LICENSE Version 3, 29 June 2007  Copyright (C) 2007 Free Software Foundation, Inc. <https://fsf.org/> Everyone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.  This version of the GNU Lesser General Public License incorporates the terms and conditions of version 3 of the GNU General Public License, supplemented by the additional permissions listed below.  0. Additional Definitions.  As used herein, \"this License\" refers to version 3 of the GNU Lesser General Public License, and the \"GNU GPL\" refers to version 3 of the GNU General Public License.  \"The Library\" refers to a covered work governed by this License, other than an Application or a Combined Work as defined below.  An \"Application\" is any work that makes use of an interface provided by the Library, but which is not otherwise based on the Library. Defining a subclass of a class defined by the Library is deemed a mode of using an interface provided by the Library.  A \"Combined Work\" is a work produced by combining or linking an Application with the Library. The particular version of the Library with which the Combined Work was made is also called the \"Linked Version\".  The \"Minimal Corresponding Source\" for a Combined Work means the Corresponding Source for the Combined Work, excluding any source code for portions of the Combined Work that, considered in isolation, are based on the Application, and not on the Linked Version.  The \"Corresponding Application Code\" for a Combined Work means the object code and/or source code for the Application, including any data and utility programs needed for reproducing the Combined Work from the Application, but excluding the System Libraries of the Combined Work.  1. Exception to Section 3 of the GNU GPL.  You may convey a covered work under sections 3 and 4 of this License without being bound by section 3 of the GNU GPL.  2. Conveying Modified Versions.  If you modify a copy of the Library, and, in your modifications, a facility refers to a function or data to be supplied by an Application that uses the facility (other than as an argument passed when the facility is invoked), then you may convey a copy of the modified version:  a) under this License, provided that you make a good faith effort to ensure that, in the event an Application does not supply the function or data, the facility still operates, and performs whatever part of its purpose remains meaningful, or  b) under the GNU GPL, with none of the additional permissions of this License applicable to that copy.  3. Object Code Incorporating Material from Library Header Files.  The object code form of an Application may incorporate material from a header file that is part of the Library. You may convey such object code under terms of your choice, provided that, if the incorporated material is not limited to numerical parameters, data structure layouts and accessors, or small macros, inline functions and templates (ten or fewer lines in length), you do both of the following:  a) Give prominent notice with each copy of the object code that the Library is used in it and that the Library and its use are covered by this License.  b) Accompany the object code with a copy of the GNU GPL and this license document.  4. Combined Works.  You may convey a Combined Work under terms of your choice that, taken together, effectively do not restrict modification of the portions of the Library contained in the Combined Work and reverse engineering for debugging such modifications, if you also do each of the following:  a) Give prominent notice with each copy of the Combined Work that the Library is used in it and that the Library and its use are covered by this License.  b) Accompany the Combined Work with a copy of the GNU GPL and this license document.  c) For a Combined Work that displays copyright notices during execution, include the copyright notice for the Library among these notices, as well as a reference directing the user to the copies of the GNU GPL and this license document.  d) Do one of the following:  0) Convey the Minimal Corresponding Source under the terms of this License, and the Corresponding Application Code in a form suitable for, and under terms that permit, the user to recombine or relink the Application with a modified version of the Linked Version to produce a modified Combined Work, in the manner specified by section 6 of the GNU GPL for conveying Corresponding Source.  1) Use a suitable shared library mechanism for linking with the Library.  A suitable mechanism is one that (a) uses at run time a copy of the Library already present on the user's computer system, and (b) will operate properly with a modified version of the Library that is interface-compatible with the Linked Version.  e) Provide Installation Information, but only if you would otherwise be required to provide such information under section 6 of the GNU GPL, and only to the extent that such information is necessary to install and execute a modified version of the Combined Work produced by recombining or relinking the Application with a modified version of the Linked Version. (If you use option 4d0, the Installation Information must accompany the Minimal Corresponding Source and Corresponding Application Code. If you use option 4d1, you must provide the Installation Information in the manner specified by section 6 of the GNU GPL for conveying Corresponding Source.)  5. Combined Libraries.  You may place library facilities that are a work based on the Library side by side in a single library together with other library facilities that are not Applications and are not covered by this License, and convey such a combined library under terms of your choice, if you do both of the following:  a) Accompany the combined library with a copy of the same work based on the Library, uncombined with any other library facilities, conveyed under the terms of this License.  b) Give prominent notice with the combined library that part of it is a work based on the Library, and explaining where to find the accompanying uncombined form of the same work.  6. Revised Versions of the GNU Lesser General Public License.  The Free Software Foundation may publish revised and/or new versions of the GNU Lesser General Public License from time to time. Such new versions will be similar in spirit to the present version, but may differ in detail to address new problems or concerns.  Each version is given a distinguishing version number. If the Library as you received it specifies that a certain numbered version of the GNU Lesser General Public License \"or any later version\" applies to it, you have the option of following the terms and conditions either of that published version or of any later version published by the Free Software Foundation. If the Library as you received it does not specify a version number of the GNU Lesser General Public License, you may choose any version of the GNU Lesser General Public License ever published by the Free Software Foundation.  If the Library as you received it specifies that a proxy can decide whether future versions of the GNU Lesser General Public License shall apply, that proxy's public statement of acceptance of any version is permanent authorization for you to choose that version for the Library. ",
    "maintainer": "",
    "maintainer_email": "Appsilon <opensource@appsilon.com>",
    "name": "shiny-semantic",
    "package_url": "https://pypi.org/project/shiny-semantic/",
    "platform": null,
    "project_url": "https://pypi.org/project/shiny-semantic/",
    "project_urls": {
      "GitHub": "https://github.com/Appsilon/py_shiny_semantic"
    },
    "release_url": "https://pypi.org/project/shiny-semantic/0.1.3/",
    "requires_dist": [
      "shiny (>=0.2.9)",
      "black ; extra == 'dev'",
      "isort ; extra == 'dev'",
      "flake8 ; extra == 'dev'",
      "pre-commit ; extra == 'dev'",
      "bumpver ; extra == 'dev'"
    ],
    "requires_python": ">=3.10",
    "summary": "Semantic UI components in Shiny for Python",
    "version": "0.1.3",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16502149,
  "releases": {
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c47979c0606fca9d9ff77cb1d8b706920263c437706f1180e2579f5f4350d1e3",
          "md5": "1f842fca83bae59e03ce786e7399d74c",
          "sha256": "0a31e12e35d6743645ee04b0324dfdfb2b15a55a40fe11a7cac2952a5bab2740"
        },
        "downloads": -1,
        "filename": "shiny_semantic-0.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "1f842fca83bae59e03ce786e7399d74c",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.10",
        "size": 3003632,
        "upload_time": "2023-01-19T06:40:44",
        "upload_time_iso_8601": "2023-01-19T06:40:44.744537Z",
        "url": "https://files.pythonhosted.org/packages/c4/79/79c0606fca9d9ff77cb1d8b706920263c437706f1180e2579f5f4350d1e3/shiny_semantic-0.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1ebee834362ddca42c72094033c4c066334c1c5d17a415936fba51eb29d4c336",
          "md5": "4756b4f9524493f005e2ed1fad407ac5",
          "sha256": "320f6685c18f00c893cd40a944de546f2266048b1a8bfeba85739552d757363e"
        },
        "downloads": -1,
        "filename": "shiny_semantic-0.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "4756b4f9524493f005e2ed1fad407ac5",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.10",
        "size": 2996251,
        "upload_time": "2023-01-19T06:40:52",
        "upload_time_iso_8601": "2023-01-19T06:40:52.023590Z",
        "url": "https://files.pythonhosted.org/packages/1e/be/e834362ddca42c72094033c4c066334c1c5d17a415936fba51eb29d4c336/shiny_semantic-0.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5ca9d5ffd82da363c689f767e9dc87c93a49ab0c320e12e15091209ecc76008b",
          "md5": "5b89d42c55c27a5c26e0fb9f35ef5e63",
          "sha256": "5ea2166c42c09096839399a53b50ed1433e0c917e2b27b9b9e6699bd6c8fb218"
        },
        "downloads": -1,
        "filename": "shiny_semantic-0.1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "5b89d42c55c27a5c26e0fb9f35ef5e63",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.10",
        "size": 3004737,
        "upload_time": "2023-01-20T10:25:35",
        "upload_time_iso_8601": "2023-01-20T10:25:35.460299Z",
        "url": "https://files.pythonhosted.org/packages/5c/a9/d5ffd82da363c689f767e9dc87c93a49ab0c320e12e15091209ecc76008b/shiny_semantic-0.1.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "43a3f36ef056e9ac98514871a565097b780ed56d82d4f9cb3f59f1279c0e416e",
          "md5": "de37c03f47fb946221b00fe91f37bb14",
          "sha256": "cca7be3572c8b046d20b5ef26a5ffb4e7f4c512646d64c291218c396529ac4f4"
        },
        "downloads": -1,
        "filename": "shiny_semantic-0.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "de37c03f47fb946221b00fe91f37bb14",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.10",
        "size": 2997624,
        "upload_time": "2023-01-20T10:25:42",
        "upload_time_iso_8601": "2023-01-20T10:25:42.495326Z",
        "url": "https://files.pythonhosted.org/packages/43/a3/f36ef056e9ac98514871a565097b780ed56d82d4f9cb3f59f1279c0e416e/shiny_semantic-0.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "91f3f9c8acb910f59700f199b208b90f827618f007dec76b3ff8d38ec3277431",
          "md5": "21374049205dd9ac9815748c082dcdec",
          "sha256": "a2f061af585bd3247f7107e0883b5c356cd93cd69f069630116aabe878f86b05"
        },
        "downloads": -1,
        "filename": "shiny_semantic-0.1.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "21374049205dd9ac9815748c082dcdec",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.10",
        "size": 3004049,
        "upload_time": "2023-01-20T10:59:31",
        "upload_time_iso_8601": "2023-01-20T10:59:31.655768Z",
        "url": "https://files.pythonhosted.org/packages/91/f3/f9c8acb910f59700f199b208b90f827618f007dec76b3ff8d38ec3277431/shiny_semantic-0.1.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "63751497e69245dd6df3160fc0bdb24ee5866defe80d47f660b1e3243bcc7573",
          "md5": "b2749c05ab82a8e8576761a2131edb64",
          "sha256": "a523764bf32486c73ae194f824eb3afb4228b630088efe698acf2d11b038bcbf"
        },
        "downloads": -1,
        "filename": "shiny_semantic-0.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "b2749c05ab82a8e8576761a2131edb64",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.10",
        "size": 2996338,
        "upload_time": "2023-01-20T10:59:49",
        "upload_time_iso_8601": "2023-01-20T10:59:49.232896Z",
        "url": "https://files.pythonhosted.org/packages/63/75/1497e69245dd6df3160fc0bdb24ee5866defe80d47f660b1e3243bcc7573/shiny_semantic-0.1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.1.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "bd1c89aa57d6b1ca5421d4a6f8207095129aab116ba0ed9bed59a8b9f5b379df",
          "md5": "61889f73c5b3107619e955381691928a",
          "sha256": "404e7d3496a1f2a15eb94b4fd25a543f3b502466223b0e7c2220aef3eb4d2e0a"
        },
        "downloads": -1,
        "filename": "shiny_semantic-0.1.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "61889f73c5b3107619e955381691928a",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.10",
        "size": 3004090,
        "upload_time": "2023-01-20T14:59:45",
        "upload_time_iso_8601": "2023-01-20T14:59:45.442887Z",
        "url": "https://files.pythonhosted.org/packages/bd/1c/89aa57d6b1ca5421d4a6f8207095129aab116ba0ed9bed59a8b9f5b379df/shiny_semantic-0.1.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4025016248a11dc01fb77e31906ce466d9442178cdc35de844f14e7dc4b01282",
          "md5": "6d8a94bc6df13a2d2509a5a449ff307b",
          "sha256": "a00b572b2a61d32944ee546fee743e8ecb7166b60e99f3c88d38181dec9f7b37"
        },
        "downloads": -1,
        "filename": "shiny_semantic-0.1.3.tar.gz",
        "has_sig": false,
        "md5_digest": "6d8a94bc6df13a2d2509a5a449ff307b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.10",
        "size": 2996447,
        "upload_time": "2023-01-20T14:59:52",
        "upload_time_iso_8601": "2023-01-20T14:59:52.853463Z",
        "url": "https://files.pythonhosted.org/packages/40/25/016248a11dc01fb77e31906ce466d9442178cdc35de844f14e7dc4b01282/shiny_semantic-0.1.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "bd1c89aa57d6b1ca5421d4a6f8207095129aab116ba0ed9bed59a8b9f5b379df",
        "md5": "61889f73c5b3107619e955381691928a",
        "sha256": "404e7d3496a1f2a15eb94b4fd25a543f3b502466223b0e7c2220aef3eb4d2e0a"
      },
      "downloads": -1,
      "filename": "shiny_semantic-0.1.3-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "61889f73c5b3107619e955381691928a",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.10",
      "size": 3004090,
      "upload_time": "2023-01-20T14:59:45",
      "upload_time_iso_8601": "2023-01-20T14:59:45.442887Z",
      "url": "https://files.pythonhosted.org/packages/bd/1c/89aa57d6b1ca5421d4a6f8207095129aab116ba0ed9bed59a8b9f5b379df/shiny_semantic-0.1.3-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "4025016248a11dc01fb77e31906ce466d9442178cdc35de844f14e7dc4b01282",
        "md5": "6d8a94bc6df13a2d2509a5a449ff307b",
        "sha256": "a00b572b2a61d32944ee546fee743e8ecb7166b60e99f3c88d38181dec9f7b37"
      },
      "downloads": -1,
      "filename": "shiny_semantic-0.1.3.tar.gz",
      "has_sig": false,
      "md5_digest": "6d8a94bc6df13a2d2509a5a449ff307b",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.10",
      "size": 2996447,
      "upload_time": "2023-01-20T14:59:52",
      "upload_time_iso_8601": "2023-01-20T14:59:52.853463Z",
      "url": "https://files.pythonhosted.org/packages/40/25/016248a11dc01fb77e31906ce466d9442178cdc35de844f14e7dc4b01282/shiny_semantic-0.1.3.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}