{
  "info": {
    "author": "",
    "author_email": "David Eckman <eckman@tamu.edu>, Shane Henderson <sgh9@cornell.edu>, Sara Shashaani <sshasha2@ncsu.edu>",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# Welcome to SimOpt!\r\n\r\nSimOpt is a testbed of simulation-optimization problems and solvers. Its purpose is to encourage the development and constructive comparison of simulation-optimization (SO) solvers (algorithms). We are particularly interested in the finite-time performance of solvers, rather than the asymptotic results that one often finds in related literature.\r\n\r\nThe most-up-to-date publication about this library is [Eckman et al. (2021)](https://eckman.engr.tamu.edu/wp-content/uploads/sites/233/2022/01/SimOpt-software-paper.pdf).\r\n\r\n\r\nFor the purposes of this project, we define simulation as a very general technique for estimating statistical measures of complex systems. A system is modeled as if the probability distributions of the underlying random variables were known. Realizations of these random variables are then drawn randomly from these distributions. Each replication gives one observation of the system response, i.e., an evaluation of the objective function or stochastic constraints. By simulating a system in this fashion for multiple replications and aggregating the responses, one can compute statistics and use them for evaluation and design.\r\n\r\nSeveral papers have discussed the development of SimOpt and experiments run on the testbed:\r\n* [Pasupathy and Henderson (2006)](https://www.informs-sim.org/wsc06papers/028.pdf) explains the original motivation for the testbed.\r\n* [Pasupathy and Henderson (2011)](https://www.informs-sim.org/wsc11papers/363.pdf) describes an earlier interface for MATLAB implementations of problems and solvers.\r\n* [Dong et al. (2017)](https://www.informs-sim.org/wsc17papers/includes/files/179.pdf) conducts an experimental comparison of several solvers in SimOpt and analyzes their relative performance.\r\n* [Eckman et al. (2019)](https://www.informs-sim.org/wsc19papers/374.pdf) describes in detail changes to the architecture of the MATLAB version of SimOpt and the control of random number streams.\r\n* [Eckman et al. (2021)](https://eckman.engr.tamu.edu/wp-content/uploads/sites/233/2021/09/SimOpt-metrics-paper.pdf) introduces the design of experiments for comparing solvers; this design has been implemented in the latest Python version of SimOpt. For detailed description of the terminology used in the library, e.g., factors, macroreplications, post-processing, solvability plots, etc., see this paper.\r\n\r\n\r\n## Code\r\n* The `master` branch contains the source code for the latest version of the testbed, which is written in Python.\r\n* The `matlab` branch contains a previous stable version of the testbed written in MATLAB.\r\n\r\n## Documentation\r\nFull documentation for the source code can be found **[here](https://simopt.readthedocs.io/en/latest/index.html)**.\r\n\r\n## Getting Started\r\nThe most straightforward way to interact with the library is to [clone](https://docs.github.com/en/repositories/creating-and-managing-repositories/cloning-a-repository) this repository. *(If you anticipate making improvements or contributions to SimOpt, you should first [fork](https://docs.github.com/en/get-started/quickstart/fork-a-repo) the repository so that you can later request your changes be integrated via GitHub's pull request feature.)* Alternatively, you can choose to install the library as a Python package; see the sections titled **Package** and **Basic Example** below for more details about this option.\r\n\r\nDownload a copy of the cloned repository to your local machine and navigate to the `simopt` folder in your preferred integrated development environment (IDE). You will need to make sure that you have the following dependencies installed: Python 3, `numpy`, `scipy`, `matplotlib`, `pandas`, `seaborn`, and `mrg32k3a`. Run the command ``` python -m pip install numpy scipy matplotlib pandas seaborn mrg32k3a``` to install them from the terminal.\r\n\r\nThe `demo` folder contains a handful of useful scripts that can be easily modified, as directed in the comments.\r\n\r\n* `demo_model.py`: Run multiple replications of a simulation model and report its responses.\r\n\r\n* `demo_problem.py`: Run multiple replications of a given solution for an SO problem and report its objective function values and left-hand sides of stochastic constraints.\r\n\r\n* `demo_problem_solver.py`: Run multiple macroreplications of a solver on a problem, save the outputs to a .pickle file in the `experiments/outputs` folder, and save plots of the results to .png files in the `experiments/plots` folder.\r\n\r\n* `demo_problems_solvers.py`: Run multiple macroreplications of groups of problem-solver pairs and save the outputs and plots.\r\n\r\n* `demo_data_farming_model.py`: Create a design over model factors, run multiple replications at each design point, and save the results to a comma separated value (.csv) file in the `data_farming_experiments` folder.\r\n\r\n* `demo_san-sscont-ironorecont_experiment`: Run multiple solvers on multiple versions of (s, S) inventory, iron ore, and stochastic activiy network problems and produce plots.\r\n\r\n## Graphical User Interface (GUI) - User Guide\r\n\r\n### Installation\r\nTo start up the GUI, navigate to the outer `simopt` directory and run the command ``` python3 -m simopt.GUI ``` from the terminal. The GUI depends on Python 3, `numpy`, `scipy`, `matplotlib`, `Pillow`, and `tkinter`. Run the command ``` python3 -m pip install numpy scipy matplotlib Pillow tkinter ``` to install them from the terminal.\r\n\r\n### Overview\r\nFrom the GUI, you can create a specified **problem-solver pair** or a **problem-solver group**, run macroreplications, and generate plots. The main page provides ways to create or continue working with experiments:\r\n\r\n1. Create an individual **problem-solver pair** with customized problem and solver factors.\r\n2. Load a .pickle file of a previously created **problem-solver pair**.\r\n3. Create a **problem-solver group**. \r\n\r\nAt the bottom of the main page, there is a workspace containing all **problem-solver pair**s and **problem-solver group**s. The first tab lists the **problem-solver pair**s ready to be run or post-replicated, the second tab lists the **problem-solver group**s made from the cross-design or by generating a **problem-solver group** from partial set of **problem-solver pair** in the first tab, and the third tab lists those **problem-solver pair**s that are ready to be post-normalized and prepared for plotting.\r\n\r\n\r\n#### 1. Creating a **problem-solver pair**\r\nThis is the main way to add **problem-solver pair**s to the queue in the workspace.\r\n1. First, select a solver from the \"Solver\" dropdown list. Each of the solvers has an abbreviation for the type of problems the solver can handle. Once a solver is selected, the \"Problem\" list will be sorted and show only the problems that work with the selected solver.\r\n2. Change factors associated with the solver as necessary. The first factor is a customizable name for the solver that use can specify. \r\n3. All solvers with unique combinations of factors must have unique names, i.e., no two solvers can have the same name, but different factors. If you want to use the same solver twice for a problem but with different solver factors, make sure you change the name of the solver accordingly. For example, if you want to create two **problem-solver pair**s with the same problem and solver but with or without CRN for the solver, you can change the name of the solver of choice for each pair to reflect that. This name will appear in the queue within the workspace below.\r\n4. Select a problem from the \"Problem\" dropdown list.\r\nEach problem has an abbreviation indicating which types of solver is compatible to solve it. The letters in the abbreviation stand for:\r\n    <table>\r\n        <tr>\r\n          <th> Objective </th>\r\n          <th> Constraint </th>\r\n          <th> Variable </th>\r\n          <th> Direct Gradient Observations </th>\r\n        </tr>\r\n        <tr>\r\n          <td> Single (S) </td>\r\n          <td> Unconstrained (U) </td>\r\n          <td> Discrete (D) </td>\r\n          <td> Available (G) </td>\r\n        </tr>\r\n      <tr>\r\n          <td> Multiple (M) </td>\r\n          <td> Box (B) </td>\r\n          <td> Continuous (C) </td>\r\n          <td> Not Available (N) </td>\r\n        </tr>\r\n      <tr>\r\n          <td>  </td>\r\n          <td> Deterministic (D) </td>\r\n          <td> Mixed (M)  </td>\r\n          <td>  </td>\r\n        </tr>\r\n      <tr>\r\n          <td>  </td>\r\n          <td> Stochastic (S) </td>\r\n          <td> </td>\r\n          <td>  </td>\r\n        </tr>\r\n    </table>\r\n5. Change factors associated with the problem and model as necessary.\r\n6. All problems with unique factors must have unique names, i.e., no two problems can have the same name, but different factors. If you want to use the same problem twice for a solver but with different problem or model factors, make sure you change the name of the problem accordingly. This name will appear in the queue within the workspace below.\r\n7.  The number of macroreplications can be modified in the top-left corner. The default is 10.\r\n8.  Select the \"Add **problem-solver pair**\" button, which only appears when a solver and problem is selected. The **problem-solver pair** will be added in the \"Queue of **problem-solver pair**s.\"\r\n\r\n\r\n#### 2. Loading a **problem-solver pair** from a file\r\nInstead of creating a **problem-solver pair** from scratch, you can load one from a \\*.pickle file:\r\n1. In the top left corner, click \"Load a **problem-solver pair**\". Your file system will pop up, and you can navigate to and select an appropriate \\*.pickle file. The GUI will throw an error if the selected file is not a \\*.pickle file.\r\n2. Once a **problem-solver pair** object is loaded, it will be added to the \"Queue of **problem-solver pair**s\".\r\n3. The Run and Post-Process buttons will be updated to accurately reflect whether the **problem-solver pair** has already been run and/or post-processed.\r\n\r\n#### 3. Creating a **problem-solver group**\r\nCurrently, **problem-solver group**s can only be created within the GUI or command line; they cannot be loaded from a file. \r\n\r\nYou can create a **problem-solver group** and add a new item to the \"Queue of **problem-solver group**s\" in two ways. The first is a quick grouping of problems and solvers that are compatible with their default factors: \r\nof problems and solvers with their default factors.\r\n1. Click the \"Create a **problem-solver group**\" button.\r\n2. Check the compatibility of the Problems and Solvers being selected. Note that solvers with deterministic constraint type can not handle problems with stochastic constraints (e.g., ASTRO-DF cannot be run on FACSIZE-2).\r\n3. Specify the number of macroreplications - the default is 10.\r\n4. Click \"Confirm Cross-Design **problem-solver group**.\"\r\n5. The pop-up window will disappear, and the **problem-solver pair**s frame will automatically switch to the \"Queue of **problem-solver group**s\".\r\n6. To exit out of the **problem-solver group** pop-up without creating a **problem-solver group**, click the red \"x\" in the top-left corner of the window.\r\n\r\nThe second is converting a list of **problem-solver pair**s into a **problem-solver group** by a cross-design: \r\n1. Select the **problem-solver pair**s of interest from the \"Queue of **problem-solver pair**s\". \r\n2. Clicking the \"Convert to a **problem-solver group**\" button. This will complete the cross-design for the partial list and create a new row in the \"Queue of **problem-solver group**s\".\r\n\r\n\r\n### Running a **problem-solver pair** or a **problem-solver group** \r\nTo run a **problem-solver pair** or a **problem-solver group**, click the \"Run\" button in the \"Queue of **problem-solver pair**s\" or \"Queue of **problem-solver group**s\". Once the **problem-solver pair** or **problem-solver group** has been run, the \"Run\" button becomes disabled.\r\n**Note:** Running a **problem-solver pair** can take anywhere from a couple of seconds to a couple of minutes depending on the **problem-solver pair** and the number of macroreplications.\r\n\r\n### Post-Processing and Post-Normalization\r\nPost-processing happens before post-normalizing and after the run is complete. You can specify the number of post-replications and the (proxy) optimal solution or function value.  After post-normalization is complete, the Plotting window appears.\r\nTo exit out of the Post-Process/Normalize pop-up without post-processing or post-normalizing, click the red \"x\" in the top-left corner of the window.\r\n\r\n#### - **problem-solver pair**\r\n**problem-solver pair**s can be post-processed from the \"Queue of **problem-solver pair**s\" tab by clicking \"Post-Process.\" Adjust Post-Processing factors as necessary. Only **problem-solver pair**s that have already been run can be post-processed. After post-processing, click the \"Post-Normalize by Problem\" tab to select which **problem-solver pair**s to post-normalize together.\r\n* Only **problem-solver pair**s with the same problem can be post-normalized together.\r\n* Once all **problem-solver pair**s of interest are selected, click the \"Post-Normalize Selected\" button at the bottom of the GUI (this button only appears when in the Post-Normalize tab).\r\n* In the new pop-up form, update any values necessary and click \"Post-Normalize\" when the **problem-solver pair**s are ready to be post-normalized.\r\n\r\n#### - **problem-solver group**\r\n**problem-solver group**s are post-processed and post-normalized at the same time. In the \"Queue of **problem-solver group**s\" tab, click the \"Post-Process\" button for the specific **problem-solver group**, then change any values necessary, then click \"Post-Process\".\r\n\r\n### Plotting\r\nThe Plotting page is identical for both **problem-solver pair**s and **problem-solver group**s. Currently, multiple **problem-solver pair**s with the same problem can be plotted together, and any problem-solver pair from a single **problem-solver group** can be plotted together:\r\n1. On the left side, select one or more problems from the problem list.\r\n2. Select solvers from the solver list.\r\n3. On the right side, select a plot type and adjust plot parameters and settings.\r\nThere are 5 settings common to most plot types: Confidence Intervals, Number of Bootstrap Samples, Confidence Level, Plot Together, and Print Max HW.\r\nThe type of plots that are currently available in the GUI are: Mean Progress Curve, Quantile Progress Curve, Solve Time CDF, Scatter Plot, CDF Solvability, Quantile Solvability, CDF Difference Plot, Quantile Difference Plot, Terminal Box/Violin, and Terminal Scatter.\r\n4. Click \"Add.\"\r\n5. All plots will show in the plotting queue, along with information about their parameters and where the file is saved.\r\n6. To view one plot, click \"View Plot.\" All plots can be viewed together by clicking \"See All Plots\" at the bottom of the page.\r\n7. To return to the main page, click the red \"x\" in the top-left corner of the window.\r\n\r\n## Contributing\r\nYou can contribute problems and solver to SimOpt by using [pull requests](https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/proposing-changes-to-your-work-with-pull-requests/about-pull-requests) in GitHub or corresponding with the developers. \r\n\r\n\r\n## Package\r\nThe `simoptlib` package is available to download through the Python Packaging Index (PyPI) and can be installed from the terminal with the following command:\r\n\r\n    python -m pip install simoptlib\r\n\r\n## Basic Example\r\n\r\nAfter installing `simoptlib`, the package's main modules can be imported from the Python console (or in code):\r\n\r\n    import simopt\r\n    from simopt import models, solvers, experiment_base\r\n\r\nThe following snippet of code will run 10 macroreplications of the Random Search solver (\"RNDSRCH\") on the Continuous Newsvendor problem (\"CNTNEWS-1\"):\r\n\r\n    myexperiment = simopt.experiment_base.ProblemSolver(\"RNDSRCH\", \"CNTNEWS-1\")\r\n    myexperiment.run(n_macroreps=10)\r\n\r\nThe results will be saved to a .pickle file in a folder called `experiments/outputs`. To post-process the results, by taking, for example 200 postreplications at each recommended solution, run the following:\r\n\r\n    myexperiment.post_replicate(n_postreps=200)\r\n    simopt.experiment_base.post_normalize([myexperiment], n_postreps_init_opt=200)\r\n\r\nA .txt file summarizing the progress of the solver on each macroreplication can be produced:\r\n    \r\n    myexperiment.log_experiment_results()\r\n\r\nA .txt file called `RNDSRCH_on_CNTNEWS-1_experiment_results.txt` will be saved in a folder called `experiments/logs`.\r\n\r\nOne can then plot the mean progress curve of the solver (with confidence intervals) with the objective function values shown on the y-axis:\r\n    \r\n    simopt.experiment_base.plot_progress_curves(experiments=[myexperiment], plot_type=\"mean\", normalize=False)\r\n\r\nThe Python scripts in the `demo` folder provide more guidance on how to run common experiments using the library.\r\n\r\nOne can also use the SimOpt graphical user interface by running the following from the terminal:\r\n\r\n    python -m simopt.GUI\r\n\r\n## Authors\r\nThe core development team currently consists of \r\n\r\n- [**David Eckman**](https://eckman.engr.tamu.edu) (Texas A&M University)\r\n- [**Sara Shashaani**](https://shashaani.wordpress.ncsu.edu) (North Carolina State University)\r\n- [**Shane Henderson**](https://people.orie.cornell.edu/shane/) (Cornell University)\r\n\r\n\r\n## Citation\r\nTo cite this work, please use\r\n```\r\n@misc{simoptgithub,\r\n  author = {D. J. Eckman and S. G. Henderson and S. Shashaani and R. Pasupathy},\r\n  title = {{SimOpt}},\r\n  year = {2021},\r\n  publisher = {GitHub},\r\n  journal = {GitHub repository},\r\n  howpublished = {\\url{https://github.com/simopt-admin/simopt}},\r\n  commit = {eda24b9f6a5885a37321ad7f8534bf10dec22480}\r\n}\r\n```\r\n\r\n## Acknowledgments\r\nAn earlier website for SimOpt, [http://www.simopt.org](http://www.simopt.org), was developed through work supported by the National Science Foundation under grant nos. DMI-0400287, CMMI-0800688 and CMMI-1200315.\r\nRecent work on the development of SimOpt has been supported by the National Science Foundation under grant nos. DGE-1650441, CMMI-1537394, CMMI-1254298, CMMI-1536895, CMMI-2206972, IIS-1247696, and TRIPODS+X DMS-1839346, by the Air Force Office of Scientific Research under grant nos. FA9550-12-1-0200, FA9550-15-1-0038, and FA9550-16-1-0046, and by the Army Research Office under grant no. W911NF-17-1-0094.\r\nAny opinions, findings and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the National Science Foundation (NSF).\r\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "",
    "license": "MIT License  Copyright (c) 2019 simopt-admin  Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:  The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.  THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE. ",
    "maintainer": "",
    "maintainer_email": "",
    "name": "simoptlib",
    "package_url": "https://pypi.org/project/simoptlib/",
    "platform": null,
    "project_url": "https://pypi.org/project/simoptlib/",
    "project_urls": {
      "Documentation": "https://simopt.readthedocs.io/en/latest/",
      "Homepage": "https://github.com/simopt-admin/simopt"
    },
    "release_url": "https://pypi.org/project/simoptlib/1.0.2/",
    "requires_dist": [
      "numpy (>=1.21.6)",
      "scipy (>=1.7.3)",
      "matplotlib (>=3.2.2)",
      "pandas (>=1.3.5)",
      "seaborn (>=0.11.2)",
      "mrg32k3a (>=1.0.0)"
    ],
    "requires_python": ">=3.7",
    "summary": "A testbed for simulation-optimization experiments.",
    "version": "1.0.2",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16004115,
  "releases": {
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2388b199437b347d97b750e9b8d5aa12ed593ca628510dc8d69961f55e5d5102",
          "md5": "652f1fad8b77abd421e8ff3d4fcc10eb",
          "sha256": "6245b500e96806dc5f1d56ec1c4f226d01a300ff3bd65d20898963d307251aa2"
        },
        "downloads": -1,
        "filename": "simoptlib-1.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "652f1fad8b77abd421e8ff3d4fcc10eb",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 155696,
        "upload_time": "2022-08-23T17:19:01",
        "upload_time_iso_8601": "2022-08-23T17:19:01.090679Z",
        "url": "https://files.pythonhosted.org/packages/23/88/b199437b347d97b750e9b8d5aa12ed593ca628510dc8d69961f55e5d5102/simoptlib-1.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "18c88388dfff537304b0e6cd8ef3553345a51d554b11ccb60b3c3d8529fa3657",
          "md5": "32b09ab60b19536112dbd894cc55abb9",
          "sha256": "16c87999faf5b3b9dfc473d5458a1f47032429de256342e5ac82df73bc0ec6aa"
        },
        "downloads": -1,
        "filename": "simoptlib-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "32b09ab60b19536112dbd894cc55abb9",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 117733,
        "upload_time": "2022-08-23T17:19:03",
        "upload_time_iso_8601": "2022-08-23T17:19:03.107810Z",
        "url": "https://files.pythonhosted.org/packages/18/c8/8388dfff537304b0e6cd8ef3553345a51d554b11ccb60b3c3d8529fa3657/simoptlib-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "eb8591f50373605ecebc9da9ac8f82443fcedd022d153e6f99b3485452fa9425",
          "md5": "4529266189278c21e2bdf76558ee5c1c",
          "sha256": "fc101c061625dd2a2e5be0830bc0157f18a2d9feb25dbe31b8d71e0e292c1c51"
        },
        "downloads": -1,
        "filename": "simoptlib-1.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "4529266189278c21e2bdf76558ee5c1c",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 161003,
        "upload_time": "2022-10-31T16:55:35",
        "upload_time_iso_8601": "2022-10-31T16:55:35.594944Z",
        "url": "https://files.pythonhosted.org/packages/eb/85/91f50373605ecebc9da9ac8f82443fcedd022d153e6f99b3485452fa9425/simoptlib-1.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1b3d380372825715e692d801ae54df6012f9b893c0dde4bc9992583f20d34fd2",
          "md5": "dc49f1555045c1f96dbadea5b0dfa21b",
          "sha256": "ba7002257c08e29871a571a0a935ccf6b00f269d61b38359a8009e6a47c8c306"
        },
        "downloads": -1,
        "filename": "simoptlib-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "dc49f1555045c1f96dbadea5b0dfa21b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 120902,
        "upload_time": "2022-10-31T16:55:37",
        "upload_time_iso_8601": "2022-10-31T16:55:37.049349Z",
        "url": "https://files.pythonhosted.org/packages/1b/3d/380372825715e692d801ae54df6012f9b893c0dde4bc9992583f20d34fd2/simoptlib-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2d67145f1e86e305a8f12e7ae47c467b9027f1120b415c3ca961b24f626c004b",
          "md5": "ead8afe8b82fee801110d513eeb04fdd",
          "sha256": "7f1fb197f33a3b89495321cbe0ccc44fcf8ac4b976f6aa78f8621bbe6d25cf72"
        },
        "downloads": -1,
        "filename": "simoptlib-1.0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "ead8afe8b82fee801110d513eeb04fdd",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 164682,
        "upload_time": "2022-12-06T04:59:02",
        "upload_time_iso_8601": "2022-12-06T04:59:02.961756Z",
        "url": "https://files.pythonhosted.org/packages/2d/67/145f1e86e305a8f12e7ae47c467b9027f1120b415c3ca961b24f626c004b/simoptlib-1.0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9f0acf2be115e592e86df706dbb2d763caf3c3c0e60f6337bbf70f9de9788ecd",
          "md5": "585ab438110e652ca2105551e0d6d1c7",
          "sha256": "f057c5a71cefdbdb0902ca3a6b18cdeb31f12f6b32a0bc7300cb078f5270b433"
        },
        "downloads": -1,
        "filename": "simoptlib-1.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "585ab438110e652ca2105551e0d6d1c7",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 122707,
        "upload_time": "2022-12-06T04:59:05",
        "upload_time_iso_8601": "2022-12-06T04:59:05.053495Z",
        "url": "https://files.pythonhosted.org/packages/9f/0a/cf2be115e592e86df706dbb2d763caf3c3c0e60f6337bbf70f9de9788ecd/simoptlib-1.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "2d67145f1e86e305a8f12e7ae47c467b9027f1120b415c3ca961b24f626c004b",
        "md5": "ead8afe8b82fee801110d513eeb04fdd",
        "sha256": "7f1fb197f33a3b89495321cbe0ccc44fcf8ac4b976f6aa78f8621bbe6d25cf72"
      },
      "downloads": -1,
      "filename": "simoptlib-1.0.2-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "ead8afe8b82fee801110d513eeb04fdd",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.7",
      "size": 164682,
      "upload_time": "2022-12-06T04:59:02",
      "upload_time_iso_8601": "2022-12-06T04:59:02.961756Z",
      "url": "https://files.pythonhosted.org/packages/2d/67/145f1e86e305a8f12e7ae47c467b9027f1120b415c3ca961b24f626c004b/simoptlib-1.0.2-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "9f0acf2be115e592e86df706dbb2d763caf3c3c0e60f6337bbf70f9de9788ecd",
        "md5": "585ab438110e652ca2105551e0d6d1c7",
        "sha256": "f057c5a71cefdbdb0902ca3a6b18cdeb31f12f6b32a0bc7300cb078f5270b433"
      },
      "downloads": -1,
      "filename": "simoptlib-1.0.2.tar.gz",
      "has_sig": false,
      "md5_digest": "585ab438110e652ca2105551e0d6d1c7",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7",
      "size": 122707,
      "upload_time": "2022-12-06T04:59:05",
      "upload_time_iso_8601": "2022-12-06T04:59:05.053495Z",
      "url": "https://files.pythonhosted.org/packages/9f/0a/cf2be115e592e86df706dbb2d763caf3c3c0e60f6337bbf70f9de9788ecd/simoptlib-1.0.2.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}