{
  "info": {
    "author": "Saketh Gundlapalli",
    "author_email": "",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# Smart Crawler - v.0.0.3\n## _The Super smart Python Package for Web crawling_\n\nSmart Crawler is a light weight crawlling package that can be used for crawlling list of items from any webpage.\nAll you need to configure is the class names of the items need to be crawled and few other settings and you are all set up 😃.\n\n## 1. Features\n\n- Can crawl upto 10,000 pages in one stretch\n- Can seemlessly crawl both static and dynamically rendered webpages\n- Minimal setup and hassle free web crawling\n- Option to visualize the webpages that are being crawled\n- In-built delay timer to avoid bot/crawler detection by websites\n\n## 2. Tech\n\nProgramming Language(s) in use:\n- [Python 3](https://www.python.org/) \n\nDependency Package(s):\n\n- [Selenium 3.141.0](https://pypi.org/project/selenium/3.141.0/) - Python bindings for Selenium.\n- [Webdriver Manager 3.4.2](https://pypi.org/project/webdriver-manager/3.4.2/) - Library \n\nAnd of course Smart Crawler itself is open source with a [public repository](https://github.com/Saketh7382/smartcrawler) on GitHub.\n\n## 3. Installation\n\nInstall the package using pip.\n\n```sh\npip install smartcrawler\n```\n\nThis automatically installs selenium\\==3.141.0 and webdriver_manager==3.4.2\n\n## 4. Usage\n\nHere is the simple driver code for crawling the name and image of each product from mobiles section of [amazon.in](https://www.amazon.in/s?i=electronics&rh=n%3A1389401031&s=price-desc-rank&fs=true&qid=1645356896&ref=sr_st_price-desc-rank)\n\n```sh\nimport json\nfrom smartcrawler import Delay, Items, Crawler\n\ndelay = Delay(timer='random')\ndelay.set_timer(3,7)\n\nitems = Items({\n    \"body\": [\".s-result-item.s-asin:not([class*='AdHolder'])\"],\n    \"nextpage\": [\"a.s-pagination-next\",\".a-last > a\"],\n    \"name\": [\".a-color-base.a-text-normal\"],\n    \"image\": [\".s-asin .s-image\",\".s-asin .s-image\"]\n})\n\nbase_url = 'https://www.amazon.in/s?i=electronics&rh=n%3A1389401031&s=price-desc-rank&fs=true&qid=1645356896&ref=sr_st_price-desc-rank'\n\nc = Crawler(base=base_url, items=items, crawltype='pagination' , delay=delay, headless=True)\nc.run()\nflag = c.start()\n\nresult = list()\n\nwhile flag:\n    items = c.fetch()\n\n    for item in items:\n        result.append({\n            \"name\": item[\"name\"].text(),\n            \"image\": item[\"image\"].attr(\"src\")\n        })\n\n    flag = c.next()\n\nf = open(\"./output.json\",\"w\")\njson.dump(result, f, indent=2)\nf.close()\n```\n\n#### 4.1 Code Explaination:\n\n```sh\nfrom smartcrawler import Delay, Items, Crawler\n```\nWe need to import three classes namely Delay, Items and Crawler. (Detailed explaination of these classes in [next section](#5-explaining-various-classes-and-options))\n- **Delay:** class that is responsible for delayed timings between each crawling to avoid being detected as a bot.\n- **Items:** class that is resposible for storing the CSS information of the items that needs to be crawled.\n- **Crawler:** main crawler class that is responsible for crawling the information. Instances of Items class and Delay class are provided as input parameters to the Crawler class.\n\n---\n```sh\ndelay = Delay(timer='random')\ndelay.set_timer(3,7)\n```\n**Creating an instance of Delay class.** We need to provide the parameter timer to the class. In this example, the timer value is set to 'random'. (*More information regarding Delay class and various possible values of timer parameter and their functions are discussed in [next section](#5-explaining-various-classes-and-options)*).\n\nThe 'random' timer value means that the delay (in seconds) between each crawling would be random from time interval [min\\_time, max\\_time] which are in this case [3,7].\n\nThe default [min\\_time, max\\_time] interval will be [3,5]. We can change this range using `set_timer()` function as did in line 2.\n\n---\n\n```sh\nitems = Items({\n    \"body\": [\".s-result-item.s-asin:not([class*='AdHolder'])\"],\n    \"nextpage\": [\"a.s-pagination-next\",\".a-last > a\"],\n    \"name\": [\".a-color-base.a-text-normal\"],\n    \"image\": [\".s-asin .s-image\",\".s-asin .s-image\"]\n})\n```\n**Creating an instance of Item class**. The only input parameter to the Item class is a python dict that contains CSS information regarding the items that need to be crawled. The css information is nothing but the CSS selector of the element of intrest. You can learn more about CSS selectors [from here](https://www.w3schools.com/css/css_selectors.asp).\n\n- `body` : CSS selector for the body of the item that is of the intrest.\n- `nextpage` : CSS selector for the anchor tag or button that is responsible for pagination to the next page. It must be a clicakble element.\n- `name` : CSS selector for the name of the product.\n- `image`: CSS selector for the image of the product.\n\nNote: \n1. The `body` and `nextpage` values are mandatory and the program rises an error if we do not provide them. \n2. The `name` and `image` are user defined values.\n\n---\n\n```sh\nbase_url = 'https://www.amazon.in/s?i=electronics&rh=n%3A1389401031&s=price-desc-rank&fs=true&qid=1645356896&ref=sr_st_price-desc-rank'\n```\n\n**base_url** is the first page that our crawler crawls for data. After crawlling this link, our crawler clicks for the element `nextpage` that we have provided in the items instance above to go to the next page.\n\n---\n\n```sh\nc = Crawler(base=base_urls, items=items, crawltype='list' , delay=delay, headless=True)\nc.run()\nflag = c.start()\n\nresult = list()\n\nwhile flag:\n    items = c.fetch()\n\n    for item in items:\n        result.append({\n            \"name\": item[\"name\"].text(),\n            \"image\": item[\"image\"].attr(\"src\")\n        })\n\n    flag = c.next()\n\nf = open(\"./output.json\",\"w\")\njson.dump(result, f, indent=2)\nf.close()\n```\n\n1. First we have created the crawler instance 'c'. Crawler class needs to be configured with five input parameters, namely; base, items, crawltype, delay and headless. \n- `base_url`, `items` and `delay` instances that we have created above are passed to Crawler class using base, items and delay parameters respectively.\n- The parameters crawltype and headless will be discussed in length in subsequent sections, for this example, we kept values `pagination` and `True` for the parameters crawltype and headless respectively.\n2. `c.run()` creates a browser instance managed by selenium and webdriver_manager packages. Depending on the value of headless parameter False/True, the browser will be visible/invisible.\n3. `c.start()` is responsible for crawling the **base_url**. This function returns True always and we have stored it as a flag variable that begins a while loop.\n4. The while loop is started with flag variable as breaking condition, since `c.start()` always returns True, we enter the loop, where we fetch the items that has been crawled, in this case, items crawled from **base_url**.\n5. Inside the loop, we call `c.fetch()` which returns the crawled items as an CrawlObject class instanve. CrawlObject is an Iterable object. Each element inside the CrawlObject class is a CrawlItem class instance. Each CrawlItem instance in items can be indexed using the key values that we have used for initiating Items class earlier. In this case valid indexed will be `name` and  `image` (not `body` and `nextpage`, since they are not user defined key values). \n6. We use a for loop to access each CrawlItem class. As mentioned earlier, we access crawled element using its appropriate index value (`name` and  `image`), the data from these elements are accessed using one of the following ways:\n- If the element is something that contains text data (eg; span, p, etc...), you can access the element's text data using `text()` function. Here the name element is a span element and we require the text of the span element hence we use `item[\"name\"].text()` to access the data.\n- Another way to access the data is by `attr()` method. This method can be used if the data we are accessing is that of an attribute value of that particular element. In this case, we need the image element is an <img/> html element and we need the value of src attribute of the <img/> element. Hence we use `item[\"image\"].attr(\"src\")` to access the value of src attribute.\n7. The data extracted in above step are again stored as a key value pair and is appended to a list, here `result`.\n8. After successfully extracting the data that we have crawled, its time to move on to the next page and this can be achieved by `c.next()`. The `c.next()` works as same as `c.start()`. The metod `c.start()` is used to crawl the base page that is being specified using **base_url**.  `c.next()` on the other hand clicks on the element that we have mentioned using nextpage key in items instance. This loads the next page and the method crawls and loads the items crawled in the next page.\n9. As in `c.start()` which always returns True, `c.next()` only returns true of the nextpage element is found, clicked and loaded. If not it returns False. We again assign the return value of `c.next()` to the flag variable, which is the condition to continue or break the while loop.\n10. If next page is found, flag becomes True and we enter into the next iteration of the while loop and process is repeated from step.5, else the loop is breaked and we get out of the loop with crawled data being stored inside the `result` list.\n11. In the end, we store the `result` list into a json file.\n\n\n## 5. Explaining Various Classes and Options\n\nIn this section we will discuss all the three classes, namely; `Delay`, `Items` and `Crawler` that we use to perform crawling, in detail. We have already seen how to use them in above example, now let us look at what each and individual input parameters to these classes represent and various functionalities and advance options you can enable.\n\n### 5.1. Delay\nThe Delay class is responsible for to introduce delays (in seconds) in between crawling of two pages. This is necessary because most of the websites block the crawlers after certain number of crawls. In order to not get blocked and ensure a smooth crawling flow, we need to wait few seconds after each crawling so that websites do not recognise the crawler. \n\nThere are three types of delays we can introduce using this class. They are:\n1. `random` : This type introduces random delays in between each crawling. We need to set the time interval range and the class chooses the amount of delay time from within this provided range. For ex; if we set the range to [3,7], then the timer waits x seconds of time in between each crawling where x is random timing between 3 and 7 seconds (3 & 7 included).\n2. `static`: This type introduces a constant delay in between each crawling. For ex; if we set the timer to 5, then it waits 5 seconds after every crawl until end.\n3. `none`: This type does not introduces any kind of delay in between each crawling and crawler continues to crawl in its own speed. (Not recomended)\n\nWe can choose one of the above values to initiate the Delay class. This can be done using timer parameter.\n\n```sh\ndelay = Delay(timer='static')\n```\nThe default value of the timer parameter will be `random`.\n\n#### 5.1.1 set\\_timer()\n\n```sh\nDelay.set_timer(min_time, max_time)\n```\n\nThis function is used to set the delay value. It takes two parameters `min_time` and `max_time`. By default, these values are set to 3 & 5 respectively. That is if we use the type random delay, then by default the random time interval will be between 3 to 5 seconds. And in the same way if we use the static delay type, then the default delay time would be 3 seconds between each crawl.\n\nWe need to provide both `min_time` and `max_time` values in case we need to overwrite default delay values for a random delay type. In case of static delay type providing only  `min_time` value would be suffice. The `max_time` value would be ignored even if you used it on a static delay type.\n\nWe cannot use set_timer() function on a `none` type delay. This raises a `IllegalSetTimeError`.\n\n#### 5.1.2 Exceptions\n\n1. `MissingTimerValueError` : This is raised if we do not provide both min\\_time and max\\_time parameters for set\\_timer function over a random delay type or if do not provide min\\_time parameter for set\\_timer function over a static delay type.\n```sh\ndelay = Delay(timer='random')\ndelay.set_timer(3) #rises exception - case 1\n\ndelay = Delay(timer='static')\ndelay.set_timer() #rises exception - case 2\n```\n2. `MaxExceedsMinError` : This is raised if the value of min\\_time exceeds the value of max\\_time.\n```sh\ndelay.set_timer(10,7) #rises exception\n```\n3. `IllegalSetTimeError` : This is raised if the value use set\\_timer function over a none delay type\n```sh\ndelay = Delay(timer='none')\ndelay.set_timer(3,7) #rises exception\n```\n\n### 5.2 Items\n\nThe Items class is responsible for storing the CSS information of the items that we need to crawl. To initiate this class instance, we need to provide a python dictionary of key value pairs as an input parameter where the values are CSS selectors. This input dictionary follows certain rules. They are:\n\n1. The values of the dictionary should be CSS selectors and should be of either of type `str` or of type `list`. If you have just one CSS selector for the item, you can keep it as `str` and if you have bunch of selectors that point out to same value, for ex; in some pages, the name of the item is represented by CSS selector-1 and in some other pages it is by CSS selector-2, then you can all the possible CSS selectors of that item into a `list` and the Crawler will iterate over the list until it finds a match to crawl. \n2. There should be a key value pair with key being `body` and its value being CSS selector of the item's wrapper element. Usually while crawling list of items from a web page, the `body` will be the CSS selector that selects all the items in that page. This is a mandatory key and not providing the `body` key-value will raise `MissingItemsError`\n3. If the crawler type is `pagination` (you can learn more about types of Crawlers in [next sub section](#53-Crawler)), then we need to provide another mandatory key-value pair with key being `nextpage`. The value of it should be the CSS selector of the element that is responsible for pagination to the next page and it should be a clickable element (<a> or <button>).\n4. The other key value pairs in the dictionary are user defined. They can keep any name to the keys (except for body and nextpage) and the values should follow rule 1.\n\n#### 5.2.1 Exceptions\n\n1. `ItemsValueTypeError` : This is raised if we provide values other than `str` and `list` within input dictionary.\n```sh\nitems = Items({\n    \"body\": 123  #raises exception\n})\n```\n2. `EmptyListError` : This is raised if there we provide empty list as a value within input dictionary.\n```sh\nitems = Items({\n    \"body\": [] #raises exception\n})\n```\n\n### 5.3 Crawler\n\nThe Crawler class is responsible for performing crawling. We can initiate the Crawler class by setting up the following input parameters:\n1. `crawltype`: This input parameter decides the type of the crawler. There are two types of crawlers we can use to crawl the site. They are 'pagination' and 'list' respectively. \n- By setting the value to 'pagination', we are initiating the crawler with just one base_url, from which it clicks on 'nextpage' ([reference: section 5.2](#5-2-items)). \n- By setting the value to 'list' we provide the list of urls to crawl for the crawler before hand and it picks the next url to crawl from this list instead of relying on `nextpage` element.\n2. `base`: This input parameter takes either one URL (in case of crawltype='pagination') as str or list of URLs as list (in case of crawltype='list').\n3. `items`: Takes the instance of Items class.\n4. `delay`: Takes the instance of Delay class.\n5. `headless`: This input parameter takes either **True** or **False** as value. Setting it to True will allows the crawler in background without opening a browser instance. Setting it to False will open the browser and instance and user can check the webpage that the crawler is crawling at any particular time during the process.\n\n#### 5.3.1 run()\n\nThis function creates a browser instance. Depending on the value set to the `headless` input parameter, this browser instance will be visible/invisible.\n\n#### 5.3.2 start()\n\nThis function crawls the first URL, known as home URL or base URL. In pagination crawler type, this first URL will be the URL passed as value to the `base` parameter. In list crawler type, the crawler receives list of URLs from `base` parameter and the crawler shuffles these URLs and randomly picks one of the URL to be the base URL.\n\n#### 5.3.3 fetch()\n\nThis function gets the data that has been crawled at current iteration. It returns the crawled items as an CrawlObject class instanve. CrawlObject is an Iterable object. Each element inside the CrawlObject class is a CrawlItem class instance. Each CrawlItem instance in items can be indexed using the key values that we have used for initiating Items class earlier. (refer [section 4.1 for detailed explaination](#41-code-explaination))\n\n#### 5.3.3 next()\n\nThis function works as same as `c.start()`. The metod `c.start()` is used to crawl the base page that is being specified using `base` input parameter. `next()` on the other either hand clicks on the element that we have mentioned using nextpage key in items instance (in case of crawltype='pagination') or chooses another URL from the list provided using `base` parameter in case of crawltype='list'. This loads the next page and the method crawls and loads the items crawled in the next page. (refer [section 4.1 for detailed explaination](#41-code-explaination))\n\n## License\n\nMIT\n\n**Free Package, Hell Yeah!**\n\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "smartcrawler",
    "package_url": "https://pypi.org/project/smartcrawler/",
    "platform": "",
    "project_url": "https://pypi.org/project/smartcrawler/",
    "project_urls": null,
    "release_url": "https://pypi.org/project/smartcrawler/0.0.3/",
    "requires_dist": [
      "selenium (==3.141.0)",
      "webdriver-manager (==3.4.2)"
    ],
    "requires_python": ">=3.6",
    "summary": "Package for crawling items from webpages and store them as json file",
    "version": "0.0.3",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 12964700,
  "releases": {
    "0.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "fcf8f6fb5808e4cca055eabf444616f063ca886f597a95bf4de0133b8b5edd4d",
          "md5": "724d32ec3075e132710d77255c6e6480",
          "sha256": "95cabc48a69026627893b91b3e6371e1044dd107e24ba2a6cc84a148613c3823"
        },
        "downloads": -1,
        "filename": "smartcrawler-0.0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "724d32ec3075e132710d77255c6e6480",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 5204,
        "upload_time": "2022-02-20T15:00:19",
        "upload_time_iso_8601": "2022-02-20T15:00:19.900375Z",
        "url": "https://files.pythonhosted.org/packages/fc/f8/f6fb5808e4cca055eabf444616f063ca886f597a95bf4de0133b8b5edd4d/smartcrawler-0.0.2-py3-none-any.whl",
        "yanked": true,
        "yanked_reason": "Unavailability of long description"
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "db7f102effbfb31fc9ab0a7ff73e78ec03974ae0009638a24f6441ed86b0d267",
          "md5": "bd5f2cd4edac3488a095627c2a64caa5",
          "sha256": "fdf6c5d227ac34cdb9586f472f0d331b87284b475a82b9af2bcab8208a21758a"
        },
        "downloads": -1,
        "filename": "smartcrawler-0.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "bd5f2cd4edac3488a095627c2a64caa5",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 4525,
        "upload_time": "2022-02-20T15:00:21",
        "upload_time_iso_8601": "2022-02-20T15:00:21.720414Z",
        "url": "https://files.pythonhosted.org/packages/db/7f/102effbfb31fc9ab0a7ff73e78ec03974ae0009638a24f6441ed86b0d267/smartcrawler-0.0.2.tar.gz",
        "yanked": true,
        "yanked_reason": "Unavailability of long description"
      }
    ],
    "0.0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "735db5a2ac398b8153abf8b0586ecf80147bc149fb5108456e475ec0765df5b6",
          "md5": "bd09f2774cdc506def2ddcf518cb8706",
          "sha256": "8f806e8f9dbc4e6fa4fc19cc304d85756775cdd66976ef08bd4c00bf7a56054b"
        },
        "downloads": -1,
        "filename": "smartcrawler-0.0.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "bd09f2774cdc506def2ddcf518cb8706",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 10906,
        "upload_time": "2022-02-21T21:09:08",
        "upload_time_iso_8601": "2022-02-21T21:09:08.289758Z",
        "url": "https://files.pythonhosted.org/packages/73/5d/b5a2ac398b8153abf8b0586ecf80147bc149fb5108456e475ec0765df5b6/smartcrawler-0.0.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e84d7ef4017eaf68e5afd51a47d12b5308e0edc74edc0486a7e0c6aeebd3377f",
          "md5": "86e632dab91b2e730bcf28d25c8f2c4d",
          "sha256": "7504ecabebf313bef708e5c248df9650342f4ac9832174f0dc540cd16765d363"
        },
        "downloads": -1,
        "filename": "smartcrawler-0.0.3.tar.gz",
        "has_sig": false,
        "md5_digest": "86e632dab91b2e730bcf28d25c8f2c4d",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 16083,
        "upload_time": "2022-02-21T21:09:11",
        "upload_time_iso_8601": "2022-02-21T21:09:11.453854Z",
        "url": "https://files.pythonhosted.org/packages/e8/4d/7ef4017eaf68e5afd51a47d12b5308e0edc74edc0486a7e0c6aeebd3377f/smartcrawler-0.0.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "735db5a2ac398b8153abf8b0586ecf80147bc149fb5108456e475ec0765df5b6",
        "md5": "bd09f2774cdc506def2ddcf518cb8706",
        "sha256": "8f806e8f9dbc4e6fa4fc19cc304d85756775cdd66976ef08bd4c00bf7a56054b"
      },
      "downloads": -1,
      "filename": "smartcrawler-0.0.3-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "bd09f2774cdc506def2ddcf518cb8706",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6",
      "size": 10906,
      "upload_time": "2022-02-21T21:09:08",
      "upload_time_iso_8601": "2022-02-21T21:09:08.289758Z",
      "url": "https://files.pythonhosted.org/packages/73/5d/b5a2ac398b8153abf8b0586ecf80147bc149fb5108456e475ec0765df5b6/smartcrawler-0.0.3-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "e84d7ef4017eaf68e5afd51a47d12b5308e0edc74edc0486a7e0c6aeebd3377f",
        "md5": "86e632dab91b2e730bcf28d25c8f2c4d",
        "sha256": "7504ecabebf313bef708e5c248df9650342f4ac9832174f0dc540cd16765d363"
      },
      "downloads": -1,
      "filename": "smartcrawler-0.0.3.tar.gz",
      "has_sig": false,
      "md5_digest": "86e632dab91b2e730bcf28d25c8f2c4d",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 16083,
      "upload_time": "2022-02-21T21:09:11",
      "upload_time_iso_8601": "2022-02-21T21:09:11.453854Z",
      "url": "https://files.pythonhosted.org/packages/e8/4d/7ef4017eaf68e5afd51a47d12b5308e0edc74edc0486a7e0c6aeebd3377f/smartcrawler-0.0.3.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}