{
  "info": {
    "author": "Benjamin Trom",
    "author_email": "benjamintrom@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.10",
      "Programming Language :: Python :: 3.11",
      "Programming Language :: Python :: 3.8",
      "Programming Language :: Python :: 3.9"
    ],
    "description": "# Spawn Python\n\nA Python implementation of the Spawn protocol.\n\n## Overview\n\nThe Spawn Python module is a python implementation of the Spawn protocol. It allows you to run jobs on the Spawn platform from your python code. You can find the source code for the Spawn Python module on [GitHub](https://github.com/SpawnAI/spawn-py). The Spawn Python module is licensed under the [MIT License](https://opensource.org/licenses/MIT). The Spawn Python module is currently in beta, so please report any bugs or issues you encounter.\n\n## Installation\n\nInstall the library using pip:\n\n```bash\npip install spawn\n```\n\n## Usage\n\nTo use the Spawn Python module, you need to require it in your JavaScript code and create a Spawn client object. To get started, you need to create a Spawn account and create an app. You can find more information about creating a Spawn account and creating an app in the [Spawn documentation](https://spawn.ai/docs/). Once you have created an app, you can get the app_id, key, and secret from the app settings page. You can then use these values to create a Spawn client object:\n\n\n```py3\nfrom spawn import SpawnClient\n\nspawn = SpawnClient(TEST_APP_ID, TEST_APP_KEY, TEST_APP_SECRET)\n```\n\n### Administration of the users\n\n#### Authorizing or denying the access to the services\n\nUsing the Spawn-py client, you can manage how your customers can access our services. \n\nTo allow a user to access our services, you first need to create an app user. During the creation, you need to provide an identifier that will be necessary to access to the usage data. It will be refered in this client as an external id. This external id can be an email, a username, a phone number, a crypto wallet address, etc. \n\n```py\nuser = spawn.createAppUser(user_name)\n```\n\nOnce a user is created, you can allow or deny the usage of paid services for this user. This is done by handling the tokens of the user. You can create a token for a user by providing the external id of the user.\n\n\n```py\ntoken = spawn.createToken(user_name)\n```\n\nThere is no need to store the token in your database. You can retrieve it at any time by providing the external id of the user.\n\n```py\ntoken_value = spawn.getAppUserToken(user_name)\n```\n\nThere is no need to give a token for every utilisation. Once a token is created, it remain active until it is deleted. If you need to deny the access to a user, you can delete all the tokens of the user.\n\n```py\nis_deleted = spawn.deleteTokenOfAppUser(user_name)\n```\n\nMoreover, the AI usage of a user is limited by the amount of credit that you give it. You can set the credit of a user by providing the external id of the user and the amount of credit you want to give. This security is mandatory to avoid a user to use all the credit of your app.\n\n```py\ncredits = spawn.setCredit(user_name, 100);\n```\n\n#### Accessing user usage\n\nAs the administror of your application, you can access all the informations that we have on your users.\n\nYou can get the credit of a user by providing the external id of the user.\n```py\ncredits = spawn.getAppUserCredits(user_name)\n```\n\nYou can get the history of all the jobs that a user has run on our service.\n```py\nhistory = spawn.getAppUserJobHistory(user_name, 10, 0)\n```\n\nIf you want to get the specific result of a job (be it an image or an add-on), you can user the getResult method. You need to provide the job_id of the job you want to get the result of. It will return a json object with the result of the job.\n```py\nresults = spawn.getResults(job_id)\n```\n\nAs your user will be able to create add-ons, you will have a complete right to access them. All add-ons create by your customers and by you will be accessible by the getAddOnList method. It will return a json object with all the add-ons of your app.\n```py\naddons = spawn.getAddOnList()\n```\n\nMoreover, you can delete, share or rename any add-on created on your application.\n```py\nis_renamed = spawn.renameAddOn('User1/landscape add-on', 'forest add-on')\n\nis_shared = spawn.shareAddOn('User1/forest add-on', 'Benoit')\n\nis_deleted = spawn.deleteAddOn('User1/forest add-on');\n```\n\n\n### Usage of IA services\n\nEven if this the Spawn-py client is created to manage applications and its users, it has all the needed methods for running jobs on the Spawn platform. When running jobs on Spawn-py, you are seen as a super-user and do not have to use tokens or credit.\n\nTo know how many workers are active on the Spawn platform, you can use the getCountActiveWorker method. It will return the number of workers for each service.\n```py\ncount_workers = client.getCountActiveWorker();\n```\n\n#### Running an image generation job\n\nThe following example shows how to run a stable diffusion job with minimal parameters.\n\n```py\nresponse = client.runStableDiffusion(\"a cute cat\");\n```\n\nTo get the cost of a job without running it, you can use the costStableDiffusion method. Its syntax is exactly the same as runStableDiffusion.\n\n```py\ncost = client.costStableDiffusion(\"a cute cat\");\n```\n\nIt is possible to specify additional parameters for the jobs. Those parameters are defined in this list :\n```js\n/**\n  * @param prompt - the description of the image to be generated\n  * @param args.negative_prompt - description of the image to be generated, but with negative words like \"ugly\", \"blurry\" or \"low quality\"\n  * @param args.width - the width of the generated image\n  * @param args.height - the height of the generated image\n  * @param args.steps - the number of steps of the StableDiffusion algorithm. The higher the number, the more detailed the image will be. Generally, 30 steps is enough, but you can try more if you want.\n  * @param args.batch_size - the number of images to be generated at each step.\n  * @param args.guidance_scale - the weight of the guidance image in the loss function. Typical values are between 5. and 15. The higher the number, the more the image will look like the prompt. If you go too high, the image will look like the prompt but will be low quality.\n  * @param args.init_image - the url of an initial image to be used by the algorithm. If not provided, random noise will be used. You can start from an existing image and make StableDiffusion refine it. You can specify the skip_steps to choose how much of the image will be refined (0 is like a random initialization, 1. is like a copy of the image).\n  * @param args.mask - the url of a mask image. The mask image must be a black and white image where white pixels are the pixels that will be modified by the algorithm. Black pixels will be kept as they are. If not provided, the whole image will be modified.\n  * @param args.skip_steps - the number of steps to skip at the beginning of the algorithm. If you provide an init_image, you can choose how much of the image will be refined. 0 is like a random initialization, 1. is like a copy of the image.\n  * @param args.seed - the seed of the random number generator. Using twice the same we generate the same image. It can be useful to see the effect of parameters on the image generated. If not provided, a random seed will be used.\n  * @param args.image_format - the format of the generated image. It can be \"png\" or \"jpeg\".\n  * @param args.nsfw_filter - if true, the image will be filtered to remove NSFW content. It can be useful if you want to generate images for a public website.\n  * @param args.translate_prompt - if true, the prompt will be translated to English before being used by the algorithm. It can be useful if you want to generate images in a language that is not English.\n  */\n```\n\nTo specify those parameters, you can use the runStableDiffusion method and pass in an object with the parameters you want to change as arguments.\n\n```py\nresponse = client.runStableDiffusion(\"a cute cat\",width: 640, height: 384, image_format: \"jpeg\");\n```\n\nMore specific at our plateform, you can alter your jobs by using one or multiple add-ons that are have been trained or shared to your application.\n```py\nresponse = client.runStableDiffusion(\"a cute cat\",patches: [\n      {\n        name: 'Serge/chinese_landscape',\n        alpha_text_encoder: 0.5,\n        alpha_unet: 0.5,\n        steps: 1000,\n      },\n    ]);\n```\n\nThe response object will contain the job_id of the job that was created. You can use this job_id to check the status of the job and to retrieve the results of the job. This result can take a few second to be produced.\n\n```js\nresult = client.getResult(response['job_id']);\n```\n\n#### Running a patch creation job\n\nThe following example shows how to run a patch creation job with minimal parameters.\n\n```py\nspawn = SpawnClient(TEST_APP_ID, TEST_APP_KEY, TEST_APP_SECRET)\n\ncost = spawn.costPatchTrainer(None,\"archilul\")\nassert cost.data > 0\n\ntrain_id = spawn.runPatchTrainer(\n    [\n        {\n            \"url\": \"https://img.sanctuary.fr/fiche/origin/78.jpg\",\n            \"label\": \"fcompo style, a group of people standing next to each other, by Otomo Katsuhiro, french comic style, zenescope, complex emotion, cover corp\"\n        }\n        # You can add more images here\n]\n,\"my_patch\")\n```\n\nTo get the cost of a job without posting it, you can use the costPatchTrainer method. Its syntax is the same as the runPatchTrainer method.\n\n```py\ncost = await spawn.costPatchTrainer(dataset, \"my_patch\");\n```\n\nTo train a patch, you need a list of images and label that will be used to train the patch. They will alter the stable diffusion model to generate images that are similar to the images you provide. The label is used to describe the images you provide. It can be a sentence or a list of words.\n\n## Documentation\n\nFor more information about the Spawn Python module, please refer to the [Spawn Python documentation](https://spawn.ai/docs/spawn-py).\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "spawn-py",
    "package_url": "https://pypi.org/project/spawn-py/",
    "platform": null,
    "project_url": "https://pypi.org/project/spawn-py/",
    "project_urls": null,
    "release_url": "https://pypi.org/project/spawn-py/0.1.0/",
    "requires_dist": [
      "postgrest-py (>=0.10.3,<0.11.0)",
      "python-dotenv (>=0.21.1,<0.22.0)",
      "websockets (>=10.4,<11.0)"
    ],
    "requires_python": ">=3.8,<4.0",
    "summary": "A python package to work with the Spawn API",
    "version": "0.1.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16945509,
  "releases": {
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "11c54cc74d6f4c72342e118f3f43879d719b1699e5cbd5e13c99fc749767d363",
          "md5": "8d4e02944097feb6f1f2240725bb9a24",
          "sha256": "f60401ba88bdc56c29b2d4103b5dd46f9396e5a05a6433862240294f361c4016"
        },
        "downloads": -1,
        "filename": "spawn_py-0.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "8d4e02944097feb6f1f2240725bb9a24",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8,<4.0",
        "size": 9158,
        "upload_time": "2023-02-20T16:10:46",
        "upload_time_iso_8601": "2023-02-20T16:10:46.145927Z",
        "url": "https://files.pythonhosted.org/packages/11/c5/4cc74d6f4c72342e118f3f43879d719b1699e5cbd5e13c99fc749767d363/spawn_py-0.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f20fa94e10714df38be838b36c7547e02fcb6b9e83c4ad717ef095ad8e0872f5",
          "md5": "b8379f3df858a63c2ccdde1005dce3e6",
          "sha256": "a33df6d37a23db0c575f821a5aadab6428724b8a0789384c3ce1dadf62c84c7b"
        },
        "downloads": -1,
        "filename": "spawn_py-0.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "b8379f3df858a63c2ccdde1005dce3e6",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8,<4.0",
        "size": 9013,
        "upload_time": "2023-02-20T16:10:47",
        "upload_time_iso_8601": "2023-02-20T16:10:47.541013Z",
        "url": "https://files.pythonhosted.org/packages/f2/0f/a94e10714df38be838b36c7547e02fcb6b9e83c4ad717ef095ad8e0872f5/spawn_py-0.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "11c54cc74d6f4c72342e118f3f43879d719b1699e5cbd5e13c99fc749767d363",
        "md5": "8d4e02944097feb6f1f2240725bb9a24",
        "sha256": "f60401ba88bdc56c29b2d4103b5dd46f9396e5a05a6433862240294f361c4016"
      },
      "downloads": -1,
      "filename": "spawn_py-0.1.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "8d4e02944097feb6f1f2240725bb9a24",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.8,<4.0",
      "size": 9158,
      "upload_time": "2023-02-20T16:10:46",
      "upload_time_iso_8601": "2023-02-20T16:10:46.145927Z",
      "url": "https://files.pythonhosted.org/packages/11/c5/4cc74d6f4c72342e118f3f43879d719b1699e5cbd5e13c99fc749767d363/spawn_py-0.1.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "f20fa94e10714df38be838b36c7547e02fcb6b9e83c4ad717ef095ad8e0872f5",
        "md5": "b8379f3df858a63c2ccdde1005dce3e6",
        "sha256": "a33df6d37a23db0c575f821a5aadab6428724b8a0789384c3ce1dadf62c84c7b"
      },
      "downloads": -1,
      "filename": "spawn_py-0.1.0.tar.gz",
      "has_sig": false,
      "md5_digest": "b8379f3df858a63c2ccdde1005dce3e6",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.8,<4.0",
      "size": 9013,
      "upload_time": "2023-02-20T16:10:47",
      "upload_time_iso_8601": "2023-02-20T16:10:47.541013Z",
      "url": "https://files.pythonhosted.org/packages/f2/0f/a94e10714df38be838b36c7547e02fcb6b9e83c4ad717ef095ad8e0872f5/spawn_py-0.1.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}