{
  "info": {
    "author": "Luis Falcon",
    "author_email": "stiletto@globalexposome.org",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 2 - Pre-Alpha",
      "Environment :: X11 Applications :: Qt",
      "Intended Audience :: Developers",
      "Intended Audience :: End Users/Desktop",
      "Intended Audience :: Healthcare Industry",
      "Intended Audience :: Science/Research",
      "License :: OSI Approved :: GNU General Public License (GPL)",
      "Natural Language :: English",
      "Operating System :: POSIX",
      "Programming Language :: Python :: 3",
      "Topic :: Scientific/Engineering :: Bio-Informatics",
      "Topic :: Scientific/Engineering :: Medical Science Apps."
    ],
    "description": "\n.. image:: https://www.gnuhealth.org/downloads/artwork/logos/stiletto-isologo.webp\n\n==========================================================================================\nStiletto: A computational model of the cerebral perforating arteries in health and disease\n==========================================================================================\n\n**Welcome to Stiletto!**\n\nOur project aims to develop a computational model of the cerebral perforating arteries, the structure, hemodynamics and vascular flow reactivity, autoregulation and their relation with the neurovascular unit (NVU) in health and disease. The project will provide a framework to simulate scenarios to try to better understand complex phenomena such as aging, the exposome and genetics involved in brain homeostasis and dysfunction.\n\nThe cerebral perforating arteries are a group of small vessels that supply important areas of the brain, including the basal ganglia. These arteries play a critical role in the brain, and their dysfunction is evidenced in the context of the small vessel disease (SVD) and neurodegenerative disorders. Given their sub-voxel caliber, the deep cerebral perforating arteries are difficult to evaluate and reconstruct using conventional radiological methods.\n\nSmall vessel disease encompasses a group of microangiopathies that share common radiological and clinical patterns, with a negative impact on the brain parenchyma.\nSVD is one of the leading causes of cognitive impairment in our societies. Cerebral microangiopathies are responsible of 25% of strokes and 45% of dementia [1]_ . SVD poses a serious and growing burden to the individual and the public health system.\n\nThe perforating arteries are very small vessels (diameter < 1mm) that, unlike larger arteries, are difficult to study with conventional radiological methods. The SVD term is used to group arteriopathies that share a common clinical and radiological pattern in the brain parenchyma, secondary to the original vascular lesion. White matter hyperintensities (WMI), leukoaraiosis (white matter rarefaction), microbleeds, lacunes and cerebral atrophy [2]_ are some radiological signs associated to this group of disorders. The relationship between these radiological findings, the clinical signs and cognitive impairment remains unclear.\n \nThe etiology of SVD is diverse: Inflammatory/immune (vasculitis), atherosclerotic (Binswanger) and genetic (CADASIL) are some examples of underlying causes. Endothelial dysfunction and neurovascular unit (NVU) impairment are common in these arteriopathies.\n\nThe exposome represents the sum of environmental factors that have an effect on the health of the individual throughout their life. Differences in SVD onset, severity and disease progression suggest the role of environmental and epigenetic factors. For instance, low-grade chronic inflammation is involved in autoimmune and neurodegenerative processes [3]_. Low-grade chronic inflammation has a higher prevalence among low socioeconomic status, poor nutritional habits and high emotional stress groups [4]_. We hope Stiletto can be a valuable tool to further study the role of environmental stressors on the brain microcirculation. \n\nThe Stiletto project will make use of computational models to simulate scenarios and interactive visualization. Our project will work on the basis of current anatomical knowledge and with human brain specimens, to better understand the micro anatomical features of the vasculature in health and disease contexts. We willinitially focus on thedeep branches of themiddle cerebral artery (MCA), the laterallenticulostriate arteries.These smallperforating arteries,with a mean diameter of 469 µm [5]_, originate from the M1 segment of the MCA, andprovide nutrients to thebasal ganglia.Due to the similarities among the deep perforating arteries, results from our project could be extrapolated to other perforators. \n\nIn addition, Stiletto will also be able to process clinical, genetic and demographic data from the participating institutions databases. The project will use solely Free/Libre software, libraries and datasets, including GNU Health [6]_, VTK [7]_ , UniProtKB [8]_ and Orthanc [9]_\n\nWe hope the Stiletto project will be useful in the following areas: \n\n*\t**Education**: A computer model to the brain microcirculation and the neurovascular unit.\n*\t**Research** on the cerebral small vessel disease (SVD): To get a better understanding of the underlying processes of the small vessel disease and its effect on the brain parenchyma.\n*\t**Precision medicine**: To assess the environmental, genetic and epigenetic factors unique to the individual's brain microcirculation. \n*\t**In silico drug discovery**: To provide an alternative, ethical, and human-focused computational model to drug discovery that does not use animal models and animal cruelty.\n\nStiletto is part of the Global Exposome Project (GEP) [10]_. The source code will be released under the GNU GPL v3 [11]_ and its documentation will be available under Creative Commons (CC-BY-SA) [12]_. As a member from the Global Exposome Project, any individual and institution that uses Stiletto will commit to open science and to a compassionate, human relevant biomedical research, without the use of nonhuman animal models [13]_\n\nJoin us! \n++++++++\n\nStiletto is a large, multidisciplinary project that is just starting! You'll find a welcoming, friendly international community that works together for the advancement of science, medicine and society. If you want to be part of the project, please send us a mail to stiletto@globalexposome.org\n\n\nReferences:\n+++++++++++\n\n.. [1] Shi Y, Thrippleton MJ, Blair GW, et al. Small vessel disease is associated with altered cerebrovascular pulsatility but not resting cerebral blood flow. J Cereb Blood Flow Metab. 2020;40(1):85-99. doi:10.1177/0271678X18803956 \n\n.. [2] Pantoni, L, Gorelik, P. Cerebral Small Vessel Disease. Cambridge Medicine, 2014\n\n.. [3] Furman D, Campisi J, Verdin E, Carrera-Bastos P, Targ S, Franceschi C, Ferrucci L, Gilroy DW, Fasano A, Miller GW, Miller AH, Mantovani A, Weyand CM, Barzilai N, Goronzy JJ, Rando TA, Effros RB, Lucia A, Kleinstreuer N, Slavich GM. Chronic inflammation in the etiology of disease across the life span. Nat Med. 2019 Dec;25(12):1822-1832. doi: 10.1038/s41591-019-0675-0. Epub 2019 Dec 5. PMID: 31806905; PMCID: PMC7147972.\n\n.. [4] Rupa, M. Patel, R Inflamed: Deep Medicine and the anatomy of Injustice. Farra, Straus and Giroux 2021\n\n.. [5] Djulejić V, Marinković S, Milić V, Georgievski B, Rašić M, Aksić M, Puškaš L. Common features of the cerebral perforating arteries and their clinical significance. Acta Neurochir (Wien). 2015 May;157(5):743-54; discussion 754. doi: 10.1007/s00701-015-2378-8. Epub 2015 Mar 14. PMID: 25772345.\n\n.. [6] GNU Health .- The Libre digital health ecosystem (https://www.gnuhealth.org)\n\n.. [7] VTK .- The Visualization Toolkit ( https://vtk.org)\n\n.. [8] UniprotKB .- The UniProt Knowledgebase (https://www.uniprot.org)\n\n.. [9] Orthanc project (https://www.orthanc-server.com/)\n\n.. [10] The Global Exposome Project (https://www.globalexposome.org)\n\n.. [11] GNU General Public License GPL (www.gnu.org)\n\n.. [12] Creative Commons (https://creativecommons.org)\n\n.. [13] A call to accelerate human-focussed medical research (https://www.animalfreeresearchuk.org/openletter/)\n\n\n\n\n",
    "description_content_type": "",
    "docs_url": null,
    "download_url": "https://www.gnusolidario.org",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://www.globalexposome.org/projects/stiletto",
    "keywords": "stiletto",
    "license": "GPL v3+",
    "maintainer": "",
    "maintainer_email": "",
    "name": "Stiletto",
    "package_url": "https://pypi.org/project/Stiletto/",
    "platform": "any",
    "project_url": "https://pypi.org/project/Stiletto/",
    "project_urls": {
      "Download": "https://www.gnusolidario.org",
      "Homepage": "https://www.globalexposome.org/projects/stiletto"
    },
    "release_url": "https://pypi.org/project/Stiletto/0.0.1/",
    "requires_dist": null,
    "requires_python": ">=3.10,<4",
    "summary": "A computational model of the cerebral perforating arteries",
    "version": "0.0.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 13050892,
  "releases": {
    "0.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f8b3679f409256167c86f954652a24ed672fd17145b271a774a5abd70b395983",
          "md5": "03661f57fe98c58ff26f537ba6618df0",
          "sha256": "be4f0cb2d96c2656c0b4cf18f7fac80386a497fe8b3e3a8ba7dd029ea7dbc55a"
        },
        "downloads": -1,
        "filename": "Stiletto-0.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "03661f57fe98c58ff26f537ba6618df0",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.10,<4",
        "size": 2014,
        "upload_time": "2022-02-28T13:48:07",
        "upload_time_iso_8601": "2022-02-28T13:48:07.758599Z",
        "url": "https://files.pythonhosted.org/packages/f8/b3/679f409256167c86f954652a24ed672fd17145b271a774a5abd70b395983/Stiletto-0.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "33c10a9ecebef4b21899a571d09accc2ba938cf879fa6afbf22a058e5fd4146b",
          "md5": "921cc1b67b86054f5cc796a1d0e9d6b9",
          "sha256": "1cf68d244e319af1222df81431acfba9cec84ff9005d4ddf4de4cad6fdfce648"
        },
        "downloads": -1,
        "filename": "Stiletto-0.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "921cc1b67b86054f5cc796a1d0e9d6b9",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.10,<4",
        "size": 18165,
        "upload_time": "2022-03-01T22:30:55",
        "upload_time_iso_8601": "2022-03-01T22:30:55.871976Z",
        "url": "https://files.pythonhosted.org/packages/33/c1/0a9ecebef4b21899a571d09accc2ba938cf879fa6afbf22a058e5fd4146b/Stiletto-0.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "33c10a9ecebef4b21899a571d09accc2ba938cf879fa6afbf22a058e5fd4146b",
        "md5": "921cc1b67b86054f5cc796a1d0e9d6b9",
        "sha256": "1cf68d244e319af1222df81431acfba9cec84ff9005d4ddf4de4cad6fdfce648"
      },
      "downloads": -1,
      "filename": "Stiletto-0.0.1.tar.gz",
      "has_sig": false,
      "md5_digest": "921cc1b67b86054f5cc796a1d0e9d6b9",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.10,<4",
      "size": 18165,
      "upload_time": "2022-03-01T22:30:55",
      "upload_time_iso_8601": "2022-03-01T22:30:55.871976Z",
      "url": "https://files.pythonhosted.org/packages/33/c1/0a9ecebef4b21899a571d09accc2ba938cf879fa6afbf22a058e5fd4146b/Stiletto-0.0.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}