{
  "info": {
    "author": "James Shi",
    "author_email": "yshi0914@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# Bert-based Information Extractive Summarizer\n\n## How it works\nIt first uses BERT-pretrained model to do the embedding for the sentences, then running a clustering algorithm (DBSCAN). \n\n\n## Previous work\nDerek Miller's has proposed a paper using BERT and some clustering algorithm (KMean) in the paper (https://arxiv.org/pdf/1906.04165.pdf). But there are some limitations in his work. Our approach has overcomed some weakness. This tool utilizes the HuggingFace Pytorch transformers library to run extractive summarizations. \nThis library also uses coreference techniques, utilizing the \n(https://github.com/huggingface/neuralcoref) neuralcoref library to resolve words in summaries that need more context. The greedyness of \nthe neuralcoref library can be tweaked in the CoreferenceHandler class.\nPaper (https://arxiv.org/abs/1906.04165)\n\n## Install packages\n\n```bash\npip install pandas\npip install spacy\npip install transformers\npip install neuralcoref\npip install pandas\npip install gensim\npip install scipy\npip install sklearn\npip install matplotlib\npip install torch\npip install matplotlib\npip install seaborn\npython -m spacy download en_core_web_md\n```\n#### Large Example using CNN\n\n```python\nfrom summarizer import Summarizer\n\nbody = '''\n(CNN) -- Can a movie actually convince you to support torture? Can a movie really persuade you that \"fracking\" -- a process used to drill for natural gas -- is a danger to the environment? Can a movie truly cause you to view certain minority groups in a negative light?\n\nSome scoff at the notion that movies do anything more than entertain. They are wrong. Sure, it's unlikely that one movie alone will change your views on issues of magnitude. But a movie (or TV show) can begin your \"education\" or \"miseducation\" on a topic. And for those already agreeing with the film's thesis, it can further entrench your views.\n\nAnyone who doubts the potential influence that movies can have on public opinion need to look no further than two films that are causing an uproar even before they have opened nationwide. They present hot button issues that manage to fire up people from the left and right.\n\nThe first, \"Zero Dark Thirty,\" is about the pursuit and killing of Osama bin Laden, which features scenes of torture. The second, \"Promised Land,\" stars Matt Damon and explores how the use of fracking to drill for natural gas can pose health and environmental dangers.\n\nCritics of \"Zero Dark Thirty\" fear that audiences will accept as true the film's story line that torture was effective in eliciting information to locate bin Laden. They are rightfully concerned that the film will sway some to become more receptive or even supportive of the idea of torturing prisoners.\n\nPeter Bergen: Did torture really net bin Laden?\n\nOpposition to the film escalated last week as three senior U.S. senators -- John McCain, Carl Levin and Dianne Feinstein -- sent a letter to the film's distributor, Sony Pictures, characterizing the film's use of torture as \"grossly inaccurate and misleading.\" The senators bluntly informed Sony Pictures that it has \"an obligation to state that the role of torture in the hunt for Osama bin Laden is not based on the facts, but rather part of the film's fictional narrative.\"\n\nThe hostility toward \"Promised Land\" shows us that it's not just politicians who complain about movie messages. Big business -- namely, the gas industry -- is aggressively objecting to the allegation in \"Promised Land\" that fracking poses environmental and health risks.\n\nHow concerned is the gas industry?\n\nIt has set up a rapid response team to counter publicity for the film by using two Washington-based groups that lobby for gas and oil companies: the Independent Petroleum Association of America and Energy in Depth. These groups have scrutinized appearances by the films stars on talk shows, questioned who the financiers of the film are, published parts of the script and mocked the film on social media.\n\nEnergy in Depth went as far as to \"fact check\" a recent appearance by the film's co-star and co-writer, John Krasinski, on \"Late Night With David Letterman.\" Within hours of Krasinski's appearance, Energy in Depth posted a blog on its website pointing out what it perceived as factual errors made by Krasinski about fracking.\n\nRegardless of whether \"Zero Dark Thirty\" and \"Promised Land\" intended to promote any message, people who watch them will be \"educated\" in some way on torture and fracking -- even if very subtly.\n\nThis is the same reason that minority groups continue to object to being represented in a negative light in movies and TV. They understand that accurate representations matter because studies have shown that biases can form based on stereotypes or inaccurate representations. (Being of Italian and Arab descent, I'm acutely aware of this issue as my respective heritages have been represented by a parade of mobsters and terrorists.)\n\nWhat's Hollywood's role in all of this? The same as it has always been -- to make money.\n\nIn fact, there's no doubt that the studios behind these movies are overjoyed at the controversy that has erupted and the resulting free press. Indeed, the response of Sony Pictures to the uproar over \"Zero Dark Thirty\" tells you about what they really hope we will all do: \"We encourage people to see the film before characterizing it.\"\n\nSo go ahead, enjoy these films and ones like them that are based on actual events or current hot issues. But while you are watching them, be aware you might be getting more than the price of ticket. You might also be getting a (mis)education.\n\nThe opinions expressed in this commentary are solely those of Dean Obeidallah.\n\n'''\n\nmodel = Summarizer()\nresult = model(body, min_length=65)\noutputStr = ''.join(result)\nprint(outputStr)\n```\n* ratio: it is a parameter used to set the min points for identify the core point. (default to 0.2)\n* min_length: The minimum length to accept as a sentence. (default to 25)\n* max_length: The maximum length to accept as a sentence. (default to 500)\n\n## Future work\nThe identification of suitable epsilon can be automated.\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/yshi0914/bert-based-extractive-summarizer",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "summarizer-yshi0914",
    "package_url": "https://pypi.org/project/summarizer-yshi0914/",
    "platform": "",
    "project_url": "https://pypi.org/project/summarizer-yshi0914/",
    "project_urls": {
      "Homepage": "https://github.com/yshi0914/bert-based-extractive-summarizer"
    },
    "release_url": "https://pypi.org/project/summarizer-yshi0914/0.0.1/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "A BERT-based DBSCAN summarizer package",
    "version": "0.0.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 7798938,
  "releases": {
    "0.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "05b8c7cbdd5acab8e27f2ead913993e1ac0f4f78d86b7d8f6b88d081555a928f",
          "md5": "89c4e839310679c3224b5338161ac05e",
          "sha256": "6d0545e2e37ceb137982a279b72f71af11ad21a932d3c07391809b5287216ddc"
        },
        "downloads": -1,
        "filename": "summarizer_yshi0914-0.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "89c4e839310679c3224b5338161ac05e",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 14120,
        "upload_time": "2020-07-27T14:15:30",
        "upload_time_iso_8601": "2020-07-27T14:15:30.665083Z",
        "url": "https://files.pythonhosted.org/packages/05/b8/c7cbdd5acab8e27f2ead913993e1ac0f4f78d86b7d8f6b88d081555a928f/summarizer_yshi0914-0.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8474c1a942d9384c4be5ffa543d7ae55ff8b6841fff7db945371a34eed0d97b6",
          "md5": "aee37f8baa94bbe6462c22a696426410",
          "sha256": "b549d30bcb8ad7e0a330c62b9d227caf0f3171125be3649c3c4578fc4e36c65c"
        },
        "downloads": -1,
        "filename": "summarizer-yshi0914-0.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "aee37f8baa94bbe6462c22a696426410",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 11900,
        "upload_time": "2020-07-27T14:15:41",
        "upload_time_iso_8601": "2020-07-27T14:15:41.102779Z",
        "url": "https://files.pythonhosted.org/packages/84/74/c1a942d9384c4be5ffa543d7ae55ff8b6841fff7db945371a34eed0d97b6/summarizer-yshi0914-0.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "05b8c7cbdd5acab8e27f2ead913993e1ac0f4f78d86b7d8f6b88d081555a928f",
        "md5": "89c4e839310679c3224b5338161ac05e",
        "sha256": "6d0545e2e37ceb137982a279b72f71af11ad21a932d3c07391809b5287216ddc"
      },
      "downloads": -1,
      "filename": "summarizer_yshi0914-0.0.1-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "89c4e839310679c3224b5338161ac05e",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 14120,
      "upload_time": "2020-07-27T14:15:30",
      "upload_time_iso_8601": "2020-07-27T14:15:30.665083Z",
      "url": "https://files.pythonhosted.org/packages/05/b8/c7cbdd5acab8e27f2ead913993e1ac0f4f78d86b7d8f6b88d081555a928f/summarizer_yshi0914-0.0.1-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "8474c1a942d9384c4be5ffa543d7ae55ff8b6841fff7db945371a34eed0d97b6",
        "md5": "aee37f8baa94bbe6462c22a696426410",
        "sha256": "b549d30bcb8ad7e0a330c62b9d227caf0f3171125be3649c3c4578fc4e36c65c"
      },
      "downloads": -1,
      "filename": "summarizer-yshi0914-0.0.1.tar.gz",
      "has_sig": false,
      "md5_digest": "aee37f8baa94bbe6462c22a696426410",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 11900,
      "upload_time": "2020-07-27T14:15:41",
      "upload_time_iso_8601": "2020-07-27T14:15:41.102779Z",
      "url": "https://files.pythonhosted.org/packages/84/74/c1a942d9384c4be5ffa543d7ae55ff8b6841fff7db945371a34eed0d97b6/summarizer-yshi0914-0.0.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}