{
  "info": {
    "author": "Johan Forsberg",
    "author_email": "johan.forsberg@maxiv.lu.se",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "# SVG synoptic #\n\n\n## Important ##\n\nThere has been some refactoring of this library since version 2.1. The\nchanges are mostly under the hood, but there is one change that needs\nto be done to existing synoptics to work with later versions: a\n\"backend\" must be loaded. At the moment, only the Qt backend is\nusable, which works exactly like it used to, it's just separated out\nand needs this line to be loaded from the HTML, e.g.:\n\n    <script src=\"js/qt_backend.js\"></script>\n\nSee the examples if this is unclear.\n\n\n## Installation ##\n\nLike any python package. E.g. to install in a virtualenv:\n\n    $ pip install svgsynoptic2\n\nYou can also use conda:\n\n    $ conda install -c conda-forge svgsynoptic2\n\n\n## Examples ##\n\n    $ cd examples\n    $ python simple_example\n    $ python tango_example\n\n## Introduction ##\n\nThe SVG synoptic enables an intuitive way of interaction with a control system, by displaying a graphical representation (e.g. a drawing) of the physical and/or logical structure, and allowing various information and interactions to be tied in to this representation. The user can interact by panning/zooming (if the drawing is complex enough to require this) and \"hovering\"/clicking elements to bring up informations or launch more specific panels.\n\nThe library is developed with the TANGO control system in mind, and has a Qt widget implementation based on Taurus. It should however be possible to adapt it to other systems as well.\n\nA SVG synoptic consists mainly of an SVG format file, that can be produced in any way. There are various software packages that can be used (inkscape is a good FOSS alternative) that can be used by non-programmers, but since SVG is an open, XML based format, it is possible to generate the files programmatically. \n\nBy annotating elements in the SVG file, they can be connected to control system items, displaying e.g. the current on/off state, an alarm, or a numerical value. \n\nThe SVG synoptic can be run as a standalone application or embedded in a Qt application. There is also work underway to make it possible to run as a \"web application\".\n\n\n## Usage ##\n\nTo make a simple synoptic application, all you need to do is copy the structure of one of the demo applications, create a SVG file of the correct structure, and modify \"index.html\" to suit your needs. \n\n### The SVG file ###\n\nThis is really the most important part of any synoptic application. It can in principle contain anything that is supported by SVG (caveat: the application uses the PyQt5's QWebEngineView widget to display the SVG. Not all the newest SVG features may be supported.) \n\n#### Structure ####\n\nThe only restriction of the file is that it has to conform to a certain layer structure (the names of the layers matter, except when noted. All layers except the toplevel are optional.):\n\n* *main* (name does not matter, but there needs to be a toplevel layer, containing all the other layers)\n  - *symbols* (a \"scratch\" layer; will not be displayed by the application)\n  - *background* (should contain stuff that will always be visible)\n  - *Vacuum* (can be any name, can be show/hidden by the user)\n  - *Stuff* (same)\n  - ...\n\nFurther, each of the layers can optionally have sublayers of the names \"zoom0\", \"zoom1\", and so on. These will be used at different detail levels depending on user navigation. Things drawn outside of these sublayers are shown in every zoom level of the layer.\n\n- Stuff\n  + zoom0  (a general overview, that is shown when the app is started)\n  + zoom1  (more detailed view of the parts)\n  + zoom3  (super detailed view with individual equipment, etc)\n\nThe scales where the different zoom levels will become active can be tweaked through a configuration option, see below.\n\n#### Models ####\n\nIn order to connect your drawing to TANGO, you need to insert references to devices or attributes. This is done through the \"desc\" SVG element which can be inserted into most SVG elements. \n\nA desc element containing a text like \"model=sys/tg_test/1\" will connect the container element to the test device. This means that the element will be colored (\"fill\") according to the State of the device, and also that left clicking the element will by default open the device using a Taurus device panel. The click behavior can be overridden by python code.\n\nAdding an attribute as a model (e.g. \"model=sys/tg_test/1/ampli\") to a text element will instead cause it to display the current value of the element. If the \"State\" attribute is given, the fill color will also be set accordingly.\n\nIt's also possible to name a part of the drawing as a \"section\" by setting a desc like \"section=MySection\". This part will then become clickable, causing the view to zoom in on it.\n\n##### Models in separate json file #####\nIt is possible to store the actual tango models in a separate json config file, and have aliases in the SVG file. The aliases must be surrounded by $-signs, for example:\n\n```model=$valve1$```\n\nThe config file then needs a line:\n \n ```\"valve1\" : \"bxxx/vac/valve-01\"```\n\nThe model list is injected into the html-file. In order for this to work the html file needs a placeholder where this should go:\n\n```<script type=\"text/javascript\">/*configplaceholder*/</script>```\n\nFinally, to import the list of models call the setConfig() function of the widget giving the name of the json file. See also the \"tango\" example.\n\n\n\n#### Tips & tricks ####\n\nThe SVG format has lots of features that can be useful for a synoptic. There are no particular restrictions to what features can be used, except for what's actually supported by the browser component used. Since it's an evolving standard, some newer features may not be supported by the PyQt5's widgets so it's important to test that before relying on it.\n\nInkscape is a very powerful tool and it's worth putting a little time into learning to use it effectively. It has many helpful features that may not be immediately obvious. \n\n##### Groups #####\nIt's often practical to group elements together to form more complex shapes. You can set the model on a group as usual. Groups can also be cloned. Note that the State color will only affect parts of the group that do not have inline fill styles (see \"Troubleshooting\" below). This effect can be used to e.g. make an icon that contains a lamp that is colored according to state. \n\n##### Clones #####\nUsually a synoptic will contain a few different symbols that are reused several times, e.g. vacuum valves, pumps, etc. This can be quite tedious since you have to copy-paste each symbol everywhere every time you change its appearance. The \"clone\" functionality in inkscape allows you to create one \"master\" instance of each symbol (element or group) and then create clones of it to use in the drawing. \n    - Clones can't be edited, but changes made to the original are reflected by all clones. If the original is a group, you can edit it by double clicking it. It will then be entered (like a layer) and you can edit the contents.\n    - The model can be set individually on each clone. \n    - The original can be kept in the \"symbols\" layer (see above) so it's not visible.\n    - To check that your element is a clone, select it and check the bottom of the window, where it should say \"Clone of: ...\". \n    - Clones can safely be duplicated (Ctrl+d) into new clones. \n    - Avoid clones of clones, as this can cause unexpected behaviors.\n\n##### Alignment #####\nInkscape has lots of tools that make it easier to make drawings neat. The \"snap\" feature helps a lot with placement of elements, especially together with the \"grid\" and \"guide\" features. The \"Align and distribute\" panel also helps with spacing and lining up of elements. Holding the Control key when moving or rotating things is also helpful. Check inkscape's documentation for more information.\n\n##### Scaling #####\nBe careful about scaling elements, as it can easily make things look \"off\". This is especially true about text, and rotated elements. Holding down Control while scaling makes sure the width/height ratio is kept intact. Also, inkscape can be configured to keep line thickness constant when scaling. If you mess up the scaling of some object, it can be reset from inkscape through \"Object\"->\"Transform...\"->\"Matrix\", by checking the \"Edit current matrix\" box and clearing it. However this will also reset the position of your element, so if it's a clone it will be positioned on the original.\n\n\n#### Troubleshooting ####\n\nA generally useful tool to check issues is the \"XML Editor\" in inkscape. It can be used to inspect the resulting SVG file directly.\nAnother useful tool, it's a Web Inspector accessible via the F12 key in Synoptic. \n\n##### items do not display state colors correctly #####\n\nFirst, check that your model definition is correct. Then, check that the \"fill\" style is not set in the element's \"style\" attribute. Unsetting fill can be done by clicking the \"?\" button in the \"Fill and Stroke\" dialog. If it's a group, also check the elements in the group. An object with no inline fill should appear completely black in Inkscape.\n\nThe synoptic uses CSS classes to set the fill style, and that can be overridden by \"inline\" styles directly on the element. Inkscape uses inline styles to set fill, so it's quite likely to be an issue. \n\n\n## The HTML file ##\n\nNot too much to do in this file, but there are some settings for the synoptic that can be tweaked, and some functionality (\"plugins\") of the synoptic selectively loaded. Have a look at the HTML files in the examples to see how this is done. \n\nAlso, any background or foreground images, styling etc, should be done here. If more complex styling is required, separate CSS files may be loaded from here. Note that SVG can also be styled by CSS.\n\n### Zoom levels ###\n\nBy default there is assumed to be three zoom levels, at 1, 10 and 100 times each. This means that the first level (0) is only shown when the synoptic is maximally zoomed out, the next (1) is shown until it's zoomed in to 10 times enlargement, and finally, the last level (2) is shown up to a zoom factor 100, which is also the maximum allowed zoom.\n\nLet's say you have two zoom levels, and you want to switch between them at zoom factor 2 and allow sooming up to a factor 10. The config should then look like this:\n\n    {view: {zoomSteps: [2, 10]}}\n\n\n## Issues and limitations ##\n\nSome things to be aware of:\n\n* Currently, having SVG \"transform\" attributes on a *layer* causes all sorts of issues where models are not recognized as in view. Make sure the \"transform\" attribute is not set on any of your layers (most easily done through the XML editor in inkscape). It's quite easy to add this by mistake in inkscape, by selecting all elements in a layer and moving them at the same time. This will hopefully be handled better by a future version of SVG synoptic.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://gitlab.com/MaxIV/lib-maxiv-svgsynoptic",
    "keywords": "",
    "license": "GPLv3",
    "maintainer": "",
    "maintainer_email": "",
    "name": "svgsynoptic2",
    "package_url": "https://pypi.org/project/svgsynoptic2/",
    "platform": null,
    "project_url": "https://pypi.org/project/svgsynoptic2/",
    "project_urls": {
      "Homepage": "https://gitlab.com/MaxIV/lib-maxiv-svgsynoptic"
    },
    "release_url": "https://pypi.org/project/svgsynoptic2/4.2.0/",
    "requires_dist": [
      "pytango (>=9.2.1)",
      "taurus (>=4.5)",
      "pyqtwebengine"
    ],
    "requires_python": ">=3.6",
    "summary": "Widget for displaying a SVG synoptic.",
    "version": "4.2.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16789689,
  "releases": {
    "4.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e4ae1e33a138355e6efa4a28c4addd3db59a9dc033bccade27f465bf718ef016",
          "md5": "1b9dab03529415e94e8146185a8edebe",
          "sha256": "35d165182011a64a44ec73cef3be90d2bd560c189abf20b1b37bf7540d7b87a4"
        },
        "downloads": -1,
        "filename": "svgsynoptic2-4.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "1b9dab03529415e94e8146185a8edebe",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 230667,
        "upload_time": "2021-09-01T10:34:59",
        "upload_time_iso_8601": "2021-09-01T10:34:59.930798Z",
        "url": "https://files.pythonhosted.org/packages/e4/ae/1e33a138355e6efa4a28c4addd3db59a9dc033bccade27f465bf718ef016/svgsynoptic2-4.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d77dd931d0ac96262f9518bc570d1837aa9b7ce2c647be702a312a3b79c93d9d",
          "md5": "dbc18391ab8f59b539d3ad0d5b429a82",
          "sha256": "ae3626604fcbe6ffc662643c0f5ce2ac81f7c2023c119233386b69656a499549"
        },
        "downloads": -1,
        "filename": "svgsynoptic2-4.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "dbc18391ab8f59b539d3ad0d5b429a82",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 223896,
        "upload_time": "2021-09-01T10:35:01",
        "upload_time_iso_8601": "2021-09-01T10:35:01.791521Z",
        "url": "https://files.pythonhosted.org/packages/d7/7d/d931d0ac96262f9518bc570d1837aa9b7ce2c647be702a312a3b79c93d9d/svgsynoptic2-4.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "4.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0b51a904865f1027b673bfa3d69f1b43caf4850ccc0eba14cef42eff9128a424",
          "md5": "c6f2a4f561c3bda7dccc20576e663658",
          "sha256": "992c80d7285a95805d7a84707639abf89a9c3d09a1298acb8d3af1b3d1bd9fa8"
        },
        "downloads": -1,
        "filename": "svgsynoptic2-4.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "c6f2a4f561c3bda7dccc20576e663658",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 230748,
        "upload_time": "2021-11-25T09:10:19",
        "upload_time_iso_8601": "2021-11-25T09:10:19.331455Z",
        "url": "https://files.pythonhosted.org/packages/0b/51/a904865f1027b673bfa3d69f1b43caf4850ccc0eba14cef42eff9128a424/svgsynoptic2-4.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8fbf74a8cebc2b0722161695d44a9f4be262543ccbc9acc0a9bb5c0eae5110b4",
          "md5": "465a4a5337b47a4f8e7fddbba9b534b8",
          "sha256": "e76f60f1bd303c7745cc4a3e10c3f6ce31a8ee3b4728c5842d6211f3aada6ff2"
        },
        "downloads": -1,
        "filename": "svgsynoptic2-4.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "465a4a5337b47a4f8e7fddbba9b534b8",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 223969,
        "upload_time": "2021-11-25T09:10:20",
        "upload_time_iso_8601": "2021-11-25T09:10:20.811994Z",
        "url": "https://files.pythonhosted.org/packages/8f/bf/74a8cebc2b0722161695d44a9f4be262543ccbc9acc0a9bb5c0eae5110b4/svgsynoptic2-4.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "4.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4ac57a8024674e5ee71de0355211e6e360fdc366833146b1e51798bfafab13ea",
          "md5": "291a0faabfb4dc60850879e68f450317",
          "sha256": "22830195026d7b5dcafe86cadc016fbee4cd2139d638d67de29bbffde730dd05"
        },
        "downloads": -1,
        "filename": "svgsynoptic2-4.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "291a0faabfb4dc60850879e68f450317",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 230632,
        "upload_time": "2021-11-25T14:16:14",
        "upload_time_iso_8601": "2021-11-25T14:16:14.567825Z",
        "url": "https://files.pythonhosted.org/packages/4a/c5/7a8024674e5ee71de0355211e6e360fdc366833146b1e51798bfafab13ea/svgsynoptic2-4.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "081fb2d48d460694a68e7cfdfcf4fb2c66c419a6c67e819e9317aacefe1db99d",
          "md5": "eacf1b4f3c38df2f90a8f4a381e74e7e",
          "sha256": "65e4a1153c70a9e99894270f215b468d9886f3d0a289d75607a747071e22d19c"
        },
        "downloads": -1,
        "filename": "svgsynoptic2-4.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "eacf1b4f3c38df2f90a8f4a381e74e7e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 223946,
        "upload_time": "2021-11-25T14:16:15",
        "upload_time_iso_8601": "2021-11-25T14:16:15.994234Z",
        "url": "https://files.pythonhosted.org/packages/08/1f/b2d48d460694a68e7cfdfcf4fb2c66c419a6c67e819e9317aacefe1db99d/svgsynoptic2-4.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "4.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "12a87853a652d06c0af2cc66e1972c7cb5bd00eed9bc445301739f3462e7a68b",
          "md5": "9075a595fc2f456c05f02f1ff0cc441a",
          "sha256": "18c8864e0265c072f80e3e98c68c863edc84c970577e40158cb3df48c99d9147"
        },
        "downloads": -1,
        "filename": "svgsynoptic2-4.1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "9075a595fc2f456c05f02f1ff0cc441a",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 230621,
        "upload_time": "2022-01-11T13:54:10",
        "upload_time_iso_8601": "2022-01-11T13:54:10.609826Z",
        "url": "https://files.pythonhosted.org/packages/12/a8/7853a652d06c0af2cc66e1972c7cb5bd00eed9bc445301739f3462e7a68b/svgsynoptic2-4.1.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "74b79fd8c0690cd29756391c92728e73dbab77034347293734be6ca7156809a7",
          "md5": "721a858d32560772842690130fdeb9cf",
          "sha256": "791d6030e36aa2acd83c192ec37a4ad9067708754774ecf30c493cf1f3c2c4f7"
        },
        "downloads": -1,
        "filename": "svgsynoptic2-4.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "721a858d32560772842690130fdeb9cf",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 223962,
        "upload_time": "2022-01-11T13:54:11",
        "upload_time_iso_8601": "2022-01-11T13:54:11.802692Z",
        "url": "https://files.pythonhosted.org/packages/74/b7/9fd8c0690cd29756391c92728e73dbab77034347293734be6ca7156809a7/svgsynoptic2-4.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "4.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8bdba74e0156c88467a80641010fd927b99b7537c2b293a6c92550a84378f058",
          "md5": "5148dd8d1139b72225f3a18a7755358b",
          "sha256": "5125c0dc9ff3573b5e6e3a5ad098c6e307a5037aa2dc91975413e58d37d9a571"
        },
        "downloads": -1,
        "filename": "svgsynoptic2-4.1.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "5148dd8d1139b72225f3a18a7755358b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 230632,
        "upload_time": "2022-04-07T12:10:55",
        "upload_time_iso_8601": "2022-04-07T12:10:55.127507Z",
        "url": "https://files.pythonhosted.org/packages/8b/db/a74e0156c88467a80641010fd927b99b7537c2b293a6c92550a84378f058/svgsynoptic2-4.1.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3ee095725422c04fac0afac267d485ad9c69176e31e976d132b5c9839a8feb87",
          "md5": "d6115c9ce35a56dc2bddcd545b981a48",
          "sha256": "b5788faa939bc709201592318550fc7696af841dc53db5ba48b07d933709d243"
        },
        "downloads": -1,
        "filename": "svgsynoptic2-4.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "d6115c9ce35a56dc2bddcd545b981a48",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 224011,
        "upload_time": "2022-04-07T12:10:56",
        "upload_time_iso_8601": "2022-04-07T12:10:56.782491Z",
        "url": "https://files.pythonhosted.org/packages/3e/e0/95725422c04fac0afac267d485ad9c69176e31e976d132b5c9839a8feb87/svgsynoptic2-4.1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "4.1.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0370414eab8c05aae7742d380492a7b908901e40323aa84e0502c600f1aa4ff1",
          "md5": "017f004044f7122dffc671f9b45a57d8",
          "sha256": "9160c3f574e0090eadd064a90631de7c5efcacf26461a56078fccb7f9c46f7d1"
        },
        "downloads": -1,
        "filename": "svgsynoptic2-4.1.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "017f004044f7122dffc671f9b45a57d8",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 233613,
        "upload_time": "2022-09-14T11:58:37",
        "upload_time_iso_8601": "2022-09-14T11:58:37.456644Z",
        "url": "https://files.pythonhosted.org/packages/03/70/414eab8c05aae7742d380492a7b908901e40323aa84e0502c600f1aa4ff1/svgsynoptic2-4.1.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9c40ceed8e03c49c934d426587d545b669df07c03a0b22efd1caa6e0cf25187d",
          "md5": "54a771674bf47b60f60a69fa308d65f3",
          "sha256": "cb24f040bfb84e4f4196f30f6ff182b3753d955dd22682c1f9fe97180e25a867"
        },
        "downloads": -1,
        "filename": "svgsynoptic2-4.1.3.tar.gz",
        "has_sig": false,
        "md5_digest": "54a771674bf47b60f60a69fa308d65f3",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 226972,
        "upload_time": "2022-09-14T11:58:38",
        "upload_time_iso_8601": "2022-09-14T11:58:38.880642Z",
        "url": "https://files.pythonhosted.org/packages/9c/40/ceed8e03c49c934d426587d545b669df07c03a0b22efd1caa6e0cf25187d/svgsynoptic2-4.1.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "4.1.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b12b80739feea1c19d408be71ff49df28708b5267ad931a2b1556094ccdf02be",
          "md5": "ce275c1fe0845573872c8a3b439be241",
          "sha256": "59fa3e1bd95a563a9c218c7a883575b080e5ebc6b36d12f2fca871e720e48492"
        },
        "downloads": -1,
        "filename": "svgsynoptic2-4.1.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "ce275c1fe0845573872c8a3b439be241",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 233747,
        "upload_time": "2022-11-22T14:37:44",
        "upload_time_iso_8601": "2022-11-22T14:37:44.164718Z",
        "url": "https://files.pythonhosted.org/packages/b1/2b/80739feea1c19d408be71ff49df28708b5267ad931a2b1556094ccdf02be/svgsynoptic2-4.1.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c41f17d058a0fb55199b5e2d2596aad5d35e6ce694f9594a8a271db1f0aac8fd",
          "md5": "5fd806e0bb51398d3487d02f9f0e5ce4",
          "sha256": "31e1eacbc153c6f24f34bc868ab2068961c1c1fedfb0cdb22318ef1de1bf60a6"
        },
        "downloads": -1,
        "filename": "svgsynoptic2-4.1.4.tar.gz",
        "has_sig": false,
        "md5_digest": "5fd806e0bb51398d3487d02f9f0e5ce4",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 227135,
        "upload_time": "2022-11-22T14:37:45",
        "upload_time_iso_8601": "2022-11-22T14:37:45.808516Z",
        "url": "https://files.pythonhosted.org/packages/c4/1f/17d058a0fb55199b5e2d2596aad5d35e6ce694f9594a8a271db1f0aac8fd/svgsynoptic2-4.1.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "4.2.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3838af9b4e510515f9b8059462c2d28745336f5ea224179beba40d97c90939cf",
          "md5": "18aa4d184ad2939c7fb6b38b811ea5dc",
          "sha256": "6c5940c97f8f233557e50a1a25934fa6859dbda0a96fcc9ea6fa8c7a4f38e8bd"
        },
        "downloads": -1,
        "filename": "svgsynoptic2-4.2.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "18aa4d184ad2939c7fb6b38b811ea5dc",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 233993,
        "upload_time": "2023-02-10T13:39:03",
        "upload_time_iso_8601": "2023-02-10T13:39:03.673122Z",
        "url": "https://files.pythonhosted.org/packages/38/38/af9b4e510515f9b8059462c2d28745336f5ea224179beba40d97c90939cf/svgsynoptic2-4.2.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4266468fc20843d5976f340493d12d0c7603a4c92ddd9c364f9ab96c01e427f8",
          "md5": "45467a235f757262535a53243afbbed8",
          "sha256": "4b758282d04a90af41c42b917d70ff5ec9c8e0bb9d6593734b22d6bd3656f276"
        },
        "downloads": -1,
        "filename": "svgsynoptic2-4.2.0.tar.gz",
        "has_sig": false,
        "md5_digest": "45467a235f757262535a53243afbbed8",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 227391,
        "upload_time": "2023-02-10T13:39:05",
        "upload_time_iso_8601": "2023-02-10T13:39:05.483859Z",
        "url": "https://files.pythonhosted.org/packages/42/66/468fc20843d5976f340493d12d0c7603a4c92ddd9c364f9ab96c01e427f8/svgsynoptic2-4.2.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "3838af9b4e510515f9b8059462c2d28745336f5ea224179beba40d97c90939cf",
        "md5": "18aa4d184ad2939c7fb6b38b811ea5dc",
        "sha256": "6c5940c97f8f233557e50a1a25934fa6859dbda0a96fcc9ea6fa8c7a4f38e8bd"
      },
      "downloads": -1,
      "filename": "svgsynoptic2-4.2.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "18aa4d184ad2939c7fb6b38b811ea5dc",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6",
      "size": 233993,
      "upload_time": "2023-02-10T13:39:03",
      "upload_time_iso_8601": "2023-02-10T13:39:03.673122Z",
      "url": "https://files.pythonhosted.org/packages/38/38/af9b4e510515f9b8059462c2d28745336f5ea224179beba40d97c90939cf/svgsynoptic2-4.2.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "4266468fc20843d5976f340493d12d0c7603a4c92ddd9c364f9ab96c01e427f8",
        "md5": "45467a235f757262535a53243afbbed8",
        "sha256": "4b758282d04a90af41c42b917d70ff5ec9c8e0bb9d6593734b22d6bd3656f276"
      },
      "downloads": -1,
      "filename": "svgsynoptic2-4.2.0.tar.gz",
      "has_sig": false,
      "md5_digest": "45467a235f757262535a53243afbbed8",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 227391,
      "upload_time": "2023-02-10T13:39:05",
      "upload_time_iso_8601": "2023-02-10T13:39:05.483859Z",
      "url": "https://files.pythonhosted.org/packages/42/66/468fc20843d5976f340493d12d0c7603a4c92ddd9c364f9ab96c01e427f8/svgsynoptic2-4.2.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}