{
  "info": {
    "author": "Ben Avrahami",
    "author_email": "avrahami.ben@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 4 - Beta",
      "Environment :: Win32 (MS Windows)",
      "Intended Audience :: Developers",
      "License :: OSI Approved :: MIT License",
      "Programming Language :: Python :: 3"
    ],
    "description": "# Swimport\n## About\nSwimport is a python library to simplify automate the meandering and error-prone parts of making a [SWIG](http://www.swig.org/) interface file for python. \n\n**Swimport is an advanced tool, users are expected to have above-basic knowledge in both python and C++. As well as having read chapters 1, 2, 5-13, and 34 of [SWIG's documentation](http://www.swig.org/Doc3.0/)**\n\n**At present time, swimport is not, and is not designed to be, an 'automagical' .h to .i converter. Most usages will require additional user configuration to the output files. Users are advised to merely import the output file into a user-written file that includes the parts swimport can't/ isn't designed to handle.**\n\n## Installation and requirements\nSwimport requires the [CppHeaderParser module](https://pypi.org/project/CppHeaderParser/). Other than that, install like any other python library (Swimport is pure-python).\n\nTests and examples might have some additional requirements.\n## Usage\n### Abstract\n* The library reads C++ header files (.h) and creates a SWIG interface file (.i) that, when built with SWIG, using the source files and (optionally) the header files, will compile into a python module utilising the C++ code. \n\n### Structure\n* At first, Source objects are created from header file (.h) paths, they handle the reading and parsing of C++ objects in the source files.\n* Then, SwimRules are made to handle the imports of C++ objects. A SwimRule is composed of two distinct objects:\n    * A Trigger, that decides whether a C++ objects will be imported by the rule.\n    * A Behaviour, that handles the valid C++ objects and wraps them in a Swimporting object.\n    * Each C++ object kind (variable, method, ect., see below) has its own types for both Trigger and Behaviour, although custom classes can be used (see below).\n* The SwimRule processes a source file, checking which of its cpp objects pass the trigger, and returns Swimporting objects for those objects.\n* Swimporting objects are functions specialised for a particular C++ object and importing behaviour. \n* Usage of swimport revolves around the Swim object. The Swim receives the Swimporting objects and adds lines to itself.\n* Finally, the Swim object writes its lines to the output file.\n\n### Object Kinds\n#### Methods\nImporting methods requires special rules for how to handle parameters. These behave in a similar way, each with a trigger and behaviour. Common default behaviours and rules are built-in to the library (and are the default method behaviour, see below).\n\n#### Containers\nA container is a collective term for structs, classes, and unions. There are two ways to import containers.\n##### Trigger-Behaviour\nContainers support a rudimentary trigger-behaviour protocol. Note that this protocol should only be used for simple c structs. Without any constructors, methods, or any private or static members.\n##### ContainerSwim\nThe ContainerSwim object acts a pseudo-Swim object by itself, handling methods, static members, and extension methods (both on c++ and python side). See examples 37-43 for usage examples.\n\n#### Enums\nEnums can be imported using SwimRules as normal. Note that enum values are treated as global variables in python.\n##### Python enum Behaviour\nA special behaviour exists to wrap the c++ enum with a python enum class. Making it usable like a python enum.\n\n#### Variables and Constants\nVariables can be imported using SwimRules as normal. Constants declared with #define are not supported. NOTE: sharing a mutable value as a variable between C and python is tricky. See the official SWIG docs for an explanation but in general: all the C variables that are subject ot change during runtime MUST be accessed through the special cvar object in the library.\n##### GetSet Behaviour\nTo avoid the above quirk, a specialized behaviour for variables exists that instead generates getter and setter methods for the C variable. \n\n#### Typedefs\nTypedefs can be imported using SwimRules as normal. In cases where inter-dependant typedefs from multiple source need to be imported, a TypeDefAggregate object can used to aggregate the typedefs and sort them appropriately.\n\n#### Types\nA type is a virtual C++ object. A type can be used to convert complex C++ types to Python objects. Swimporting objects for types must be created directly.\n##### Typemaps\nUsing types requires writing SWIG typemaps. The most common way to do this is to enter the body of a cpp function, letting Swimport automatically wrap a function around it, and call it in the typemap. There are other ways to create a typemap, most notably an BuiltinTypemap.\n\n#### Pools\nPools are specialized code snippets that can be added manually to the output code. Some pools are used without arguments, while others are. See `swimport.pools.__doc__` for info on all pools.\n\n#### Direct Inserts\nUsers can also insert .i code immediately to the output file using the Swim's `add_*` methods.\n### Additional Features\n#### Repeat Import Blocking\nSwim object keep a record of all the object they've accepted Swimportings for, and refuse to swimport the same object twice. This means that when applying rules, users can apply the most narrow rules first, and apply the broader rules without concern for duplicates or excluding already imported objects.  \n#### Python Code Templates\nSWIG features scopes that allow direct injection of python code to the output file. As useful as these injections are, they are rather limited, not providing macros like the function name and return values. For this reason, python code used as `MethodBehaviour` parameters (like `prepend_python` and `append_python`) are used as templates, with macros of the form `$...` and `${...}`. The replacements occur under the following rules:\n* special rule `$$` is an escape for the `$` char.\n* macros of the form `$<identifier>` evaluate to a pre-set value:\n    * `$retvar`: the variable containing the function output.\n* macros of the form `${identifier}` evaluate as python code with the variable `method` as the method being imported.\n* all other usages of the `$` character are invalid\n```\nbehaviour = Method.Behaviour(prepend_python='print(\"entered ${method.name}\")',\n                             append_python='print(\"exiting ${method.name}, result: $retval\")')\n```\n\n#### Custom Behaviours and Triggers\nUsers can create their Behaviour and Trigger classes, see examples below. When doing this, it is important to subclass `swimport.Trigger`, `swimport.Behaviour` or their specialisations.\n```\nfrom swimport import Method\n\nclass VoidTrigger(Method.Trigger):  # a trigger class that only matches methods that return void\n    def is_valid(self, rule, obj: Method):\n        return super().is_valid(rule, obj)\\\n            and obj.return_type == 'void'  # todo account for dll names\n```\n\n#### Rule Assertion\nWhen applying a collection of swimportings (like a method rule result), it returns an int indicating how many swimportings were accepted. These can be used to assert the imported objects:\n```\nassert swim(method_rule_foo(src)) == 1  # assert that only one object was imported\nassert 'foo' in swim(method_rule_foo(src))  # assert that an object of name 'foo' was imported\nassert 'foo' in swim(method_rule_foo(src)) == 1  # assert that only an object of name 'foo' was imported\n```\n\nImportant to mention that **if the script is run with the (little-used) -O flag, the assert, alongside its contents, will be ignored.** To combat this, usage of third-party libraries like [ensure](https://pypi.org/project/ensure/) are recommended.\n#### Default parameters rules\nSwimport uses the following rules by default to classify method parameters. These can be changed by changing an individual `MethodBehaviour`'s `parameter_rules` or the default with `MethodBehaviour.default_parameter_rules` the following group rules are considered in order:\n\n|prefix|type|action|\n|------|----|------|\n|AIO_|ANY|an inplace numpy array of any rank [^1][^3]|\n|A_|any non-const pointer or reference|a 1D numpy output array [^1][^3]|\n|A_|any const pointer or reference|a 1D numpy input array [^1][^3]|\n|BF_|non-const pointer or reference|an output byte array that needs to be freed [^1][^3]|\n|B_|non-const pointer or reference|an output byte array [^1][^3]|\n|B_|const pointer or reference|an input buffer [^1][^3]|\n|SF_|non-const char pointer pointer or reference [^2]|an output C string that needs to be freed [^3]|\n|ANY|const char pointer [^2]|a C string|\n|IO_|ANY|a parameter that act as both input and output [^4]|\n|ANY|any non-const pointer or reference|an output parameter [^4]|\n|ANY|any const pointer or reference|an input parameter [^4]|\n|ANY|ANY|no action is taken|\n\n[^1]: arrays and buffers also consume the next parameter as input.\n[^2]: wherever char is used, wchar_t is accepted as well. (see quirk below).\n[^3]: requires special pool\n[^4]: requires the type to be imported to swimport, see below\n\n#### Importing Types to Swimport\nAdvanced swimport features (like input and output parameters, but also the ones listed below), requires that swimport will know the type involved, including standard conversion functions and other info. This is called swimporting, and there are multiple ways to do it for different types:\n##### TypeSwimporting\nThis is the canonical, most basic method of importing a type (almost all other importing methods wrap a TypeSwimporting).\n##### Container, Enumeration, and Typedef Behaviours\nMost common Behaviours automatically import both the container type, and its pointer type. Note that some behaviours like typedefs and basic enums only import the type if the original type was imported.\n##### Pools\nFor most commonly used types, there are pools to import it with very little effort.\n###### Primitives\nThe `pools.primitive` map imports all primitive types (including `bool`, `size_t`, and `wchar_t`).\n###### void*\n`pools.void_ptr` imports void*.\n###### c string\n`pools.c_string` imports C strings (null-terminated char and wchar_t pointers). This also allows specifying a C string that needs to be freed by the caller with the SF\\_ prefix. Note that non-const pointers cannot be accepted as input to c++ functions.\n###### std::string\n`pools.std_string` imports both `std::string` and `std::wstring`.\n###### PyObject*\n`pools.pyObject` imports raw PyObject* objects.\n###### bool\n`pools.bool` imports bool types, allowing them to accept any python object, converting it to its truthfulness value. Note that if this and the `primitive` pools are used in conjunction, bool must be excluded from the primitive imports with `pools.primitive(blacklist='bool')`.\n###### None, Ellipsis, and NotImplemented\n`pools.singletons` imports the special c++ types `ellipsis`, `NoneType`, `NotImplemented`, and `PySingleton` defined in py_singletons.h.\n###### slices\n`pools.slice` imports the `slice<...>` structs defined in py_slice.h.\n###### complex\n`pools.complex` imports the `std::complex<double>` type.\n###### tuple\n`pools.tuple` imports the `std::tuple<...>` type. It requires that all its sub-types be properly imported.\n###### input iterable\n`pools.input_iterable` imports a special template `py_iterable<T>` defined in `py_iterable.h`. Accepting this type as an argument allows the function to iterate over a python object. The inner type must be imported. This pool is automatically applied to all imported types (unless explicitly disabled).\n###### iterables\n`pools.iter` imports an iterable type. See its documentation for details. This pool is automatically applied to all imported types (unless explicitly disabled). There are also specialisations of this pool named `pools.list`, `pools.set`, `pools.frozenset`, and `pools.array` (that also requires an array length), for issuing the default output type. \n###### map\n`pools.map` imports a mapping type (`std::unordered_map` by default). See its documentation for details.\n###### callable\n`pools.callable` imports the `std::function<...>` type for input to c++. It requires that all its sub-types be properly imported.\n\nNote: Some imported types (most notably wide C strings) have special functions that must be called after they are converted from a python object to a C++ object (programmatically called `to_cpp_post`). Since the `std::function` caller does not know this, using these types will result in undisposed resources. By default, usage of such types as `pools.callable` return types will raise an error. \n###### buffers\n`pools.buffer` imports buffer types of the parameter signature `unsigned char *, size_t`. Note that buffer parameter names must either begin with a \"B\\_\" or \"BF\\_\"\n###### numpy arrays\n`pools.numpy_arrays` imports numpy array types of the parameter signature `T *, size_t` where T is a primitive type. Note that nparray parameter names must either begin with a \"A\\_\", \"AIO\\_\", or \"AF\\_\" (to indicate that an array is newly allocated and should be freed by the numpy array).\n\n#### Rule construction syntax\nTriggers can be joined into a rule with the >> operator\n```\nfrom swimport import MethodBehaviour, MethodNameTrigger, TriggerBehaviourSwimRule\n\ntrigger = MethodNameTrigger('foo')\nbehaviour = MethodBehaviour()\n\nassert (trigger >> behaviour) == TriggerBehaviourSwimRule(trigger, behaviour)\n```\n\n#### Default Triggers and Behaviors\nMany C++ types also have default behaviours and triggers to make rule construction easier. In most cases, the default trigger accepts only objects whose names fully match the pattern input\n```\nfrom swimport import MethodBehaviour, MethodNameTrigger, Method\n\nassert MethodNameTrigger('foo') == Method.Trigger('foo')\nassert MethodBehaviour() == Method.Behaviour()\n```\n\nThe default triggers can even be automatically constructed from arguments\n```\nfrom swimport import Method\n\nbehaviour = Method.Behaviour()\nassert ('foo' >> behaviour) == (Method.Triggers('foo') >> behaviour)\n```\n\nUsing `...`, a trigger is constructed that accepts every object that the behaviour can handle.\n```\nrule = ... >> behaviour\n```\n\nNote that behaviours can be used in the exact same way by themselves. (behaviours are rules that accept any object of the appropriate category). Using the `... >> behaviour` syntax is useful to give rules specific names for the output file.\n```\nrule = (... >> behaviour).replace(name=\"my special rule\")\n```\n#### Compound Triggers\nTriggers can be used in binary logical operators: `| & ^` to create a trigger that accepts objects if the individual triggers accept the objects appropriately (example: `(a|b).is_valid(...) == a.is_valid(...) or b.is_valid(...)`)\n\nSimilarly, triggers can be inverted to create a negation (`(~a).is_valid(...) == not a.is_valid(...)`).\n\nTriggers can also be compounded into a not-implies relation (`(a > b) == a & (~b)`).\n### Examples\nMany usage examples can be found in the `tests\\examples` directory. examples are usually comprised of:\n* `main.py`: A file that calls the swimport library and builds the .i file\n* `src.cpp`/`src.h`: cpp source files to be processed, compiled, and linked\n* `usage.py`: a file showing usage of the resulting cpp/python library\n\nNote that some examples might require additional libraries to run.\n\n## Known Issues/Quirks\n* When importing dll, the function name must not be mangled (extern \"C\" must be used)\n  * When using extern \"C\", it must be scoped. \n* There is a bug in CppHeaderParser where it will crash if the header file ends in a singleline comment\n* A quirk in SWIG to python conversion is that functions that return void return None in python. and that functions with output parameters are merely appended to the original output. meaning that a function with a pointer as a return and an output parameter will ignore the return value if it is null. This behaviour is consistent with standard SWIG. The solution is to simply ensure that if a function returns a pointer and has output parameters, ensure that the return value is never null.\n* A bug in both SWIG and CppHeaderParser prevents enums from being non-int\n* When entering strings, note that SWIG accepts strings with the null char `\\0` inside them, these will be converted wholesale, but might be mistaken for the string terminator in most C code.\n* CppHeaderParser cannot parse using alias commands: `using alias = oldname;` \n\n    ### Arrays\n    Yes, arrays have so many notes that they deserve their own section\n    * functions that accept arrays cast aggressively to the type they require, including downcasting and truncating. So that a C function that expects an array of ints will accept a list of python floats, truncating each value individually. See example 14 to see this in action.\n    * arrays of type char are not enabled by default, although they can be used with an optional argument to the numpy_arrays pool. Although note, that the dtype of arrays accepted is \"S1\", not \"U1\", as is default for char arrays made in np. use 'signed char' or 'unsigned char' for byte arrays. see example 15 to see this in action. \n    * When an array is used as an output variable with the AF\\_ prefix, it takes ownership of the variable, meaning it will be freed when the array is deleted. As a direct consequence of this, **the pointer of the array must be one that has been specifically allocated and unique, as the array takes ownership of it.** This means, among other things, that you cannot use `std::vector::data` as the pointer.\n    ### Containers\n    * Due to the way python handles descriptors, it is impossible to easily create class properties. Meaning that mutable static class members must be accessed through swig's `cvar` attribute, as a property of an arbitrary member of the class, or using getset methods.\n    * Due to a bug in CppHeaderParser, all member and inheritance, even in structs, must be access-qualified.\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/talos-gis/swimport",
    "keywords": "",
    "license": "MIT",
    "maintainer": "Idan Miara",
    "maintainer_email": "idan@miara.com",
    "name": "swimport",
    "package_url": "https://pypi.org/project/swimport/",
    "platform": "",
    "project_url": "https://pypi.org/project/swimport/",
    "project_urls": {
      "Homepage": "https://github.com/talos-gis/swimport"
    },
    "release_url": "https://pypi.org/project/swimport/3.1.1/",
    "requires_dist": [
      "CppHeaderParser (>=2)",
      "psutil ; extra == 'memory_testing'"
    ],
    "requires_python": ">=3.6.0",
    "summary": "Swimport is a python library to simplify automate the meandering and error-prone parts of making a SWIG interface file for python",
    "version": "3.1.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 9447487,
  "releases": {
    "3.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6e28d669adc20558c0aefb69a5546e5bd48e3ed568f35330611797bd2b062e6b",
          "md5": "c02766d8a9ab6025f6eae60675dd0b8a",
          "sha256": "bf69d36b76c8a339b717392be8d259c574956e41f6db21da45a796bf73758138"
        },
        "downloads": -1,
        "filename": "swimport-3.0.0.win-amd64.zip",
        "has_sig": false,
        "md5_digest": "c02766d8a9ab6025f6eae60675dd0b8a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6.0",
        "size": 71485,
        "upload_time": "2020-03-26T16:14:13",
        "upload_time_iso_8601": "2020-03-26T16:14:13.674175Z",
        "url": "https://files.pythonhosted.org/packages/6e/28/d669adc20558c0aefb69a5546e5bd48e3ed568f35330611797bd2b062e6b/swimport-3.0.0.win-amd64.zip",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "3.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7a14f51ed0a1855649f182f69c1de717cf32a4bddef91ec5622f44c3bff98c39",
          "md5": "0f45d0794b8946bb25b424934323675e",
          "sha256": "071342cab9e77327125d118f5ed3ecc5323c5af2bd5154a196ac1dd953c0cb3e"
        },
        "downloads": -1,
        "filename": "swimport-3.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "0f45d0794b8946bb25b424934323675e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6.0",
        "size": 28286,
        "upload_time": "2020-03-26T16:31:25",
        "upload_time_iso_8601": "2020-03-26T16:31:25.564718Z",
        "url": "https://files.pythonhosted.org/packages/7a/14/f51ed0a1855649f182f69c1de717cf32a4bddef91ec5622f44c3bff98c39/swimport-3.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "3.0.10": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d97705e77fed59a462e301d7ce53814aacf6335be01416879fd326965ac97671",
          "md5": "6125329c6a662a89ee3d05d60087896f",
          "sha256": "a747951c561becaf0450f8ade324fc20c09e295deee8cfdf82ef45d0c3a06070"
        },
        "downloads": -1,
        "filename": "swimport-3.0.10.tar.gz",
        "has_sig": false,
        "md5_digest": "6125329c6a662a89ee3d05d60087896f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6.0",
        "size": 52662,
        "upload_time": "2020-03-30T13:47:03",
        "upload_time_iso_8601": "2020-03-30T13:47:03.309687Z",
        "url": "https://files.pythonhosted.org/packages/d9/77/05e77fed59a462e301d7ce53814aacf6335be01416879fd326965ac97671/swimport-3.0.10.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "3.0.11": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8cad82efcb01d04ce2be1fa00540e4084b1da632eff53b98b7ef8b38bfa4b4de",
          "md5": "bac3adc0e953dcb6af03090267c7adda",
          "sha256": "a9be3f6be7dad2927d6e0e50af4a7e4c397b3c42df11fbeb323ee12c95fb3051"
        },
        "downloads": -1,
        "filename": "swimport-3.0.11.tar.gz",
        "has_sig": false,
        "md5_digest": "bac3adc0e953dcb6af03090267c7adda",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6.0",
        "size": 52726,
        "upload_time": "2020-04-05T04:53:34",
        "upload_time_iso_8601": "2020-04-05T04:53:34.680547Z",
        "url": "https://files.pythonhosted.org/packages/8c/ad/82efcb01d04ce2be1fa00540e4084b1da632eff53b98b7ef8b38bfa4b4de/swimport-3.0.11.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "3.0.12": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a093c2e778b899ccc5bd19ef77a3e9760250fb6fe6225ba3a8586dc7f30506ec",
          "md5": "f7969d8bffb37192d28558d8e346ac69",
          "sha256": "a292a216537838c276b0200b5cbacbb571fa59d68a8883c740b0eb41e0526779"
        },
        "downloads": -1,
        "filename": "swimport-3.0.12-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "f7969d8bffb37192d28558d8e346ac69",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6.0",
        "size": 66494,
        "upload_time": "2020-08-13T15:33:17",
        "upload_time_iso_8601": "2020-08-13T15:33:17.356420Z",
        "url": "https://files.pythonhosted.org/packages/a0/93/c2e778b899ccc5bd19ef77a3e9760250fb6fe6225ba3a8586dc7f30506ec/swimport-3.0.12-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5ca5c8d17f539d778db64c21db5850d656428f4f232e4af454e5c4a9c694c891",
          "md5": "d28a3e67fcccceabca675dc4e367f837",
          "sha256": "3a50660d27526a20b04f63058c56155558d251ed5e357f1446e78f0b6590b25a"
        },
        "downloads": -1,
        "filename": "swimport-3.0.12.tar.gz",
        "has_sig": false,
        "md5_digest": "d28a3e67fcccceabca675dc4e367f837",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6.0",
        "size": 54144,
        "upload_time": "2020-08-13T15:33:18",
        "upload_time_iso_8601": "2020-08-13T15:33:18.748960Z",
        "url": "https://files.pythonhosted.org/packages/5c/a5/c8d17f539d778db64c21db5850d656428f4f232e4af454e5c4a9c694c891/swimport-3.0.12.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "3.0.13": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "290f39d99f956423714c861554b213dcefd62e8cd318c7b25a56553916a53ddb",
          "md5": "72207bda184c24f63ec5c3a974cc22a0",
          "sha256": "5360c8ce613272aa49e7952f602d3742f555dee812e27c382c66c95320df55b4"
        },
        "downloads": -1,
        "filename": "swimport-3.0.13-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "72207bda184c24f63ec5c3a974cc22a0",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6.0",
        "size": 66466,
        "upload_time": "2020-08-26T15:27:24",
        "upload_time_iso_8601": "2020-08-26T15:27:24.640305Z",
        "url": "https://files.pythonhosted.org/packages/29/0f/39d99f956423714c861554b213dcefd62e8cd318c7b25a56553916a53ddb/swimport-3.0.13-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c7b7466c343e980cf896b66e4a53ae41701525ac4cced58a69b6b1a6089f3362",
          "md5": "b8f5c5bc0cbb0e9ae3bd503c3c5355ae",
          "sha256": "724a8119b5cd07376a271079a68fbe483970f313a9f9fb8bca8444dd23fe1862"
        },
        "downloads": -1,
        "filename": "swimport-3.0.13.tar.gz",
        "has_sig": false,
        "md5_digest": "b8f5c5bc0cbb0e9ae3bd503c3c5355ae",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6.0",
        "size": 55123,
        "upload_time": "2020-08-26T15:27:25",
        "upload_time_iso_8601": "2020-08-26T15:27:25.831145Z",
        "url": "https://files.pythonhosted.org/packages/c7/b7/466c343e980cf896b66e4a53ae41701525ac4cced58a69b6b1a6089f3362/swimport-3.0.13.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "3.0.14": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "cf8d0ffb821c710795df508c5a5b2fc8d420393a6278adea544ce278061150bf",
          "md5": "b466ca91019040dc37cf6b52be0002e2",
          "sha256": "22733f83ffad53c0635795134f478b84b8a8d99909169a24f10776b8eb05ffaa"
        },
        "downloads": -1,
        "filename": "swimport-3.0.14-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "b466ca91019040dc37cf6b52be0002e2",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6.0",
        "size": 67388,
        "upload_time": "2020-09-29T10:01:02",
        "upload_time_iso_8601": "2020-09-29T10:01:02.961929Z",
        "url": "https://files.pythonhosted.org/packages/cf/8d/0ffb821c710795df508c5a5b2fc8d420393a6278adea544ce278061150bf/swimport-3.0.14-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "919b4fdab8251be7397736e43ce22ea74571f804fd8736df70f6cfdef16de5e9",
          "md5": "98d46dd3b2039b2840b99b4ae5aa06fa",
          "sha256": "66242181a70b64a95db6974dcf14bc6895584e9093c1fd3006bffdba4a16c03a"
        },
        "downloads": -1,
        "filename": "swimport-3.0.14.tar.gz",
        "has_sig": false,
        "md5_digest": "98d46dd3b2039b2840b99b4ae5aa06fa",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6.0",
        "size": 55224,
        "upload_time": "2020-09-29T10:01:05",
        "upload_time_iso_8601": "2020-09-29T10:01:05.061778Z",
        "url": "https://files.pythonhosted.org/packages/91/9b/4fdab8251be7397736e43ce22ea74571f804fd8736df70f6cfdef16de5e9/swimport-3.0.14.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "3.0.15": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "bbe046684c1bb124c5df0da26beb9647846d63215ae859134d89a4fae43d952b",
          "md5": "e50dfcb6cb6415a240562cf0c2f10751",
          "sha256": "bd0d2b112b7d297ad019f684f1f9b7ce0ac7e81d2a065112d5e505bfd7ff56b8"
        },
        "downloads": -1,
        "filename": "swimport-3.0.15-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "e50dfcb6cb6415a240562cf0c2f10751",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6.0",
        "size": 67598,
        "upload_time": "2020-09-29T18:03:18",
        "upload_time_iso_8601": "2020-09-29T18:03:18.827207Z",
        "url": "https://files.pythonhosted.org/packages/bb/e0/46684c1bb124c5df0da26beb9647846d63215ae859134d89a4fae43d952b/swimport-3.0.15-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e47660244936c39068774bdecf523ad18f1849083522510b9cc0789e07b859d4",
          "md5": "c1ccad9f154ca2a0f6add46454e0043e",
          "sha256": "f8a8ee6e92dd1ef2839b1b927cf470026af1d5c1192c72546bc3f47b064c1796"
        },
        "downloads": -1,
        "filename": "swimport-3.0.15.tar.gz",
        "has_sig": false,
        "md5_digest": "c1ccad9f154ca2a0f6add46454e0043e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6.0",
        "size": 55381,
        "upload_time": "2020-09-29T18:03:20",
        "upload_time_iso_8601": "2020-09-29T18:03:20.602128Z",
        "url": "https://files.pythonhosted.org/packages/e4/76/60244936c39068774bdecf523ad18f1849083522510b9cc0789e07b859d4/swimport-3.0.15.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "3.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "34ba5d3e9101b3641d8069ced98e2b23b95c29a19c1fbb95382cecec011cd59d",
          "md5": "2a0fb5ac040356e74134235b5e8c85ee",
          "sha256": "51569c6df2c11774fc116b365889f07b89bb82c00a7a7841bd55345474244c2f"
        },
        "downloads": -1,
        "filename": "swimport-3.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "2a0fb5ac040356e74134235b5e8c85ee",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6.0",
        "size": 44782,
        "upload_time": "2020-03-26T16:35:54",
        "upload_time_iso_8601": "2020-03-26T16:35:54.305954Z",
        "url": "https://files.pythonhosted.org/packages/34/ba/5d3e9101b3641d8069ced98e2b23b95c29a19c1fbb95382cecec011cd59d/swimport-3.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "3.0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "05ba01212ab9e23a6640b4370fab421bb6d00105b9655ca61a05c6684a174bc4",
          "md5": "831262f0206b362035d7f6ceb423071f",
          "sha256": "b4027dde963bb2c639d340599046cdf28c0341f301ec3d38ef614c9d229dc443"
        },
        "downloads": -1,
        "filename": "swimport-3.0.3.win-amd64.zip",
        "has_sig": false,
        "md5_digest": "831262f0206b362035d7f6ceb423071f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6.0",
        "size": 153112,
        "upload_time": "2020-03-29T10:53:04",
        "upload_time_iso_8601": "2020-03-29T10:53:04.041882Z",
        "url": "https://files.pythonhosted.org/packages/05/ba/01212ab9e23a6640b4370fab421bb6d00105b9655ca61a05c6684a174bc4/swimport-3.0.3.win-amd64.zip",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "3.0.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "66b10ef0c92bf6f9f8f6f58bc558572177c1532f9b408a687618806c1d568463",
          "md5": "4f691eef2868f708d7edf531b7d6305c",
          "sha256": "9f588a4b2dce8f2a5fb1689fa1059d770046011149c38a92037ad3d1a331d377"
        },
        "downloads": -1,
        "filename": "swimport-3.0.4.tar.gz",
        "has_sig": false,
        "md5_digest": "4f691eef2868f708d7edf531b7d6305c",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6.0",
        "size": 52372,
        "upload_time": "2020-03-29T10:55:50",
        "upload_time_iso_8601": "2020-03-29T10:55:50.313737Z",
        "url": "https://files.pythonhosted.org/packages/66/b1/0ef0c92bf6f9f8f6f58bc558572177c1532f9b408a687618806c1d568463/swimport-3.0.4.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "3.0.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ec4b4527a28084390e06b62cafbd54b1bb4130738a542d9da1dc364168076254",
          "md5": "f4cd5977ddbd5aa86a3c3cf64598ba83",
          "sha256": "324a0fba3fc36a4b0d2bc98d067663b25fab6d51cf1294f5f6b683a763f15412"
        },
        "downloads": -1,
        "filename": "swimport-3.0.5.tar.gz",
        "has_sig": false,
        "md5_digest": "f4cd5977ddbd5aa86a3c3cf64598ba83",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6.0",
        "size": 52398,
        "upload_time": "2020-03-29T12:37:35",
        "upload_time_iso_8601": "2020-03-29T12:37:35.707098Z",
        "url": "https://files.pythonhosted.org/packages/ec/4b/4527a28084390e06b62cafbd54b1bb4130738a542d9da1dc364168076254/swimport-3.0.5.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "3.0.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ee724d2b5279d4538d0aad1f922a75f16c5b3252138039f2914b13c3415121c4",
          "md5": "00e1c2b9e81f1d9f799860227137f1d3",
          "sha256": "41b5b5005ba9392d5f4896530a726703b0927485953ad8adf0a1f152d0fa7f1b"
        },
        "downloads": -1,
        "filename": "swimport-3.0.6.tar.gz",
        "has_sig": false,
        "md5_digest": "00e1c2b9e81f1d9f799860227137f1d3",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6.0",
        "size": 52521,
        "upload_time": "2020-03-29T15:23:40",
        "upload_time_iso_8601": "2020-03-29T15:23:40.136870Z",
        "url": "https://files.pythonhosted.org/packages/ee/72/4d2b5279d4538d0aad1f922a75f16c5b3252138039f2914b13c3415121c4/swimport-3.0.6.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "3.0.7": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1d704e433b145d7a726a02c28c99fade8e37a13b99d19ce05525dd72426fe827",
          "md5": "88ef3e4c4628f5edb840c932835ffc43",
          "sha256": "44f531e1b58ac935ed989366d780bb9f21302ff9f2ac8db50fd8680c53fa83cf"
        },
        "downloads": -1,
        "filename": "swimport-3.0.7.tar.gz",
        "has_sig": false,
        "md5_digest": "88ef3e4c4628f5edb840c932835ffc43",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6.0",
        "size": 52534,
        "upload_time": "2020-03-29T15:24:28",
        "upload_time_iso_8601": "2020-03-29T15:24:28.692883Z",
        "url": "https://files.pythonhosted.org/packages/1d/70/4e433b145d7a726a02c28c99fade8e37a13b99d19ce05525dd72426fe827/swimport-3.0.7.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "3.0.8": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0bf925f5c66e1709d8b3f69b0745ada9d7c72ce5754d392a2410f3a21f1fc7e9",
          "md5": "8aed114c6123f918964a8ab67facc584",
          "sha256": "1a7f65461d71477a86fdb5a73bf235a90173201de52a33bd3f9cdd3f550af946"
        },
        "downloads": -1,
        "filename": "swimport-3.0.8.tar.gz",
        "has_sig": false,
        "md5_digest": "8aed114c6123f918964a8ab67facc584",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6.0",
        "size": 52545,
        "upload_time": "2020-03-29T15:29:37",
        "upload_time_iso_8601": "2020-03-29T15:29:37.940511Z",
        "url": "https://files.pythonhosted.org/packages/0b/f9/25f5c66e1709d8b3f69b0745ada9d7c72ce5754d392a2410f3a21f1fc7e9/swimport-3.0.8.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "3.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "17f1160e811a0056af9ef208a1926ee77f4b4655910620950f4a96099689db28",
          "md5": "d2e2915fe891832b1ac5cf6f91a9ec54",
          "sha256": "bf1bf765cfaa3412e277f14647a6769d59f8547b365bc10c78b4a70f8e1c1382"
        },
        "downloads": -1,
        "filename": "swimport-3.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "d2e2915fe891832b1ac5cf6f91a9ec54",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6.0",
        "size": 67232,
        "upload_time": "2021-01-23T10:54:56",
        "upload_time_iso_8601": "2021-01-23T10:54:56.027216Z",
        "url": "https://files.pythonhosted.org/packages/17/f1/160e811a0056af9ef208a1926ee77f4b4655910620950f4a96099689db28/swimport-3.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "3.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ca228a15404cbedd95a5f9b45bdab648bff86338f14bfb77d0eef8b253792f8f",
          "md5": "aa303fe97b3e21396b630ac45b5781ce",
          "sha256": "ea228ae0abbf43dc2bfa27747a370ecdc9b488da224a04b7c7aeed2c698452ed"
        },
        "downloads": -1,
        "filename": "swimport-3.1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "aa303fe97b3e21396b630ac45b5781ce",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6.0",
        "size": 67430,
        "upload_time": "2021-02-17T20:13:13",
        "upload_time_iso_8601": "2021-02-17T20:13:13.699202Z",
        "url": "https://files.pythonhosted.org/packages/ca/22/8a15404cbedd95a5f9b45bdab648bff86338f14bfb77d0eef8b253792f8f/swimport-3.1.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "ca228a15404cbedd95a5f9b45bdab648bff86338f14bfb77d0eef8b253792f8f",
        "md5": "aa303fe97b3e21396b630ac45b5781ce",
        "sha256": "ea228ae0abbf43dc2bfa27747a370ecdc9b488da224a04b7c7aeed2c698452ed"
      },
      "downloads": -1,
      "filename": "swimport-3.1.1-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "aa303fe97b3e21396b630ac45b5781ce",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6.0",
      "size": 67430,
      "upload_time": "2021-02-17T20:13:13",
      "upload_time_iso_8601": "2021-02-17T20:13:13.699202Z",
      "url": "https://files.pythonhosted.org/packages/ca/22/8a15404cbedd95a5f9b45bdab648bff86338f14bfb77d0eef8b253792f8f/swimport-3.1.1-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}