{
  "info": {
    "author": "Chintan Gandhi, Jay Modi, Suraj Patel, Omkar Kulkarni, Nirav Shah",
    "author_email": "cagandhi97@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# <img src=\"https://github.com/jaymodi98/Sync-Ends/blob/master/images/bot.png\" height=\"42\" width=\"42\"/> Sync Ends\n\n## End development overheads\n\nSoftware Engineering Project for CSC 510\n\n[![MIT license](https://img.shields.io/badge/License-MIT-blue.svg)](https://lbesson.mit-license.org/)\n![GitHub](https://img.shields.io/badge/language-python-blue.svg)\n![GitHub contributors](https://img.shields.io/github/contributors/jaymodi98/Sync-Ends)\n[![Build Status](https://travis-ci.com/jaymodi98/Sync-Ends.svg?branch=master)](https://travis-ci.com/jaymodi98/Sync-Ends)\n<br>\n![GitHub closed issues](https://img.shields.io/github/issues-closed-raw/jaymodi98/Sync-Ends)\n![GitHub closed pull requests](https://img.shields.io/github/issues-pr-closed/jaymodi98/Sync-Ends)\n[![codecov](https://codecov.io/gh/jaymodi98/Sync-Ends/branch/master/graph/badge.svg?token=DP2AWTXOXL)](undefined)<br>\n[![DOI](https://zenodo.org/badge/300105279.svg)](https://zenodo.org/badge/latestdoi/300105279)\n![YouTube Video Views](https://img.shields.io/youtube/views/1Pd3Enj13m8?style=social)\n\nSync Ends is an automated bridge to sync service owners and service consumers. Every team has a single Postman collection that they use to test their APIs and share it across in their documentations. The backend team has to register their service on our application and we take care of the rest. Everytime there is a change in the way the API is called, we parse the changes and inform the API consumers. This way all the team members are informed about the changes and know exactly what to edit in their codebase. The Slack framework lets you concentrate on the **core** functionality you want to build without worrying about integration overheads.\n\n[![Watch the video](https://github.com/jaymodi98/Sync-Ends/blob/master/images/screenshotpromo.png)](https://www.youtube.com/watch?v=1Pd3Enj13m8)\n\n## Table of Contents\n  * [Architecture Diagram](#architecture-diagram)\n  * [Features](#features)\n  * [Patterns in the code](#patterns-in-the-code)\n  * [Documentation](#documentation)\n    + [What is Sync Ends?](#what-is-sync-ends)\n    + [Why use Sync Ends?](#why-use-sync-ends)\n    + [How to use Sync Ends?](#how-to-use-sync-ends)\n      - [Installation](#installation)\n      - [Usage](#usage)\n        * [How to write the config_file? (format of the file should be `.json`)](#how-to-write-the-config_file-format-of-the-file-should-be-json)\n      - [What happens after this command is run?](#what-happens-after-this-command-is-run)\n  * [Experimentation Phase for Project 3](#experimentation-phase-for-project-3)\n    + [It vs Not It](#it-vs-not-it)\n    + [Idea for the Experimentation](#idea-for-the-experimentation)\n    + [Experimentation SetUp](#experimentation-setup)\n      - [Step 1 : Setup Postman](#step-1--setup-postman)\n      - [Step 2 : Create a Slack workspace and integrate Slack bot](#step-2--create-a-slack-workspace-and-integrate-slack-bot)\n        * [2a. Creating Slack workspace](#2a-creating-slack-workspace)\n        * [2b. Creating Slack bot](#2b-creating-slack-bot)\n    + [Experimentation Process](#experimentation-process)\n    + [Experimentation Measures](#experimentation-measures)\n      - [Quantitative measures](#quantitative-measures)\n      - [Qualitative measures](#qualitative-measures)\n  * [How to Contribute?](#how-to-contribute)\n  * [License](#license)\n\n## Architecture Diagram\n<img src=\"https://github.com/jaymodi98/Sync-Ends/blob/master/images/architecture.PNG\" height=\"500\" width=\"800\"/>\n\n## Features\n|Feature|Description  |\n|--|--|\n|1-step service execution |```Simple 1-step CLI execution for Sync Ends service```|\n|API Change Notification  |```Get notifications about changes made to the API in Postman along with detailed diff of changes```|\n|Track Postman collection | ```Ability to track a Postman collection and get notifications```|\n|Slack Bot Subscription   |``` Set frequency of notifications as well as customize Slack channel for updates``` |\n\n## Patterns in the code\n\n- We are using Composite and Layer pattern in the code. The Parser module parses the user input and passes the parsed data to the underlying layers. The `sync end service` accepts the data from the parser layer and sends the notification to Slack.\n- The Collection object uses the Composite pattern where a Collection contains multiple EndPoints and each End Point has attributes such as URL, method type, name, etc.\n\n## Documentation\n### What is Sync Ends?\n\nPlease have a look at the point descriptions of each function/class through this [documentation file](https://github.com/jaymodi98/Sync-Ends/blob/master/docs/src/index.html) generated via `pdoc3`. To view this documentation, clone the repository and then open the linked file in the browser.\n\n### Why use Sync Ends?\nSync ends is a productivity service that focuses on saving developer time by automating API changes to their consumers in real-time thus improving your team's productivity. \nConsider an API consumer using multiple APIs in their system. In this ever-changing world, it is impossible for the consumer to be updated with each and every API change. This is the problem that Sync Ends service addresses. The service is easy to install and this reduces the communication overhead on side of the API devs. So avoid crashes and jump on the Sync Ends bandwagon! :)\n\nThis version of sync ends is highly usable as it can be simply downloaded through PyPI. It is a single package which satisfies all your needs with clean documentation. Using  just a simple config file, you can start the service from terminal through our CLI interface. All your API's from the Postman collection will be fetched and their changes will be reflected as notifications in your slack channel.\n\n<img src=\"https://github.com/jaymodi98/Sync-Ends/blob/master/src/meme.jpg\" width=40% />\n\n```Transcript(Hindi to English) - API can change anytime```\n\n*Reference : Meme From TV Series [Mirzapur](https://www.google.com/search?q=mirzapur)*\n\n\n### How to use Sync Ends?\n#### Installation\n```\npip install sync-ends\n```\nThe code is deployed as a python package on PyPI which is a single step installation process.\n\n#### Usage\n\n1. The package is primarily run through a CLI (single step) for ease of use.\n\nRun the following command with required parameters.\n```\nsyncends  --config_file </path/to/your/local/config/file>\n```\nWhat is `--config_file`?\n```\nconfig_file - the configuration file used by the Sync Ends service\n```\n##### How to write the config_file? (format of the file should be `.json`)\n```\n{\n    \"postman_api_key\": \"<a>\",\n    \"slack_token\": \"<b>\",\n    \"trigger_interval\": <c>,\n    \"collections\": [\n        {\n            \"collection_name\": \"<d>\",\n            \"slack_channel\": \"<e>\"\n        }\n    ]\n}\n```\nwhere,\n- `a`: postman api key generated using steps shown in [postman setup section](#step-1--setup-postman)\n- `b`: slack token generated using steps shown in [slack setup section](#step-2--create-a-slack-workspace-and-integrate-slack-bot)\n- `c`: **[optional: default=10]** time (in seconds), after which application will periodically check for api changes\n- `d`: collection name from postman collections\n- `e`: **[optional: default=\"general\"]** slack channel in which notifications will be sent (must be a public channel)\n\n\n#### What happens after this command is run?\n\nThis command is the entry point to a background process which fetches all the `Postman collections` using the `Postman API key` and posts a message through the `Slack bot token` configured in the `Slack channel` specified. The background service fetches the Postman collections every `trigger interval` seconds. Since all of this happens **automatically** after running the CLI command, this means that developer on changing the API in the Postman does not have to worry about notifying any API consumers of the change. That magic is done by our bot :)\n\n## Experimentation Phase for Project 3\nEach experiment will involve 2 subjets:\n  - One person will act as API Developer\n  - 2<sup>nd</sup> person will act as API Consumer. (Also referred to as API Tester at some places)\n\nIn the experiment phase, we will be planning to evaluate the performance improvement of the API consumer (tester) in a rapidly developing environment. The experiment is planned to be run in pairs where one person will act as a developer and the other will act as an API consumer (tester). \n- The job of the developer will be to change API schemas in Postman which *mocks* the behaviour that a change has been made in the serving of API in the actual codebase. \n- The job of the tester will be to monitor these changes and note them down which *mocks* the behaviour that the API consumer is now aware that a change needs to be made in the codebase where this API is used.\n\n\n### It vs Not It\n\nIn the presence of our Sync Ends service, once the developer makes a change in the APIs in the Postman collection, the changes will be directly fetched from Postman and a Slack message will be sent in the channel with a detailed diff notifying the API consumer of this change. <br>\n\nIn the absence of our service, the developer will have to manually notify changes to the API consumer and if the developer forgets to do so, the API consumer will be unaware of API changes and this would mock the fact that the API consumer will have a crash when their application tries to call the updated API with old parameters.\n\n### Idea for the Experimentation\n\nThe primary idea for the experiment is to provide the participants(lab rats) with a clear setup for interaction with the service. As we mentioned, the experiment is planned to be run in pairs. As a result, the team picking up this project will simply need to configure following things:\n- A general Postman account with a single collection but multiple APIs. ([steps](#step-1--setup-postman))\n    - The developer half of the lab rats will interact with this Postman account where they will change APIs and our Sync Ends service will take care of the rest. \n    - The login credentials and api key of the postman account will need to shared with the API Developers. So please create an account(s) keeping that in mind. \n- A Slack channel along with configuring a Slack Bot which interacts with our Sync Ends service. ([steps](#step-2--create-a-slack-workspace-and-integrate-slack-bot))\n    - For the tester half of lab rats, they will need to be added to this channel. \n> We leave it upto the team picking up this project to define whether they will add all pairs of participants in a common Slack channel or make multiple Slack channels for different experiments. The same goes for the Postman Collection part. <br>\n\nThe experiment will have two phases. (1) A pair of people NOT using our system and performing the experiment (2) The same pair of people now using our system and performing the experiment. This would ensure that the same group of people who experienced the absence can now, hopefully, understand the importance of the Sync Ends service and can benefit from it.\n\nTo get an even better read on the effectiveness of the system, the roles of the developer and tester(API consumer) can be swapped and the experiment begin again so that both the lab rats can experience the halves and you can get a larger sample size to prove the validity of the observations.\n\nRest Assured, the [Experimentation Setup](#experimentation-setup) section defines clear and precise steps to get done with the setup part. In our view and based on our own preliminary trial, it will be easier for the team to just make a `single Postman collection` from the sample collection schema provided and add lab rats to and remove them from a common Slack channel. However, the final say is left upto the team conducting this experiment.\n\n### Experimentation SetUp\nAs mentioned above, the team needs to setup 3 things for the experiment: (1) a Postman collection (2) a Slack channel (3) a [config json](#how-to-write-the-config_file-format-of-the-file-should-be-json).\n\nThe team will have to provide the `config json file` and a `Postman account` to each API developer so that they can:\n- change the API schemas in the collection \n- and the sync ends service which is run would parse the changes based on the `parameters in the config file`. \n\nThe API developer will only need to have Python installed as our package is hosted on PyPI and will be able to access [Web Postman](https://web.postman.co/build). In the presence of our system, the developer won't have to be added to any Slack channels as that is handled by our service. However, in the absence of our system, the developer will need to have some way to communicate with API consumer, probably Slack and hence would need to be added the Slack channel where the API consumer is also added.\n\nThe API consumer(tester) will only need to be added to the `Slack channel` and the tester's job is to simply identify changes in APIs through Slack messages or otherwise.\n\n#### Step 1 : Setup Postman\n1. Sign in to [Postman](https://identity.getpostman.com/login). You can use your existing postman account but since you will need to share API key and login credentials with the API Developer, *we suggest creating a new account*.\n2. If you do not have any pre-exiting collections on Postman, import this [sample collection](https://www.postman.com/collections/e2cb1b9c870ee78fc20d).\n3. To integrate with the Sync Ends service, a Postman API key is required. Generate API key by visiting this [page](https://web.postman.co/settings/me/api-keys).\n4. Copy the generated API key. This is required during the time of execution of the service. Make sure you store it safely as you won't be able to view this any other time.\n\n#### Step 2 : Create a Slack workspace and integrate Slack bot\n\n##### 2a. Creating Slack workspace\n1. Open https://slack.com/.\n2. Provide your email ID. Select `Create New workspace`.\n3. Check your email and enter the code to verify your email.\n4. Provide your name and set a password.\n5. Add some details to your workspace in the next page.\n6. Provide a company name.\n7. Workspace URL should be unique. Also remember this URL, this is what is used to login to your Slack instance.\n8. Agree with the terms.\n9. Skip the invite step.\n10. You are up and running with your own instance of Slack.\n\n##### 2b. Creating Slack bot\n1. Open your `<workspace-URL>/apps` (the one you created above). For example, [https://test-visual.slack.com/apps](https://test-visual.slack.com/apps).\n2. Search for bot in the search bar and select `Bots`.\n3. In the Bots landing page, click on `Add configuration`.\n4. Provide a Bot name. For example, `wolfpack-bot` and click on `Add Bot integration`.\n5. In the `Setup instruction` page: `Copy and store the API Token`. For example, the token may look something like this: `xoxb-22672546-n1X9APk3D0tfksr81NJj6VAM`.\n6. Save the Bot integration.\n\n### Experimentation Process\n\nThe experimentation process for developers consists of them performing roughly these tasks:\n* Adding a new API request to the collection\n* Deleting a API from the collection\n* Updating the name of an API\n* Updating the URL of an API\n* Updating the API method (GET, POST, etc.) of an API\n* Updating the authentication method in the API\n* Performing these steps quickly and in succession \n\nThe experimentation process for testers(API consumers) consists of them simply noting these changes in a spreadsheet that can be shared with them. Their primary job will be to note what changed in the APIs in the presence and absence of our Sync Ends service.\n\n### Experimentation Measures\nThrought the experiments, the teams can take following quantitative and qualitative measures:\n\n#### Quantitative measures\nThese measures can be used to compare the results between environment with and without Sync Ends.\n1. Number of APIs changed by the developer\n2. Number of APIs added by the developer\n3. Number of APIs deleted by the developer\n4. Time taken by API consumer (tester) to identify these change/addition/deletion (In presence of the Sync Ends system v/s Without the system)\n\n#### Qualitative measures\nApart from quantitative measures, these qualititive measures can be taken to identify the performance of the system:\n1. How easy it is for API consumer to find the changes (In presence of the Sync Ends system v/s Without the system)\n2. Can the API consumer get occupied in his personal work and still get to know about the API changes quickly?\n\n## Congratulations\n### **You just saved yourself from unwanted crashes**\n<img src=\"https://media.tenor.com/images/73cca45a93f91944b2c9fdd4b05c3c53/tenor.gif\"/>\n\n## How to Contribute?\nPlease take a look at our [CONTRIBUTING.md](https://github.com/jaymodi98/Sync-Ends/blob/master/CONTRIBUTING.md) where we provide instructions on contributing to the repo and help us in enhancing the product.\n\n## License\n\nThis project is licensed under the MIT License.\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "https://github.com/jaymodi98/Sync-Ends/archive/v2.1.3.tar.gz",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/jaymodi98/csc510-project",
    "keywords": "python",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "sync-ends",
    "package_url": "https://pypi.org/project/sync-ends/",
    "platform": "",
    "project_url": "https://pypi.org/project/sync-ends/",
    "project_urls": {
      "Download": "https://github.com/jaymodi98/Sync-Ends/archive/v2.1.3.tar.gz",
      "Homepage": "https://github.com/jaymodi98/csc510-project"
    },
    "release_url": "https://pypi.org/project/sync-ends/2.1.3/",
    "requires_dist": [
      "aiohttp (==3.6.3)",
      "appdirs (==1.4.4)",
      "async-timeout (==3.0.1)",
      "attrs (==20.2.0)",
      "black (==20.8b1)",
      "certifi (==2020.6.20)",
      "chardet (==3.0.4)",
      "click (==7.1.2)",
      "coverage",
      "flake8 (==3.8.4)",
      "idna (==2.10)",
      "importlib-metadata (==2.0.0)",
      "iniconfig (==1.1.1)",
      "jsondiff (==1.2.0)",
      "mccabe (==0.6.1)",
      "multidict (==4.7.6)",
      "mypy-extensions (==0.4.3)",
      "packaging (==20.4)",
      "pathspec (==0.8.0)",
      "pluggy (==0.13.1)",
      "py (==1.9.0)",
      "pycodestyle (==2.6.0)",
      "pyflakes (==2.2.0)",
      "pyparsing (==2.4.7)",
      "pytest (==6.1.1)",
      "pytest-cov (==2.10.1)",
      "pytest-flake8 (==1.0.6)",
      "regex (==2020.10.23)",
      "requests (==2.24.0)",
      "six (==1.15.0)",
      "slack (==0.0.2)",
      "slackclient (==2.9.2)",
      "toml (==0.10.1)",
      "typed-ast (==1.4.1)",
      "typing-extensions (==3.7.4.3)",
      "urllib3 (==1.25.10)",
      "websocket-client (==0.54.0)",
      "yarl (==1.5.1)",
      "zipp (==3.4.0)"
    ],
    "requires_python": ">=3.6",
    "summary": "Sync Ends - End Development Overheads CSC 510 Project",
    "version": "2.1.3",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 8520030,
  "releases": {
    "2.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8339cbc96d2f97e9dbdec96686a31f7be1de815f40b8b9d9a2bf4a894edfbe77",
          "md5": "d8f432ec9a18c106548fadca4008ad72",
          "sha256": "41ad196825da86e0208ecc5a47398ba846662690a2267af511510165a66f457a"
        },
        "downloads": -1,
        "filename": "sync_ends-2.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "d8f432ec9a18c106548fadca4008ad72",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 12842,
        "upload_time": "2020-10-26T21:26:50",
        "upload_time_iso_8601": "2020-10-26T21:26:50.770782Z",
        "url": "https://files.pythonhosted.org/packages/83/39/cbc96d2f97e9dbdec96686a31f7be1de815f40b8b9d9a2bf4a894edfbe77/sync_ends-2.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e09431cad93adaf9a96a19da78b50d916038401651a761fb044d9dbb660c2466",
          "md5": "2b5f98f0ce62cb1c385847ef49c7a4d1",
          "sha256": "60332c95a0ff1385fff1efe9104309523af04bb85f1df02b16db0847795b5d08"
        },
        "downloads": -1,
        "filename": "sync-ends-2.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "2b5f98f0ce62cb1c385847ef49c7a4d1",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 12654,
        "upload_time": "2020-10-26T21:26:52",
        "upload_time_iso_8601": "2020-10-26T21:26:52.670935Z",
        "url": "https://files.pythonhosted.org/packages/e0/94/31cad93adaf9a96a19da78b50d916038401651a761fb044d9dbb660c2466/sync-ends-2.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d66fbc1841edcd8ebac4c046021c8d24a8e5a2ae6ec63ded174d0b2c3fde7fdf",
          "md5": "ab6463d3e6c31a3d29d9721e2a2c4596",
          "sha256": "947e3f5567f2d3acc12f4c38d43d82e59fd83bcd8ee98ebdb380b6b8e85f68d4"
        },
        "downloads": -1,
        "filename": "sync_ends-2.1.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "ab6463d3e6c31a3d29d9721e2a2c4596",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 13095,
        "upload_time": "2020-10-26T22:08:22",
        "upload_time_iso_8601": "2020-10-26T22:08:22.905063Z",
        "url": "https://files.pythonhosted.org/packages/d6/6f/bc1841edcd8ebac4c046021c8d24a8e5a2ae6ec63ded174d0b2c3fde7fdf/sync_ends-2.1.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d169346a4ab9243d549f5148acdf215e7b6e279e7d578876c24561bf348b6d12",
          "md5": "d0deb5364583687254efb91332aaa55d",
          "sha256": "83bf2584ad22e9160d971dce89d1b5775f0af798488765932d38d9b37d52d0fe"
        },
        "downloads": -1,
        "filename": "sync-ends-2.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "d0deb5364583687254efb91332aaa55d",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 12788,
        "upload_time": "2020-10-26T22:08:24",
        "upload_time_iso_8601": "2020-10-26T22:08:24.219820Z",
        "url": "https://files.pythonhosted.org/packages/d1/69/346a4ab9243d549f5148acdf215e7b6e279e7d578876c24561bf348b6d12/sync-ends-2.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d4a6016ccdb4595dce3bfc735ce565e1f0070b7e8311741be353e679597d75a2",
          "md5": "b7d273f3c2ee5620dd98071ae5333039",
          "sha256": "465cc63d3ff7589b725ab5fd48c84217547b640bebdaa38e2f0b57f56df2c677"
        },
        "downloads": -1,
        "filename": "sync_ends-2.1.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "b7d273f3c2ee5620dd98071ae5333039",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 16636,
        "upload_time": "2020-10-27T02:13:46",
        "upload_time_iso_8601": "2020-10-27T02:13:46.972977Z",
        "url": "https://files.pythonhosted.org/packages/d4/a6/016ccdb4595dce3bfc735ce565e1f0070b7e8311741be353e679597d75a2/sync_ends-2.1.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6f304ccb77fba075f2e241e52f339617feb52a251b3a4651b38e6a17dbdd47ea",
          "md5": "8f44ce0d9aa0524bd5b3b5a7acb1e5d0",
          "sha256": "db9619e79fb10fb85d36413904a6e45def21b43738bc73e871e6f5cb5362bd95"
        },
        "downloads": -1,
        "filename": "sync-ends-2.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "8f44ce0d9aa0524bd5b3b5a7acb1e5d0",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 16076,
        "upload_time": "2020-10-27T02:13:48",
        "upload_time_iso_8601": "2020-10-27T02:13:48.078648Z",
        "url": "https://files.pythonhosted.org/packages/6f/30/4ccb77fba075f2e241e52f339617feb52a251b3a4651b38e6a17dbdd47ea/sync-ends-2.1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.1.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d9150bc2cd1bb088ea390c7c17abc291986966b2ce0d029d419f786affe40e04",
          "md5": "3fc0df6125a069c43287d28594722d46",
          "sha256": "7e9c7aab1f302d729c08fd3d5910cb877c4795ffa3de63307c9bdccce079a8cb"
        },
        "downloads": -1,
        "filename": "sync_ends-2.1.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "3fc0df6125a069c43287d28594722d46",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 20087,
        "upload_time": "2020-10-28T03:52:21",
        "upload_time_iso_8601": "2020-10-28T03:52:21.447271Z",
        "url": "https://files.pythonhosted.org/packages/d9/15/0bc2cd1bb088ea390c7c17abc291986966b2ce0d029d419f786affe40e04/sync_ends-2.1.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e35f34304bf002d58fb92e0393cad03d739e6c90e756c269a7e871ea060ccd9e",
          "md5": "f7d84292307fabdb7b601745c9f52d4f",
          "sha256": "de5ad4edffa17cf4d4ec5856f58ba55fee8727ee89af7bab8a54179e0a298b92"
        },
        "downloads": -1,
        "filename": "sync-ends-2.1.3.tar.gz",
        "has_sig": false,
        "md5_digest": "f7d84292307fabdb7b601745c9f52d4f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 23591,
        "upload_time": "2020-10-28T03:52:22",
        "upload_time_iso_8601": "2020-10-28T03:52:22.622416Z",
        "url": "https://files.pythonhosted.org/packages/e3/5f/34304bf002d58fb92e0393cad03d739e6c90e756c269a7e871ea060ccd9e/sync-ends-2.1.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "d9150bc2cd1bb088ea390c7c17abc291986966b2ce0d029d419f786affe40e04",
        "md5": "3fc0df6125a069c43287d28594722d46",
        "sha256": "7e9c7aab1f302d729c08fd3d5910cb877c4795ffa3de63307c9bdccce079a8cb"
      },
      "downloads": -1,
      "filename": "sync_ends-2.1.3-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "3fc0df6125a069c43287d28594722d46",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6",
      "size": 20087,
      "upload_time": "2020-10-28T03:52:21",
      "upload_time_iso_8601": "2020-10-28T03:52:21.447271Z",
      "url": "https://files.pythonhosted.org/packages/d9/15/0bc2cd1bb088ea390c7c17abc291986966b2ce0d029d419f786affe40e04/sync_ends-2.1.3-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "e35f34304bf002d58fb92e0393cad03d739e6c90e756c269a7e871ea060ccd9e",
        "md5": "f7d84292307fabdb7b601745c9f52d4f",
        "sha256": "de5ad4edffa17cf4d4ec5856f58ba55fee8727ee89af7bab8a54179e0a298b92"
      },
      "downloads": -1,
      "filename": "sync-ends-2.1.3.tar.gz",
      "has_sig": false,
      "md5_digest": "f7d84292307fabdb7b601745c9f52d4f",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 23591,
      "upload_time": "2020-10-28T03:52:22",
      "upload_time_iso_8601": "2020-10-28T03:52:22.622416Z",
      "url": "https://files.pythonhosted.org/packages/e3/5f/34304bf002d58fb92e0393cad03d739e6c90e756c269a7e871ea060ccd9e/sync-ends-2.1.3.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}