{
  "info": {
    "author": "Claudio M. Perez",
    "author_email": "",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "Intended Audience :: Developers",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3 :: Only"
    ],
    "description": "\n\nInfo about original Tkinter license: https://web.archive.org/web/20170430142250/http://tkinter.unpythonic.net/wiki/Tkinter\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "",
    "license": "A. HISTORY OF THE SOFTWARE ========================== Python was created in the early 1990s by Guido van Rossum at Stichting Mathematisch Centrum (CWI, see http://www.cwi.nl) in the Netherlands as a successor of a language called ABC.  Guido remains Python's principal author, although it includes many contributions from others. In 1995, Guido continued his work on Python at the Corporation for National Research Initiatives (CNRI, see http://www.cnri.reston.va.us) in Reston, Virginia where he released several versions of the software. In May 2000, Guido and the Python core development team moved to BeOpen.com to form the BeOpen PythonLabs team.  In October of the same year, the PythonLabs team moved to Digital Creations, which became Zope Corporation.  In 2001, the Python Software Foundation (PSF, see https://www.python.org/psf/) was formed, a non-profit organization created specifically to own Python-related Intellectual Property. Zope Corporation was a sponsoring member of the PSF. All Python releases are Open Source (see http://www.opensource.org for the Open Source Definition).  Historically, most, but not all, Python releases have also been GPL-compatible; the table below summarizes the various releases. Release         Derived     Year        Owner       GPL- from                                compatible? (1) 0.9.0 thru 1.2              1991-1995   CWI         yes 1.3 thru 1.5.2  1.2         1995-1999   CNRI        yes 1.6             1.5.2       2000        CNRI        no 2.0             1.6         2000        BeOpen.com  no 1.6.1           1.6         2001        CNRI        yes (2) 2.1             2.0+1.6.1   2001        PSF         no 2.0.1           2.0+1.6.1   2001        PSF         yes 2.1.1           2.1+2.0.1   2001        PSF         yes 2.1.2           2.1.1       2002        PSF         yes 2.1.3           2.1.2       2002        PSF         yes 2.2 and above   2.1.1       2001-now    PSF         yes Footnotes: (1) GPL-compatible doesn't mean that we're distributing Python under the GPL.  All Python licenses, unlike the GPL, let you distribute a modified version without making your changes open source.  The GPL-compatible licenses make it possible to combine Python with other software that is released under the GPL; the others don't. (2) According to Richard Stallman, 1.6.1 is not GPL-compatible, because its license has a choice of law clause.  According to CNRI, however, Stallman's lawyer has told CNRI's lawyer that 1.6.1 is \"not incompatible\" with the GPL. Thanks to the many outside volunteers who have worked under Guido's direction to make these releases possible. B. TERMS AND CONDITIONS FOR ACCESSING OR OTHERWISE USING PYTHON =============================================================== Python software and documentation are licensed under the Python Software Foundation License Version 2. Starting with Python 3.8.6, examples, recipes, and other code in the documentation are dual licensed under the PSF License Version 2 and the Zero-Clause BSD license. Some software incorporated into Python is under different licenses. The licenses are listed with code falling under that license. PYTHON SOFTWARE FOUNDATION LICENSE VERSION 2 -------------------------------------------- 1. This LICENSE AGREEMENT is between the Python Software Foundation (\"PSF\"), and the Individual or Organization (\"Licensee\") accessing and otherwise using this software (\"Python\") in source or binary form and its associated documentation. 2. Subject to the terms and conditions of this License Agreement, PSF hereby grants Licensee a nonexclusive, royalty-free, world-wide license to reproduce, analyze, test, perform and/or display publicly, prepare derivative works, distribute, and otherwise use Python alone or in any derivative version, provided, however, that PSF's License Agreement and PSF's notice of copyright, i.e., \"Copyright (c) 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022 Python Software Foundation; All Rights Reserved\" are retained in Python alone or in any derivative version prepared by Licensee. 3. In the event Licensee prepares a derivative work that is based on or incorporates Python or any part thereof, and wants to make the derivative work available to others as provided herein, then Licensee hereby agrees to include in any such work a brief summary of the changes made to Python. 4. PSF is making Python available to Licensee on an \"AS IS\" basis.  PSF MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED.  BY WAY OF EXAMPLE, BUT NOT LIMITATION, PSF MAKES NO AND DISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF PYTHON WILL NOT INFRINGE ANY THIRD PARTY RIGHTS. 5. PSF SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF PYTHON FOR ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS AS A RESULT OF MODIFYING, DISTRIBUTING, OR OTHERWISE USING PYTHON, OR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF. 6. This License Agreement will automatically terminate upon a material breach of its terms and conditions. 7. Nothing in this License Agreement shall be deemed to create any relationship of agency, partnership, or joint venture between PSF and Licensee.  This License Agreement does not grant permission to use PSF trademarks or trade name in a trademark sense to endorse or promote products or services of Licensee, or any third party. 8. By copying, installing or otherwise using Python, Licensee agrees to be bound by the terms and conditions of this License Agreement. BEOPEN.COM LICENSE AGREEMENT FOR PYTHON 2.0 ------------------------------------------- BEOPEN PYTHON OPEN SOURCE LICENSE AGREEMENT VERSION 1 1. This LICENSE AGREEMENT is between BeOpen.com (\"BeOpen\"), having an office at 160 Saratoga Avenue, Santa Clara, CA 95051, and the Individual or Organization (\"Licensee\") accessing and otherwise using this software in source or binary form and its associated documentation (\"the Software\"). 2. Subject to the terms and conditions of this BeOpen Python License Agreement, BeOpen hereby grants Licensee a non-exclusive, royalty-free, world-wide license to reproduce, analyze, test, perform and/or display publicly, prepare derivative works, distribute, and otherwise use the Software alone or in any derivative version, provided, however, that the BeOpen Python License is retained in the Software, alone or in any derivative version prepared by Licensee. 3. BeOpen is making the Software available to Licensee on an \"AS IS\" basis.  BEOPEN MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED.  BY WAY OF EXAMPLE, BUT NOT LIMITATION, BEOPEN MAKES NO AND DISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF THE SOFTWARE WILL NOT INFRINGE ANY THIRD PARTY RIGHTS. 4. BEOPEN SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF THE SOFTWARE FOR ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS AS A RESULT OF USING, MODIFYING OR DISTRIBUTING THE SOFTWARE, OR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF. 5. This License Agreement will automatically terminate upon a material breach of its terms and conditions. 6. This License Agreement shall be governed by and interpreted in all respects by the law of the State of California, excluding conflict of law provisions.  Nothing in this License Agreement shall be deemed to create any relationship of agency, partnership, or joint venture between BeOpen and Licensee.  This License Agreement does not grant permission to use BeOpen trademarks or trade names in a trademark sense to endorse or promote products or services of Licensee, or any third party.  As an exception, the \"BeOpen Python\" logos available at http://www.pythonlabs.com/logos.html may be used according to the permissions granted on that web page. 7. By copying, installing or otherwise using the software, Licensee agrees to be bound by the terms and conditions of this License Agreement. CNRI LICENSE AGREEMENT FOR PYTHON 1.6.1 --------------------------------------- 1. This LICENSE AGREEMENT is between the Corporation for National Research Initiatives, having an office at 1895 Preston White Drive, Reston, VA 20191 (\"CNRI\"), and the Individual or Organization (\"Licensee\") accessing and otherwise using Python 1.6.1 software in source or binary form and its associated documentation. 2. Subject to the terms and conditions of this License Agreement, CNRI hereby grants Licensee a nonexclusive, royalty-free, world-wide license to reproduce, analyze, test, perform and/or display publicly, prepare derivative works, distribute, and otherwise use Python 1.6.1 alone or in any derivative version, provided, however, that CNRI's License Agreement and CNRI's notice of copyright, i.e., \"Copyright (c) 1995-2001 Corporation for National Research Initiatives; All Rights Reserved\" are retained in Python 1.6.1 alone or in any derivative version prepared by Licensee.  Alternately, in lieu of CNRI's License Agreement, Licensee may substitute the following text (omitting the quotes): \"Python 1.6.1 is made available subject to the terms and conditions in CNRI's License Agreement.  This Agreement together with Python 1.6.1 may be located on the internet using the following unique, persistent identifier (known as a handle): 1895.22/1013.  This Agreement may also be obtained from a proxy server on the internet using the following URL: http://hdl.handle.net/1895.22/1013\". 3. In the event Licensee prepares a derivative work that is based on or incorporates Python 1.6.1 or any part thereof, and wants to make the derivative work available to others as provided herein, then Licensee hereby agrees to include in any such work a brief summary of the changes made to Python 1.6.1. 4. CNRI is making Python 1.6.1 available to Licensee on an \"AS IS\" basis.  CNRI MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED.  BY WAY OF EXAMPLE, BUT NOT LIMITATION, CNRI MAKES NO AND DISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF PYTHON 1.6.1 WILL NOT INFRINGE ANY THIRD PARTY RIGHTS. 5. CNRI SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF PYTHON 1.6.1 FOR ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS AS A RESULT OF MODIFYING, DISTRIBUTING, OR OTHERWISE USING PYTHON 1.6.1, OR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF. 6. This License Agreement will automatically terminate upon a material breach of its terms and conditions. 7. This License Agreement shall be governed by the federal intellectual property law of the United States, including without limitation the federal copyright law, and, to the extent such U.S. federal law does not apply, by the law of the Commonwealth of Virginia, excluding Virginia's conflict of law provisions. Notwithstanding the foregoing, with regard to derivative works based on Python 1.6.1 that incorporate non-separable material that was previously distributed under the GNU General Public License (GPL), the law of the Commonwealth of Virginia shall govern this License Agreement only as to issues arising under or with respect to Paragraphs 4, 5, and 7 of this License Agreement.  Nothing in this License Agreement shall be deemed to create any relationship of agency, partnership, or joint venture between CNRI and Licensee.  This License Agreement does not grant permission to use CNRI trademarks or trade name in a trademark sense to endorse or promote products or services of Licensee, or any third party. 8. By clicking on the \"ACCEPT\" button where indicated, or by copying, installing or otherwise using Python 1.6.1, Licensee agrees to be bound by the terms and conditions of this License Agreement. ACCEPT CWI LICENSE AGREEMENT FOR PYTHON 0.9.0 THROUGH 1.2 -------------------------------------------------- Copyright (c) 1991 - 1995, Stichting Mathematisch Centrum Amsterdam, The Netherlands.  All rights reserved. Permission to use, copy, modify, and distribute this software and its documentation for any purpose and without fee is hereby granted, provided that the above copyright notice appear in all copies and that both that copyright notice and this permission notice appear in supporting documentation, and that the name of Stichting Mathematisch Centrum or CWI not be used in advertising or publicity pertaining to distribution of the software without specific, written prior permission. STICHTING MATHEMATISCH CENTRUM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS, IN NO EVENT SHALL STICHTING MATHEMATISCH CENTRUM BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE. ZERO-CLAUSE BSD LICENSE FOR CODE IN THE PYTHON DOCUMENTATION ---------------------------------------------------------------------- Permission to use, copy, modify, and/or distribute this software for any purpose with or without fee is hereby granted. THE SOFTWARE IS PROVIDED \"AS IS\" AND THE AUTHOR DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.",
    "maintainer": "",
    "maintainer_email": "",
    "name": "tcinter",
    "package_url": "https://pypi.org/project/tcinter/",
    "platform": null,
    "project_url": "https://pypi.org/project/tcinter/",
    "project_urls": {
      "Repository": "http://github.com/claudioperez/tcinter"
    },
    "release_url": "https://pypi.org/project/tcinter/0.0.4/",
    "requires_dist": null,
    "requires_python": "",
    "summary": ".",
    "version": "0.0.4",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 15070124,
  "releases": {
    "0.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "de346996b8a2b9800b09f9f9d9f5a041270c2cc6073c1ef145afc6b82997cea3",
          "md5": "40079b876c61b469066e7eb1d3b7d8a4",
          "sha256": "0b0112eeee96337c598b432c36a409b84662cbad25b9dacf3d69967f372413cb"
        },
        "downloads": -1,
        "filename": "tcinter-0.0.1-cp310-cp310-manylinux_2_28_x86_64.whl",
        "has_sig": false,
        "md5_digest": "40079b876c61b469066e7eb1d3b7d8a4",
        "packagetype": "bdist_wheel",
        "python_version": "cp310",
        "requires_python": null,
        "size": 915735,
        "upload_time": "2022-09-11T21:33:35",
        "upload_time_iso_8601": "2022-09-11T21:33:35.344921Z",
        "url": "https://files.pythonhosted.org/packages/de/34/6996b8a2b9800b09f9f9d9f5a041270c2cc6073c1ef145afc6b82997cea3/tcinter-0.0.1-cp310-cp310-manylinux_2_28_x86_64.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ed9249cc5557989e813a721b174ecf3c3b98ccd3fa86d2382711fac11ba4ab1f",
          "md5": "deeb5a741a44f13ca6e39f37f68607fc",
          "sha256": "16d01d683a3f63703e6463ad77480bab68b9f0b8a2b6bf7443c030b1dfced5dd"
        },
        "downloads": -1,
        "filename": "tcinter-0.0.1-cp311-cp311-manylinux_2_28_x86_64.whl",
        "has_sig": false,
        "md5_digest": "deeb5a741a44f13ca6e39f37f68607fc",
        "packagetype": "bdist_wheel",
        "python_version": "cp311",
        "requires_python": null,
        "size": 915761,
        "upload_time": "2022-09-11T21:33:37",
        "upload_time_iso_8601": "2022-09-11T21:33:37.598749Z",
        "url": "https://files.pythonhosted.org/packages/ed/92/49cc5557989e813a721b174ecf3c3b98ccd3fa86d2382711fac11ba4ab1f/tcinter-0.0.1-cp311-cp311-manylinux_2_28_x86_64.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ab5b68088820ef85b0b7be234bab1986b4bed9c1e33256a329540ba1712a5552",
          "md5": "c2bfec4608c2817b53fa24651c0b4dbf",
          "sha256": "0bfe92a8a170329fb02400374f6c7d8a8261af881968870c28b032828349de67"
        },
        "downloads": -1,
        "filename": "tcinter-0.0.1-cp37-cp37m-manylinux_2_28_x86_64.whl",
        "has_sig": false,
        "md5_digest": "c2bfec4608c2817b53fa24651c0b4dbf",
        "packagetype": "bdist_wheel",
        "python_version": "cp37",
        "requires_python": null,
        "size": 915910,
        "upload_time": "2022-09-11T21:33:40",
        "upload_time_iso_8601": "2022-09-11T21:33:40.059747Z",
        "url": "https://files.pythonhosted.org/packages/ab/5b/68088820ef85b0b7be234bab1986b4bed9c1e33256a329540ba1712a5552/tcinter-0.0.1-cp37-cp37m-manylinux_2_28_x86_64.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "269f332d243197c29fb4e56c8d676847a463d9c0746f4908e47f14de1cb99b43",
          "md5": "dc493e67da967b41b7ed82215c76ab05",
          "sha256": "ba4fe0bb14b30b0543138a1d56c2bb8e0dd07a458d4f88d5cecf2c593ca48069"
        },
        "downloads": -1,
        "filename": "tcinter-0.0.1-cp38-cp38-manylinux_2_28_x86_64.whl",
        "has_sig": false,
        "md5_digest": "dc493e67da967b41b7ed82215c76ab05",
        "packagetype": "bdist_wheel",
        "python_version": "cp38",
        "requires_python": null,
        "size": 915940,
        "upload_time": "2022-09-11T21:33:42",
        "upload_time_iso_8601": "2022-09-11T21:33:42.292789Z",
        "url": "https://files.pythonhosted.org/packages/26/9f/332d243197c29fb4e56c8d676847a463d9c0746f4908e47f14de1cb99b43/tcinter-0.0.1-cp38-cp38-manylinux_2_28_x86_64.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2df9524ea16a4d567a782f674d996ee173fac005288df14a91d21d46b7d784bf",
          "md5": "6232c00709866b3016bc5257e9d312ff",
          "sha256": "b3eaa9c7f05aafcf31c7f671c6cf3c980d67e4abcacc7e1533bf8371dc608ec0"
        },
        "downloads": -1,
        "filename": "tcinter-0.0.1-cp39-cp39-manylinux_2_28_x86_64.whl",
        "has_sig": false,
        "md5_digest": "6232c00709866b3016bc5257e9d312ff",
        "packagetype": "bdist_wheel",
        "python_version": "cp39",
        "requires_python": null,
        "size": 915748,
        "upload_time": "2022-09-11T21:33:44",
        "upload_time_iso_8601": "2022-09-11T21:33:44.450789Z",
        "url": "https://files.pythonhosted.org/packages/2d/f9/524ea16a4d567a782f674d996ee173fac005288df14a91d21d46b7d784bf/tcinter-0.0.1-cp39-cp39-manylinux_2_28_x86_64.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "baa2444fbc61144dbf2e0193303ab59020f65a3b64256870dcfa5e64e2ada9fc",
          "md5": "ee0ad2a6b0071f4d615a717fcc26bdef",
          "sha256": "2423139f65d3f4110c0ad028aa9c8d41faed63dca4e3f2ce01415d3f64162002"
        },
        "downloads": -1,
        "filename": "tcinter-0.0.2-cp310-cp310-manylinux_2_28_x86_64.whl",
        "has_sig": false,
        "md5_digest": "ee0ad2a6b0071f4d615a717fcc26bdef",
        "packagetype": "bdist_wheel",
        "python_version": "cp310",
        "requires_python": null,
        "size": 917695,
        "upload_time": "2022-09-12T03:02:24",
        "upload_time_iso_8601": "2022-09-12T03:02:24.171307Z",
        "url": "https://files.pythonhosted.org/packages/ba/a2/444fbc61144dbf2e0193303ab59020f65a3b64256870dcfa5e64e2ada9fc/tcinter-0.0.2-cp310-cp310-manylinux_2_28_x86_64.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a49e0ce41e359a0459022271659c05bca51eea4b5413ff561ee470b0f479e4dc",
          "md5": "10420704c4c693e53cb8fcad385a71fa",
          "sha256": "72c27a18d2c6d00074d3b5b8d324b3f188c279a65f5ae8e6b95b4c708503639c"
        },
        "downloads": -1,
        "filename": "tcinter-0.0.2-cp311-cp311-manylinux_2_28_x86_64.whl",
        "has_sig": false,
        "md5_digest": "10420704c4c693e53cb8fcad385a71fa",
        "packagetype": "bdist_wheel",
        "python_version": "cp311",
        "requires_python": null,
        "size": 917721,
        "upload_time": "2022-09-12T03:02:26",
        "upload_time_iso_8601": "2022-09-12T03:02:26.426449Z",
        "url": "https://files.pythonhosted.org/packages/a4/9e/0ce41e359a0459022271659c05bca51eea4b5413ff561ee470b0f479e4dc/tcinter-0.0.2-cp311-cp311-manylinux_2_28_x86_64.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3f43f22d157bb2d99d87d706d8b76af96300407fe7c8d9976ac7689ee5c3034c",
          "md5": "938a0e48e55172eb2d7e0d17178c0637",
          "sha256": "b192019c714fd0db903eb4fe5642e582225beb66ba2698a6c31a2a41e0ed7e99"
        },
        "downloads": -1,
        "filename": "tcinter-0.0.2-cp37-cp37m-manylinux_2_28_x86_64.whl",
        "has_sig": false,
        "md5_digest": "938a0e48e55172eb2d7e0d17178c0637",
        "packagetype": "bdist_wheel",
        "python_version": "cp37",
        "requires_python": null,
        "size": 917866,
        "upload_time": "2022-09-12T03:02:29",
        "upload_time_iso_8601": "2022-09-12T03:02:29.019202Z",
        "url": "https://files.pythonhosted.org/packages/3f/43/f22d157bb2d99d87d706d8b76af96300407fe7c8d9976ac7689ee5c3034c/tcinter-0.0.2-cp37-cp37m-manylinux_2_28_x86_64.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6e12706da9bdd5b0d49bfb7b47b51c6a50622b52b3e7e67acaf16ee797a599f3",
          "md5": "4e0667ef95f88aa7a1f1640ffacb4310",
          "sha256": "c61a3d86848e2d4b994c262d079e663da7c79b2ac47fab911af66faef22bb18a"
        },
        "downloads": -1,
        "filename": "tcinter-0.0.2-cp38-cp38-manylinux_2_28_x86_64.whl",
        "has_sig": false,
        "md5_digest": "4e0667ef95f88aa7a1f1640ffacb4310",
        "packagetype": "bdist_wheel",
        "python_version": "cp38",
        "requires_python": null,
        "size": 917900,
        "upload_time": "2022-09-12T03:02:31",
        "upload_time_iso_8601": "2022-09-12T03:02:31.207454Z",
        "url": "https://files.pythonhosted.org/packages/6e/12/706da9bdd5b0d49bfb7b47b51c6a50622b52b3e7e67acaf16ee797a599f3/tcinter-0.0.2-cp38-cp38-manylinux_2_28_x86_64.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6fb929583bbe98e53b3dad9521886d1ba1b8408f9a41445db5e8c8b05dd21164",
          "md5": "80ed5f50f00ee8d920b65fb430700605",
          "sha256": "4f8bebcdde53d1458c183a7ea03089f0553d540fbe7578a22e66cc1c3dcae7f7"
        },
        "downloads": -1,
        "filename": "tcinter-0.0.2-cp39-cp39-manylinux_2_28_x86_64.whl",
        "has_sig": false,
        "md5_digest": "80ed5f50f00ee8d920b65fb430700605",
        "packagetype": "bdist_wheel",
        "python_version": "cp39",
        "requires_python": null,
        "size": 917708,
        "upload_time": "2022-09-12T03:02:33",
        "upload_time_iso_8601": "2022-09-12T03:02:33.556795Z",
        "url": "https://files.pythonhosted.org/packages/6f/b9/29583bbe98e53b3dad9521886d1ba1b8408f9a41445db5e8c8b05dd21164/tcinter-0.0.2-cp39-cp39-manylinux_2_28_x86_64.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ba6b739a1c0a1c27434d4cafb98e8f67e426cb9688465bf9ec3506d464303bc0",
          "md5": "50cca049f25555ada70d241a58784b9a",
          "sha256": "956ecb0833d2ab4c2f93bb9c433bd9bd4564886198d5a6436e64323bf3cb1d3e"
        },
        "downloads": -1,
        "filename": "tcinter-0.0.3-cp310-cp310-manylinux_2_28_x86_64.whl",
        "has_sig": false,
        "md5_digest": "50cca049f25555ada70d241a58784b9a",
        "packagetype": "bdist_wheel",
        "python_version": "cp310",
        "requires_python": null,
        "size": 926621,
        "upload_time": "2022-09-12T17:54:20",
        "upload_time_iso_8601": "2022-09-12T17:54:20.788478Z",
        "url": "https://files.pythonhosted.org/packages/ba/6b/739a1c0a1c27434d4cafb98e8f67e426cb9688465bf9ec3506d464303bc0/tcinter-0.0.3-cp310-cp310-manylinux_2_28_x86_64.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "498998c9337209c4df0b65012cd5658c232701e4d81cb894b81d6c669d75e6e4",
          "md5": "c32cc51d5dbcc016e1ef3c01c23e4f84",
          "sha256": "8d402c0ed1e697276fdc86a188f75ada5560e2e41809d7e9c16c8e36adb78ba0"
        },
        "downloads": -1,
        "filename": "tcinter-0.0.3-cp311-cp311-manylinux_2_28_x86_64.whl",
        "has_sig": false,
        "md5_digest": "c32cc51d5dbcc016e1ef3c01c23e4f84",
        "packagetype": "bdist_wheel",
        "python_version": "cp311",
        "requires_python": null,
        "size": 926652,
        "upload_time": "2022-09-12T17:54:23",
        "upload_time_iso_8601": "2022-09-12T17:54:23.091449Z",
        "url": "https://files.pythonhosted.org/packages/49/89/98c9337209c4df0b65012cd5658c232701e4d81cb894b81d6c669d75e6e4/tcinter-0.0.3-cp311-cp311-manylinux_2_28_x86_64.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a9815acd97d019a4d68fe75e9a88588d43b416d11334c00a0b843f8d8ba72762",
          "md5": "cfe2e067a5996a5b1d0058f5750d9346",
          "sha256": "561e221b299388a6a6146cfb22582bcdf311af89f385e60aca75acfa0077c944"
        },
        "downloads": -1,
        "filename": "tcinter-0.0.3-cp37-cp37m-manylinux_2_28_x86_64.whl",
        "has_sig": false,
        "md5_digest": "cfe2e067a5996a5b1d0058f5750d9346",
        "packagetype": "bdist_wheel",
        "python_version": "cp37",
        "requires_python": null,
        "size": 926714,
        "upload_time": "2022-09-12T17:54:25",
        "upload_time_iso_8601": "2022-09-12T17:54:25.643277Z",
        "url": "https://files.pythonhosted.org/packages/a9/81/5acd97d019a4d68fe75e9a88588d43b416d11334c00a0b843f8d8ba72762/tcinter-0.0.3-cp37-cp37m-manylinux_2_28_x86_64.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8ea698bb2cfc10670981e866b53330fbe6dcdb1095c8c555925ef4386a7553bd",
          "md5": "5e493a6daba953a662be90b4504f8b19",
          "sha256": "a4eec62dfe88b119159b1c45d91bd21bdc682ea593a1ce1e7d42fe52d4ee8ce5"
        },
        "downloads": -1,
        "filename": "tcinter-0.0.3-cp38-cp38-manylinux_2_28_x86_64.whl",
        "has_sig": false,
        "md5_digest": "5e493a6daba953a662be90b4504f8b19",
        "packagetype": "bdist_wheel",
        "python_version": "cp38",
        "requires_python": null,
        "size": 926735,
        "upload_time": "2022-09-12T17:54:27",
        "upload_time_iso_8601": "2022-09-12T17:54:27.751449Z",
        "url": "https://files.pythonhosted.org/packages/8e/a6/98bb2cfc10670981e866b53330fbe6dcdb1095c8c555925ef4386a7553bd/tcinter-0.0.3-cp38-cp38-manylinux_2_28_x86_64.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d497eedd1afe215ee94c4acacf4da65c0cf930c0328738d6c35076375fc60367",
          "md5": "22d63233838883f56f576aa77b23718a",
          "sha256": "3e7ac0064c407df91defdb7334363900c186b754f7073fde0095407298e8cf6e"
        },
        "downloads": -1,
        "filename": "tcinter-0.0.3-cp39-cp39-manylinux_2_28_x86_64.whl",
        "has_sig": false,
        "md5_digest": "22d63233838883f56f576aa77b23718a",
        "packagetype": "bdist_wheel",
        "python_version": "cp39",
        "requires_python": null,
        "size": 926633,
        "upload_time": "2022-09-12T17:54:30",
        "upload_time_iso_8601": "2022-09-12T17:54:30.458102Z",
        "url": "https://files.pythonhosted.org/packages/d4/97/eedd1afe215ee94c4acacf4da65c0cf930c0328738d6c35076375fc60367/tcinter-0.0.3-cp39-cp39-manylinux_2_28_x86_64.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2d69bcef77fa6b6aefd93c2fc5cab30347132e6eff0fc7668d9f4a8c213603e3",
          "md5": "61dcf614f2dabbc2bf3aba9abc50415c",
          "sha256": "972e612cc1c97cbdde0f955d4cdd87558f208e65d0588dd5c98afa20b2e84933"
        },
        "downloads": -1,
        "filename": "tcinter-0.0.4-cp310-cp310-manylinux_2_28_x86_64.whl",
        "has_sig": false,
        "md5_digest": "61dcf614f2dabbc2bf3aba9abc50415c",
        "packagetype": "bdist_wheel",
        "python_version": "cp310",
        "requires_python": null,
        "size": 926626,
        "upload_time": "2022-09-12T17:59:31",
        "upload_time_iso_8601": "2022-09-12T17:59:31.581348Z",
        "url": "https://files.pythonhosted.org/packages/2d/69/bcef77fa6b6aefd93c2fc5cab30347132e6eff0fc7668d9f4a8c213603e3/tcinter-0.0.4-cp310-cp310-manylinux_2_28_x86_64.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e4f9b7527113336bbd0f9ff134174d260ed235961390134734691e54dcd32b64",
          "md5": "980935ff03b37a09c5a75572e82c4a29",
          "sha256": "816fdb23c93c3ab8f67da64b35143db53e11979e445011a94cf43333257026fb"
        },
        "downloads": -1,
        "filename": "tcinter-0.0.4-cp311-cp311-manylinux_2_28_x86_64.whl",
        "has_sig": false,
        "md5_digest": "980935ff03b37a09c5a75572e82c4a29",
        "packagetype": "bdist_wheel",
        "python_version": "cp311",
        "requires_python": null,
        "size": 926655,
        "upload_time": "2022-09-12T17:59:34",
        "upload_time_iso_8601": "2022-09-12T17:59:34.041598Z",
        "url": "https://files.pythonhosted.org/packages/e4/f9/b7527113336bbd0f9ff134174d260ed235961390134734691e54dcd32b64/tcinter-0.0.4-cp311-cp311-manylinux_2_28_x86_64.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7c221f3715082c7adfe3b477eab81284864c13f5c366d1fd4d92afb4ee97b72a",
          "md5": "b6fe593f1a659d04188976d5709e2ce9",
          "sha256": "1a5f21bf772e2eb67cd0990a2e8c44f6879461733712cc6c9620f62b91ca47fa"
        },
        "downloads": -1,
        "filename": "tcinter-0.0.4-cp37-cp37m-manylinux_2_28_x86_64.whl",
        "has_sig": false,
        "md5_digest": "b6fe593f1a659d04188976d5709e2ce9",
        "packagetype": "bdist_wheel",
        "python_version": "cp37",
        "requires_python": null,
        "size": 926710,
        "upload_time": "2022-09-12T17:59:36",
        "upload_time_iso_8601": "2022-09-12T17:59:36.525820Z",
        "url": "https://files.pythonhosted.org/packages/7c/22/1f3715082c7adfe3b477eab81284864c13f5c366d1fd4d92afb4ee97b72a/tcinter-0.0.4-cp37-cp37m-manylinux_2_28_x86_64.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "65cfd2b7a99ae0524f844c80b708cd95d008e28b88521e8720f1919eef010ef1",
          "md5": "e58361def0af21e29617c17a582166c4",
          "sha256": "d976404adc59f4d8c04c45571843759970a7ef9815f820d65c84b4578cdde5f8"
        },
        "downloads": -1,
        "filename": "tcinter-0.0.4-cp38-cp38-manylinux_2_28_x86_64.whl",
        "has_sig": false,
        "md5_digest": "e58361def0af21e29617c17a582166c4",
        "packagetype": "bdist_wheel",
        "python_version": "cp38",
        "requires_python": null,
        "size": 926739,
        "upload_time": "2022-09-12T17:59:39",
        "upload_time_iso_8601": "2022-09-12T17:59:39.095498Z",
        "url": "https://files.pythonhosted.org/packages/65/cf/d2b7a99ae0524f844c80b708cd95d008e28b88521e8720f1919eef010ef1/tcinter-0.0.4-cp38-cp38-manylinux_2_28_x86_64.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9a3f027be4c816c657eceefc10f156324131cdd6a2daf65596219fbab010b668",
          "md5": "89550697ed59a951d1b886832995a881",
          "sha256": "a43c4d7c4932b9670207f81f1dd779620f3c6c1a627bfb40c55cb359e6dd5ca8"
        },
        "downloads": -1,
        "filename": "tcinter-0.0.4-cp39-cp39-manylinux_2_28_x86_64.whl",
        "has_sig": false,
        "md5_digest": "89550697ed59a951d1b886832995a881",
        "packagetype": "bdist_wheel",
        "python_version": "cp39",
        "requires_python": null,
        "size": 926634,
        "upload_time": "2022-09-12T17:59:41",
        "upload_time_iso_8601": "2022-09-12T17:59:41.469811Z",
        "url": "https://files.pythonhosted.org/packages/9a/3f/027be4c816c657eceefc10f156324131cdd6a2daf65596219fbab010b668/tcinter-0.0.4-cp39-cp39-manylinux_2_28_x86_64.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "2d69bcef77fa6b6aefd93c2fc5cab30347132e6eff0fc7668d9f4a8c213603e3",
        "md5": "61dcf614f2dabbc2bf3aba9abc50415c",
        "sha256": "972e612cc1c97cbdde0f955d4cdd87558f208e65d0588dd5c98afa20b2e84933"
      },
      "downloads": -1,
      "filename": "tcinter-0.0.4-cp310-cp310-manylinux_2_28_x86_64.whl",
      "has_sig": false,
      "md5_digest": "61dcf614f2dabbc2bf3aba9abc50415c",
      "packagetype": "bdist_wheel",
      "python_version": "cp310",
      "requires_python": null,
      "size": 926626,
      "upload_time": "2022-09-12T17:59:31",
      "upload_time_iso_8601": "2022-09-12T17:59:31.581348Z",
      "url": "https://files.pythonhosted.org/packages/2d/69/bcef77fa6b6aefd93c2fc5cab30347132e6eff0fc7668d9f4a8c213603e3/tcinter-0.0.4-cp310-cp310-manylinux_2_28_x86_64.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "e4f9b7527113336bbd0f9ff134174d260ed235961390134734691e54dcd32b64",
        "md5": "980935ff03b37a09c5a75572e82c4a29",
        "sha256": "816fdb23c93c3ab8f67da64b35143db53e11979e445011a94cf43333257026fb"
      },
      "downloads": -1,
      "filename": "tcinter-0.0.4-cp311-cp311-manylinux_2_28_x86_64.whl",
      "has_sig": false,
      "md5_digest": "980935ff03b37a09c5a75572e82c4a29",
      "packagetype": "bdist_wheel",
      "python_version": "cp311",
      "requires_python": null,
      "size": 926655,
      "upload_time": "2022-09-12T17:59:34",
      "upload_time_iso_8601": "2022-09-12T17:59:34.041598Z",
      "url": "https://files.pythonhosted.org/packages/e4/f9/b7527113336bbd0f9ff134174d260ed235961390134734691e54dcd32b64/tcinter-0.0.4-cp311-cp311-manylinux_2_28_x86_64.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "7c221f3715082c7adfe3b477eab81284864c13f5c366d1fd4d92afb4ee97b72a",
        "md5": "b6fe593f1a659d04188976d5709e2ce9",
        "sha256": "1a5f21bf772e2eb67cd0990a2e8c44f6879461733712cc6c9620f62b91ca47fa"
      },
      "downloads": -1,
      "filename": "tcinter-0.0.4-cp37-cp37m-manylinux_2_28_x86_64.whl",
      "has_sig": false,
      "md5_digest": "b6fe593f1a659d04188976d5709e2ce9",
      "packagetype": "bdist_wheel",
      "python_version": "cp37",
      "requires_python": null,
      "size": 926710,
      "upload_time": "2022-09-12T17:59:36",
      "upload_time_iso_8601": "2022-09-12T17:59:36.525820Z",
      "url": "https://files.pythonhosted.org/packages/7c/22/1f3715082c7adfe3b477eab81284864c13f5c366d1fd4d92afb4ee97b72a/tcinter-0.0.4-cp37-cp37m-manylinux_2_28_x86_64.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "65cfd2b7a99ae0524f844c80b708cd95d008e28b88521e8720f1919eef010ef1",
        "md5": "e58361def0af21e29617c17a582166c4",
        "sha256": "d976404adc59f4d8c04c45571843759970a7ef9815f820d65c84b4578cdde5f8"
      },
      "downloads": -1,
      "filename": "tcinter-0.0.4-cp38-cp38-manylinux_2_28_x86_64.whl",
      "has_sig": false,
      "md5_digest": "e58361def0af21e29617c17a582166c4",
      "packagetype": "bdist_wheel",
      "python_version": "cp38",
      "requires_python": null,
      "size": 926739,
      "upload_time": "2022-09-12T17:59:39",
      "upload_time_iso_8601": "2022-09-12T17:59:39.095498Z",
      "url": "https://files.pythonhosted.org/packages/65/cf/d2b7a99ae0524f844c80b708cd95d008e28b88521e8720f1919eef010ef1/tcinter-0.0.4-cp38-cp38-manylinux_2_28_x86_64.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "9a3f027be4c816c657eceefc10f156324131cdd6a2daf65596219fbab010b668",
        "md5": "89550697ed59a951d1b886832995a881",
        "sha256": "a43c4d7c4932b9670207f81f1dd779620f3c6c1a627bfb40c55cb359e6dd5ca8"
      },
      "downloads": -1,
      "filename": "tcinter-0.0.4-cp39-cp39-manylinux_2_28_x86_64.whl",
      "has_sig": false,
      "md5_digest": "89550697ed59a951d1b886832995a881",
      "packagetype": "bdist_wheel",
      "python_version": "cp39",
      "requires_python": null,
      "size": 926634,
      "upload_time": "2022-09-12T17:59:41",
      "upload_time_iso_8601": "2022-09-12T17:59:41.469811Z",
      "url": "https://files.pythonhosted.org/packages/9a/3f/027be4c816c657eceefc10f156324131cdd6a2daf65596219fbab010b668/tcinter-0.0.4-cp39-cp39-manylinux_2_28_x86_64.whl",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}