{
  "info": {
    "author": "Derek Ditch",
    "author_email": "dcode@users.noreply.github.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 4 - Beta",
      "Environment :: Console",
      "Intended Audience :: Information Technology",
      "License :: OSI Approved :: Apache Software License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.10",
      "Programming Language :: Python :: 3.11",
      "Topic :: Security",
      "Typing :: Typed"
    ],
    "description": "# Elastic Security Labs thrunting-tools\n\nHave you ever been threat hunting (hereafter known as \"thrunting\") in Kibana and thought\n\"Gee! I wish I could take these results and do some automation on the command line!\".\nWell look no further, fellow thrunter! This repo has just what you need to make your\nautomation adventures a bit easier.\n\nthrunting-tools is a collection of command line utilities for working with data.\n\nThe current list of tools are:\n\n- `eql-query`, a tool to let you perform EQL searches from your shell!\n- `lucene-query`, a tool to let you perform Lucene searches against Elasticsearch in your\n  comfort zone, the command line.\n- `from-charcode`, a tool to convert a character code in a given base to the ASCII character\n- `to-charcode`, a tool to convert an ASCII character to a given base\n- `url-decode`, a tool to decode urlencoded strings\n- `url-encode`, a tool to encode common character or all special characters to urlencoded strings\n- `zlib-compress`, a tool to perform zlib compression/deflation on the command line\n- `zlib-decompress`, a tool to perform zlib decompression/inflation on the command line\n- `zlib-deflate`, an alias for zlib-compress\n- `zlib-decompress`, an alias for zlib-decompress\n- `unmap-pe`, processes a PE binary, removing the memory mapping. Useful for analyzing process memory dumps\n\n## Installation\n\nThe easiest way to install thrunting-tools is with [pipx](https://pypa.github.io/pipx/). Once\nyou have pipx installed, to install these tools on your path, simply install the latest release\nwith:\n\n```shell\npipx install thrunting-tools\n```\n\nAlternatively, if you'd like to install with pip and you have your own Python environment, you can\ndo that too.\n\n```shell\npip3 install thrunting-tools\n```\n\nYou can now check that each command was installed.\n\n```shell\neql-query --version\nlucene-query --version\n```\n\n### Docker Usage\n\nLastly, if you want to use a container runtime environment, you can use the latest release from\nthe repository GitHub Container Repository. Currently, we're publishing AMD64 and ARM64 images.\n\n```shell\ndocker pull ghcr.io/elastic/securitylabs-thrunting-tools:main\n```\n\nThen, you can run the container and pass your local configuration in to the default\nlocation used by the container, `/config.yml`. (NOTE: the `:z` part of the volume\nspecification is only needed if you use SELinux)\n\n```shell\ndocker run -ti -v \"${HOME}/.config/thrunting-tools/config.yml\":/config.yml:ro,z \\\n    --rm ghcr.io/elastic/securitylabs-thrunting-tools:latest eql-query --help\n```\n\n## Usage\n\nEach of the commands provide a usage when called with `--help`.\n\n```shell\n$ eql-query --help\n\n Usage: eql-query [OPTIONS] QUERY\n\n╭─ Arguments ─────────────────────────────────────────────────────────────────────────────────╮\n│ *    query      TEXT  Query specified using EQL (See https://ela.st/eql) [required]         │\n╰─────────────────────────────────────────────────────────────────────────────────────────────╯\n╭─ Options ───────────────────────────────────────────────────────────────────────────────────╮\n│ --index        -i      TEXT     Index pattern to search. Defaults to                        │\n│                                 '.alerts-security.alerts-default,apm-*-transaction*,logs-*' │\n│ --since        -s      TEXT     Earliest time filter using datemath or datetime             │\n│                                 [default: now-30d/d]                                        │\n│ --before       -b      TEXT     Latest time filter using datemath or datetime               │\n│                                 [default: now]                                              │\n│ --compact      -c               Output one event/sequence per line                          │\n│ --fields       -f      TEXT     Comma separated list of fields to display [default: None]   │\n│ --size         -s      INTEGER  Specify maximum size of result set [default: 100]           │\n│ --config               PATH     Optional path to YAML configuration with settings for       │\n│                                 Elasticsearch                                               │\n│                                 [default:                                                   │\n│                                 /home/user/.config/thrunting-tools/config.yml]           │\n│ --environment  -e      TEXT     Environment name to use from config file (if present)       │\n│                                 [default: default]                                          │\n│ --help                          Show this message and exit.                                 │\n╰─────────────────────────────────────────────────────────────────────────────────────────────╯\n```\n\n## Configuration\n\nThere are two ways to pass configuration to the tools: environment variables and configuration files.\n\nThe tools default to looking for the YAML configuration file in the platform-specific\nconfiguration directory (see the `--help` output). If present, configuration groups are\ntop-level keys (e.g. `elasticsearch`), which contain a list of environments. All scripts will\ncheck for the first environment with the name attribute set to `default`  if none is specified\non the command line.\n\nExample configuration file:\n\n```yaml\nelasticsearch:\n  - name: default\n    cloud_id: \"security-cluster:dXMtd2VzdDEuZ2NwLmNsb3VkLmVzLmlvJGFiY2R=\"\n    cloud_auth: \"elastic:changeme\"\n```\n\n## Examples\n\nRun query using `devel` environment configuration\n\n```shell\neql-query -e devel 'malware where event.kind: \"alert\"'\n```\n\nUsing `jq` and `wc` to get the number of alert events where `EXCEL.EXE` was the parent process.\n\n```shell\neql-query 'any where event.kind: \"alert\"' -c | \\\n    jq 'select(._source.process.parent.name == \"EXCEL.EXE\")' -c | wc -l\n```\n\nFind the unique event categories of all events in the last day that triggered based upon a\nrule using the 'sandbox' environment\n\n```shell\n$ lucene-query --since 'now-1d' 'rule: *' -e sandbox -c | \\\n    jq '._source.event.category[]' -c -r | sort -u\nnetwork\n```\n\nFind the unique dynamic DNS subdomains of a particular domain resolved in our network in the\nlast month\n\n```shell\nlucene-query --since 'now-1M' 'dns.question.name: *.duckdns.org' -c \\\n    | jq '._source.dns.question.name' -r | sort -u\n...\n```\n\nFind a list of all the unique agent IDs that resolved a known malware domain within the last 12 months.\n\n```shell\n$ lucene-query --since 'now-12M' 'dns.question.name: puerto2547.duckdns.org' -c \\\n    | jq '._source.agent.id' -r | sort -u\nec82f608-3d1b-4651-900e-b970c68bbeef\n```\n\nExtract a single binary using Elastic Defend integration with\n[optional sample collection](https://www.elastic.co/security-labs/collecting-cobalt-strike-beacons-with-the-elastic-stack) enabled.\nNote that additional shell scripting would be needed to loop over a set of results.\n\n```shell\neql-query 'process where ?process.Ext.memory_region.bytes_compressed_present == true' \\\n    --size 1 \\\n    --fields 'process.Ext.memory_region.bytes_compressed' | \\\n    jq -r '.process.Ext.memory_region.bytes_compressed' | \\\n    base64 -d | zlib-decompress > captured_sample.bin\n```\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/elastic/securitylabs-thrunting-tools",
    "keywords": "elasticsearch,eql,lucene,command line",
    "license": "Apache-2.0",
    "maintainer": "",
    "maintainer_email": "",
    "name": "thrunting-tools",
    "package_url": "https://pypi.org/project/thrunting-tools/",
    "platform": null,
    "project_url": "https://pypi.org/project/thrunting-tools/",
    "project_urls": {
      "Bug Tracker": "https://github.com/elastic/securitylabs-thrunting-tools/issues",
      "Homepage": "https://github.com/elastic/securitylabs-thrunting-tools",
      "Repository": "https://github.com/elastic/securitylabs-thrunting-tools"
    },
    "release_url": "https://pypi.org/project/thrunting-tools/8.5.2/",
    "requires_dist": [
      "typer[all] (>=0.7.0,<0.8.0)",
      "scalpl (>=0.4.2,<0.5.0)",
      "pygments (>=2.13.0,<3.0.0)",
      "prompt-toolkit (>=3.0.32,<4.0.0)",
      "elasticsearch (>=8.5.0,<9.0.0)",
      "appdirs (>=1.4.4,<2.0.0)",
      "ruamel-yaml (>=0.17.21,<0.18.0)",
      "pydantic (>=1.10.2,<2.0.0)",
      "pefile (>=2022.5.30,<2023.0.0)"
    ],
    "requires_python": ">=3.10,<4.0",
    "summary": "A collection of utilities to help with threat hunting on the command line.",
    "version": "8.5.2",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 15933858,
  "releases": {
    "8.5.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "259e47a923870e09763aeb34838d44daafbafbba6c8afb61f6321d5eadc453c1",
          "md5": "a1ecd4f2508484487da89a81dd32c7ff",
          "sha256": "d329eb34b795142b6cd6f0c448967bb03d8c900bae1695e85aa763b4ee2f267e"
        },
        "downloads": -1,
        "filename": "thrunting_tools-8.5.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "a1ecd4f2508484487da89a81dd32c7ff",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.10,<4.0",
        "size": 17155,
        "upload_time": "2022-11-18T02:29:45",
        "upload_time_iso_8601": "2022-11-18T02:29:45.295191Z",
        "url": "https://files.pythonhosted.org/packages/25/9e/47a923870e09763aeb34838d44daafbafbba6c8afb61f6321d5eadc453c1/thrunting_tools-8.5.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1f6a97c719522e8ebade0b4a9e551b750591e5cae8ede2e8ab6a874da8e59920",
          "md5": "d0f5fee39b5684e72861c8d25bd19799",
          "sha256": "94d4cb23c40396e28711a799f029b17f32b963af50a5d60af674a11efaccc2b5"
        },
        "downloads": -1,
        "filename": "thrunting_tools-8.5.1.tar.gz",
        "has_sig": false,
        "md5_digest": "d0f5fee39b5684e72861c8d25bd19799",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.10,<4.0",
        "size": 13723,
        "upload_time": "2022-11-18T02:29:46",
        "upload_time_iso_8601": "2022-11-18T02:29:46.485424Z",
        "url": "https://files.pythonhosted.org/packages/1f/6a/97c719522e8ebade0b4a9e551b750591e5cae8ede2e8ab6a874da8e59920/thrunting_tools-8.5.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "8.5.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ea6d4a883f587f0fcb69d9872426a64b0b20d3686472b69deacf385e7a756bd0",
          "md5": "34b91e1fe71bd4e40c35694d9a8ef967",
          "sha256": "5ee4986e8cf55a8a871e9d22c182f21ca5feb7eaa4a398ea7b8b3b8abe117430"
        },
        "downloads": -1,
        "filename": "thrunting_tools-8.5.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "34b91e1fe71bd4e40c35694d9a8ef967",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.10,<4.0",
        "size": 25563,
        "upload_time": "2022-11-29T22:36:37",
        "upload_time_iso_8601": "2022-11-29T22:36:37.883614Z",
        "url": "https://files.pythonhosted.org/packages/ea/6d/4a883f587f0fcb69d9872426a64b0b20d3686472b69deacf385e7a756bd0/thrunting_tools-8.5.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a3bd540f89b1f6ab062e33a4f50b780d05864e2b81255b66b7d0dd2e4491b469",
          "md5": "16a18672ea30af1320d5ae9080d2c470",
          "sha256": "6c23bcff461a057ed1c93070a00073a9dce3c6f0e2f287ee79a4ee27b73f332e"
        },
        "downloads": -1,
        "filename": "thrunting_tools-8.5.2.tar.gz",
        "has_sig": false,
        "md5_digest": "16a18672ea30af1320d5ae9080d2c470",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.10,<4.0",
        "size": 17404,
        "upload_time": "2022-11-29T22:36:39",
        "upload_time_iso_8601": "2022-11-29T22:36:39.795509Z",
        "url": "https://files.pythonhosted.org/packages/a3/bd/540f89b1f6ab062e33a4f50b780d05864e2b81255b66b7d0dd2e4491b469/thrunting_tools-8.5.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "ea6d4a883f587f0fcb69d9872426a64b0b20d3686472b69deacf385e7a756bd0",
        "md5": "34b91e1fe71bd4e40c35694d9a8ef967",
        "sha256": "5ee4986e8cf55a8a871e9d22c182f21ca5feb7eaa4a398ea7b8b3b8abe117430"
      },
      "downloads": -1,
      "filename": "thrunting_tools-8.5.2-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "34b91e1fe71bd4e40c35694d9a8ef967",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.10,<4.0",
      "size": 25563,
      "upload_time": "2022-11-29T22:36:37",
      "upload_time_iso_8601": "2022-11-29T22:36:37.883614Z",
      "url": "https://files.pythonhosted.org/packages/ea/6d/4a883f587f0fcb69d9872426a64b0b20d3686472b69deacf385e7a756bd0/thrunting_tools-8.5.2-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "a3bd540f89b1f6ab062e33a4f50b780d05864e2b81255b66b7d0dd2e4491b469",
        "md5": "16a18672ea30af1320d5ae9080d2c470",
        "sha256": "6c23bcff461a057ed1c93070a00073a9dce3c6f0e2f287ee79a4ee27b73f332e"
      },
      "downloads": -1,
      "filename": "thrunting_tools-8.5.2.tar.gz",
      "has_sig": false,
      "md5_digest": "16a18672ea30af1320d5ae9080d2c470",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.10,<4.0",
      "size": 17404,
      "upload_time": "2022-11-29T22:36:39",
      "upload_time_iso_8601": "2022-11-29T22:36:39.795509Z",
      "url": "https://files.pythonhosted.org/packages/a3/bd/540f89b1f6ab062e33a4f50b780d05864e2b81255b66b7d0dd2e4491b469/thrunting_tools-8.5.2.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}