{
  "info": {
    "author": "",
    "author_email": "\"Joe P. Renaud\" <TidalPy@gmail.com>",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 3 - Alpha",
      "Intended Audience :: Developers",
      "Intended Audience :: Education",
      "Intended Audience :: Science/Research",
      "License :: OSI Approved :: GNU General Public License v3 (GPLv3)",
      "Natural Language :: English",
      "Operating System :: MacOS",
      "Operating System :: Microsoft :: Windows",
      "Operating System :: POSIX :: Linux",
      "Programming Language :: Python :: 3.10",
      "Programming Language :: Python :: 3.8",
      "Programming Language :: Python :: 3.9",
      "Programming Language :: Python :: Implementation :: CPython",
      "Topic :: Scientific/Engineering",
      "Topic :: Scientific/Engineering :: Astronomy",
      "Topic :: Scientific/Engineering :: Mathematics",
      "Topic :: Scientific/Engineering :: Physics"
    ],
    "description": "<h1 align=\"center\">TidalPy</h1>\n<h3 align=\"center\">v0.4.0 Beta</h3>\n\n<p align=\"center\">\n    <a href=\"https://github.com/jrenaud90/TidalPy/actions/workflows/pr_tests_win.yml\"><img src=\"https://github.com/jrenaud90/TidalPy/actions/workflows/pr_tests_win.yml/badge.svg?branch=main\" alt=\"Windows Tests\" /></a>\n    <a href=\"https://github.com/jrenaud90/TidalPy/actions/workflows/pr_tests_mac.yml\"><img src=\"https://github.com/jrenaud90/TidalPy/actions/workflows/pr_tests_mac.yml/badge.svg?branch=main\" alt=\"MacOS Tests\" /></a>\n    <a href=\"https://github.com/jrenaud90/TidalPy/actions/workflows/pr_tests_ubun.yml\"><img src=\"https://github.com/jrenaud90/TidalPy/actions/workflows/pr_tests_ubun.yml/badge.svg?branch=main\" alt=\"Ubuntu Tests\" /></a>\n    <a href=\"https://codecov.io/github/jrenaud90/TidalPy\" ><img src=\"https://codecov.io/github/jrenaud90/TidalPy/branch/main/graph/badge.svg?token=35OY4ZLOA5\"/></a><br />\n    <a href=\"https://mybinder.org/v2/gh/jrenaud90/TidalPy/master?filepath=%2FDemos%2F\"><img src=\"https://mybinder.org/badge_logo.svg\" alt=\"Binder\" /></a>\n    <a href=\"https://doi.org/10.5281/zenodo.7017475\"><img src=\"https://zenodo.org/badge/DOI/10.5281/zenodo.7017475.svg\" alt=\"DOI\"></a>\n</p>\n\n## Purpose\n\nTidalPy is an open-source software suite designed to assist researchers in the semi-analytic calculation of tidal\ndissipation and subsequent orbit-spin evolution for rocky and icy worlds.\n\n**TidalPy is intended to be a...**\n\n* Black Box (in the documentation this is referred to as the \"*OOP* scheme\" for Object-Oriented Programming)\n    * TidalPy serves as simple to install (cross-platform) and, hopefully, simple to use package that users can pick up\n      and hit the ground running.\n    * The OOP scheme performs many calculations with very little input from the user. The major drawbacks are\n      performance (in some situations) and that many assumptions are opaque to the user without some digging.\n* Tool Box (referred to as the \"*Functional* scheme\")\n    * TidalPy also contains many efficient functions to perform calculations relevant to tides and thermal-orbital\n      coupling. These can be quickly imported and used in a custom scripts.\n        * In general, the functional scheme will have much higher performance, flexibility, and extensibility than OOP.\n          It also generally makes assumptions more visible to the user. The downside is the user may need to be more\n          familiar with the underlying physics.\n\n*Once you are comfortable with TidalPy, it is usually a good idea to mix the two schemes: take some aspects of OOP that\nyou don't want to deal with and build on them with some of TidalPy's or your own functions.*\n\n### Limitations\n\nThe major limitations of the current version of TidalPy are...\n\n* A multilayer model has now been implemented, but it is not currently part of the OOP scheme.\n* Chemical and phase changes within a planet's layers have not been implemented.\n\n### Related Software\n\nBelow is a non-exhaustive list of publicly available software that performs similar or parallel calculations as TidalPy.\n\n* Are you interested in the habitability of a planet? With considerations of tides, atmospheres, water content, solar\n  interactions? Check out...\n    * [VPLanet](https://github.com/VirtualPlanetaryLaboratory/vplanet)\n* Are you interested in the orbital evolution of multiple planets with each planet influencing one another? Consider an\n  N-body approach like...\n    * [Posidonius (formerly Mercury-T)](https://github.com/marblestation/posidonius)\n    * [ReboundX](https://github.com/dtamayo/reboundx)\n* Don't care about tides or orbital dynamics but are instead interested in interior structure and composition of\n  planets?\n    * [BurnMan](https://github.com/geodynamics/burnman)\n    * [PerpleX](http://www.perplex.ethz.ch/)\n* Are you interested in tides, interiors, *and* the chemical evolution of small worlds but don't care about\n  non-synchronous rotation or compressibility of planets?\n    * [IcyDwarf](https://github.com/MarcNeveu/IcyDwarf)\n\nHowever, if you want high fidelity tidal, orbital, spin, and interior models --- then you have come to the right place!\nRead below for instructions on how to install and use TidalPy.\n\n## How to Install\n\n### Compatibility\n\n*As of TidalPy v0.4.0*:\n\n* **Windows-Latest**: *Installation & tests passed.*\n* **MacOS-Latest**: *Installation & tests passed.*\n* **Ubuntu-Latest**: *Installation & tests passed.*\n\n### Simple Installation\n\nAs simple as ensuring 64-bit [Python 3.8+](https://www.python.org/) is installed on your system and performing the\nfollowing in a terminal:\n\n`pip install TidalPy`\n\nHowever, there can be several gotchas that come with this simple installation process. It is recommended to use the\nadvanced installation described in the next section.\n\n_Note: As of TidalPy v0.3.4, if you do not install via anaconda then you will need to manually install \n[proj v8.0.0+](https://proj.org/install.html) and [geos 3.7.2+](https://anaconda.org/conda-forge/geos) \n(before installing TidalPy. Otherwise, the project map graphic utility may not work. \n[Read more here](https://scitools.org.uk/cartopy/docs/latest/installing.html)_ \n\n### Accessing Jupyter Notebooks\nThere are several jupyter notebooks with TidalPy demos found in the /Demos/ and /Derivative/ directories.\nIn order to access these you will need to make sure you install Jupyter and a few related packages:\n\n`pip install ipympl ipython ipywidgets jupyter`\n\nor \n\n`conda install ipympl ipython ipywidgets jupyter`\n\nThen you can navigate to these directories in a terminal and access the notebooks by using the command,\n`jupyter notebook`.\n\n### Advanced Installation\n\nIt is highly recommended that you use the [Anaconda](https://www.anaconda.com/distribution/) distribution of Python.\nThis has pre-compiled binaries for several packages that TidalPy uses and will generally negate a lot of potential\nheadaches. It is also recommended that you use a virtual environment. Using Anaconda, a new virtual environment can be\nmade with `conda create -n <name> python=3.9` and switched to with `conda activate <name>`.\n\n* Get the latest version of TidalPy from Github.\n    * Ensure you have the latest version of [git](https://git-scm.com/downloads)\n      or [github](https://desktop.github.com/). Clone the TidalPy git\n      using `git clone https://github.com/jrenaud90/TidalPy.git`.\n        * Whenever you want to update TidalPy simply navigate to this directory and use `git pull`. Since TidalPy is in\n          early development, it is recommended you check for updates regularly. Updates will **not**\n          download automatically.\n\n* Using a terminal, navigate to the TidalPy directory that contains `setup.py` and then:\n    * For Anaconda Python:\n        * Run `conda install --file conda_requirements.txt -c defaults -c conda-forge; pip install -e .` *(That trailing\n          period is important, don't leave it out!)*\n    * For non-Anaconda Python:\n        * Run `pip install -e .` *(That trailing period is important, don't leave it out!)*\n\n* Test your installation:\n    * Navigate to the TidalPy directory that contains `setup.py` in a terminal.\n    * Ensure you have `pytest` package installed (`conda install pytest` or `pip install pytest`).\n    * Run pytest by simply using the command `pytest` from your terminal:\n        * Running all the tests can take a while (currently around 10 minutes), if all you are interested in is checking that\n          TidalPy installed correctly then you can let pytest check the first dozen tests if they are passing then you\n          can quit the test suite early.\n        * If no errors show up (warnings are okay and expected) then you should hopefully be good to go.\n    * Open a new terminal *not in the TidalPy directory* (e.g., your desktop).\n        * Run `python` and then try to `import TidalPy`; if that works try the command `TidalPy.version` if you do not\n          get any import errors, and the version number is as you expect, then TidalPy was successfully installed.\n\n### Additional Dependencies\n\nTidalPy will only install 3rd-party packages that are absolutely needed to run the majority of \nits functionality. However, there are some functions throughout TidalPy that take advantage of\nadditional packages. You can install these additional packages by calling (note you need to install\ncartopy and julia's dependencies first --- see the next few sections),\n\n`pip install -r additional_dependencies.txt`\n\nThis command should be run from an elevated terminal to avoid permission issues.\n\n#### Cartopy\n\nTidalPy utilizes the [cartopy](https://scitools.org.uk/cartopy/docs/latest/index.html) package for some of \n3d projection map plotting. In turn, cartopy relies on [GEOS](https://trac.osgeo.org/geos/) which is not a python\npackage and must be installed outside of pip.\n\nThe easiest way to install cartopy is using an Anaconda environment by,\n\n`conda install -c conda-forge cartopy`\n\nIf you are not using a conda environment then you will need to find and install the GEOS binaries manually:\n\n**Windows:** [Follow instructions here](https://trac.osgeo.org/osgeo4w/)\n**On Ubuntu:** `sudo apt-get install libgeos-dev`\n**On MacOS:** `brew install geos`\n\nAfter GEOS is installed you can pip install the rest,\n\n`pip install pyproj shapely pyshp cartopy`\n\n#### Diffeqpy / Julia\n\nTidalPy provides the option to use the [Julia](https://julialang.org/) programing language's differential equation \nsolver for python: [diffeqpy](https://github.com/SciML/diffeqpy). To utilize this package you first need to ensure\nthat Julia is installed on your machine and available via the system's environment path.\n\n* Install the Julia language from [https://julialang.org/downloads/](https://julialang.org/downloads/)\n* Add Julia's directory and its `bin` subdirectory to your system's path.\n* Open an elevated (\"as administrator\") terminal, command prompt, or powershell.\n    * If you are using a virtual Python environment make sure it is active.\n* Install `julia` and `diffeqpy` for python using pip\n    * Run `pip install julia diffeqpy`\n* Open Python on your elevated terminal (the following steps may take a while to compile). \n  * Run `import julia; julia.install(); import diffeqpy; diffeqpy.install()`\n\n### Installation Troubleshooting\n\n* The `setuptools` package is required before TidalPy can be installed. Usually it is automatically installed, but if\n  you are starting with a clean virtual environment it may not have been.\n    * For Anaconda: `conda install setuptools`\n    * Or for regular Python: `pip install setuptools`\n* The current version of TidalPy is in Alpha and will receive many updates on a relatively fast schedule. So, it is\n  recommended that you run it from an IDE and/or install it as\n  an [editable package](https://pip.pypa.io/en/stable/reference/pip_install/#editable-installs). If you do not wish to\n  install as an editable package then please remove all `-e` flags.\n\n## How to Use\n\nCheck out the `Documentation\\Getting Started.md` file. This is pretty bare bones at the moment but offers some basic\ninfo about TidalPy. For now the best way to learn how to use TidalPy is by checking out the `Demos` directory. There\nare \"beginner\" [Jupyter notebooks](https://jupyter.org/) that are a great starting point.\n\n## Using TidalPy for Science\n\nTidalPy has been used in several studies already, and we encourage you to use it in yours. We would appreciate you\ninclude a link back to this [page](https://github.com/jrenaud90/TidalPy) and cite one of the papers below (if you\nutilized a specific package). We also would love to see where TidalPy is being used! Please feel free to send us an\nemail: [TidalPy@gmail.com](mailto:TidalPy@gmail.com) when a paper or presentation utilized TidalPy. Anyone is welcome to\nmake forks or copies of TidalPy as long as their work references back to this page. License information can be found at\nthe end of this file.\n\n### Referencing TidalPy\n\nThe science used in TidalPy is described in the following papers (and references therein):\n\n* Rheological Modeling Package:\n    * [Tidally Heated Terrestrial Exoplanets: Viscoelastic Response Models](https://ui.adsabs.harvard.edu/abs/2009ApJ...707.1000H/abstract)\n    * [Increased Tidal Dissipation Using Advanced Rheological Models](https://ui.adsabs.harvard.edu/abs/2018ApJ...857...98R/abstract)\n* Non-synchronous Rotation Evolution and High Eccentricity Truncation Packages:\n    * [Tidal Dissipation in Dual-Body, Highly Eccentric, and Non-synchronously Rotating System](https://ui.adsabs.harvard.edu/abs/2021PSJ.....2....4R/abstract)\n    * [Tidal Evolution of the Keplerian Elements](https://ui.adsabs.harvard.edu/abs/2019CeMDA.131...30B/abstract)\n* Third Party Software:\n    * *Interior Model*: [BurnMan](https://github.com/geodynamics/burnman)\n    * *Integration Routines*: [diffeqpy](https://github.com/SciML/diffeqpy), [Julia DiffEq](https://diffeq.sciml.ai/v2.0/)\n    * *CVD Conscious Color Maps*: [Geodynamic Color Maps](http://doi.org/10.5281/zenodo.5501399)\n    * *Projection Maps*: [Cartopy](https://scitools.org.uk/cartopy/docs/latest/)\n\n## Contribute\n\nTidalPy is in early alpha and there are lots of areas where it can improve! If you are interested in helping out, please\ncheck out the information in `Documentation\\Contribute.md`.\n\n**Found a bug or have an idea for a new feature?**\n\n* Go to TidalPy's [Github page](https://github.com/jrenaud90/TidalPy) and click the \"Issues\" tab then make a new report.\n    * If you ran into a bug please include a code snippet (in markdown: code is designated by Grave accents surrounding\n      the text) that reproduces the error (please keep this snippet as concise as possible).\n    * It is helpful to triage issues when they are made. If you think you know the severity of a bug or can provide any\n      other *at-a-glance* context, consider adding a \"label\" (right-hand side of the github issue form) to the issue.\n\n## License Information\nYou are welcome to copy/fork TidalPy and make modifications assuming the following conditions are met:\n* Links are included that point back to this [page](https://github.com/jrenaud90/TidalPy).\n* Any software derived from TidalPy must remain open-source and non-commercial.\n\nThis work is licensed under the Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License. To view\na copy of this license,\nvisit [http://creativecommons.org/licenses/by-nc-sa/4.0/](http://creativecommons.org/licenses/by-nc-sa/4.0/) or send a\nletter to Creative Commons, PO Box 1866, Mountain View, CA 94042, USA.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "Scientific Computing,Scientific Modeling,Astrophysics,Astronomy,Planets,Moons,Exoplanets,Planetary Science,Planetary Interiors,Orbital Dynamics,Tides,Tidal Dynamics,Tidal Heating,Numerical Integration",
    "license": "# License  ## Creative Commons Attribution-ShareAlike 4.0 International Creative Commons Corporation (“Creative Commons”) is not a law firm and does not provide legal services or legal advice. Distribution of Creative Commons public licenses does not create a lawyer-client or other relationship. Creative Commons makes its licenses and related information available on an “as-is” basis. Creative Commons gives no warranties regarding its licenses, any material licensed under their terms and conditions, or any related information. Creative Commons disclaims all liability for damages resulting from their use to the fullest extent possible.  **Using Creative Commons Public Licenses**  Creative Commons public licenses provide a standard set of terms and conditions that creators and other rights holders may use to share original works of authorship and other material subject to copyright and certain other rights specified in the public license below. The following considerations are for informational purposes only, are not exhaustive, and do not form part of our licenses.  * __Considerations for licensors:__ Our public licenses are intended for use by those authorized to give the public permission to use material in ways otherwise restricted by copyright and certain other rights. Our licenses are irrevocable. Licensors should read and understand the terms and conditions of the license they choose before applying it. Licensors should also secure all rights necessary before applying our licenses so that the public can reuse the material as expected. Licensors should clearly mark any material not subject to the license. This includes other CC-licensed material, or material used under an exception or limitation to copyright. [More considerations for licensors](http://wiki.creativecommons.org/Considerations_for_licensors_and_licensees#Considerations_for_licensors).  * __Considerations for the public:__ By using one of our public licenses, a licensor grants the public permission to use the licensed material under specified terms and conditions. If the licensor’s permission is not necessary for any reason–for example, because of any applicable exception or limitation to copyright–then that use is not regulated by the license. Our licenses grant only permissions under copyright and certain other rights that a licensor has authority to grant. Use of the licensed material may still be restricted for other reasons, including because others have copyright or other rights in the material. A licensor may make special requests, such as asking that all changes be marked or described. Although not required by our licenses, you are encouraged to respect those requests where reasonable. [More considerations for the public](http://wiki.creativecommons.org/Considerations_for_licensors_and_licensees#Considerations_for_licensees).  By exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-ShareAlike 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.  ### Section 1 – Definitions.  a. __Adapted Material__ means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.  b. __Adapter's License__ means the license You apply to Your Copyright and Similar Rights in Your contributions to Adapted Material in accordance with the terms and conditions of this Public License.  c. __BY-SA Compatible License__ means a license listed at [creativecommons.org/compatiblelicenses](http://creativecommons.org/compatiblelicenses), approved by Creative Commons as essentially the equivalent of this Public License.  d. __Copyright and Similar Rights__ means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.  e. __Effective Technological Measures__ means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.  f. __Exceptions and Limitations__ means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.  g. __License Elements__ means the license attributes listed in the name of a Creative Commons Public License. The License Elements of this Public License are Attribution and ShareAlike.  h. __Licensed Material__ means the artistic or literary work, database, or other material to which the Licensor applied this Public License.  i. __Licensed Rights__ means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.  j. __Licensor__ means the individual(s) or entity(ies) granting rights under this Public License.  k. __Share__ means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.  l. __Sui Generis Database Rights__ means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.  m. __You__ means the individual or entity exercising the Licensed Rights under this Public License. __Your__ has a corresponding meaning.  ### Section 2 – Scope.  a. ___License grant.___  1. Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:  A. reproduce and Share the Licensed Material, in whole or in part; and  B. produce, reproduce, and Share Adapted Material.  2. __Exceptions and Limitations.__ For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.  3. __Term.__ The term of this Public License is specified in Section 6(a).  4. __Media and formats; technical modifications allowed.__ The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.  5. __Downstream recipients.__  A. __Offer from the Licensor – Licensed Material.__ Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.  B. __Additional offer from the Licensor – Adapted Material.__ Every recipient of Adapted Material from You automatically receives an offer from the Licensor to exercise the Licensed Rights in the Adapted Material under the conditions of the Adapter’s License You apply.  C. __No downstream restrictions.__ You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.  6. __No endorsement.__ Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).  b. ___Other rights.___  1. Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.  2. Patent and trademark rights are not licensed under this Public License.  3. To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties.  ### Section 3 – License Conditions.  Your exercise of the Licensed Rights is expressly made subject to the following conditions.  a. ___Attribution.___  1. If You Share the Licensed Material (including in modified form), You must:  A. retain the following if it is supplied by the Licensor with the Licensed Material:  i. identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);  ii. a copyright notice;  iii. a notice that refers to this Public License;  iv. a notice that refers to the disclaimer of warranties;  v. a URI or hyperlink to the Licensed Material to the extent reasonably practicable;  B. indicate if You modified the Licensed Material and retain an indication of any previous modifications; and  C. indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.  2. You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.  3. If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.  b. ___ShareAlike.___  In addition to the conditions in Section 3(a), if You Share Adapted Material You produce, the following conditions also apply.  1. The Adapter’s License You apply must be a Creative Commons license with the same License Elements, this version or later, or a BY-SA Compatible License.  2. You must include the text of, or the URI or hyperlink to, the Adapter's License You apply. You may satisfy this condition in any reasonable manner based on the medium, means, and context in which You Share Adapted Material.  3. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, Adapted Material that restrict exercise of the rights granted under the Adapter's License You apply.  ### Section 4 – Sui Generis Database Rights.  Where the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:  a. for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database;  b. if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material, including for purposes of Section 3(b); and  c. You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.  For the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.  ### Section 5 – Disclaimer of Warranties and Limitation of Liability.  a. __Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.__  b. __To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.__  c. The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.  ### Section 6 – Term and Termination.  a. This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.  b. Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:  1. automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or  2. upon express reinstatement by the Licensor.  For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.  c. For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.  d. Sections 1, 5, 6, 7, and 8 survive termination of this Public License.  ### Section 7 – Other Terms and Conditions.  a. The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.  b. Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.  ### Section 8 – Interpretation.  a. For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.  b. To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.  c. No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.  d. Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.  > Creative Commons is not a party to its public licenses. Notwithstanding, Creative Commons may elect to apply one of its public licenses to material it publishes and in those instances will be considered the “Licensor.” The text of the Creative Commons public licenses is dedicated to the public domain under the [CC0 Public Domain Dedication](https://creativecommons.org/publicdomain/zero/1.0/legalcode). Except for the limited purpose of indicating that material is shared under a Creative Commons public license or as otherwise permitted by the Creative Commons policies published at [creativecommons.org/policies](http://creativecommons.org/policies), Creative Commons does not authorize the use of the trademark “Creative Commons” or any other trademark or logo of Creative Commons without its prior written consent including, without limitation, in connection with any unauthorized modifications to any of its public licenses or any other arrangements, understandings, or agreements concerning use of licensed material. For the avoidance of doubt, this paragraph does not form part of the public licenses. > > Creative Commons may be contacted at creativecommons.org. ",
    "maintainer": "",
    "maintainer_email": "",
    "name": "TidalPy",
    "package_url": "https://pypi.org/project/TidalPy/",
    "platform": null,
    "project_url": "https://pypi.org/project/TidalPy/",
    "project_urls": {
      "Bug Tracker": "https://github.com/jrenaud90/TidalPy/issues",
      "Homepage": "https://github.com/jrenaud90/TidalPy"
    },
    "release_url": "https://pypi.org/project/TidalPy/0.4.1/",
    "requires_dist": null,
    "requires_python": "<3.11,>=3.8",
    "summary": "Planetary Tidal Evolution Software made with Python.",
    "version": "0.4.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16994018,
  "releases": {
    "0.3.0.dev8": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4bf7f42061706b0bd29c3f4a93f71039cfa1f1c5ab18419f0c58dfd0756d7a3b",
          "md5": "8e17eb5c2410ac4d6843cfb5c865c59c",
          "sha256": "c287eb329673b36be6fbc8e84c6496f74df35d822c5115da086c2e41975729eb"
        },
        "downloads": -1,
        "filename": "TidalPy-0.3.0.dev8-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "8e17eb5c2410ac4d6843cfb5c865c59c",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 376910,
        "upload_time": "2021-06-08T01:52:57",
        "upload_time_iso_8601": "2021-06-08T01:52:57.831447Z",
        "url": "https://files.pythonhosted.org/packages/4b/f7/f42061706b0bd29c3f4a93f71039cfa1f1c5ab18419f0c58dfd0756d7a3b/TidalPy-0.3.0.dev8-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "3f31e317c11dbaa593ea34fdf99f8ab84160d4edbe7e2cab6951f4124bdb4170",
          "md5": "0d363e90366756a92aef72dd4ec617f3",
          "sha256": "b663de296b80ce20d1ffb352df96dc47c11ee63f383cf98f45b1796299117aa9"
        },
        "downloads": -1,
        "filename": "TidalPy-0.3.0.dev8.tar.gz",
        "has_sig": false,
        "md5_digest": "0d363e90366756a92aef72dd4ec617f3",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 288473,
        "upload_time": "2021-06-08T01:53:00",
        "upload_time_iso_8601": "2021-06-08T01:53:00.245824Z",
        "url": "https://files.pythonhosted.org/packages/3f/31/e317c11dbaa593ea34fdf99f8ab84160d4edbe7e2cab6951f4124bdb4170/TidalPy-0.3.0.dev8.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3.0b0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f10c152ac451841f0871bb8c8e2c5bec57c3d8848a53abe1897fd72b95c00a39",
          "md5": "03d581a6385f1083c2e10e05b576ed6e",
          "sha256": "2050bec3ba291a76bd6d3d5353e48efc5259b5a11ceb8966bbecaa18d871233c"
        },
        "downloads": -1,
        "filename": "TidalPy-0.3.0b0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "03d581a6385f1083c2e10e05b576ed6e",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7",
        "size": 373975,
        "upload_time": "2021-06-09T20:40:35",
        "upload_time_iso_8601": "2021-06-09T20:40:35.521469Z",
        "url": "https://files.pythonhosted.org/packages/f1/0c/152ac451841f0871bb8c8e2c5bec57c3d8848a53abe1897fd72b95c00a39/TidalPy-0.3.0b0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "689ded866d6559e86ca9b9c325d96698895f78283ac58bfe1cf5993d02029341",
          "md5": "c76cd64054220be8788ddc165f9fb828",
          "sha256": "00b07c3949b4f2b397a4269cb93cd9bdca7d0cda01383775d7dc12085148787b"
        },
        "downloads": -1,
        "filename": "TidalPy-0.3.0b0.tar.gz",
        "has_sig": false,
        "md5_digest": "c76cd64054220be8788ddc165f9fb828",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7",
        "size": 286039,
        "upload_time": "2021-06-09T20:40:37",
        "upload_time_iso_8601": "2021-06-09T20:40:37.049175Z",
        "url": "https://files.pythonhosted.org/packages/68/9d/ed866d6559e86ca9b9c325d96698895f78283ac58bfe1cf5993d02029341/TidalPy-0.3.0b0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3.4a0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "bffd702a2f3ba87530d7d3375254df39e4cca58f1689657bf392f7d342b499f7",
          "md5": "1f45df56e01893b51ea6c04f4fce2920",
          "sha256": "ce9e8ab7050851b4c5f49c9ea1d5ad9e63d03cd8cf629890cfc1fd8184c566ec"
        },
        "downloads": -1,
        "filename": "TidalPy-0.3.4a0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "1f45df56e01893b51ea6c04f4fce2920",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 414730,
        "upload_time": "2022-04-06T21:54:30",
        "upload_time_iso_8601": "2022-04-06T21:54:30.696887Z",
        "url": "https://files.pythonhosted.org/packages/bf/fd/702a2f3ba87530d7d3375254df39e4cca58f1689657bf392f7d342b499f7/TidalPy-0.3.4a0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e9a6b0499c96d012adb6d88c1a79a09b49eb4e384fb9c74d4c8c938bdcf9ebe5",
          "md5": "341fd989115dd853e5efa9d757712627",
          "sha256": "63ce75ee9aee937438eaca61f5c3daa99f3b53ae4872cd8430f16f9f36d96ece"
        },
        "downloads": -1,
        "filename": "TidalPy-0.3.4a0.tar.gz",
        "has_sig": false,
        "md5_digest": "341fd989115dd853e5efa9d757712627",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 310901,
        "upload_time": "2022-04-06T21:54:33",
        "upload_time_iso_8601": "2022-04-06T21:54:33.099914Z",
        "url": "https://files.pythonhosted.org/packages/e9/a6/b0499c96d012adb6d88c1a79a09b49eb4e384fb9c74d4c8c938bdcf9ebe5/TidalPy-0.3.4a0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3.4a1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "50f63f169fb8dc78b4362bc739a82330a8f1996e1a10cc6c3ecd1ea66e405362",
          "md5": "ce1a05be397cf5622ef9f1e07823222e",
          "sha256": "42a536a50845edc3503b5d33082d070cec3919ca6fb513ec843e123dba5485e7"
        },
        "downloads": -1,
        "filename": "TidalPy-0.3.4a1.tar.gz",
        "has_sig": false,
        "md5_digest": "ce1a05be397cf5622ef9f1e07823222e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 314581,
        "upload_time": "2022-04-06T21:41:58",
        "upload_time_iso_8601": "2022-04-06T21:41:58.871412Z",
        "url": "https://files.pythonhosted.org/packages/50/f6/3f169fb8dc78b4362bc739a82330a8f1996e1a10cc6c3ecd1ea66e405362/TidalPy-0.3.4a1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3.5b0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e4f566b711c242b6481eee6e30fd110ece570ffe6d2ec70e83ac552656a62391",
          "md5": "fc4d803aa8dd9b9a3eb8e63b0a9c9691",
          "sha256": "7c8271b9cfd64c0e7e3c0034b807c696518be5a1a8777c614e28bbf5b3b280ab"
        },
        "downloads": -1,
        "filename": "TidalPy-0.3.5b0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "fc4d803aa8dd9b9a3eb8e63b0a9c9691",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 415728,
        "upload_time": "2022-04-07T15:47:52",
        "upload_time_iso_8601": "2022-04-07T15:47:52.041059Z",
        "url": "https://files.pythonhosted.org/packages/e4/f5/66b711c242b6481eee6e30fd110ece570ffe6d2ec70e83ac552656a62391/TidalPy-0.3.5b0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "972538aea0df229fa281ba417ba1162fb222181e384816db33d98f357209e2ac",
          "md5": "267dd90bf7597a1f019b4242c8c7f71b",
          "sha256": "aed63867dbd864c80c4b8c64d97ca40cc294154981bfc08a5980bc6e39370f74"
        },
        "downloads": -1,
        "filename": "TidalPy-0.3.5b0.tar.gz",
        "has_sig": false,
        "md5_digest": "267dd90bf7597a1f019b4242c8c7f71b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 312157,
        "upload_time": "2022-04-07T15:47:53",
        "upload_time_iso_8601": "2022-04-07T15:47:53.883382Z",
        "url": "https://files.pythonhosted.org/packages/97/25/38aea0df229fa281ba417ba1162fb222181e384816db33d98f357209e2ac/TidalPy-0.3.5b0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.4.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "37c418b43075bffd635799f25b5cf65e40f10bda267553ccaecd909641ef0c64",
          "md5": "1c57be221cea51d80bbe6daa2d54c140",
          "sha256": "2830b41a19d4cd7a2bfb2ba9edaf54562d887b3dda828ac9a2042b2c4b1b33be"
        },
        "downloads": -1,
        "filename": "TidalPy-0.4.1.tar.gz",
        "has_sig": false,
        "md5_digest": "1c57be221cea51d80bbe6daa2d54c140",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": "<3.11,>=3.8",
        "size": 384318,
        "upload_time": "2023-02-23T14:19:10",
        "upload_time_iso_8601": "2023-02-23T14:19:10.583797Z",
        "url": "https://files.pythonhosted.org/packages/37/c4/18b43075bffd635799f25b5cf65e40f10bda267553ccaecd909641ef0c64/TidalPy-0.4.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "37c418b43075bffd635799f25b5cf65e40f10bda267553ccaecd909641ef0c64",
        "md5": "1c57be221cea51d80bbe6daa2d54c140",
        "sha256": "2830b41a19d4cd7a2bfb2ba9edaf54562d887b3dda828ac9a2042b2c4b1b33be"
      },
      "downloads": -1,
      "filename": "TidalPy-0.4.1.tar.gz",
      "has_sig": false,
      "md5_digest": "1c57be221cea51d80bbe6daa2d54c140",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": "<3.11,>=3.8",
      "size": 384318,
      "upload_time": "2023-02-23T14:19:10",
      "upload_time_iso_8601": "2023-02-23T14:19:10.583797Z",
      "url": "https://files.pythonhosted.org/packages/37/c4/18b43075bffd635799f25b5cf65e40f10bda267553ccaecd909641ef0c64/TidalPy-0.4.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}