{
  "info": {
    "author": "Logan Whitehouse",
    "author_email": "lswhiteh@unc.edu",
    "bugtrack_url": null,
    "classifiers": [
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# TimeSweeper\n\nTimesweeper is a package for detecting positive selective sweeps from time-series genomic sampling using convolutional neural networks.\n\nThe associated manuscript can be found here: https://www.biorxiv.org/content/10.1101/2022.07.06.499052v1\nExperiments and figures for the Timesweeper manuscript can be found here: https://github.com/SchriderLab/timesweeper-experiments\n\n## Table of Contents\n- [TimeSweeper](#timesweeper)\n  - [Table of Contents](#table-of-contents)\n  - [Overview](#overview)\n  - [Workflow Overview](#workflow-overview)\n  - [Installation and Requirements](#installation-and-requirements)\n  - [Timesweeper Configuration](#timesweeper-configuration)\n    - [Configs required for both types of simulation:](#configs-required-for-both-types-of-simulation)\n    - [Additional configs needed for stdpopsim simulation:](#additional-configs-needed-for-stdpopsim-simulation)\n  - [Timesweeper Modules Details](#timesweeper-modules-details)\n    - [Overview](#overview-1)\n    - [Custom Simulation (`simulate_custom`)](#custom-simulation-simulate_custom)\n    - [stpopsim Simulation (`simulate_stdpopsim`)](#stpopsim-simulation-simulate_stdpopsim)\n    - [Process VCF Files (`process`)](#process-vcf-files-process)\n    - [Make Training Data (`condense`)](#make-training-data-condense)\n    - [Neural Networks (`train`)](#neural-networks-train)\n    - [Detect Sweeps (`detect`)](#detect-sweeps-detect)\n  - [Preparing Input Data for Timesweeper to Predict On](#preparing-input-data-for-timesweeper-to-predict-on)\n  - [Example Usage](#example-usage)\n  - [Using Non-Timesweeper Simulations](#using-non-timesweeper-simulations)\n\n## Overview\n\nTimesweeper is built as a series of modules that are chained together to build a workflow for detecting signatures of selective sweeps using simulated demographic models to train a 1D convolutional neural network (1DCNN). Some modules can be swapped out or modified for different use cases (such as simulating from a custom SLiM script), but the general workflow order is assumed to be consistent. \n\n## Workflow Overview\n\n1. Create a SLiM script\n   1. Either based on the `example_demo_model.slim` example \n   2. Or by using stdpopsim to generate a SLiM script\n2. Simulate demographic model with time-series sampling\n   1. `sim_custom` if using custom SLiM script\n   2. `sim_stdpopsim` if using a SLiM script output by stdpopsim\n   - Note: If available, we suggest using a job submission platform such as SLURM to parallelize simulations. This is the most resource and time-intensive part of the module by far.\n   - Optional: Preprocess VCFs simulated without timesweepers simulation modules by merging with `process_vcfs`\n4. Create features for the neural network with `condense`\n5. Train networks with `train`\n6. Run `detect` on VCF of interest using trained models and input data\n\n---\n\n## Installation and Requirements\n\nThe only required utility not packaged with the PyPi installation of Timesweeper is SLiM, which can be easily installed with conda through the conda-forge channel (see below) or as a binary (https://messerlab.org/slim/).\n\nOtherwise see either [setup.cfg](setup.cfg) or [requirements.txt](requirements.txt) for general and specific requirements respectively.\n\nTimesweeper and all requirements can be installed from pip, I recommend doing so inside a virtual environment along with SLiM for easy access when simulating:\n```{bash}\nconda create -n blinx -c conda-forge python slim\nconda activate blinx\npip install timesweeper\n```\n\n---\n\n## Timesweeper Configuration\n\nFor any given experiment run you will need a YAML configuration file (see `example_timesweeper_config.yaml` for template). The requirements for configuration are different between using stdpopsim and custom SLiM script simulations.\n\n### Configs required for both types of simulation:\n\nExample config file for a custom simulation run:\n\n```\nwork dir: win_size_sims/\nslimfile: /slimfiles/onePop-selectiveSweep-vcf-noselcoeff.slim\nslim path: slim\nmut types: [2]\nscenarios: [\"neut\", \"sdn\", \"ssv\"]\nwin_size: 51\nnum_sample_points : 20\ninds_per_tp : 10  # Diploid inds\nsample sizes: [10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]\nploidy: 2\nphysLen : 5000000\nreps: 30000\n```\n\nExample config file for a stdpopsim simulation run:\n\n```\nwork dir: OoA\nslimfile: OoA3pop.slim\npop: p2\nsample sizes: [10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]\nyears sampled: [4750, 4500, 4250, 4000, 3750, 3500, 3250, 3000, 2750, 2500, 2250, 2000, 1750, 1500, 1250, 1000, 750, 500, 250, 0]\nploidy: 2\nscenarios: [\"neut\", \"sdn\", \"ssv\"]\nmut types: [2]\nwin_size: 51\ninds_per_tp: 10\nnum_sample_points : 20\nreps: 10000\nselection gen: 50 # Gens before first sampling\nselection coeff bounds: [0.00025, 0.25]\nmut rate: 1.29e-8\nslim path: slim\ngen time: 25\n```\n\n- **Working Directory** (`work dir`) - this serves as the \"home base\" of an experiment. This is where all intermediate and final data will be written to.\n- **SLiM Script** (`slimfile`) - either generated by stdpopsim (see \"Using stdpopsim to generate a SLiM template\" below) or from a custom SLiM script (see \"Using a custom SLiM script\").\n- - **Path to SLiM Executable** (`slim path`) - if you use the Makefile will be `/<path>/<to>/<timesweeper>/SLiM/build/slim`\n- **Mutation types** (`mut types`) - target mutation types output by SLiM in outputVCFSample. Typically MT=1 is for neutral mutations and MT=2 is for selected alleles.\n- **Scenarios** (`scenarios`) - Names of the types of simulation scenarios input into Timesweeper. The standard (and maybe only?) option for current implementation is `[\"neut\", \"ssv\", \"sdn\"]`.\n- **Window size** (`win_size`) - Number of SNPs to use to create feature vectors.\n- **Number of Sample Points** (`num_sample_points`) - Number of timepoints sampled, identical to `len(sample_sizes)`.\n- **Individuals per timepoint** (`inds_per_tp`) - Another lazy variable to do some quick calculations, variable sampling sizes is supported but this is used for some quick calculations. Will probably be removed at some point when it causes errors.\n- **Sample sizes of each timepoint** (`sample sizes`) - sampled in your data (i.e. how many individuals are included in timepoint 1, timepoint 2, etc)\n- **Ploidy** (`ploidy`) - ploidy of your samples.\n- **Physical size** (`physLen`) - Size of the chromosome to simulate. Will be overwritten by stdpopsim if used.\n- **Simulation Replicates** (`reps`) - for each scenario: neutral, selection on de novo mutation, selection on standing variation. Will be overwritten with `--rep-range` argument if doing parallelized sims.\n\n\n### Additional configs needed for stdpopsim simulation: \n- **Target Population ID** (`pop`) - will be something like \"p1\" or \"p2\", will be identified in the stdpopsim model catalog.\n- **Years Sampled** (`years sampled`) - typically in years Before Present (BP - which is years prior to 1950 apparently). This is only needed if you are injecting sampling into a stdpopsim model or if you'd like to calculate FIT values along with the AFT predictions with Timesweeper. If you don't have any idea what these values should be you can still run Timesweeper and get AFT predictions no problem, just use a custom SLiM script and remove this line from the config file.\n- **Selection Generation Before Sampling** (`selection gen`) - Number of generations before the __first__ sample timepoint. We've found that you can be relatively flexible (see the manuscript), but 50 is a good default value.\n- **Selection Coefficient Bounds** (`selection coeff bounds`) - to improve robustness we use a uniform distribution to draw selection coefficients with lower and upper bounds specified here. If you want a non-stochastic selection coefficient simply use the same number twice.\n- **Mutation Rate** (`mut rate`) - just overwrites the stdpopsim mutation rate in case you'd like to fiddle with it. \n- **Generation Time** (`gen time`) - allows conversions between generations and continuous time. \n- **Selection Generation** (`selection gen`) - Number of generations to start sampling (with a random offset each replicate) before selection.\n\n\n---\n\n## Timesweeper Modules Details\n\n### Overview\n```\n$ timesweeper\nusage: timesweeper [-h] {sim_stdpopsim,sim_custom,process,condense,train,detect,plot_training,plot_freqs,summarize,merge_logs} ...\n\nTimesweeper CLI\n\npositional arguments:\n  {sim_stdpopsim,sim_custom,process,condense,train,detect,plot_training,plot_freqs,summarize,merge_logs}\n                        Timesweeper modes\n    sim_stdpopsim       Injects time-series sampling into stdpopsim SLiM output script.\n    sim_custom          Simulates selection for training Timesweeper using a pre-made SLiM script.\n    process             Module for splitting multivcfs (vertically concatenated vcfs) into merged (horizontally concatenated vcfs) if simulating\n                        without the sim module.\n    condense            Creates training data from simulated merged vcfs after process_vcfs.py has been run.\n    train               Handler script for neural network training and prediction for TimeSweeper Package. Will train two models: one for the series\n                        of timepoints generated using the hfs vectors over a timepoint and one\n    detect              Module for iterating across windows in a time-series vcf file and predicting whether a sweep is present at each snp-\n                        centralized window.\n    plot_training       Plots central SNPs from simulations to visually inspect mean trends over replicates.\n    plot_freqs          Create a bedfile of major and minor allele frequency changes over time.\n    summarize           Creates a CSV of data parsed from slim log files.\n    merge_logs          Merges the summary TSV from SLiM logs with test data predictions.\n\noptions:\n  -h, --help            show this help message and exit\n```\n\n### Custom Simulation (`simulate_custom`) \n\nA flexible wrapper for a SLiM script that assumes you have a demographic model already defined in SLiM and would like to use it for Timesweeper. This module is meant to be modified with utility functions and other constants to feed into simulation replicates using the string variable `d_block`. This set of constants will be fed to SLiM at runtime but can be modified in the module as needed prior. The module on GitHub is the version used to generate simulations for the manuscript, and is meant to provide ideas/context for how it's possible to modify the `d_block` and write utility functions for it.\n\n  There are some basic requirements for using a custom SLiM script:\n  1. Each timepoint must be output using a the outputVCFSample function like so: `<pop_id>.outputVCFSample(<num_individuals>, replace=T, filePath=outFile, append=T);`\n  2. The constants `sweep`, `outFile`, and `dumpFile` must be used in your simulation script\n      - `sweep`: one of \"neut\"/\"sdn\"/\"soft\", equivalent to neutral, selection on *de novo* mutation, and selection on standing variation respectively. This identifier is used both in the SLiM script to condition on scenarios but also in the output file naming.\n      - `outFile`: is the VCF file that will be used as output for samples for a given replicate. Will be set as `<work_dir>/vcfs/<sweep>/<rep>.multivcf`\n      - `dumpFile`: similarly to outFile this is where the intermediate simulation state is saved to in case of mutation loss or other problems with a replicate.\n\n  There is an example SLiM simulation in [constant_population.slim](timesweeper/constant_population.slim) that has been used and templated/modified for many experiments for the manuscript and is ready to be used with the current `d_block` setup in `sim_custom.py`.\n\n```\n$ timesweeper sim_custom -h\nusage: timesweeper sim_custom [-h] [--threads THREADS]\n                              [--rep-range REP_RANGE REP_RANGE] -y YAML_CONFIG\n\nSimulates selection for training Timesweeper using a pre-made SLiM script.\n\noptions:\n  -h, --help            show this help message and exit\n  --threads THREADS     Number of processes to parallelize across. Defaults to\n                        all.\n  --rep-range REP_RANGE REP_RANGE\n                        <start, stop>. If used, only range(start, stop) will\n                        be simulated for reps. This is to allow for easy SLURM\n                        parallel simulations.\n  -y YAML_CONFIG, --yaml YAML_CONFIG\n                        YAML config file with all required options defined.\n\n```\n\n\n### stpopsim Simulation (`simulate_stdpopsim`) \n\nFor use with SLiM scripts that have been generated using stdpopsim's `--slim-script` option to output the model. This allows for out of the box demographic models downloaded straight from the catalog stdpopsim adds to regularly. Some information needs to be gotten from the model definition so that the wrapper knows which population to sample from, how to scale values if rescaling the simulation, and more. These are described in detail both in the help message of the module and in the above doc section [Configs required for both types of simulation](#configs-required-for-both-types-of-simulation).\n\n```\n$ timesweeper sim_stdpopsim -h\nusage: timesweeper sim_stdpopsim [-h] [-v] [--threads THREADS]\n                                 [--rep-range REP_RANGE REP_RANGE]\n                                 YAML CONFIG\n\nInjects time-series sampling into stdpopsim SLiM output script.\n\npositional arguments:\n  YAML CONFIG           YAML config file with all options defined.\n\noptions:\n  -h, --help            show this help message and exit\n  -v, --verbose         Print verbose logging during process.\n  --threads THREADS     Number of processes to parallelize across.\n  --rep-range REP_RANGE REP_RANGE\n                        <start, stop>. If used, only range(start, stop) will\n                        be simulated for reps. This is to allow for easy SLURM\n                        parallel simulations.\n```\n\n### Process VCF Files (`process`) \n\nThis module splits the multivcf files (which are just multiple concatenated VCF entries) generated by SLiM and then merges them in order from most ancient to most current timepoints. **NOTE:** This is already integrated into `sim_custom` and `sim_stdpopsim` but can be used separately if you would like to simulate without the sim_custom or sim_stdpopsim modules.\n\n```\n$ timesweeper process -h\nusage: timesweeper process [-h] -i IN_DIR -t THREADS\n\nModule for splitting multivcfs (vertically concatenated vcfs) into merged\n(horizontally concatenated vcfs) if simulating without the sim module.\n\noptions:\n  -h, --help            show this help message and exit\n  -i IN_DIR, --in-dir IN_DIR\n                        Top-level directory containing subidrectories labeled\n                        with the names of each scenario and then replicate\n                        numbers inside those containing each multivcf.\n  -t THREADS, --threads THREADS\n                        Threads to use for multiprocessing.\n\n```\n\n### Make Training Data (`condense`) \n\nVCFs merged using `timesweeper process` are read in as allele frequencies using scikit-allel, and depending on the scenario (neut/sdn/soft) the central or locus under selection is pulled out and aggregated for all replicates. This labeled ground-truth data from simulations is then saved as a dictionary in a pickle file for easy access and low disk usage. \n\nThis module also allows for adding missingness to the training data in the case of missingness in the real data Timesweeper is going to be used on. To do this add the `-m <val>` flag where `val` is in [0,1] and is used as the parameter of a binomial draw for each allele per timestep to set as present/missing. We show in the manuscript that some missingness is viable (e.g. `val=0.2`), however high missingness (e.g. `val=0.5`) will result in terrible performance and should be avoided. Optimally this value should reflect the missingness present in the real data input to Timesweeper so as to parameterize the network to be better prepared for it.\n\nNote: the process of retrieving known-selection sites is based on the mutation type labels contained in VCF INFO fields output by SLiM. It currently assumes the mutation type where selection is being introduced is identified as \"m2\", but if you use a custom SLiM model and happen to change mutation type this module should be modified to properly scan for that.\n\nWarning: This module is the primary user of the `win_size` parameter. We recommend a window size of 51 based on our testing, but note that the current implementation of the 1DCNN fails to classify anything properly at sizes larger than k=101 in our testing, so user discretion and testing is advised when attempting to use larger windows.\n\n```\n$ timesweeper condense -h\nusage: timesweeper condense [-h] [--threads THREADS] [-o OUTFILE]\n                            [--subsample-inds SUBSAMPLE_INDS]\n                            [--subsample-tps SUBSAMPLE_TPS] [--og-tps OG_TPS]\n                            [-m MISSINGNESS] [-f FREQ_INC_THRESHOLD] [-a]\n                            [--hft] [--no-progress] [--verbose] -y YAML_CONFIG\n\nCreates training data from simulated merged vcfs after process_vcfs.py has\nbeen run.\n\noptions:\n  -h, --help            show this help message and exit\n  --threads THREADS     Number of processes to parallelize across.\n  -o OUTFILE, --outfile OUTFILE\n                        Pickle file to dump dictionaries with training data\n                        to. Should probably end with .pkl.\n  --subsample-inds SUBSAMPLE_INDS\n                        Number of individuals to subsample if using a larger\n                        simulation than needed for efficiency. NOTE: If you\n                        use this, keep the sample_sizes entry in the yaml\n                        config identical to the original simulations. This is\n                        mostly for the paper experiments and as such isn't\n                        very cleanly implemented.\n  --subsample-tps SUBSAMPLE_TPS\n                        Number of timepoints to subsample if using a larger\n                        simulation than needed for efficiency. NOTE: If you\n                        use this, keep the sample_sizes entry in the yaml\n                        config identical to the original simulations. This is\n                        mostly for the paper experiments and as such isn't\n                        very cleanly implemented.\n  --og-tps OG_TPS       Number of timepoints taken in the original data to be\n                        subsetted if using --subample-tps.\n  -m MISSINGNESS, --missingness MISSINGNESS\n                        Missingness rate in range of [0,1], used as the\n                        parameter of a binomial distribution for randomly\n                        removing known values.\n  -f FREQ_INC_THRESHOLD, --freq-increase-threshold FREQ_INC_THRESHOLD\n                        If given, only include sim replicates where the sweep\n                        site has a minimum increase of <freq_inc_thr> from the\n                        first timepoint to the last.\n  -a, --allow-shoulders\n                        1/3 of samples from sweep classes will be offset to be\n                        used as neutral shoulders.\n  --hft                 Whether to calculate HFT alongside AFT.\n                        Computationally more expensive.\n  --no-progress         Turn off progress bar.\n  --verbose             Raise warnings from issues usually stemming from bad\n                        replicates.\n  -y YAML_CONFIG, --yaml YAML_CONFIG\n                        YAML config file with all required options defined.\n\n```\n\n### Neural Networks (`train`) \n\nTimesweeper's neural network architecture is a shallow 1DCNN implemented in Keras2 with a Tensorflow backend that trains extremely fast on CPUs with very little RAM needed. Assuming all previous steps were run it can be trained and evaluated on hold-out test data with a single line invocation.\n\n```\n$ timesweeper train -h\nusage: timesweeper train [-h] -i TRAINING_DATA -d DATA_TYPE\n                         [-s SUBSAMPLE_AMOUNT] [-n EXPERIMENT_NAME] -y\n                         YAML_CONFIG [--single-tp]\n\nHandler script for neural network training and prediction for TimeSweeper\nPackage. Will train two models: one for the series of timepoints generated\nusing the hfs vectors over a timepoint and one\n\noptions:\n  -h, --help            show this help message and exit\n  -i TRAINING_DATA, --training-data TRAINING_DATA\n                        Pickle file containing data formatted with\n                        make_training_features.py.\n  -d DATA_TYPE, --data-type DATA_TYPE\n                        AFT or HFT data preparation.\n  -s SUBSAMPLE_AMOUNT, --subsample-amount SUBSAMPLE_AMOUNT\n                        Amount of data to subsample for each class to test for\n                        sample size effects.\n  -n EXPERIMENT_NAME, --experiment-name EXPERIMENT_NAME\n                        Identifier for the experiment used to generate the\n                        data. Optional, but helpful in differentiating runs.\n  -y YAML_CONFIG, --yaml YAML_CONFIG\n                        YAML config file with all required options defined.\n  --single-tp           Whether to use the tp1_model module for a special case\n                        experiment.\n\n```\n\n### Detect Sweeps (`detect`) \n\nFinally, the main module of the package is for detecting sweeps in a given VCF. This loads in the prepared VCF (see \"Preparing Input Data for Timesweeper\" below) in chunks, converts allele data to time-series allele velocity data, and predicts using the 1DCNN trained on simulated data. Each prediction represents a 51-SNP window with the focal allele being the actual target.\n\nTimesweeper outputs predictions as both a csv file and a bedfile. The BED file allows for easy intersections using bedtools and can be cross-referenced back to the CSV for score filtering.\n\nHere are the details on the headers:\n- Chrom: Chromosome/contig, identical to VCF file name of it\n- BP: location of central allele in the window being predicted on\n- Class: Neut/Hard/Soft, class identified by the maximum score in 3-class softmax output from the model\n- Neut/Hard/Soft Prob: raw score from softmax final layer of 1DCNN\n- SDN/SSV_sval: Predicted selection coefficient by each (ssv, sdn) regression model\n- Win_Start/End: left and right-most locations of the SNPs on each side of the window being predicted on\n\nNote: By default Timesweeper only outputs sites with a minimum sweep (sdn+soft) score of 0.66 to prevent massive amounts of neutral outputs. This value could easily be modified in the module but we find it better to filter after the fact for more flexibility.\n\nTimesweeper also has a `--benchmark` flag that will allow for testing accuracy on simulated data if wanted. This will search the input data for the mutation type identifier flags allowing a benchmark of detection accuracy on data that has a ground truth.\n\n```\n$ timesweeper detect -h\nusage: timesweeper detect [-h] -i INPUT_VCF [--benchmark] --aft-class-model\n                          AFT_CLASS_MODEL --aft-reg-model AFT_REG_MODEL\n                          [--hft-class-model HFT_CLASS_MODEL] --hft-reg-model\n                          HFT_REG_MODEL -o OUTFILE -y YAML_CONFIG -s SCALAR\n\nModule for iterating across windows in a time-series vcf file and predicting\nwhether a sweep is present at each snp-centralized window.\n\noptions:\n  -h, --help            show this help message and exit\n  -i INPUT_VCF, --input-vcf INPUT_VCF\n                        Merged VCF to scan for sweeps. Must be merged VCF\n                        where files are merged in order from earliest to\n                        latest sampling time, -0 flag must be used.\n  --benchmark           If testing on simulated data and would like to report\n                        the mutation type stored by SLiM during\n                        outputVCFSample as well as neutral predictions, use\n                        this flag. Otherwise the mutation type will not be\n                        looked for in the VCF entry nor reported with results.\n  --aft-class-model AFT_CLASS_MODEL\n                        Path to Keras2-style saved model to load for\n                        classification aft prediction.\n  --aft-reg-model AFT_REG_MODEL\n                        Path to Keras2-style saved model to load for\n                        regression aft prediction. Either SDN or SSV work,\n                        both will be loaded.\n  --hft-class-model HFT_CLASS_MODEL\n                        Path to Keras2-style saved model to load for\n                        classification hft prediction.\n  --hft-reg-model HFT_REG_MODEL\n                        Path to Keras2-style saved model to load for\n                        regression hft prediction.\n  -o OUTFILE, --outfile-prefix OUTFILE\n                        Prefix to use for results csvs. Will have\n                        '_[aft/hft].csv' appended to it.\n  -y YAML_CONFIG, --yaml YAML_CONFIG\n                        YAML config file with all required options defined.\n  -s SCALAR, --scalar SCALAR\n                        Minmax scalar saved as a pickle file during training.\n\n```\n\n---\n\n## Preparing Input Data for Timesweeper to Predict On\n\nTimesweeper needs a specific format of input data to work, namely a VCF file merged to the superset of all samples and polymorphisms that is merged *in order* of oldest to most recent. That last point is extremely important and easily missed.\n\nVCFs of all samples will need to be merged using the `bcftools merge -Oz --force-samples -0 <inputs_earliest.vcf ... inputs_latest.vcf> > merged.vcf.gz` options.\n\n---\n\n## Example Usage\n\nBelow is an example run of Timesweeper using the example config and simulation script provided in the repo. This will go through the entire process of simulating, training the model, processing input and calling predicted sweeps on a VCF of interest called `foo.vcf`.\n\n```\nconda activate blinx\ncd timesweeper\n\n#Simulate training data\ntimesweeper sim_custom yaml examples/example_config.yaml\n\n#Create feature vectors for both AFT and HFT\ntimesweeper condense --hft yaml examples/example_config.yaml\n\n#Train network\ntimesweeper train -n example_ts_run yaml examples/example_config.yaml\n\n#Predict on input VCF\ntimesweeper detect -i foo.vcf \\\n  --aft-class-model ts_experiment/trained_models/example_ts_run_Timesweeper_aft \\\n  --hft-class-model ts_experiment/trained_models/example_ts_run_Timesweeper_hft \\\n  --aft-reg-model ts_experiment/trained_models/REG_example_ts_run_Timesweeper_aft_sdn \\\n  --hft-reg-model ts_experiment/trained_models/REG_example_ts_run_Timesweeper_hft_sdn \\\n  \n```\n\n\n## Using Non-Timesweeper Simulations\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/SchriderLab/Timesweeper",
    "keywords": "population genetics,deep learning,positive selection",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "Timesweeper",
    "package_url": "https://pypi.org/project/Timesweeper/",
    "platform": null,
    "project_url": "https://pypi.org/project/Timesweeper/",
    "project_urls": {
      "GitHub": "https://github.com/SchriderLab/Timesweeper",
      "Homepage": "https://github.com/SchriderLab/Timesweeper",
      "Issues": "https://github.com/SchriderLab/Timesweeper/issues"
    },
    "release_url": "https://pypi.org/project/Timesweeper/1.3/",
    "requires_dist": null,
    "requires_python": ">=3.6",
    "summary": "A tool for detecting positive selective sweeps using time-series genomcis data.",
    "version": "1.3",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17424177,
  "releases": {
    "1.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d038e67e5b2ae00114b4dc104008c8d9ebc4d178351e6771e3b8b82a4335b7ad",
          "md5": "8c3aeaa4cc9730b17b0d57d4b3c0ba79",
          "sha256": "30633357299b44424c7716daa3c100c0a988c23a17f9ca14517c08debb1d4488"
        },
        "downloads": -1,
        "filename": "Timesweeper-1.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "8c3aeaa4cc9730b17b0d57d4b3c0ba79",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 39989,
        "upload_time": "2023-03-06T22:12:46",
        "upload_time_iso_8601": "2023-03-06T22:12:46.801339Z",
        "url": "https://files.pythonhosted.org/packages/d0/38/e67e5b2ae00114b4dc104008c8d9ebc4d178351e6771e3b8b82a4335b7ad/Timesweeper-1.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c26630f34118da7b4161f200539e3d216845bb9ae4ba58ae6a674285a4b65553",
          "md5": "714376bd8486f5372a8341bfbdd25e58",
          "sha256": "6322a11999251a2a76254750ec430e1ec3945b8d44aea35788cca149d37515e2"
        },
        "downloads": -1,
        "filename": "Timesweeper-1.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "714376bd8486f5372a8341bfbdd25e58",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 41064,
        "upload_time": "2023-03-06T22:18:17",
        "upload_time_iso_8601": "2023-03-06T22:18:17.683692Z",
        "url": "https://files.pythonhosted.org/packages/c2/66/30f34118da7b4161f200539e3d216845bb9ae4ba58ae6a674285a4b65553/Timesweeper-1.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5a0ed8ffe0a93d9b6b7153c18c286e283fe6ff29da4aff7bb94bf74360cbf0c8",
          "md5": "5bb023d820f3bafa6c716bd00e61ae65",
          "sha256": "0c265b9c39907c0851bf21f44fcdf7e5df4140f85c1407142066ee350909ea2e"
        },
        "downloads": -1,
        "filename": "Timesweeper-1.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "5bb023d820f3bafa6c716bd00e61ae65",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 41787,
        "upload_time": "2023-03-07T00:27:25",
        "upload_time_iso_8601": "2023-03-07T00:27:25.504001Z",
        "url": "https://files.pythonhosted.org/packages/5a/0e/d8ffe0a93d9b6b7153c18c286e283fe6ff29da4aff7bb94bf74360cbf0c8/Timesweeper-1.1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "fcbb371c8c653b7a6bfdf304c2d3f7af15d3c11c3e76a35f6f332a7eb59a70cc",
          "md5": "4ca20a903043dfbc08db19b4ec3120f6",
          "sha256": "3604fd05dc88bd41c087fb594019f05286667291f552176f7ae1950fbb2cca71"
        },
        "downloads": -1,
        "filename": "Timesweeper-1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "4ca20a903043dfbc08db19b4ec3120f6",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 42631,
        "upload_time": "2023-03-08T19:28:43",
        "upload_time_iso_8601": "2023-03-08T19:28:43.446160Z",
        "url": "https://files.pythonhosted.org/packages/fc/bb/371c8c653b7a6bfdf304c2d3f7af15d3c11c3e76a35f6f332a7eb59a70cc/Timesweeper-1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1d81da4b04ce1e1342f2e9973b89fa276dec72170b5ffea288a3c79cf80d610d",
          "md5": "62368efcea4006e79856d4191f6cf27e",
          "sha256": "03e9edb0500abeed83aff925b4561c84b3488f5f62aa5031da423ea05e4879d8"
        },
        "downloads": -1,
        "filename": "Timesweeper-1.3.tar.gz",
        "has_sig": false,
        "md5_digest": "62368efcea4006e79856d4191f6cf27e",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 43066,
        "upload_time": "2023-03-24T01:22:26",
        "upload_time_iso_8601": "2023-03-24T01:22:26.832484Z",
        "url": "https://files.pythonhosted.org/packages/1d/81/da4b04ce1e1342f2e9973b89fa276dec72170b5ffea288a3c79cf80d610d/Timesweeper-1.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "1d81da4b04ce1e1342f2e9973b89fa276dec72170b5ffea288a3c79cf80d610d",
        "md5": "62368efcea4006e79856d4191f6cf27e",
        "sha256": "03e9edb0500abeed83aff925b4561c84b3488f5f62aa5031da423ea05e4879d8"
      },
      "downloads": -1,
      "filename": "Timesweeper-1.3.tar.gz",
      "has_sig": false,
      "md5_digest": "62368efcea4006e79856d4191f6cf27e",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 43066,
      "upload_time": "2023-03-24T01:22:26",
      "upload_time_iso_8601": "2023-03-24T01:22:26.832484Z",
      "url": "https://files.pythonhosted.org/packages/1d/81/da4b04ce1e1342f2e9973b89fa276dec72170b5ffea288a3c79cf80d610d/Timesweeper-1.3.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}