{
  "info": {
    "author": "Valter Eduardo da Silva Junior",
    "author_email": "valteresj2@gmail.com",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "# Tree Missing Imput: A new approach to filling in missing values.\n\n### Abstract\nNowadays the area of artificial intelligence more specifically in machine learning has been widely applied in this era of digitization of today's companies, from the sectors with simple tasks to complex tasks as predicts which of their clients is a possible fraudster, in all areas. Professionals machine learning has been bringing very significant results, but few people know that to apply machine learning techniques in your business environment you must first understand your data well, for this there is the area of data mining, Where there are various techniques for applying data refinement, creating new features, and among other important steps before we get into the model development process, this step is vital to having the desired model perform well without a good mining application. data you will not have an unstable and poor performance model. In the data mining area there is a very common problem that appears in almost every segment in the machine learning area like supervised, unsupervised and semi-supervised which is missing data in your database and this is quite critical Depending on the volume and which variable it is in, to solve this problem there are several techniques from the simplest to the most complex, and we will present some of them later. Our approach addresses exactly this problem that is so vital in most database preprocessing developments, where this solution uses a decision tree to predict the missing values ​​for each variable in the data, but the process of splits and evolution of that tree has a different approach than classic trees like CART and ID3, all development of this project will be done in Python.\n\n### Tree Missing Imput\n\nThe Tree Missing Imput (TMI) approach was developed because of the need to improve the performance of database learning models that have missing data, currently many developers use missing padding on numeric variables such as minimum, maximum, quantile (10%, 15%,...,90%), median, average and others to replace this missing data, but these approaches do not bring significant performance improvements either individually or together for the models, and with this type of padding is generated a category within a numerical variable depending on the volume of missing, for the categorical variables a lot is used to fill the category with larger, smaller volume, or a new category that is also another not very sophisticated approach, for comparison we will use database of binary classification extracted from the Keel website (https://sci2s.ugr.es/keel/missing.php) and we will use the DataWig technique (https://datawig.readthedocs.io/en/latest/) where this technique applies neural networks to estimate missing values, the scikitlearn IterativeImputer (https://scikit-learn.org/stable/modules/impute.html) and also the traditional techniques mentioned above.\n\nMy goal was to bring a new approach of simple use, with good performance and fast processing, so I thought of bringing decision tree approach in a different way, this approach will be presented in topics:\n\n<ol>\n<li>First we apply a preprocessing to the data, for numerical variables we transform into categorical variables with ranges determined by the 10% quantiles and if we have missing in it we generate a class 'MISSING' and for categorical variables we apply only the class 'MISSING' if there is missing in itself.</li>\n<li>Next we compute the information gain of these new variables in relation to the missing variable, for example: The gender variable has 15% of missing and then the information gain in the complementary variables is computed and ordered from highest to lowest. and this applies to each missing variable of the data.</li>\n<li>As the tree growth order is applied to the tree pruning, our tree stopping criterion is when the current node has only missing record and that this amount is greater than or equal to 9% of the missing amount of the variable, With this we stop the growth of the tree, done this step is applied pruning of nodes with low registration frequency with fill, we remove nodes with frequency below 30.</li>\n<li>For the missing records in the categorical variables that are not in any tree node we apply a new category 'others' and for the numerical variables we apply the mean of the variable itself.</li>\n</ol>\n\nThis generates a tree for each missing variable in the data, so in the end we will have a new data with its filled variables. The numbers 9% and 30 of the pruning parameters were obtained from simulations, so I will leave these values fixed.\n\n### Results\n\nIn this topic I used the UCI database that was Bank and the rest of Keel, the classifier used to measure the performance of the approaches was LDA (Linear Discriminant Analysis), all bases have binary taregt and with that I applied the technique of AUC to measure performance, in both databases I used size 10 k-fold to calculate the average and deviation of performance of each study approach, it is worth remembering that all these approaches are applied to any kind of problem since supervised and unsupervised.\n\nIn Table 1 shows the results obtained, in the columns containing 'others', I applied a new class in the categorical variables called 'others', and for the numerical variables were applied the minimum, maximum and average, TMI and DataWig.\n\n![alt text](table_result.png \"Table 1 - Results obtained by fold.\")\n\nFigure 1 illustrates the extracted result based on the experiment found in scitkitlearn (https://scikit-learn.org/stable/auto_examples/impute/plot_iterative_imputer_variants_comparison.html) in this experiment and applied to a regression problem which is a different approach. TMI and DataWig were added for comparison, in the barplot shows the TMI with ExtraTreesRegressor showing the best performance with the value of 0.608938 and DataWig with 0.613505, where both presented a result below with the original data. which was 0.631302, another important detail is the variation of the result by folds, where the TMI showed a smaller variation than DataWig with the ExtraTreesRegressor technique.\n\n![alt text](image_result.png \"Figure 1 - Comparions by models to each technique of study.\")\n\nFrom the results obtained, we have a good performance in the study bases losing only three, so we can argue that this approach presents a substantial gain compared to the proposed techniques, another gain detail and the learning processing time compared to DataWig, in the Australian base for example TMI presented 8s of response and while DataWig presented 85s, with this we have a gain of 10 times more and this varies according to the amount of epochs defined by the user.\nAt the Mushroom base where it already has a high predictive power we are able to leverage performance by jumping to maximum performance. Base Housevotes all its variables are categorical and binary and with high sensitivity and so much so that DataWig had a very significant performance drop, our approach showed better performance stability between fold results.\n\n### Algorithm usage\nParameters of imput of function IMV\n<ol>\n<li>data: Input data for training</li>\n<li>target: Name of target variable to remove from training to avoid overfiting problem.</li>\n<li>save_model: Boolean to save or not save each generate model, all the saves will be in the format .npy.</li>\n</ol>\n\nParameters of imput of function predict\n\n<ol>\n<li>new_dt: Input new data for predict of missing values.</li>\n<li>new_weights: Weigths generate by model.</li>\n<li>new_pre_processing: Preprocessing generate by model.</li>\n</ol>\n\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/valteresj2/Tree-Imput-Missing-Values",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "timv",
    "package_url": "https://pypi.org/project/timv/",
    "platform": "",
    "project_url": "https://pypi.org/project/timv/",
    "project_urls": {
      "Homepage": "https://github.com/valteresj2/Tree-Imput-Missing-Values"
    },
    "release_url": "https://pypi.org/project/timv/0.0.1/",
    "requires_dist": [
      "numpy (>=1.19.5)",
      "pandas (>=1.1.5)",
      "info-gain (>=1.0.1)"
    ],
    "requires_python": "",
    "summary": "Say hello!",
    "version": "0.0.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 11081172,
  "releases": {
    "0.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5cf5337943b6591d7aa28547962725c08d4988f42252da8902d292e9157fd979",
          "md5": "e552a091cc976e5903c0f4c1f6b32168",
          "sha256": "0482570ae5d3825f58b6404cfa75f9f350a33721da92d67b9c142e8b186aa6f7"
        },
        "downloads": -1,
        "filename": "timv-0.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "e552a091cc976e5903c0f4c1f6b32168",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 18783,
        "upload_time": "2021-08-03T16:14:03",
        "upload_time_iso_8601": "2021-08-03T16:14:03.288975Z",
        "url": "https://files.pythonhosted.org/packages/5c/f5/337943b6591d7aa28547962725c08d4988f42252da8902d292e9157fd979/timv-0.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "96e44d590a5ba0419bfc96c576ace0d062428857011413981fccbf381d28b5e1",
          "md5": "a274e9b5ac1ba432d70c1eb79e9f5b65",
          "sha256": "edabf2a392b52be18d8f3aacb4538e2fbfe5acbc03da24e208316d8f512a6129"
        },
        "downloads": -1,
        "filename": "timv-0.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "a274e9b5ac1ba432d70c1eb79e9f5b65",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 18617,
        "upload_time": "2021-08-03T16:14:04",
        "upload_time_iso_8601": "2021-08-03T16:14:04.660302Z",
        "url": "https://files.pythonhosted.org/packages/96/e4/4d590a5ba0419bfc96c576ace0d062428857011413981fccbf381d28b5e1/timv-0.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "5cf5337943b6591d7aa28547962725c08d4988f42252da8902d292e9157fd979",
        "md5": "e552a091cc976e5903c0f4c1f6b32168",
        "sha256": "0482570ae5d3825f58b6404cfa75f9f350a33721da92d67b9c142e8b186aa6f7"
      },
      "downloads": -1,
      "filename": "timv-0.0.1-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "e552a091cc976e5903c0f4c1f6b32168",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 18783,
      "upload_time": "2021-08-03T16:14:03",
      "upload_time_iso_8601": "2021-08-03T16:14:03.288975Z",
      "url": "https://files.pythonhosted.org/packages/5c/f5/337943b6591d7aa28547962725c08d4988f42252da8902d292e9157fd979/timv-0.0.1-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "96e44d590a5ba0419bfc96c576ace0d062428857011413981fccbf381d28b5e1",
        "md5": "a274e9b5ac1ba432d70c1eb79e9f5b65",
        "sha256": "edabf2a392b52be18d8f3aacb4538e2fbfe5acbc03da24e208316d8f512a6129"
      },
      "downloads": -1,
      "filename": "timv-0.0.1.tar.gz",
      "has_sig": false,
      "md5_digest": "a274e9b5ac1ba432d70c1eb79e9f5b65",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 18617,
      "upload_time": "2021-08-03T16:14:04",
      "upload_time_iso_8601": "2021-08-03T16:14:04.660302Z",
      "url": "https://files.pythonhosted.org/packages/96/e4/4d590a5ba0419bfc96c576ace0d062428857011413981fccbf381d28b5e1/timv-0.0.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}