{
  "info": {
    "author": "",
    "author_email": "Branden Kunkel <kunkel.branden6130@gmail.com>",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 4 - Beta",
      "Intended Audience :: Developers",
      "Intended Audience :: Education",
      "Intended Audience :: Science/Research",
      "License :: OSI Approved :: GNU General Public License v3 (GPLv3)",
      "Natural Language :: English",
      "Operating System :: POSIX :: Linux",
      "Programming Language :: Python :: 3.8"
    ],
    "description": "# Twitter Aggregate Generator - **v.1.2.0**\n\n## Intro:\n\nThe Twitter Aggregate Generator (Also denoted as Twitter-AG or TAG) is a program that was intended as a quick and user friendly shell to gather large amounts of \ndata from the official Twitter API. The intended use of this data includes, but is not limited to the following:\n- create a culture of accountability surrounding what politicians say on global platforms\n- analyze and predict important social trends that impact day to day life\n- create and analyze social networks consisting of individuals or entities of academic interest\n\nCurrently, TwitterAG is in the **beta** stage, with known bugs noted in the source repository. The **release** version++ hopes to have further core modules supporting more features such as:\n- Command piping to even more precisely filter, append or strip data in responses\n- A small SDK? \n- Increased access elevation and API endpoints available. Will add a filtered stream API functionality once I can work with usable rate limits.\n- A compiled version of this program which will be based on elevated access. I anticipate that speed will be a more important factor when datasets become that large\n\nNote that **all** response types from the Twitter API are of JSON type.\n\nTo look at future modules bieng tested, take a look at the 'testing' branch for this project. To see the next update that will be pushed to 'master'\nsee the 'update' branch. Thank you for taking the time to check out the project!\n\n## Table Of Contents:\n\n- **1. Navigation**\n- **2. Core Functions**\n- **3. Commands**\n- **4. Configuration**\n- **5. Additional Information**\n\n### 1. Navigation\n\nTwitter-AG was built on top of the CMD python standard library for a shell style interface. The prompt for the console will tell you where you are\nwith a three piece pin. Take the prompt for one of the core functions as an example:\n**MODULE@INFO-user: **\nThe first part before the '@' denotes what *type* of module you are using. Those types are:\n- MODULE@ = a module that is part of the core TwitterAG package.\n- TEST@ = a module that is currently being tested. Not stable.\n- COM@ = a community contributed module.\n- DEPC@ = a module that is deprecated and will be removed with the next major update to allow time for API transition.\n\nThe second part immedietaly after the '@' but before the '-' denotes the *name* of the module that you are using. In this instance the name is 'INFO'. \nThis stands for information, or information gathering which is the core functionality of TAG. The last part is the function/console you are using within\nthe the named module that you are in. In this case, this is the **User Profile console**. Another prompt, say 'MODULE@INFO-timeline' denotes the same module, but using the **Tweet Timeline** console instead of **User Profile**.\n\n### 2. Core Functions\n\nThe core module in Twitter-AG currently has five functions/consoles (actually classes) each with a specififc API endpoint that they interface with. Similar functionality and features are shared across all functions. Some of these include full control over all request parameters, file input and output, commands, and much more. To boot and use a console, simply pass its shorthand name into the shell as a command from anywhere and it will take you there. The five consoles and their shorthands are:\n- User Profile Console = 'user'\n- User Follows Console = 'follows'\n- Tweet Lookup Console = 'tweet'\n- Tweet Timeline Console = 'timeline'\n- Likes Console = 'likes'\n\n#### User Profile Console:\nThe user profile console simply retrieves a desired user profile. As a specified target, it takes either:\n- a comma seperated list of usernames (no spaces)\n- a single user id\n- an input file of any amount of usernames/user id\n\nFor example, a response for the username 'elonmusk', the current owner of Twitter with all parameters enabled would look *similar* to the one below.\n\n`\"data\": [\n        {\n            \"created_at\": \"2009-06-02T20:12:29.000Z\",\n            \"description\": \"\",\n            \"id\": \"44196397\",\n            \"name\": \"Elon Musk\",\n            \"profile_image_url\": \"https://pbs.twimg.com/profile_images/1590968738358079488/IY9Gx6Ok_normal.jpg\",\n            \"protected\": false,\n            \"public_metrics\": {\n                \"followers_count\": 115429998,\n                \"following_count\": 130,\n                \"listed_count\": 101855,\n                \"tweet_count\": 20231\n            },\n            \"username\": \"elonmusk\",\n            \"verified\": true\n        }\n    ]`\n\nTo run the console with the currently set parameters, pass the 'profile' command to the shell. \n\n#### User Follows Console:\nThe user follows console will return two sets of data depending on which mode it is ran in. The first command, 'followers', will return a list of users who *are following* the target user id. The second command, 'following', will return a list of users that the target user id *is following*. Since both responses return user profile objects just like the **User Profile** console, all request parameters are the same as in that console. A specified target can be:\n- a single user id\n- an input file of any amount of user ids\n\nThis API endpoint does support pagination, which will be covered in the **Additional Information** section of this file.\n\n#### Tweet Lookup Console:\nThe tweet lookup console simply returns one tweet object per request with a tweet id as a target. The target can be specified with:\n- a single tweet id\n- an input file of any amount of tweet ids\n\nAn example response with no parameters enabled (this response object can be massive) would look *similar* to the one below.\n\n\"data\": [\n        {\n            \"edit_history_tweet_ids\": [\n                \"1591509211787431936\"\n            ],\n            \"id\": \"1591509211787431936\",\n            \"text\": \"@andst7 https://t.co/ZpZ6B4F7Ou\"\n        },\n        {\n            \"edit_history_tweet_ids\": [\n                \"1591498799373258752\"\n            ],\n            \"id\": \"1591498799373258752\",\n            \"text\": \"@westcoastbill \\ud83e\\uddbe\"\n        },\n        {\n            \"edit_history_tweet_ids\": [\n                \"1591490459066564610\"\n            ],\n            \"id\": \"1591490459066564610\",\n            \"text\": \"@WholeMarsBlog Given all that is in V11, it will take a few weeks to expand the beta, then another few weeks to go wide release to US &amp; Canada\"\n        },\n        {\n            \"edit_history_tweet_ids\": [\n                \"1591487015845076996\"\n            ],\n            \"id\": \"1591487015845076996\",\n            \"text\": \"RT @Tesla: Join our growing team installing Solar + Powerwall across the US \\u2192 https://t.co/BMlhHBbAJn https://t.co/mVupmqcjiK\"\n        },\n        {\n            \"edit_history_tweet_ids\": [\n                \"1591487006508736512\"\n            ],\n            \"id\": \"1591487006508736512\",\n            \"text\": \"RT @TeslaSolar: Tesla solar and Powerwall can power your home &amp; reduce your dependence on the grid \\u2013 at the lowest price in the US \\u2192\\nhttps:\\u2026\"\n        },\n        \nTo run this console with the currently set parameters, pass the 'lookup' command to the shell.\n\n#### Tweet Timeline Console:\nThe tweet timeline console will return the chronological tweet timeline for a given target user id. The response objects will be the same as in the **Tweet Lookup** console, with the same parameters available for the request. A specified target user id may be:\n- a single user id\n- an input file of any number of user ids\n\nThis API endpoint does support pagination. To run the console with the current set of params, pass the 'timeline' command to the shell.\n\n#### Likes Console:\nThe likes console will return two possible reesponse objects depending on mode selected. The first command, 'liking', will return a list of users who *have liked* a given target tweet id. The second command, 'liked', will return a list of tweets that a given target user id *has liked*. Specified targets may be:\n- a single tweet id or user id\n- an input file of any amount of tweet ids or user ids\n\nThis endpoint does support pagination. \n\n### 3. Commands\nBesides their unique 'run' type shorthands, all consoles in the core INFO module share a set of utility commands. Some commands support arguments for additional functionality or customaization. Commands with optional args will be shown with no symbols, ex. 'list [arg]'. Commands with arguments that are required will have an asterisk before the arg, ex. 'set *[arg]'. Commands with no args will not show an argument option. The full list of commands is as follows:\n- 'help' or '?' = displays the help page relevant to the current console\n- 'list [arg]' = list current parameters and available commands where arg is 'commands' or 'params'\n- 'set *[arg]' = utility to change a parameter where args are hierarchical dicionary keys leading to a desired parameter value, and the last arg is the value to write to the desired param \n- 'clear' = will clear the screen\n- 'exit' = will terminate the current instance of Twitter-AG\n- \nReminder - To change to a different console, simply pass its shorthand command into the shell.\n\n### 4. Configuration:\nConfiguration in Twitter-AG is straightforward. The program comes with a configuration file that stores all parameters that the program will use. This file should not be edited unless you are setting up the program for the first time (creating defaults) or large pre-planned campaigns. Other than those two instances, it is encouraged to use the 'set' command to change variables/parameters within TAG. The 'set' command will take care of variable types and avoid unintentional mutilation of code other than the actual parameter values.\n\nThe configuration file is uses dictionaries for paramter storage. Each variable has a type denoted by the comment after each dictionary item for those who may not do any coding themselves. Strings make up the large majority of variable types in TAG. Following are boolean and integer values. For parsing, any parameter that is of string type, and is to be omitted should have a 'None' type as its value. If a parameter is of integer type, only integers values (0-9) should be used. For boolean values, value must always be 'True' or 'False. \nDeviation from these rules will result in a program error or an API response error. Furthermore, any variable of string type that includes comma seperated words (parameters) should include NO spaces.\n\nFor each console in the core module there exists a dictionary named after that console in config\\_tools.py. This dictionary contains all of ther parameters that affect the behavior of a request. For example, there is the **User Profile** console, and in config\\_tools.py there is a dict named 'user_profile_params'. Additionally, there is one dictionary that is shared by all consoles called 'file_IO' in which I/O file paths are specified. A global file path parameter (not in a dict) is also included.\n\nUsing the 'set' command, the first argument will be which parameter type, or dictionary you want to edit. \n- pass 'request' to edit the named 'request' dictionary\n\t- note that within said 'request' dictionary there is a dictionary key names 'request_params'. The params in this dictionary precisely tune what the JSON response from the API will contain. All available 'request\\_params' for this acccess level are written into the config file by default\n- pass 'files' to edit the shared file_IO dictionary (to change the global file path pass 'global' as the next arg after 'files')\n\nEach subsequent argument *except* the last will be the dictionary **KEY** of the parameter (or nested dictionary) that you wish to change. The final argument should be the value that you wish to write to said dictionary key.\n\nAs an example, let's say we wanted to set the 'max_results' parameter for the **Tweet Timeline** endpoint console to '10'. The command would look like this:\n\nMODULE@INFO-timeline: set request request\\_params max_results 10\n\nIn the above command, 'set' is the command, 'request' puts into the 'tweet\\_timeline\\_params' dictionary, 'request\\_params' puts us into the URL encoded values dictionary, 'max_results' is the key to the value we want to change, and '10' is the value we are writing.\n\n### 5. Additional Information:\nOther than basic usage covered previosly in this reading, there is additional information pertaining to the proper configuration, usage and access for TAG and/or the Twitter API. These will all be covered in this section.\n\n#### Authorization and Access:\nThe twitter API uses OAuth and a pair of API keys for authenticication of requests. For the current set of core functionailty, only the OAuth bearer token from Twitter is needed for authenticication. To obtain these credentials you must sign up for a *developer* account with Twitter. Sign up is free. Upon sign up and verification, you will be given all three previously mentioned credentials. Keep these safe. These keys are specific to your developer account with Twitter. \nAny use that violates Twitter's terms of service will be solely the responsibility of the offending token's owner.\n\nWhen signing up for a dev account with Twitter, there are tiers, or access levels that are available to sign up for. They are:\n- essential\n- elevated\n- academic\n\nTAG is currently set up to interface as an 'essential' user. The only difference between this and the 'elevated' status is better rate limites and access to a few more parameters. As better access is gained, branches of this program will be created with those parameters in mind. Academic access is highly restricted, and will most likely not be covered by TAG. However, *if* the author(s) of TAG do ever manage to gain this access, a special branch will be created for this as well.\n\n#### References:\nBelow are where you will find links to additional documention pertaining to this program or its dependencies. \n- https://developer.twitter.com/en/docs/twitter-api : This link will get you started with a dev account and also contains documents about API requests, rate limiting, TOS and more. It is also where your personal developer dashboard will be.\n\n#### Pagination:\nPagination is supported by the Twitter API and by TwitterAG. Endpoints that allow/use pagination all have a dictionary for pagination controls located in the request dictionaries for each module. There is also a 'pagination\\_token' parameter contained in the 'request' --> 'request\\_params' dictionary. Assuming that you are starting a new campaign and want to start at the beginning of a data set, just switch pagination on (paginate? = True) and run the console. \nThe program will take care of returning subsequent pages until it meets the 'page\\_count' parameter value. To pick up on a data set where you left off, simply set the 'pagination_token' parameter to the last 'next\\_token' you recieved in a JSON response. The 'next\\_token' key can be found \ninside of the 'meta' key sent with API responses. Since output is to JSON files by default you will have them and can find them easily. Furthemrore, note that the 'page\\_count' parameter in conjunction with the 'max\\_results' parameter will\ndetermine how many responses you get when you run a console. This is important to keep track of when data rates apply to you.\n\n### Thank You!\nAs always, thamk you for taking the time to check out the project! As it grows, the aim is to create something useful for the community. All contributions will be reviewed and are greatly appreciated. Check back for some BIG updated in the near future.\n\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "Twitter-Aggregate-Generator",
    "package_url": "https://pypi.org/project/Twitter-Aggregate-Generator/",
    "platform": null,
    "project_url": "https://pypi.org/project/Twitter-Aggregate-Generator/",
    "project_urls": {
      "homepage": "https://github.com/Branden-Kunkel/twitter_aggregate_generator"
    },
    "release_url": "https://pypi.org/project/Twitter-Aggregate-Generator/1.2.0/",
    "requires_dist": [
      "requests (==2.28.1)"
    ],
    "requires_python": ">=3.8",
    "summary": "",
    "version": "1.2.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16143571,
  "releases": {
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "279b5ca9bf4021418f2765547d53058d36cb2080a4b2c59e23a4c41e6af58a06",
          "md5": "aca172c939b25f54ca87899719969d66",
          "sha256": "32c672665b02fab3b691826de0aaeffe49e7ffc1c5a73ac2ed23f41907b6a7f9"
        },
        "downloads": -1,
        "filename": "Twitter_Aggregate_Generator-1.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "aca172c939b25f54ca87899719969d66",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 25434,
        "upload_time": "2022-11-26T06:16:04",
        "upload_time_iso_8601": "2022-11-26T06:16:04.186318Z",
        "url": "https://files.pythonhosted.org/packages/27/9b/5ca9bf4021418f2765547d53058d36cb2080a4b2c59e23a4c41e6af58a06/Twitter_Aggregate_Generator-1.0.0-py3-none-any.whl",
        "yanked": true,
        "yanked_reason": "missing dependency declaration"
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "961e6a958eed8a8b1d5d2039c8078884567f8b4c50d351b9bda6efc4892ee03f",
          "md5": "535d76a9d27e5c8f2e76b995032b4922",
          "sha256": "a4713548b139352684edcef01b550a1454b8846e676754a0d8962b0386d90aae"
        },
        "downloads": -1,
        "filename": "Twitter_Aggregate_Generator-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "535d76a9d27e5c8f2e76b995032b4922",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 15488,
        "upload_time": "2022-11-26T06:16:06",
        "upload_time_iso_8601": "2022-11-26T06:16:06.017271Z",
        "url": "https://files.pythonhosted.org/packages/96/1e/6a958eed8a8b1d5d2039c8078884567f8b4c50d351b9bda6efc4892ee03f/Twitter_Aggregate_Generator-1.0.0.tar.gz",
        "yanked": true,
        "yanked_reason": "missing dependency declaration"
      }
    ],
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f68d55a6226147431b8025b37f18eb1d341c27efcf9b94fce46f01ec9ef177fd",
          "md5": "52b0fa30adb7cd82c0d3400fd510711e",
          "sha256": "3f6c885d65dab340abbc8690c71736756b070a6680b3522555ec337b16ba52e9"
        },
        "downloads": -1,
        "filename": "Twitter_Aggregate_Generator-1.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "52b0fa30adb7cd82c0d3400fd510711e",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 25579,
        "upload_time": "2022-11-26T06:54:43",
        "upload_time_iso_8601": "2022-11-26T06:54:43.825932Z",
        "url": "https://files.pythonhosted.org/packages/f6/8d/55a6226147431b8025b37f18eb1d341c27efcf9b94fce46f01ec9ef177fd/Twitter_Aggregate_Generator-1.0.1-py3-none-any.whl",
        "yanked": true,
        "yanked_reason": "Improper pyproject.toml format"
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5c683cec8c959526ef484ef64576534b2ff92e422ebb3cf67c35ffef7d528b42",
          "md5": "0ec22f677cc8de9b5834bfbf53315508",
          "sha256": "978e208e76beb2894f9ac9b60f0a0e510a215e1ba12e76857753af613c8c4b10"
        },
        "downloads": -1,
        "filename": "Twitter_Aggregate_Generator-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "0ec22f677cc8de9b5834bfbf53315508",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 15486,
        "upload_time": "2022-11-26T06:54:45",
        "upload_time_iso_8601": "2022-11-26T06:54:45.987860Z",
        "url": "https://files.pythonhosted.org/packages/5c/68/3cec8c959526ef484ef64576534b2ff92e422ebb3cf67c35ffef7d528b42/Twitter_Aggregate_Generator-1.0.1.tar.gz",
        "yanked": true,
        "yanked_reason": "Improper pyproject.toml format"
      }
    ],
    "1.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7148668071ebec00f8dd8c6bf2bdd9e11c1339c7608f69b1441d48119b200c77",
          "md5": "f9173d479a6309ff88c4dd5ba36fe73b",
          "sha256": "bb1593982b27f807cc67359b9fbfbb3d1efcc63d80444f2f23f1536c397d69b9"
        },
        "downloads": -1,
        "filename": "Twitter_Aggregate_Generator-1.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "f9173d479a6309ff88c4dd5ba36fe73b",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 27748,
        "upload_time": "2022-12-18T23:31:33",
        "upload_time_iso_8601": "2022-12-18T23:31:33.515100Z",
        "url": "https://files.pythonhosted.org/packages/71/48/668071ebec00f8dd8c6bf2bdd9e11c1339c7608f69b1441d48119b200c77/Twitter_Aggregate_Generator-1.1.0-py3-none-any.whl",
        "yanked": true,
        "yanked_reason": "Improper dependency versioning"
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1fbe48458a64e244aff9a1eab61288b3782cca4e083dbd4bee791390d91ee24c",
          "md5": "6d06bbd31524edf0b6c7f3008e3766b2",
          "sha256": "1c733fd37922acd888ac314ae55a4bcdd5ac5151726d00fef40055e04ec5c4c5"
        },
        "downloads": -1,
        "filename": "Twitter_Aggregate_Generator-1.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "6d06bbd31524edf0b6c7f3008e3766b2",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 16922,
        "upload_time": "2022-12-18T23:31:35",
        "upload_time_iso_8601": "2022-12-18T23:31:35.282186Z",
        "url": "https://files.pythonhosted.org/packages/1f/be/48458a64e244aff9a1eab61288b3782cca4e083dbd4bee791390d91ee24c/Twitter_Aggregate_Generator-1.1.0.tar.gz",
        "yanked": true,
        "yanked_reason": "Improper dependency versioning"
      }
    ],
    "1.2.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9780bd141c0f55d89f8f34ab3d070565b1aaa05c2956c4420cb77f393d42c835",
          "md5": "91b1eae11aa3a5f08569d5af636d033e",
          "sha256": "87ab5b8da0672509c9d243fbd0e92e21198a76ac6e3798607b6403d5f4807bfe"
        },
        "downloads": -1,
        "filename": "Twitter_Aggregate_Generator-1.2.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "91b1eae11aa3a5f08569d5af636d033e",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 27748,
        "upload_time": "2022-12-18T23:36:03",
        "upload_time_iso_8601": "2022-12-18T23:36:03.634503Z",
        "url": "https://files.pythonhosted.org/packages/97/80/bd141c0f55d89f8f34ab3d070565b1aaa05c2956c4420cb77f393d42c835/Twitter_Aggregate_Generator-1.2.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ed986eb02932e71a7582df4b525a497e20efdd7364813be99b6c556549586e44",
          "md5": "113c0a4d59cb78e57c5ac542b3ff9588",
          "sha256": "2336cf81864d9d3b493a96cee2916ed2dbbc3b4f5c548cc174a650876bcca787"
        },
        "downloads": -1,
        "filename": "Twitter_Aggregate_Generator-1.2.0.tar.gz",
        "has_sig": false,
        "md5_digest": "113c0a4d59cb78e57c5ac542b3ff9588",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 16932,
        "upload_time": "2022-12-18T23:36:05",
        "upload_time_iso_8601": "2022-12-18T23:36:05.308449Z",
        "url": "https://files.pythonhosted.org/packages/ed/98/6eb02932e71a7582df4b525a497e20efdd7364813be99b6c556549586e44/Twitter_Aggregate_Generator-1.2.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "9780bd141c0f55d89f8f34ab3d070565b1aaa05c2956c4420cb77f393d42c835",
        "md5": "91b1eae11aa3a5f08569d5af636d033e",
        "sha256": "87ab5b8da0672509c9d243fbd0e92e21198a76ac6e3798607b6403d5f4807bfe"
      },
      "downloads": -1,
      "filename": "Twitter_Aggregate_Generator-1.2.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "91b1eae11aa3a5f08569d5af636d033e",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.8",
      "size": 27748,
      "upload_time": "2022-12-18T23:36:03",
      "upload_time_iso_8601": "2022-12-18T23:36:03.634503Z",
      "url": "https://files.pythonhosted.org/packages/97/80/bd141c0f55d89f8f34ab3d070565b1aaa05c2956c4420cb77f393d42c835/Twitter_Aggregate_Generator-1.2.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "ed986eb02932e71a7582df4b525a497e20efdd7364813be99b6c556549586e44",
        "md5": "113c0a4d59cb78e57c5ac542b3ff9588",
        "sha256": "2336cf81864d9d3b493a96cee2916ed2dbbc3b4f5c548cc174a650876bcca787"
      },
      "downloads": -1,
      "filename": "Twitter_Aggregate_Generator-1.2.0.tar.gz",
      "has_sig": false,
      "md5_digest": "113c0a4d59cb78e57c5ac542b3ff9588",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.8",
      "size": 16932,
      "upload_time": "2022-12-18T23:36:05",
      "upload_time_iso_8601": "2022-12-18T23:36:05.308449Z",
      "url": "https://files.pythonhosted.org/packages/ed/98/6eb02932e71a7582df4b525a497e20efdd7364813be99b6c556549586e44/Twitter_Aggregate_Generator-1.2.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}