{
  "info": {
    "author": "Gary Robinson",
    "author_email": "gary.robinson@uleska.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: GNU General Public License v3 (GPLv3)",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# uleska-automate\n\nUleska CLI for ease of integration with CI/CD and similar systems\n\n```\n\n ___  ___  ___       _______   ________  ___  __    ________     \n|\\  \\|\\  \\|\\  \\     |\\  ___ \\ |\\   ____\\|\\  \\|\\  \\ |\\   __  \\    \n\\ \\  \\\\\\  \\ \\  \\    \\ \\   __/|\\ \\  \\___|\\ \\  \\/  /|\\ \\  \\|\\  \\   \n \\ \\  \\\\\\  \\ \\  \\    \\ \\  \\_|/_\\ \\_____  \\ \\   ___  \\ \\   __  \\  \n  \\ \\  \\\\\\  \\ \\  \\____\\ \\  \\_|\\ \\|____|\\  \\ \\  \\\\ \\  \\ \\  \\ \\  \\ \n   \\ \\_______\\ \\_______\\ \\_______\\____\\_\\  \\ \\__\\\\ \\__\\ \\__\\ \\__\\\n    \\|_______|\\|_______|\\|_______|\\_________\\|__| \\|__|\\|__|\\|__|\n                                 \\|_________|                    \n                                 \n                                 \nusage: uleska-automate [-h] --uleska_host ULESKA_HOST --token TOKEN\n                       [--application_id APPLICATION_ID]\n                       [--version_id VERSION_ID]\n                       [--application_name APPLICATION_NAME]\n                       [--version_name VERSION_NAME]\n                       [--toolkit_name TOOLKIT_NAME] [--update_sast]\n                       [--sast_git SAST_GIT] [--sast_username SAST_USERNAME]\n                       [--sast_token SAST_TOKEN]\n                       [--update_container]\n                       [--container_image CONTAINER_IMAGE]\n                       [--container_tag CONTAINER_TAG]\n                       [--container_connection CONTAINER_CONNECTION] [--test]\n                       [--test_and_results] [--test_and_compare]\n                       [--latest_results] [--compare_latest_results]\n                       [--print_json] [--get_ids] [--app_stats]\n                       [--fail_if_issue_risk_over FAIL_IF_ISSUE_RISK_OVER]\n                       [--fail_if_risk_over FAIL_IF_RISK_OVER]\n                       [--fail_if_risk_change_over FAIL_IF_RISK_CHANGE_OVER]\n                       [--fail_if_issues_over FAIL_IF_ISSUES_OVER]\n                       [--fail_if_issues_change_over FAIL_IF_ISSUES_CHANGE_OVER]\n                       [--fail_if_CVSS_over FAIL_IF_CVSS_OVER] [--debug]\n\nUleska command line interface. To identify the project/pipeline to test you\ncan specify either --application_name and --version_name, or --application and\n--version (passing GUIDs). Arguments can also be stored in an argparse configuration \nfile specified with 'uleska-automate @args.txt'. (Version 0.12)\n\noptional arguments:\n  -h, --help            show this help message and exit\n  --uleska_host ULESKA_HOST\n                        URL to the Uleska host (e.g. https://s1.uleska.com/)\n                        (note final / is required)\n  --token TOKEN         String for the authentication token\n  --application_id APPLICATION_ID\n                        GUID for the application to reference\n  --version_id VERSION_ID\n                        GUID for the application version/pipeline to reference\n  --application_name APPLICATION_NAME\n                        Name for the application to reference\n  --version_name VERSION_NAME\n                        Name for the version/pipeline to reference\n  --toolkit_name TOOLKIT_NAME\n                        The name of the toolkit you would like to use to scan.\n                        Note: for backwards compatibility you can call the CLI\n                        without this argument, but this will be depreciated in\n                        the future.\n  --update_sast         Add or update a SAST pipeline. Requires an pre-\n                        existing application. See documentation for other\n                        settings\n  --sast_git SAST_GIT   Git URL for SAST repo. Required with --update_sast.\n  --sast_username SAST_USERNAME\n                        If repo requires authentication, this is the username\n                        to use. Optional with --update_sast.\n  --sast_token SAST_TOKEN\n                        If repo requires authentication, this is the token\n                        value to use. Optional with --update_sast.\n  --update_container    Update a container pipeline. Requires an pre-existing\n                        application/config. See documentation for other\n                        settings\n  --container_image CONTAINER_IMAGE\n                        Name of image to use. Required with\n                        --update_container.\n  --container_tag CONTAINER_TAG\n                        Tag to use. Required with --update_container.\n  --container_connection CONTAINER_CONNECTION\n                        Connection name to use for container access. Optional\n                        with --update_container. If not included Docker Hub is\n                        assumed.\n  --test                Run tests only for the application and version\n                        referenced, do not wait for the results\n  --test_and_results    Run tests for the application and version referenced,\n                        and return the results from the last as JSON\n  --test_and_compare    Run tests for the application and version referenced,\n                        and return any differences in the results from the\n                        last test\n  --latest_results      Retrieve the latest test results for application and\n                        version referenced\n  --compare_latest_results\n                        Retrieve the latest test results for version and\n                        compare\n  --print_json          Print the relevant output as JSON to stdout\n  --get_ids             Retrieve GUID for the application_name and\n                        version_name supplied\n  --app_stats           Retrieve the latest risk and vulnerabiltiy for the\n                        whole application\n  --fail_if_issue_risk_over FAIL_IF_ISSUE_RISK_OVER\n                        Causes the CLI to return a failure if any new issue\n                        risk is over the integer specified\n  --fail_if_risk_over FAIL_IF_RISK_OVER\n                        Causes the CLI to return a failure if the risk is over\n                        the integer specified\n  --fail_if_risk_change_over FAIL_IF_RISK_CHANGE_OVER\n                        Causes the CLI to return a failure if the percentage\n                        change of increased risk is over the integer\n                        specified. Requires 'test_and_compare' or\n                        'compare_latest_results' functions\n  --fail_if_issues_over FAIL_IF_ISSUES_OVER\n                        Causes the CLI to return a failure if the number of\n                        issues is over the integer specified\n  --fail_if_issues_change_over FAIL_IF_ISSUES_CHANGE_OVER\n                        Causes the CLI to return a failure if the percentage\n                        change in new issues is over the integer specified.\n                        Requires 'test_and_compare' or\n                        'compare_latest_results' function\n  --fail_if_CVSS_over FAIL_IF_CVSS_OVER\n                        Causes the CLI to return a failure if the any new\n                        issue has a CVSS over the integer specified. Requires\n                        'test_and_compare' or 'compare_latest_results'\n                        function\n  --debug               Prints debug messages\n\n\n ```\n\n\n## Example usage:\n\n```\n# python3 uleska-automate.py --uleska_host https://uleska.example.com/ --application_name demo_UnSAFE_Bank --version_name v1 --token c64Ca28whEAIkFYlzO8clRutrlwVws2pF9999999999 --toolkit_name \"ABC\" --test_and_compare\n\nApplication or version name passed, looking up ids...\nApplication ID found for [demo_UnSAFE_Bank]: 00b17c86-62f8-4031-8fe9-d7ab319a0c3e\nVersion ID found for [v1]: a2bb3d88-cf9d-496f-9920-bee9122b43a0\nMapped names to ids: application name [demo_UnSAFE_Bank], id [00b17c86-62f8-4031-8fe9-d7ab319a0c3e], version name [v1] id [a2bb3d88-cf9d-496f-9920-bee9122b43a0]\nRunning blocking scan\nKicking off the scan\nScan running\nOur Toolkit a2bb3d88-cf9d-496f-9920-bee9122b43a0 is still running, waiting...\n\nOur Toolkit a2bb3d88-cf9d-496f-9920-bee9122b43a0 is still running, waiting...\n\nOur Toolkit a2bb3d88-cf9d-496f-9920-bee9122b43a0 is still running, waiting...\n\nNo more scans running\n\nGetting list of reports for this pipeline\nGetting information on this report\nGetting information on this report\nComparing the latest scan report with the previous one\n\n\n    Risk level has INCREASED by    $215,000\n    Risk level has INCREASED by     19.9%\n\n    Number of issues has INCREASED by   4\n    Number of issues has INCREASED by   44.4%\n\nNEW ISSUE in this toolkit run:\n        Using parseString to parse untrusted XML data is known to be vulnerable to XML attacks: reinvent.py: tool [Demo Bandit]:     Risk $10,000\n        CVSS : 6.2 : CVSS:3.0/AV:N/AC:H/PR:H/UI:R/S:C/C:H/I:L/A:N\n\nNEW ISSUE in this toolkit run:\n        Possible hardcoded password: 'h++jszpm)i@p%ay_b=cp#()^od!qns14)h%@qm3)p=cuo+st^a': tool [Demo Bandit]:     Risk $62,000\n        CVSS : 7.3 : CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:L/A:N\n\nNEW ISSUE in this toolkit run:\n        Possible hardcoded password: 'secret': tool [Demo Bandit]:     Risk $62,000\n        CVSS : 7.3 : CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:L/A:N\n\nNEW ISSUE in this toolkit run:\n        HTTP response headers should not be vulnerable to injection attacks: tool [Demo SonarQube]:     Risk $81,000\n        CVSS : 8.2 : CVSS:3.0/AV:N/AC:H/PR:L/UI:N/S:C/C:H/I:H/A:N\n\n    New risk in this tookit run    = $215,000\n```\n\n\n## Detailed Info on the Paramaters\n\n\nThe Uleska CLI allows you to perform a number of functions as described below.  These functions will rely on a combination of parameters being passed.\n\n### API Interaction\n\n#### --uleska_host [hosturl]\n\nREQUIRED.  This is the hostname (or hostname and domainname as needed) of the Uleska Platform the CLI script is to invoke the testing or commands on.  For example, if you have the Uleska Platform installed at uleska.example.com, you would set this parameter to https://uleska.example.com/ .  Note the scheme, and the final forward slash are required.\n\n#### --token [token]\n\nREQUIRED.  Provide the API authentication token retrieved for your chosen user.  See the relevant part of the Uleska documentation guide for more information on retrieving auth tokens from the Uleska Platform.\n\n### Identifying the Application and Version to be tested\n\n#### --application_name [name]\n\nThe text name of the application descriptor in the Uleska Platform to be tested.  This must be an exact string match (case sensitive).  Note - if application_name or version_name are supplied to the CLI then any application_id or version_id supplied will be ignored.  You must supply a combination of application_name and application_version to identify the testing toolkit and set up to be tested.\n\n#### --version_name [name]\n\nThe text name of the version descriptor in the Uleska Platform to be tested.  This must be an exact string match (case sensitive).  Note - if application_name or version_name are supplied to the CLI then any applicaiton_id or version_id supplied will be ignored.  You must supply a combination of application_name and application_version to identify the testing toolkit and set up to be tested.\n\n#### --applicaton_id [id]\n\nThe GUID associated with the application descriptor in the Uleska Platform.  This must be an exact string match.  The application ID can be retrieved using the 'get_ids' function of the CLI (see later), or can be viewed in the URL when accessing the application via the Uleska UI (after \"/applications/\").  Note - if application_name or version_name are supplied to the CLI then any applicaiton_id or version_id supplied will be ignored.\n\n#### --version_id [id]\n\nThe GUID associated with the version descriptor in the Uleska Platform.  This must be an exact string match.  The version ID can be retrieved using the 'get_ids' function of the CLI (see later), or can be viewed in the URL when accessing the application via the Uleska UI (after \"/versions/\").  Note - if application_name or version_name are supplied to the CLI then any applicaiton_id or version_id supplied will be ignored.\n\n#### --toolkit_name [name]\n\nThe name of the Toolkit you would like to use in your scan e.g. 'Uleska Code Scan'.  This must be an exact string match (case sensitive).\n\n### Specifying the type of testing to be conducted\n\n#### --test\n\nContacts the Uleska Platform API and invokes the testing toolkit for the application and version specified.  Requires a combination of application_name and version_name to be passed, or the application_id and version_id.  This starts the testing toolkit only, and returns immediately - i.e. runs in NON-BLOCKING mode.  If your pipeline wants to start the testing in one place, and then check the results later, this is the function to use.\n\n#### --test_and_results\n\nContacts the Uleska Platform API and invokes the testing toolkit for the application and version specified, runs in BLOCKING mode, waiting for the testing toolkit to complete, when it then retrieves the results.  Requires a combination of application_name and version_name to be passed, or the application_id and version_id.  This will wait until the toolkit is finished, giving updates as it goes along.  When the toolkit has completed, it will retrieve the results of the latest report and display (as text or JSON, depending on the --print_json flag).  If your pipeline wants to start the testing and hold for the results of the latest tests to be shown, then use this function. Note that any results returned will not have 'invalid issues' displayed or compared (e.g. issues marked as false positives, duplicates, or non-issues).\n\n#### --test_and_compare\n\nContacts the Uleska Platform API and invokes the testing toolkit for the application and version specified, as well as blocking for the testing toolkit to complete, when it then retrieves the latest results and compares those results to the previous results, highlighting any new or fixed issues.  Requires a combination of application_name and version_name to be passed, or the application_id and version_id.  Runs in BLOCKING mode until the toolkit is finished, giving updates as it goes along.  When the toolkit has completed, it will retrieve the results of the latest report, as well as the previous report, and display the differences in risk and issues between those reports (as text or JSON, depending on the --print_json flag).  If you want to know 'what's changed' since the last run through the pipeline, this function will highlight new issues found since the last run, as well as issues fixed.  It'll also show the differences in numbers of issues and risk.  This means you can program automated logic around the testing in your pipeline, e.g. flagging the build or alerting something if the risk or number of issues goes above a specified value, or if issues of type X are found, or based on CVSS, etc. Note that any results returned will not have 'invalid issues' displayed or compared (e.g. issues marked as false positives, duplicates, or non-issues).\n\n#### --latest_results\n\nContacts the Uleska Platform API and only retrieves the results of the latest scan for the application and version specified. Requires a combination of application_name and version_name to be passed, or the application_id and version_id.  If your pipeline wants to start the testing somewhere else, and come back later for the results, this is the way to get those results in a NON-BLOCKING way.  This is the non-blocking equivalent of --test_and_results (only it doesn't kick off the tests). Note that any results returned will not have 'invalid issues' displayed or compared (e.g. issues marked as false positives, duplicates, or non-issues).\n\n#### --compare_latest_results\n\nContacts the Uleska Platform API for the latest, and previous results related to the application and version specified, when it then compares those results to the previous results, highlighting any new or fixed issues.   Requires a combination of application_name and version_name to be passed, or the application_id and version_id.  If your pipeline wants to start the testing somewhere else, and come back later for the results to be compared to see what's changed since the last run, this is the way to get those results in a non-blocking way.  This is the non-blocking equivalent of --test_and_compare (only it doesn't kick off the tests). Note that any results returned will not have 'invalid issues' displayed or compared (e.g. issues marked as false positives, duplicates, or non-issues).\n\n#### --app_stats\n\nContacts the Uleska Platform API to return high level risk and vulnerability data for the entire application, not just specific versions/stages.\n\n\n### SAST Configuration updates\n\n#### --update_sast\n\nFlag to tell the CLI to expect configuration updates for SAST parameters, namely the Git Address, Git username, and/or Git auth token.  If this flag is set, at least --sast_git must be passed.  Note that the CLI SAST config updates can be used to update an existing SAST configuration for a version, it cannot be used to create a new version.\n\n#### --sast_git [gitaddress]\n\nUsed in combination with --update_sast to update the Git Address configuration of the current application and version.  Value will be the full Git URL for the relevant codeline to be tested, e.g. \"https://github.com/org/mycode.git\".  This value will overwrite the existing Git Address configured for this version, equivalent to the 'Git Address' input in the UI.  Note setting this value automatically marks the 'Source Code Origin' flag to 'Git' for this version.\n\n#### --sast_username [username]\n\nUsed in combination with --update_sast to update the Git Username configuration of the current application and version.  Value will be the username required to authenticate to the Git codeline to be tested. This value will overwrite the existing Git Username configured for this version, equivalent to the 'Username' input under 'SCM Authentication' in the UI.\n\n#### --sast_token [token]\n\nUsed in combination with --update_sast to update the Git Password configuration of the current application and version.  Value will be the password or auth token required to authenticate to the Git codeline to be tested. This value will overwrite the existing Git Password configured for this version, equivalent to the 'Password' input under 'SCM Authentication' in the UI.\n\n#### --tools [tools]\n\nUsed in combination with --update_sast to update the SAST toolkit of the current application and version.  Value will be a comma separated list of security tools configured for your testing.  This will overwite the existing toolkit configured.  For a list of tools configured for your environment, use the SecureDesigner/api/v1/tools API to list the tools and details (use the 'title' attribute as the tool name).  Example usage would be (--tools \"Bandit,Dependency Checker,nodejs scan\").\n\n\n### Container Configuration updates\n\n#### --update_container\n\nFlag to tell the CLI to expect configuration updates for container parameters, namely the container image name, container image tag, and possibly the container connection name. If this flag is set, at least --container_image and --container_tag must be passed.  Note that the CLI container config updates can be used to update an existing container configuration for a version, it cannot be used to create a new version.\n\n#### --container_image [name]\n\nUsed in combination with --update_container to update the Container Name configuration of the current application and version.  This value will overwrite the existing Container Name configured for this version, equivalent to the 'Container Name' input under 'Container' tab in the UI.\n\n#### --container_tag [tag]\n\nUsed in combination with --update_container to update the Container Tag configuration of the current application and version.  This value will overwrite the existing Container Tag configured for this version, equivalent to the 'Tag' input under 'Container' tab in the UI.\n\n#### --container_connection [connection]\n\nUsed in combination with --update_container to update the Container Connection configuration of the current application and version.  This value will overwrite the existing Container Connection configured for this version, equivalent to the 'Connection' input under 'Container' tab in the UI.\n\n\n### Risk management\n\n#### --fail_if_issue_risk_over [risk]\n\nUsable with --test_and_results, --test_and_compare, --latest_results, --compare_latest_results.  Causes the CLI to return a failure (exit 1) if any individual issue in the results set returned has a risk value setting over the threshold set.  In the case of test commands that return the latest set of results (--test_and_results, --latest_results) this will cause a failure exit if any value in the latest result set is over the threshold.  In the case of test commands that compare the previous sets of results (--test_and_compare, --compare_latest_results) this will cause a failure exit if any value in the new issues found result set is over the threshold.\n\n\n#### --fail_if_risk_over [risk]\n\nUsable with --test_and_results, --test_and_compare, --latest_results, --compare_latest_results.  Causes the CLI to return a failure (exit 1) if the overall risk returned is over the threshold set.  In the case of test commands that return the latest set of results (--test_and_results, --latest_results) this will cause a failure exit if the risk of all issues in the latest result set is over the threshold.  In the case of test commands that compare the previous sets of results (--test_and_compare, --compare_latest_results) this will cause a failure exit if the combined risk of new issues found result set is over the threshold.\n\n\n#### --fail_if_risk_change_over [percentage]\n\nUsable with --test_and_compare, --compare_latest_results.  Causes the CLI to return a failure (exit 1) if the overall change in risk returned is over the percentage threshold set.  In the case of test commands that compare the previous sets of results (--test_and_compare, --compare_latest_results) this will cause a failure exit if the aggregate change in risk of new issues found result set is over the percentage threshold.\n\n\n#### --fail_if_issues_over [number]\n\nUsable with --test_and_results, --test_and_compare, --latest_results, --compare_latest_results.  Causes the CLI to return a failure (exit 1) if the overall number of issues returned is over the threshold set.  In the case of test commands that return the latest set of results (--test_and_results, --latest_results) this will cause a failure exit if the number of all issues in the latest result set is over the threshold.  In the case of test commands that compare the previous sets of results (--test_and_compare, --compare_latest_results) this will cause a failure exit if the number of new issues found result set is over the threshold.\n\n\n#### --fail_if_issues_change_over [percentage]\n\nUsable with --test_and_compare, --compare_latest_results.  Causes the CLI to return a failure (exit 1) if the overall change in numbers of issues returned is over the percentage threshold set.  In the case of test commands that compare the previous sets of results (--test_and_compare, --compare_latest_results) this will cause a failure exit if the aggregate change in numbers of new issues found result set is over the percentage threshold.\n\n\n#### --fail_if_CVSS_over [CVSS number]\n\nUsable with --test_and_results, --test_and_compare, --latest_results, --compare_latest_results.  Requires an integer number between 0 and 10.  Causes the CLI to return a failure (exit 1) if any individual issue in the results set returned has a CVSS value setting over the threshold set.  In the case of test commands that return the latest set of results (--test_and_results, --latest_results) this will cause a failure exit if any CVSS value in the latest result set is over the threshold.  In the case of test commands that compare the previous sets of results (--test_and_compare, --compare_latest_results) this will cause a failure exit if any CVSS value in the new issues found result set is over the threshold.\n\n\n### Other functions\n\n#### --print_json\n\nUsable with --test_and_results, --test_and_compare, --latest_results, and --compare_latest_results.  Takes the information returned by the Uleska Platform and prints it to stdout in JSON format.\n\n#### --get_ids\n\nHelper function that takes in the --application_name and --version_name and gives the GUIDs associated with each.  Helpful when you don't have access to the UI, or are just to lazy to log in. \n\n#### --debug\n\nTurns on debugging mode within the CLI script.  Nuf said.\n\nFor more details on the usage of the Uleska CLI, view the documentation at https://www.uleska.com\n\n\n# Testing\n\nTo run tests, please run `python3 -m unittest`\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/uleska/uleska-automate",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "uleska-automate",
    "package_url": "https://pypi.org/project/uleska-automate/",
    "platform": null,
    "project_url": "https://pypi.org/project/uleska-automate/",
    "project_urls": {
      "Homepage": "https://github.com/uleska/uleska-automate"
    },
    "release_url": "https://pypi.org/project/uleska-automate/0.12/",
    "requires_dist": [
      "requests"
    ],
    "requires_python": "",
    "summary": "A CLI for the Uleska DevSecOps Platform",
    "version": "0.12",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 14763176,
  "releases": {
    "0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "39851bb79ca115364e2a5bb91936d698faea27318b8d77ba996c8e849f7404fd",
          "md5": "127a7ceabe99266b9587ec1eae73b7ef",
          "sha256": "bc90a5f8b49b9c481fe003e38d01e9948cdff0361c51244e983201f0b425f90a"
        },
        "downloads": -1,
        "filename": "uleska_automate-0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "127a7ceabe99266b9587ec1eae73b7ef",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 22461,
        "upload_time": "2021-06-23T12:54:21",
        "upload_time_iso_8601": "2021-06-23T12:54:21.387572Z",
        "url": "https://files.pythonhosted.org/packages/39/85/1bb79ca115364e2a5bb91936d698faea27318b8d77ba996c8e849f7404fd/uleska_automate-0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.10": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7984d3bc1a832c49ee0727ea620648c3c85476bbf039f0d71209a8dcade1b0f8",
          "md5": "b60837a5fe484142d3a312623c3d4fd2",
          "sha256": "3d0cfea67376f2a9109e99cbc4120d0d3031ca67c8cb63c4806b7e0bdfbe3e5e"
        },
        "downloads": -1,
        "filename": "uleska_automate-0.10-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "b60837a5fe484142d3a312623c3d4fd2",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 38905,
        "upload_time": "2022-08-12T13:44:17",
        "upload_time_iso_8601": "2022-08-12T13:44:17.253562Z",
        "url": "https://files.pythonhosted.org/packages/79/84/d3bc1a832c49ee0727ea620648c3c85476bbf039f0d71209a8dcade1b0f8/uleska_automate-0.10-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.11": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "45646608f9f1e1b8b7d8b989832e03792d3e52261bc0aa48163c5a1c4d1ddd8c",
          "md5": "b105eb4734021609ff9ebd42a897ef25",
          "sha256": "578ff40487f9e2af296537940cc89e0312c39f8ffe7ce479c938f9bb2a08c2ad"
        },
        "downloads": -1,
        "filename": "uleska_automate-0.11-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "b105eb4734021609ff9ebd42a897ef25",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 39002,
        "upload_time": "2022-08-15T09:51:22",
        "upload_time_iso_8601": "2022-08-15T09:51:22.185663Z",
        "url": "https://files.pythonhosted.org/packages/45/64/6608f9f1e1b8b7d8b989832e03792d3e52261bc0aa48163c5a1c4d1ddd8c/uleska_automate-0.11-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.12": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "462769fee255e86f59b2d55e827c5ef9252dfa8bc276f38a13bcf48095d88847",
          "md5": "3664baff0b0543d919f93529238373d8",
          "sha256": "1a06b999f486be86b25245739cd6a6f6725057f5c1294c14e9d16504072274e8"
        },
        "downloads": -1,
        "filename": "uleska_automate-0.12-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "3664baff0b0543d919f93529238373d8",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 38980,
        "upload_time": "2022-08-15T09:57:05",
        "upload_time_iso_8601": "2022-08-15T09:57:05.097182Z",
        "url": "https://files.pythonhosted.org/packages/46/27/69fee255e86f59b2d55e827c5ef9252dfa8bc276f38a13bcf48095d88847/uleska_automate-0.12-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ad80abf4481f1eb5e52b52f52fe3a65078531cadeb580f1bbb852d6d79d4a70a",
          "md5": "936db3a5ef4c0ed456b1548e87eaa10a",
          "sha256": "37c2d810803148c97fed03429f2ba18675ef91c5c809224a8009f6b5554c5e08"
        },
        "downloads": -1,
        "filename": "uleska_automate-0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "936db3a5ef4c0ed456b1548e87eaa10a",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 23159,
        "upload_time": "2021-07-06T18:34:43",
        "upload_time_iso_8601": "2021-07-06T18:34:43.266782Z",
        "url": "https://files.pythonhosted.org/packages/ad/80/abf4481f1eb5e52b52f52fe3a65078531cadeb580f1bbb852d6d79d4a70a/uleska_automate-0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9fa334487c4f8a6d542104233a2555837e9e62617d6099763129e38f16898640",
          "md5": "8ad5c9f040cf0b35d635f7879edef841",
          "sha256": "9050da4478a2f867e4f3d9d4834c33b97c2220574d25ceb6d9648f78d034c8e1"
        },
        "downloads": -1,
        "filename": "uleska_automate-0.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "8ad5c9f040cf0b35d635f7879edef841",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 26859,
        "upload_time": "2021-08-09T12:18:36",
        "upload_time_iso_8601": "2021-08-09T12:18:36.986019Z",
        "url": "https://files.pythonhosted.org/packages/9f/a3/34487c4f8a6d542104233a2555837e9e62617d6099763129e38f16898640/uleska_automate-0.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.4": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "badcff11f9e998a275476ef98cb85474a96211001507a20678cca75ff9487366",
          "md5": "497139abdd04a655b6503108f8971cbd",
          "sha256": "8448f59e874bb14b0482a449a3d39d00f20367230fba5b203f814744dd7aa79b"
        },
        "downloads": -1,
        "filename": "uleska_automate-0.4-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "497139abdd04a655b6503108f8971cbd",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 29565,
        "upload_time": "2021-10-07T14:23:00",
        "upload_time_iso_8601": "2021-10-07T14:23:00.791972Z",
        "url": "https://files.pythonhosted.org/packages/ba/dc/ff11f9e998a275476ef98cb85474a96211001507a20678cca75ff9487366/uleska_automate-0.4-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.5": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d7bad796bef0e309d213f4802df1c82eac1cd9e783d9e01191d99ee01d5cf593",
          "md5": "d8bd1f7c69d78ed6be48853a01258117",
          "sha256": "3e12483afe73120341a754a925053b2eded19ce2640f897af32f0fe81c59bdb5"
        },
        "downloads": -1,
        "filename": "uleska_automate-0.5-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "d8bd1f7c69d78ed6be48853a01258117",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 28773,
        "upload_time": "2022-02-15T14:47:07",
        "upload_time_iso_8601": "2022-02-15T14:47:07.958363Z",
        "url": "https://files.pythonhosted.org/packages/d7/ba/d796bef0e309d213f4802df1c82eac1cd9e783d9e01191d99ee01d5cf593/uleska_automate-0.5-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.6": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a1c83387d6177b2ca95b661ad4f7f8d824c76992ebf11f6f86ab73ac14bdae49",
          "md5": "ef1edcd88db1791386d86137336f4fa5",
          "sha256": "c94a02a6cdafd5b1b94812e062403a6ada3b414ef84c2a20bd742a0a508ce5f5"
        },
        "downloads": -1,
        "filename": "uleska_automate-0.6-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "ef1edcd88db1791386d86137336f4fa5",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 39031,
        "upload_time": "2022-03-09T08:43:49",
        "upload_time_iso_8601": "2022-03-09T08:43:49.617345Z",
        "url": "https://files.pythonhosted.org/packages/a1/c8/3387d6177b2ca95b661ad4f7f8d824c76992ebf11f6f86ab73ac14bdae49/uleska_automate-0.6-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.7": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "378bd7b27fcc02197595af59476960a441048448ff9cb904ad963ca850cb6c4d",
          "md5": "4efaa0009661d77614f498ce5b6e6f8e",
          "sha256": "4162d4891300f4735c26539d68d8dca88ba15fa787faff77f3a16fcaa61ae524"
        },
        "downloads": -1,
        "filename": "uleska_automate-0.7-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "4efaa0009661d77614f498ce5b6e6f8e",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 39228,
        "upload_time": "2022-05-30T16:31:17",
        "upload_time_iso_8601": "2022-05-30T16:31:17.672701Z",
        "url": "https://files.pythonhosted.org/packages/37/8b/d7b27fcc02197595af59476960a441048448ff9cb904ad963ca850cb6c4d/uleska_automate-0.7-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.8": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c07d65026c6033082b13f121e38b539084b85f714a8278f305d31e41566c800b",
          "md5": "9d12520f265d7a7e3570466fb0005ce1",
          "sha256": "14c524f3eef3fba889b3d6cd93731985611a172b72d4f071c411df4d81e02968"
        },
        "downloads": -1,
        "filename": "uleska_automate-0.8-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "9d12520f265d7a7e3570466fb0005ce1",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 33745,
        "upload_time": "2022-08-11T11:48:21",
        "upload_time_iso_8601": "2022-08-11T11:48:21.132617Z",
        "url": "https://files.pythonhosted.org/packages/c0/7d/65026c6033082b13f121e38b539084b85f714a8278f305d31e41566c800b/uleska_automate-0.8-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.9": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "31d3b2a5a8d593dd4d95ae8e4c332626778ccde6758b2ec68062f24993572ff1",
          "md5": "5d13920db7ca83f4c41ecc0e79f90868",
          "sha256": "d771fa178fea4dcf5cb6e79382f8682eb0974e30b87a30e3242c5cb0d1bdba35"
        },
        "downloads": -1,
        "filename": "uleska_automate-0.9-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "5d13920db7ca83f4c41ecc0e79f90868",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 38729,
        "upload_time": "2022-08-11T12:01:42",
        "upload_time_iso_8601": "2022-08-11T12:01:42.716340Z",
        "url": "https://files.pythonhosted.org/packages/31/d3/b2a5a8d593dd4d95ae8e4c332626778ccde6758b2ec68062f24993572ff1/uleska_automate-0.9-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "462769fee255e86f59b2d55e827c5ef9252dfa8bc276f38a13bcf48095d88847",
        "md5": "3664baff0b0543d919f93529238373d8",
        "sha256": "1a06b999f486be86b25245739cd6a6f6725057f5c1294c14e9d16504072274e8"
      },
      "downloads": -1,
      "filename": "uleska_automate-0.12-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "3664baff0b0543d919f93529238373d8",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 38980,
      "upload_time": "2022-08-15T09:57:05",
      "upload_time_iso_8601": "2022-08-15T09:57:05.097182Z",
      "url": "https://files.pythonhosted.org/packages/46/27/69fee255e86f59b2d55e827c5ef9252dfa8bc276f38a13bcf48095d88847/uleska_automate-0.12-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}