{
  "info": {
    "author": "Khaled Ghobashy",
    "author_email": "khaled.ghobashy@live.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 1 - Planning",
      "Intended Audience :: Education",
      "Intended Audience :: Science/Research",
      "License :: OSI Approved :: BSD License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3",
      "Topic :: Scientific/Engineering",
      "Topic :: Scientific/Engineering :: Mathematics",
      "Topic :: Scientific/Engineering :: Physics"
    ],
    "description": "# **URAEUS** | SMBD\n\n**Symbolic Multi-Body Dynamics in Python** | A python package for symbolic creation and analysis of constrained multi-body systems\n\n----------------------\n\n## Description\n\n**uraeus.smbd** is a python package developed for the symbolic creation and analysis of constrained [multi-body systems](https://en.wikipedia.org/wiki/Multibody_system).\n\nA multi-body system is hereby defined as *a finite number of material bodies connected in an arbitrary fashion by mechanical joints that limit the relative motion between pairs of bodies*. Practitioners of multi-body dynamics study the generation and solution of the equations governing the motion of such systems [1].\n\n\n\n### Audience and Fields of Application\n\nInitially, the main targeted audience was the **Formula Student** community. The motive was *encouraging a deeper understanding of the modeling processes and the underlying theories used in other commercial software packages*, which is a way of giving back to the community, and supporting the concept of *\"knowledge share\"* adopted there by exposing it to the open-source community as well.\n\nCurrently, the tool aims to serve a wider domain of users with different usage goals and different backgrounds, such as students, academic researchers and industry professionals.\n\nFields of application include any domain that deals with the study of interconnected bodies, such as:\n\n- Ground Vehicles' Systems.\n- Construction Equipment.\n- Industrial Mechanisms.\n- Robotics.\n- Biomechanics.\n- .. etc.\n\n---------------------------------------------------\n\n\n\n### Features \n\nCurrently, the tool provides:\n\n- Creation of symbolic template-based and stand-alone multi-body systems using minimal API via python scripting.\n- Convenient and easy creation of complex multi-body assemblies.\n- Convenient visualization of the system topology as a network graph.\n- Viewing the system's symbolic equations in a natural mathematical format using Latex printing.\n- Optimization of the system symbolic equations by performing common sub-expressions elimination.\n- Creation of symbolic configuration files to facilitate the process of numerical simulation data entry.\n\n---------------------------------------------------\n\n---------------------------------------------------\n\n## Installation\n\n### Using the tool on [Colab](https://colab.research.google.com)\n\nColaboratory is a free Jupyter notebook environment that requires no setup and runs entirely in the cloud [2]. So, if you do not have an up and running python environment, you still can check out the tool and create multi-body systems seamlessly. \n\nThe *examples* section below, has several ready-to-use Colab notebooks that walks you through a typical modeling process flow.\n\n### Using the tool on your machine.\n\nThe tool needs a valid python 3.6+ environment. If new to scientific computing in python, [Anaconda](https://www.anaconda.com/download/) is a recommended free python distribution from Continuum Analytics that includes SymPy, SciPy, NumPy, Matplotlib, and many more useful packages for scientific computing, which provides a nice coherent platform with most of the tools needed.\n\n#### Git\n\nAs the tool is still under continuous development, cloning this repository is a more versatile way to test and play with it, until a more stable first release is released. This can be done via the following git commands from the command line.\n\n```bash\n$ git clone https://github.com/khaledghobashy/uraeus-smbd.git\n```\n\n```bash\n$ git pull origin master\n```\n\nOr alternatively, download the repository as a **zip** file and extract it on your machine.\n\nTo install the package locally and use it as other python packages, open a terminal or a powershell and `cd` to the package location, then run\n\n```bash\n$ cd path/to/package\n$ pip install -e .\n```\n\n\n\n#### Pip\n\nThe package can be also installed from PyPi using\n\n```bash\n$ pip install uraeus.smbd\n```\n\n\n\n#### Conda\n\n*To Do*\n\n---------------------------------------------------\n\n## Background\n\n#### What is the problem to be solved?\n\nThe primary interest in multi-body dynamics is to analyze the system behavior for given inputs. In analogy with control systems; a multi-body system can be thought as a **_system_** subjected to some **_inputs_** producing some **_outputs_**. These three parts of the problem are dependent on the analyst end goal of the analysis and simulation. \n\n#### How is the system physics abstracted mathematically?\n\nAn unconstrained body in space is normally defined using 6 generalized coordinates defining its location and orientation. For example, a system of 10 bodies requires 60 generalized coordinates to be fully defined, which in turn requires 60 *independent equations* to be solved for these  _unknown_ generalized coordinates.\n\nThe way we achieve a solution for the system is dependent on the type of study we are performing. Mainly we have **four types** of analysis that are of interest for a given multi-body system. These are:\n\n- **Kinematic Analysis**</br>\n  *\"How does the whole system move if we moved this particular body ?\"*\n- **Inverse Dynamic Analysis**</br>\n  *\"What are the forces needed to achieve this motion we just did ?\"*\n- **Equilibrium Analysis**</br>\n  *\"How does the system look if we did nothing ?\"*\n- **Dynamic Analysis**</br>\n  *\"Now we gave it a force, how does it behave ?\"*\n\nEach analysis type -or question- can be modelled by a set of algebraic and/or differential equations that can be solved for the system generalized states (positions, velocities and accelerations). A more detailed discussion of each analysis type will be provided in another documentation.\n\n### Approach\n\nThe philosophy of the tool is to isolate the model creation process form the actual numerical and computational representation of the system that will be used in the simulation process. This is done through the ideas of **symbolic computing** and **code-generation** as well be shown below.\n\n#### Model Creation\n\nThe topology of the system is represented as a multi-directed graph, where each node represents a body and each edge represents a connection between the end nodes, where this connection may represents a joint, actuator or a force element. This serves mainly two aspects:\n\n1. A natural way to create and represent the topology of a given multi-body system.\n2. A convenient way to abstract the system programmatically, where all the topological data of the system are stored in a graph.\n\nThe tool achieves this by making heavy use the [NetworkX](https://networkx.github.io/documentation/stable/index.html) python package to create topology graphs and to construct the governing equations of the system. The equations themselves are represented symbolically using [SymPy](https://www.sympy.org/en/index.html), which is a Python library for symbolic mathematics.\n\nThe combination of both, NetworkX and SymPy, provides the tool with a very simple, easy-to-use and convenient interface for the process of model creation and topology design, where the user only focuses on the validity of the system topology in hand, as he thinks only in terms of the topological components - bodies, joints, actuators and forces-, without the burden of frequent numerical inputs for each component, or how the actual system is configured in space. In short, the tool divide the typical model creation process in halves, the system topology design and the system configuration assignment.\n\n#### Code Generation and Model Simulation\n\nThe process of performing actual simulations on the created model requires the generation of a valid numerical and computational code of the created model. This is done by taking in the symbolic model and create a valid code files written in the desired programming language with the desired programming paradigm and structure.\n\nThese numerical environments are decoupled from this package and developed fairly independently, as each numerical environment is responsible for the translation of the developed symbolic models into valid numerical code and what features it aims to provide for the users.\n\nThe development of such environments in different languages requires a good grasp of several aspects such as :\n\n- Good knowledge of the symbolic models' interfaces and structure.\n- Good knowledge of the target language.\n- Appropriate environment architecture/structure that serves the intended usage requirements.\n- Good knowledge of the available linear algebra and math libraries for that language.\n- Design for minimal dependencies on 3rd parties libraries.\n- Simple API for usage and simple build process for compiled languages.\n\n_**Note**: The development of such environments is discussed in a separate documentation for those interested in developing their own._\n\n#### Conclusion\n\nSeveral benefits of the adopted approach can be stated here, but the major theme here is the flexibility and modularity, in both software usage and software development. These can be summarized as follows:\n\n- The distinction between the topology design phase and the configuration assignment phase, which gives proper focus for each at its' own.\n- Natural adoption of the template-based modeling theme that emerges from the use of network-graphs to represent the system, which allows convenient assemblage of several graphs to form a new system. \n- Uncoupled simulation environment, where the symbolic equations generated form the designed topology is free to be written in any programming language with any desired numerical libraries.\n\n---------------------------------------------------\n\n---------------------------------------------------\n## Usage Examples & Tutorials\n\nThe [uraeus-mbd-projects](https://github.com/khaledghobashy/uraeus_mbd_projects) repository provides a list of well documented working examples that make use of the different uraeus framework parts, symbolic model creation, code-generation, numerical simulation and 3D visualization.\n\n---------------------------------------------------\n\n---------------------------------------------------\n\n### Detailed Example - Spatial Fourbar Mechanism\n\n----------------------------------\nBelow is code sample that walks you through the process of building a standalone symbolic topology and configuration as well as the generation of numerical simulation environments.\n\nThis model will be created as a **standalone** topology and project. What this means is that model topological data is fully encapsulated in one topology graph and no need for any topological data from other external systems, which is the case for **template-based** topologies. This also means that the project files/database is self-contained, unlike the **template-based** topologies that need to be organized in a shared database.\n\n#### Building the Symbolic Topology.\nWe start by importing the ```standalone_topology``` class from the ```systems``` module to create our symbolic model instance.\n```python\nfrom uraeus.smbd.systems import standalone_topology\n\nmodel_name = 'fourbar'\nsym_model = standalone_topology(model_name)\n```\nWe then start  constructing our system by adding the bodies, joints, actuators and forces.\n```python\n# Adding Bodies\nsym_model.add_body('l1')\nsym_model.add_body('l2')\nsym_model.add_body('l3')\n\n# Adding Joints\nsym_model.add_joint.revolute('a', 'ground', 'rbs_l1')\nsym_model.add_joint.spherical('b', 'rbs_l1', 'rbs_l2')\nsym_model.add_joint.universal('c', 'rbs_l2', 'rbs_l3')\nsym_model.add_joint.revolute('d', 'rbs_l3', 'ground')\n\n# Adding Actuators\nsym_model.add_actuator.rotational_actuator('act', 'jcs_a')\n```\nAnd that's it; we have just created a symbolic topology that represents our fourbar mechanism. The topology graph of the system can be visualized by the method ```sym_model.topology.draw_constraints_topology()```\nAlso we can check the number of constraint equations, generalized coordinates and the estimated degrees of freedom of the system.\nTo finalize this step, we call the `assemble()` method to construct the governing equations symbolically then `save` the model.\n\n```python\nsym_model.assemble()\nsym_model.save()\n```\nWe can check the system equations by accessing the appropriate topology attributes.\n```python\n# Position level constraint equations.\nsym_model.topology.pos_equations\n# System Jacobian of the position level constraint equations.\nsym_model.topology.jac_equations\n```\n#### Building the symbolic configuration.\nThe next step is to create a symbolic configuration of our symbolic model, but what is this symbolic configuration? </br>\nYou may have noticed that we did not care explicitly about how our system is configured in space, we did not care about how our bodies or joints are located or oriented or how we can define these configuration parameters, all we cared about is only the topological connectivity. These configuration parameters already got generated automatically based on the used components. For example, the creation of a symbolic body -*body l1* *for example*- generates automatically the following symbolic parameters:\n\n- ```m_rbs_l1```:  body mass.\n- ```Jbar_rbs_l1```: inertia tensor.\n- ```R_rbs_l1```: body reference point location.\n-  ```Rd_rbs_l1```: body translational velocity.\n-  ```Rdd_rbs_l1```: body translational acceleration.\n- ```P_rbs_l1```: body orientation.\n- ```Pd_rbs_l1```: body orientation 1st  rate of change.\n- ```Pdd_rbs_l1```: body orientation 2nd  rate of change.\n\nwhere the ```rbs_``` initial is short for *rigid body single*. If the body is mirrored, the system will create two bodies with the initials ```rbr_``` and ```rbl_``` for right and left respectively.\n\nThe same happens for edges' components -joints, actuators and forces- where each component is responsible for creating its own configuration symbolic parameters.\n\nThese parameters are extracted from the symbolic topology to form the primary configuration layer that represents the needed user inputs for any given simulation. The benefit of the symbolic configuration is that we can construct our own layer of inputs that we desire to use in the numerical simulation and define the relations between these inputs and the primary parameters extracted from the topology components. This is best shown by example.\n\nOur fourbar mechanism is simply visualized as three links and a ground that are connected at four distinct points, **a**, **b**, **c** and **d**. We can simply get directly the numerical values of these points in space much easier than -for example- getting directly the orientation of the two axes used to define the universal joint used to connect **l2** with **l3**. \n\nThe idea is to construct a directed relational graph that maps the required primary configuration to a set of new configuration parameters that may be easier and more convenient to specify directly.\n\nWe start by creating our configuration instance\n```python\nfrom uraeus.smbd.systems import configuration\nsym_config = configuration('%s_cfg'%model_name, sym_model)\n```\nNow we can check the primary configuration parameters extracted the from the symbolic topology by ```sym_config.config.input_nodes``` which returns a list of strings containing the inputs' parameters names.\n\nNow, we create our desired user inputs.\n\n```python\n# Adding the desired set of UserInputs\n# ====================================\n\nsym_config.add_point.UserInput('a')\nsym_config.add_point.UserInput('b')\nsym_config.add_point.UserInput('c')\nsym_config.add_point.UserInput('d')\n\nsym_config.add_vector.UserInput('x')\nsym_config.add_vector.UserInput('y')\nsym_config.add_vector.UserInput('z')\n```\nAfter that, we set the relations between the primary configuration parameters and our custom configuration inputs.\n```python\n# Defining Relations between original topology inputs\n# and our desired UserInputs.\n# ===================================================\n\n# Revolute Joint (a) location and orientation\nsym_config.add_relation.Equal_to('pt1_jcs_a', ('hps_a',))\nsym_config.add_relation.Equal_to('ax1_jcs_a', ('vcs_x',))\n\n# Spherical Joint (b) location and orientation\nsym_config.add_relation.Equal_to('pt1_jcs_b', ('hps_b',))\nsym_config.add_relation.Equal_to('ax1_jcs_b', ('vcs_z',))\n\n# Universal Joint (c) location and orientation\nsym_config.add_relation.Equal_to('pt1_jcs_c', ('hps_c',))\nsym_config.add_relation.Oriented('ax1_jcs_c', ('hps_b', 'hps_c'))\nsym_config.add_relation.Oriented('ax2_jcs_c', ('hps_c', 'hps_b'))\n\n# Revolute Joint (d) location and orientation\nsym_config.add_relation.Equal_to('pt1_jcs_d', ('hps_d',))\nsym_config.add_relation.Equal_to('ax1_jcs_d', ('vcs_y',))\n\n```\n*__Note__: The set of configuration parameters of each component and their naming convention will be discussed in a separate documentation*\n\nThe first line of the above code-block adds a relation that sets the location of joint ```pt1_jsc_a``` to be ```Equal_to``` the user-input location point ```hps_a```, where the fifth line adds a relation that sets the orientation of the first axis of the universal joint ```ax1_jsc_c``` to be ```Oriented``` along the user-input location points ```hps_b``` and ```hps_c```. The rest of the statements follows the same convention.\n\nAn optional and recommended step is to create symbolic geometries and assign these geometries to topology bodies to automatically evaluate the bodies configuration parameters stated earlier. Also this will be used to generate a python-blender script that can be used in blender to create 3D visualizations in blender later.\n```python\n# links radius\nsym_config.add_scalar.UserInput('links_ro')\n\n# Link 1 geometry\nsym_config.add_geometry.Cylinder_Geometry('l1', ('hps_a','hps_b','s_links_ro'))\nsym_config.assign_geometry_to_body('rbs_l1', 'gms_l1')\n\n# Link 2 geometry\nsym_config.add_geometry.Cylinder_Geometry('l2', ('hps_b','hps_c','s_links_ro'))\nsym_config.assign_geometry_to_body('rbs_l2', 'gms_l2')\n\n# Link 3 geometry\nsym_config.add_geometry.Cylinder_Geometry('l3', ('hps_c','hps_d','s_links_ro'))\nsym_config.assign_geometry_to_body('rbs_l3', 'gms_l3')\n```\nThe last step is to export the configuration data into a JSON file that can be used then by other  numerical and visualization environments.\n```python\nsym_config.export_JSON_file()\n```\n---------------------------------------------------\n\n---------------------------------------------------\n\n\n## Roadmap\n\n*To be discussed ...*\n\n\n\n## Implementation Details\n\n*The **Implementation Details** will be provided in a separate documentation and linked here*\n\n\n\n## Theoretical Basis\n\n*The **Theoretical Basis** will be provided in a separate documentation and linked here*\n\n\n\n## Support\n\nAs the tool is developed and maintained by one developer for now, if you have any inquiries, do not hesitate to contact me at khaled.ghobashy@live.com or kh.ghobashy@gmail.com\n\n\n\n## References\n\n[1] : McPhee, J.J. Nonlinear Dyn (1996) 9: 73. https://doi.org/10.1007/BF01833294\n\n[2] : https://colab.research.google.com/notebooks/welcome.ipynb\n\n\n\n## License\n\n**uraeus.smbd** is distributed under the 3-clause BSD license. See the [LICENSE](LICENSE) file for details.\n\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/khaledghobashy/uraeus-smbd",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "uraeus.smbd",
    "package_url": "https://pypi.org/project/uraeus.smbd/",
    "platform": "",
    "project_url": "https://pypi.org/project/uraeus.smbd/",
    "project_urls": {
      "Homepage": "https://github.com/khaledghobashy/uraeus-smbd"
    },
    "release_url": "https://pypi.org/project/uraeus.smbd/0.0.1.dev3/",
    "requires_dist": [
      "sympy (==1.4)",
      "networkx",
      "cloudpickle",
      "matplotlib"
    ],
    "requires_python": ">=3.6",
    "summary": "A python package for symbolic creation and analysis of constrained multi-body systems.",
    "version": "0.0.1.dev3",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 7155258,
  "releases": {
    "0.0.0.dev1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "761ac57ea67d978a23c51c7026c4346e7b8d5609dd282cbc43435cd0267381a2",
          "md5": "f0cccd6619f8f624974314519c2a8f8d",
          "sha256": "d6e777bc6814ad8ccdc72632b8aad2a04b9e258421b8c03935add88364f32f19"
        },
        "downloads": -1,
        "filename": "uraeus.smbd-0.0.0.dev1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "f0cccd6619f8f624974314519c2a8f8d",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 10112,
        "upload_time": "2020-01-14T09:01:15",
        "upload_time_iso_8601": "2020-01-14T09:01:15.621181Z",
        "url": "https://files.pythonhosted.org/packages/76/1a/c57ea67d978a23c51c7026c4346e7b8d5609dd282cbc43435cd0267381a2/uraeus.smbd-0.0.0.dev1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ff13860d45a1a6151a6d0dd9cef19d2deedf59da2b19fda77b445d2c91100965",
          "md5": "3d1268cb09627e5105990bfc5f77d517",
          "sha256": "9a70d964e38ec992fc16206fce3ed632e1e2a3238b0763873357b55b295e5fc2"
        },
        "downloads": -1,
        "filename": "uraeus.smbd-0.0.0.dev1.tar.gz",
        "has_sig": false,
        "md5_digest": "3d1268cb09627e5105990bfc5f77d517",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 48334,
        "upload_time": "2020-01-14T09:02:25",
        "upload_time_iso_8601": "2020-01-14T09:02:25.704351Z",
        "url": "https://files.pythonhosted.org/packages/ff/13/860d45a1a6151a6d0dd9cef19d2deedf59da2b19fda77b445d2c91100965/uraeus.smbd-0.0.0.dev1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.1.dev1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "059d7833680afd1df8f019b49edae7bfd169b164898162b69c4de3e3ba656efa",
          "md5": "8a1f4779ef3335a4ded3310625f9eaa6",
          "sha256": "ee3f867629ae8f78924bc39a82ee98fff08c6eab3e4208d3c8f5b3684792faf7"
        },
        "downloads": -1,
        "filename": "uraeus.smbd-0.0.1.dev1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "8a1f4779ef3335a4ded3310625f9eaa6",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 50528,
        "upload_time": "2020-01-14T14:18:57",
        "upload_time_iso_8601": "2020-01-14T14:18:57.640422Z",
        "url": "https://files.pythonhosted.org/packages/05/9d/7833680afd1df8f019b49edae7bfd169b164898162b69c4de3e3ba656efa/uraeus.smbd-0.0.1.dev1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "ff0cbbef561f3e2fd0e492ed7dca083b2c5b8f3deb82f651ce50344b53ef366f",
          "md5": "2422804d2c242850f299b13c9c42be73",
          "sha256": "1e84ce18fe0a739184113f1ff5f4e8224c7749408184b0f2f61c136c3d9516cf"
        },
        "downloads": -1,
        "filename": "uraeus.smbd-0.0.1.dev1.tar.gz",
        "has_sig": false,
        "md5_digest": "2422804d2c242850f299b13c9c42be73",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 48356,
        "upload_time": "2020-01-14T14:18:59",
        "upload_time_iso_8601": "2020-01-14T14:18:59.605859Z",
        "url": "https://files.pythonhosted.org/packages/ff/0c/bbef561f3e2fd0e492ed7dca083b2c5b8f3deb82f651ce50344b53ef366f/uraeus.smbd-0.0.1.dev1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.1.dev2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a7c8f4d25e5d2c69ed20b4b4626eac87d227e53d584f843523f8bab93e2fc683",
          "md5": "b203a64d7ed64fc10bec6533b0c96511",
          "sha256": "331533648e51d8020791a5dbecb987fad89c3a454f01418252d8fc2bdeacde86"
        },
        "downloads": -1,
        "filename": "uraeus.smbd-0.0.1.dev2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "b203a64d7ed64fc10bec6533b0c96511",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 52527,
        "upload_time": "2020-01-15T14:14:07",
        "upload_time_iso_8601": "2020-01-15T14:14:07.766556Z",
        "url": "https://files.pythonhosted.org/packages/a7/c8/f4d25e5d2c69ed20b4b4626eac87d227e53d584f843523f8bab93e2fc683/uraeus.smbd-0.0.1.dev2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "f082efcf559f979bc954bf3f924610a598532893079e1901ce3c1acb58502147",
          "md5": "bc2100593bc0bb746238026cdd24c7b8",
          "sha256": "f62b8867a1c70e30282378e60f5a9e44a384da561420ad1b50a90cda7905fb92"
        },
        "downloads": -1,
        "filename": "uraeus.smbd-0.0.1.dev2.tar.gz",
        "has_sig": false,
        "md5_digest": "bc2100593bc0bb746238026cdd24c7b8",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 48703,
        "upload_time": "2020-01-15T14:14:09",
        "upload_time_iso_8601": "2020-01-15T14:14:09.758468Z",
        "url": "https://files.pythonhosted.org/packages/f0/82/efcf559f979bc954bf3f924610a598532893079e1901ce3c1acb58502147/uraeus.smbd-0.0.1.dev2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.1.dev3": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "76fae68fadd3283e86339336f575a0bbc19a17a2e3a1f1ea90ce356dd2cc7825",
          "md5": "da012986530a4421e304b2f9f608ab68",
          "sha256": "84e8baae6204a6764ce742bfaa456ec51e969efbe4ed85893907ec351ba817d1"
        },
        "downloads": -1,
        "filename": "uraeus.smbd-0.0.1.dev3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "da012986530a4421e304b2f9f608ab68",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 57730,
        "upload_time": "2020-05-03T07:15:32",
        "upload_time_iso_8601": "2020-05-03T07:15:32.996151Z",
        "url": "https://files.pythonhosted.org/packages/76/fa/e68fadd3283e86339336f575a0bbc19a17a2e3a1f1ea90ce356dd2cc7825/uraeus.smbd-0.0.1.dev3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "32b249649e54de5fd9a47e0f7b6b13113107505ce9967f6373d01113dd923d6e",
          "md5": "45805329e73bdff39c176f31367ac57a",
          "sha256": "2f347861c6a2960959b0d3744e9714dd075d51c53b26b5537009ee13f0ac2d59"
        },
        "downloads": -1,
        "filename": "uraeus.smbd-0.0.1.dev3.tar.gz",
        "has_sig": false,
        "md5_digest": "45805329e73bdff39c176f31367ac57a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 48158,
        "upload_time": "2020-05-03T07:15:35",
        "upload_time_iso_8601": "2020-05-03T07:15:35.769156Z",
        "url": "https://files.pythonhosted.org/packages/32/b2/49649e54de5fd9a47e0f7b6b13113107505ce9967f6373d01113dd923d6e/uraeus.smbd-0.0.1.dev3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "76fae68fadd3283e86339336f575a0bbc19a17a2e3a1f1ea90ce356dd2cc7825",
        "md5": "da012986530a4421e304b2f9f608ab68",
        "sha256": "84e8baae6204a6764ce742bfaa456ec51e969efbe4ed85893907ec351ba817d1"
      },
      "downloads": -1,
      "filename": "uraeus.smbd-0.0.1.dev3-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "da012986530a4421e304b2f9f608ab68",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6",
      "size": 57730,
      "upload_time": "2020-05-03T07:15:32",
      "upload_time_iso_8601": "2020-05-03T07:15:32.996151Z",
      "url": "https://files.pythonhosted.org/packages/76/fa/e68fadd3283e86339336f575a0bbc19a17a2e3a1f1ea90ce356dd2cc7825/uraeus.smbd-0.0.1.dev3-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "32b249649e54de5fd9a47e0f7b6b13113107505ce9967f6373d01113dd923d6e",
        "md5": "45805329e73bdff39c176f31367ac57a",
        "sha256": "2f347861c6a2960959b0d3744e9714dd075d51c53b26b5537009ee13f0ac2d59"
      },
      "downloads": -1,
      "filename": "uraeus.smbd-0.0.1.dev3.tar.gz",
      "has_sig": false,
      "md5_digest": "45805329e73bdff39c176f31367ac57a",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 48158,
      "upload_time": "2020-05-03T07:15:35",
      "upload_time_iso_8601": "2020-05-03T07:15:35.769156Z",
      "url": "https://files.pythonhosted.org/packages/32/b2/49649e54de5fd9a47e0f7b6b13113107505ce9967f6373d01113dd923d6e/uraeus.smbd-0.0.1.dev3.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}