{
  "info": {
    "author": "Felipe Gonzalez & Sebastian Anapolsky",
    "author_email": "",
    "bugtrack_url": null,
    "classifiers": [
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "[![Quality Gate Status](https://sonarcloud.io/api/project_badges/measure?project=EL-BID_UrbanTrips&metric=alert_status)](https://sonarcloud.io/summary/new_code?id=EL-BID_UrbanTrips)\n\n![analytics image (flat)](https://raw.githubusercontent.com/vitr/google-analytics-beacon/master/static/badge-flat.gif)\n\n![analytics](https://www.google-analytics.com/collect?v=1&cid=555&t=pageview&ec=repo&ea=open&dp=/urbantrips/readme&dt=&tid=UA-4677001-16)\n\n\n\n# README\n`urbantrips` es una biblioteca de código abierto que toma información de un sistema de pago con tarjeta inteligente de transporte público y, a través de un procesamiento de la información que infiere destinos de los viajes y construye las cades de viaje para cada usuario, produce matrices de origen-destino y otros indicadores (KPI) para rutas de autobús. El principal objetivo de la librería es producir insumos útiles para la gestión del transporte público a partir de requerimientos mínimos de información. Con sólo una tabla geolocalizada de transacciones económicas proveniente de un sistema de pago electrónico, se podrá generar resultados. Los mismos serán más precisos cuanto más información adicional se incorpore al proceso a través de los archivos opcionales. El proceso elabora las matrices, los indicadores y construye una serie de gráficos y mapas de transporte.\n\nPara una discusión metodológica de como se imputan destinos y se construye la matriz de origen y destino se puede consultar este documento:\n\n![Documento Metodológico](https://github.com/EL-BID/UrbanTrips/blob/dev/Metodologia_UrbanTrips.pdf \"Documento metodológico\")\n\nCon `urbantrips` se pueden procesar en una corrida información de transacciones correspondientes a más de un día. Sin embargo, no se puede dividir un mismo día en dos corridas. Toda la información respecto de un día debe procesarse en la misma corrida. Si es demasiada información, conviene separarla en diversos archivos donde cada uno siempre tenga la totalidad de la información de los días a analizar (por ej. `lunes.csv`, `martes.csv` o `semana1.csv`, `semana2.csv` pero no `lunes_a.csv`, `lunes_b.csv`). Luego en otras corridas pueden procesarse otros días y la información se irá actualizando en las bases correspondientes.\n\nLos resultados se guardarán en dos bases de `SQLite`, una para los datos de las etapas, viajes y otros que se van actualizando a medida que se ingresan nuevos datos, y otra base de insumos para información que no se actualiza con tanta periodicidad (como por ejemplo la matriz de las distancias entre puntos fijos de una ciudad). En el siguiente apartado se muestra como configurar el proceso, qué archivos tomará `urbantrips` para producir la información y en qué bases se guardarán los resultados.\n\n## Insumos necesarios y opcionales\nUrbantrips requiere sólo 2 insumos indispensables:\n- Un archivo csv con las transacciones del sistema de pago con tarjeta\n- Un archivo de configuración: `configuraciones_generales.yaml`\n\nEl archivo csv con las transacciones debe tener los siguientes campos obligatorios (los nombres pueden ser diferentes y esto se configura en el archivo configuraciones_generales.yaml):\n- \t`fecha_trx`: campo que indica la fecha de la transacción.\n- \t`hora_trx`: solo es obligatorio cuando el campo fecha incluye solo el día, sin información de la hora y minutos.\n-\t`id_tarjeta_trx`: un id único para cada tarjeta para cada día.\n-\t`id_linea_trx`: un id único para cada linea de transporte\n-\t`orden_trx`: un entero secuencial que establezca el orden de transacciones para una misma tarjeta en el día. Solo el obligatorio cuando el campo fecha incluye solo el día o el día y hora, sin información a nivel de minutos.\n-\t`latitud_trx`: Latitud de la transacción.\n-\t`longitud_trx`: Longitud de la transacción.\n\nAl correr el proceso general de `urbantrips`, éste tomará el archivo de configuración que le dirá qué archivo csv contiene la información con los datos de las transacciones a utilizar en esta corrida. En el directorio de trabajo podrá haber diversos archivos con datos de diferentes días o periodos de tiempo (`lunes.csv`, `martes.csv` o `enero.csv`, `febrero.csv`). Cada uno será procesado en una corrida por vez. Qué archivo utilizar se configura en `configuraciones_generales.yaml` en el parámetro `nombre_archivo_trx:`. En ese mismo archivo se configuran otros parámetros, como así también las bases donde los resultados se irán guardando. Para más detalles sobre cómo utilizar este archivo de configuración consulte el apartado [Seteo del archivo de configuración](#seteo-del-archivo-de-configuracion). \n\nCon sólo esos archivos podrá correr el proceso de imputación de destinos, construcción de matrices OD y elaboración de KPIs. Dicho eso, se obtendrán más resultados y con mayor precisión si se suman estos archivos opcionales:\n\n- Tabla con información de las líneas y/o ramales de transporte público (nombre de fantasía, etc).\n- Cartografía de los recorridos de las líneas de transporte público\n- Cartografía de las zonificaciones con las unidades espaciales utilizadas para agregar datos para la matriz OD\n- Tabla de GPS con el posicionamiento de las unidades\n\n\nEl esquema de datos de estos archivos se especifica en el apartado [Esquema de datos](#Esquema-de-datos).\n\n## Aclaración sobre el concepto de lineas y ramales en urbantrips\nUna linea de transporte público puede tener un recorrido principal en torno al cual hay pequeñas variantes. Estas son consideradas ramales dentro de una misma linea. En muchas ciudades no existen estas diferencias y cada recorrido tiene un nombre y id únicos. Pero en otras no es así. A su vez, puede darse una situación donde una persona utiliza por ej el metro, subiendo a la estación del recorrido A y bajarse en el recorrido B, sin que ese transbordo sea identificado como transacción en la tarjeta. Por lo tanto, para imputar el destino consideramos como puntos de descenso posible todas las estaciones del metro. En este caso, el metro funcionará como una única línea y cada recorrido un ramal dentro del mismo. También puede suceder que una linea de autobuses tenga varios ramales, pero no siempre se identifica en los datos el ramal que realmente dicho interno está recorriendo. Con lo cual podría ser cualquier recorrido de cualquiera de los ramales y al imputar el destino deberiamos considerar todas las estaciones potenciales de toda esa linea de autobus. Esta forma de tratar a las líneas y ramales permite que `urbantrips` se acomode a estas situaciones. \n\nSi en una ciudad no existen estas situaciones, simplemente se utiliza la linea para identificar cada recorrido. Si alguna de las situaciones que se identificaron aquí se presenta en una ciudad, se puede utilizar ese criterio de linea y ramal que debe estar de ese modo en la tabla de transacciones a utilizar. La diferencia fundamental es que el proceso de imputación de destinos considerará como posible punto de destino todas las estaciones de la linea y no del ramal.\n\n## Seteo del archivo de configuración \n\nEl archivo de configuración (`configuraciones_generales.yaml`) es único. Cada corrida leerá la información que hay en este archivo. Su contenido puede editarse entre corrida y corrida para, por ejemplo, procesar dos días diferentes. \n\nEl primer parámetro `resolucion_h3` establece el nivel de resolución del esquema [H3](https://h3geo.org/) con el que se va a trabajar. La resolucion 8 tiene hexágonos de 460 metros de lado. En la resolucion 9 tienen 174 metros y en la 10 tienen 65 metros.\n\nEl segundo es el prámetro principal, el nombre del archivo que contiene la información de las transacciones. El mismo deberá localizarse en `/data/data_ciudad/` (más información sobre la [estructura de directorios](#estructura-de-directorios)). Esta parte del archivo de configuración permite especificar el nombre del archivo a utilizar como así también los nombres de los atributos tal cual aparecen en el csv para que puedan ser guardados en el esquema de datos de `urbantrips`.\n```\nresolucion_h3: 8\nnombre_archivo_trx: semana1.csv\n\nnombres_variables_trx:\n\tid_trx: id\n\tfecha_trx: fecha\n\tid_tarjeta_trx: id_tarjeta\n\tmodo_trx: modo\n\thora_trx: hora\n\tid_linea_trx: id_linea\n\tid_ramal_trx:  \n\tinterno_trx: interno_bus\n\torden_trx: etapa_red_sube\n\tlatitud_trx: lat\n\tlongitud_trx: lon\n\tfactor_expansion:  \n```\nEl siguiente conjunto de parámetros de configuración definen el procesamiento de las transacciones.\n- `formato_fecha`: especifica el formato en el que se encuentra el campo `fecha_trx` (por ej. `\"%d/%m/%Y\"`, `\"%d/%m/%Y %H:%M:%S\"`)\n- `columna_hora`: Indica si la información sobre la hora está en una columna separada (`hora_trx`). Este debe ser un entero de 0 a 23.\n- `ordenamiento_transacciones`: El criterio para ordenar las transacciones en el tiempo. Si se cuenta con un timestamp completo con horas y minutos, entonces usar `fecha_completa`. Si solo se cuenta con la información del día y la hora, se puede usar `orden_trx`.   \n- `ventana_viajes`: Cuando se tiene un timestamp completo, indica la ventana de tiempo en minutos para considerar que las etapas se agrupan en un mismo viaje.  \n- `ventana_duplicado`: Cuando se tiene un timestamp completo, indica la ventana de tiempo en minutos para considerar que dos transacciones son simultaneas, por lo se creará un `id_tarjeta` ad hoc a cada una.\n- `tipo_trx_invalidas`: Especifica primero el nombre del atributo tal cual aparece en el csv y luego los valores que deben eliminarse al no representar transacciones vinculadas a viajes (por ej. carga de salgo, errores del sistema). Se pueden especificar varios atributos y varios valores por atributo.\n- `modos`: urbantrips estandariza en 5 categorias (`autobus`,`tren`,`metro`,`tranvia` y `brt`) los modos. Debe pasarse el equivalente a cómo aparece categorizado en el csv cada modo.  \n- `filtro_latlong_bbox`: Establece un box para elminar rápidamente las transacciones que esten geolocalizadas fuera de una área lógica de cobertura del sistema de transporte público.\n```\nformato_fecha: \"%d/%m/%Y\"\ncolumna_hora: True\nordenamiento_transacciones: orden_trx #fecha_completa u orden_trx\nventana_viajes: 120\nventana_duplicado: 5\n\ntipo_trx_invalidas:\n\ttipo_trx_tren:\n    \t- 'CHECK OUT SIN CHECKIN'\n    \t- 'CHECK OUT'\n\nmodos:\n\tautobus: COL\n\ttren: TRE\n\tmetro: SUB\n\ttranvia:\n\tbrt:\n\nfiltro_latlong_bbox:\n\tminx: -59.3\n\tminy: -35.5\n\tmaxx: -57.5\n\tmaxy: -34.0\n\n```\nEl siguiente grupo de configuraciones nombra las dos bases de datos con las que trabaja `urbantrips`. `alias_db_data` guardará todo lo realtivo a etapas, viajes y toda información que se actualiza con cada corrida. Así, puede haber una base de `data` para cada semana o cada mes a medida que alcance un volumen determinado (`amba_2023_semana1`, `amba_2023_semana2`,etc). Por su lado, `alias_db_insumos` es una base de datos que guardará información de manera constante y servirá tanto para los datos de la semana 1 como los de la semana 2. \n\n```\nalias_db_data: amba_2023_semana1\nalias_db_insumos: amba_2023\n```\nEste parámetro se utiliza para cuando existe una tabla separada con GPS que contenga el posicionamiento de los internos. En ese caso, se gelocalizará cada transacción en base a la tabla GPS, uniendo por `id_linea` e `interno` (haciendo a este campo obligatorio) y minimizando el tiempo de la transacción con respecto a la transacción gps del interno de esa linea. Para eso el campo `fecha` debe estar completo con dia, hora y minutos. Esto hace obligatoria la existencia de un csv con la información de posicionamiento de los gps. Su nombre y atributos se especifican de modo similar a lo hecho en transacciones. La existencia de la tabla GPS permitira calcular KPI adicionales como el IPK.\n\n```\ngeolocalizar_trx: True\n\nnombre_archivo_gps: gps_semana1.csv\nnombres_variables_gps:\n    id_gps: \n    id_linea_gps: idlinea\n    id_ramal_gps: c_ld_Id\n    interno_gps: interno\n    fecha_gps: date_time\n    latitud_gps: latitude   \n    longitud_gps: longitude\n\n```\nEste otro grupo de parámetros controla el método de imputación de destinos. Por un lado establece el criterio de tolerancia de la distancia entre la siguiente transaccion de esa tarjeta y alguna parada de la linea utilizada en la etapa a la que se está imputando el destino. Si la distancia es mayor a esta tolerancia, no se imputará destino. El parametro  `imputar_destinos_min_distancia` establece si se imputará la siguiente transacción como destino o la parada de la linea utilizada en la etapa que minimice la distancia con respecto a la siguiente transacción.\n\n```\ntolerancia_parada_destino: 2200\nimputar_destinos_min_distancia: True\n```\nPor último, se pueden especificar tablas adicionales de utilidad para el proceso. Por un lado se puede agregar metadata para las lineas, como por ejemplo su nombre de fantasía ademas del id correspondiente, o a qué empresa pertenece.  La misma puede identificar una linea o una linea-ramal (siendo los ramales pequeñas desviaciones con respecto a un recorrido principal). En este último caso `urbantrips` creara dos tablas diferentes, una para la metadata de las lineas y otra para la de ramales. \n\nTambien permite agregar cartografías como los recorridos, que deben ser una única Linestring en 2d (no permite multilineas), o diferentes archivos con unidades espaciales para las que se quiere agregar datos. Para cada archivo debe indicarse el nombre del atributo que contiene la información y, de ser necesario, un orden en el que se quiera producir las matrices OD que genera `urbantrips`. \n```\nnombre_archivo_informacion_lineas: lineas_amba.csv\ninformacion_lineas_contiene_ramales: True\nrecorridos_geojson: recorridos_amba.geojson\n\nzonificaciones:\n\tgeo1: hexs_amba.geojson\n\tvar1: Corona\n\torden1: ['CABA', 'Primer cordón', 'Segundo cordón', 'Tercer cordón', 'RMBA']\n\tgeo2: hexs_amba.geojson\n\tvar2: Partido\n```\n\n## Esquema de datos\n### Transacciones\n| Campo | Tipo de dato | Descripción |\n| -- | -- | -- |\n| `id_trx` | int | Opcional. Id único que identifique cada registro. |\n| `fecha_trx` | strftime | **Obligatorio**. Timestamp de la transaccion. Puede ser solo el día o el dia, hora y minuto.|\n| `id_tarjeta_trx` | int/str | **Obligatorio**. Un id que identifique a cada tarjeta. |\n| `modo_trx` | str | Opcional. Se estandarizará con lo especificado en `modos` en el archivo de configuración. Si no hay información en la tabla, se imputará todo como `autobus`. |\n| `hora_trx` | int | Opcional a menos que `fecha_trx` no tenga información de la hora y minutos. Entero de 0 a 23 indicando la hora de la transacción. |\n| `id_linea_trx` | int | **Obligatorio**. Entero que identifique a la linea.  |\n| `id_ramal_trx` | int | Opcional. Entero que identifique al ramal. |\n| `interno_trx` | int | **Obligatorio**. Entero que identifique al interno |\n| `orden_trx` | int | Opcional a menos que `fecha_trx` no tenga información de la hora y minutos. Entero comenzando en 0 que esatblezca el orden de transacciones para una misma tarjeta en un mismo día. |\n| `latitud_trx` | float | **Obligatorio**. Latitud de la transacción. |\n| `longitud_trx` | float | **Obligatorio**. Longitud de la transacción. |\n| `factor_expansion` | float | Opcional. Factor de expansión en caso de tratarse de una muestra. |\n\n### GPS\n| Campo | Tipo de dato | Descripción |\n| -- | -- | -- |\n|`id_gps`|int|  **Obligatorio**. Id único que identifique cada registro. |\n|`id_linea_gps`|int|**Obligatorio**. Id único que identifique la linea.|\n|`id_ramal_gps`|int|**Obligatorio si hay ramales**. Id único que identifique cada ramal.|\n|`interno_gps`|int|**Obligatorio**. Id único que identifique cada interno.|\n|`fecha_gps`|strftime|**Obligatorio**. Dia, hora y minuto de la posición GPS del interno.|\n|`latitud_gps`|float|**Obligatorio**. Latitud.| \n|`longitud_gps`|float|**Obligatorio**. Longitud.|\n    \n    \n### Información lineas\n| Campo | Tipo de dato | Descripción |\n| -- | -- | -- |\n|`id_linea`|int|**Obligatorio**. Entero que identifique a la linea.|\n|`nombre_linea`|str|**Obligatorio**. Nombre de la línea.|\n|`modo`|str|**Obligatorio**. Modo de la linea.|\n|`id_ramal`|int|Opcional.Entero que identifique al ramal.|\n|`nombre_ramal`|str|Opcional. Nombre del ramal.|\n|`empresa`|str|Opcional. Nombre de la empresa.|\n|`descripcion`|str|Opcional. Descripción adicional de la linea o ramal.|\n\n### Recorridos lineas\n| Campo | Tipo de dato | Descripción |\n| -- | -- | -- |\n|`id_linea`|int|**Obligatorio**. Entero que identifique a la linea.|\n|`nombre_linea`|str|**Obligatorio**. Nombre de la línea.|\n| `geometry`|2DLineString|Polilinea del recorrido. No puede ser multilinea|\n\n\n## Estructura de directorios\nAl clonar `urbantrips` y correrlo, dejará la siguiente estructura de directorios:\n```\nurbantrips\n│   README.md\n│\n└─── urbantrips\n│   ...\n└─── configs\n│   │   configuraciones_generales.yaml\n│   │   \n└─── data \n│   └─── db\n│       │  amba_2023_semana1_data\n│       │  amba_2023_semana2_data\n│       │  amba_2023_insumos\n│       \n│   └─── data_ciudad\n│       │   semana1.csv\n│       │   semana2.csv\n│       │   lineas_amba.csv\n│       │   hexs_amba.geojson\n│       │   ...\n└─── resultados \n│   └─── data\n│       │   amba_2023_semana1_etapas.csv\n│       │   amba_2023_semana1_viajes.csv\n│       │   amba_2023_semana1_usuarios.csv\n│       │   amba_2023_semana2_etapas.csv\n│       │   amba_2023_semana2_viajes.csv\n│       │   amba_2023_semana2_usuarios.csv\n│   └─── html\n│       │   ...\n│   └─── matrices\n│       │   ...\n│   └─── pdf\n│       │   ...\n│   └─── png\n│       │   ...\n│   └─── tablas\n```\n\n## Configuración del ambiente\n```\nvirtualenv venv --python=python3.10\nsource venv/bin/activate\npip install git+https://github.com/EL-BID/UrbanTrips.git@dev\n```\n\n## Primeros pasos\nUna vez creado el ambiente, puede descargar el [dataset de transacciones SUBE de AMBA](https://media.githubusercontent.com/media/EL-BID/Matriz-Origen-Destino-Transporte-Publico/main/data/transacciones.csv), guardarlo en `data/data_ciudad/transacciones.csv`. Este dataset no cuenta con un campo `fecha` con el formato `dd/mm/aaaa`, deberá agregar con una fecha cualquiera y utilizar las configuraciones especificadas más abajo. Por último ejecutar:\n```\npython urbantrips/run_urbantrips.py\n```\n\n\n### Configuraciones\n```yaml\ngeolocalizar_trx: False\nresolucion_h3: 8\n#tolerancia parada destino en metros\ntolerancia_parada_destino: 2200\n\nnombre_archivo_trx: transacciones.csv\n\nalias_db_data: amba\n\nalias_db_insumos: amba\n\nnombre_archivo_informacion_lineas:\ninformacion_lineas_contiene_ramales: False\n\nimputar_destinos_min_distancia: True\n\n#ingresar el nombre de las variables\nnombres_variables_trx:\n    id_trx: id\n    fecha_trx: fecha \n    id_tarjeta_trx: id_tarjeta\n    modo_trx: modo\n    hora_trx: hora\n    id_linea_trx: id_linea\n    id_ramal_trx:  id_ramal\n    interno_trx: interno_bus\n    orden_trx: etapa_red_sube \n    latitud_trx: lat \n    longitud_trx: lon\n    factor_expansion:   \n    \nmodos:\n    autobus: COL\n    tren: TRE\n    metro: SUB\n    tranvia:\n    brt:\n     \nrecorridos_geojson:\n\n\n# Filtro de coordenadas en formato minx, miny, maxx, maxy \nfiltro_latlong_bbox:\n    minx: -59.3\n    miny: -35.5\n    maxx: -57.5\n    maxy: -34.0 \n\n    \n#Especificar el formato fecha\nformato_fecha: \"%d/%m/%Y\"\n\ncolumna_hora: True \nordenamiento_transacciones: orden_trx \n\n\ntipo_trx_invalidas:\n    tipo_trx_tren:\n        - 'CHECK OUT SIN CHECKIN'\n        - 'CHECK OUT'\n```  \n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/EL-BID/UrbanTrips",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "urbantrips",
    "package_url": "https://pypi.org/project/urbantrips/",
    "platform": null,
    "project_url": "https://pypi.org/project/urbantrips/",
    "project_urls": {
      "Homepage": "https://github.com/EL-BID/UrbanTrips"
    },
    "release_url": "https://pypi.org/project/urbantrips/0.1.0/",
    "requires_dist": [
      "openpyxl",
      "osmnx",
      "contextily",
      "h3 (<4)",
      "mapclassify",
      "weightedstats",
      "pyyaml",
      "pysal",
      "folium",
      "IPython",
      "matplotlib-scalebar",
      "mycolorpy"
    ],
    "requires_python": ">=3.10",
    "summary": "A library to process public transit smart card data.",
    "version": "0.1.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17097522,
  "releases": {
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "8d0f94afc27cc38ff4cd439a07a3bee975ad0f9ada43bd666fe4b68581240ee8",
          "md5": "2bc8723f3d1a346cc5ee0376493b37c6",
          "sha256": "05c5d3fc162e346d6be155bccf9fa3fc70500a517e493c719f6af3fe509c3a10"
        },
        "downloads": -1,
        "filename": "urbantrips-0.1.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "2bc8723f3d1a346cc5ee0376493b37c6",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.10",
        "size": 68244,
        "upload_time": "2023-02-28T15:53:06",
        "upload_time_iso_8601": "2023-02-28T15:53:06.255270Z",
        "url": "https://files.pythonhosted.org/packages/8d/0f/94afc27cc38ff4cd439a07a3bee975ad0f9ada43bd666fe4b68581240ee8/urbantrips-0.1.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "de95324a07700e3bc9e3c8c9f261efbfc7ff62b8439aa5985484dfb930f77d85",
          "md5": "22b183fb47022eb2c2f8ef41104a869c",
          "sha256": "0c2ff3ce6a934f0e7c181768a45c99e0fb27e6d23e7f78f365f252d6ef2d103f"
        },
        "downloads": -1,
        "filename": "urbantrips-0.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "22b183fb47022eb2c2f8ef41104a869c",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.10",
        "size": 68076,
        "upload_time": "2023-02-28T15:53:08",
        "upload_time_iso_8601": "2023-02-28T15:53:08.447537Z",
        "url": "https://files.pythonhosted.org/packages/de/95/324a07700e3bc9e3c8c9f261efbfc7ff62b8439aa5985484dfb930f77d85/urbantrips-0.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "8d0f94afc27cc38ff4cd439a07a3bee975ad0f9ada43bd666fe4b68581240ee8",
        "md5": "2bc8723f3d1a346cc5ee0376493b37c6",
        "sha256": "05c5d3fc162e346d6be155bccf9fa3fc70500a517e493c719f6af3fe509c3a10"
      },
      "downloads": -1,
      "filename": "urbantrips-0.1.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "2bc8723f3d1a346cc5ee0376493b37c6",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.10",
      "size": 68244,
      "upload_time": "2023-02-28T15:53:06",
      "upload_time_iso_8601": "2023-02-28T15:53:06.255270Z",
      "url": "https://files.pythonhosted.org/packages/8d/0f/94afc27cc38ff4cd439a07a3bee975ad0f9ada43bd666fe4b68581240ee8/urbantrips-0.1.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "de95324a07700e3bc9e3c8c9f261efbfc7ff62b8439aa5985484dfb930f77d85",
        "md5": "22b183fb47022eb2c2f8ef41104a869c",
        "sha256": "0c2ff3ce6a934f0e7c181768a45c99e0fb27e6d23e7f78f365f252d6ef2d103f"
      },
      "downloads": -1,
      "filename": "urbantrips-0.1.0.tar.gz",
      "has_sig": false,
      "md5_digest": "22b183fb47022eb2c2f8ef41104a869c",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.10",
      "size": 68076,
      "upload_time": "2023-02-28T15:53:08",
      "upload_time_iso_8601": "2023-02-28T15:53:08.447537Z",
      "url": "https://files.pythonhosted.org/packages/de/95/324a07700e3bc9e3c8c9f261efbfc7ff62b8439aa5985484dfb930f77d85/urbantrips-0.1.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}