{
  "info": {
    "author": "Carl Oscar Aaro",
    "author_email": "hello@carloscar.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 3 - Alpha",
      "Intended Audience :: Developers",
      "License :: OSI Approved :: MIT License",
      "Programming Language :: Python",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.10",
      "Programming Language :: Python :: 3.11",
      "Programming Language :: Python :: 3.7",
      "Programming Language :: Python :: 3.8",
      "Programming Language :: Python :: 3.9",
      "Topic :: Software Development",
      "Topic :: Software Development :: Libraries",
      "Typing :: Typed"
    ],
    "description": "# `utcnow`\n[![pypi](https://badge.fury.io/py/utcnow.svg)](https://pypi.python.org/pypi/utcnow/)\n[![Made with Python](https://img.shields.io/pypi/pyversions/utcnow)](https://www.python.org/)\n[![Type hinted - mypy validated](https://img.shields.io/badge/typehinted-yes-teal)](https://github.com/kalaspuff/utcnow)\n[![MIT License](https://img.shields.io/github/license/kalaspuff/utcnow.svg)](https://github.com/kalaspuff/utcnow/blob/master/LICENSE)\n\n*Timestamps as RFC 3339 (Date & Time on the Internet) formatted strings with conversion functionality from other timestamp formats or for timestamps on other timezones. Additionally converts timestamps from datetime objets and other common date utilities. Follow modern practices when developing API interfaces.*\n\n```python\nfrom utcnow import utcnow\n\nutcnow.get()\n# \"2077-03-01T09:33:07.139361Z\" | The most common use case – get current server time.\n#                               | Always uses UTC in the returned value.\n\nutcnow.get(\"2020-02-26 09:10:10+00:00\")\n# \"2020-02-26T09:10:10.000000Z\" | Reformats any valid date-time input to a defined standard.\n#                               | RFC 3339 compliant: YYYY-MM-DDTHH:mm:ss.ffffffZ\n\nutcnow.get(\"1997-08-04T02:14:00.53-04:00\")\n# \"1997-08-04T06:14:00.530000Z\" | Timezones as UTC for aligned and clean interfaces.\n#                               | Uses \"Z\", Zulu Time, to specify UTC timezone.\n\nutcnow.get(\"1989-12-13 08:35 UTC\")\n# \"1989-12-13T08:35:00.000000Z\" | Converts from different input formats and patterns.\n#                               | Any other RFC 3339 compliant input is valid + more.\n\n# 👋 Look further down for additional code examples of other types of input values.\n```\n\n## The elevator pitch – purpose for developers – the why\n\n##### NOTE – OPINIONATED SOFTWARE\n\n**`utcnow` is opinionated about the format of string based timestamps. For example, that timestamps as strings should be stored using the same formatting and preferably using the same length, as well as adhering to the current best practices – which for computer-to-computer comms should be by following [\"RFC 3339 (Date and Time on the Internet: Timestamps)\"](https://tools.ietf.org/html/rfc3339).**\n\n##### TIMESTAMPS WILL USE UTC\n\n**String based timestamps that are meant for logs, API responses and database records shall always be stored with timezone UTC.**\n\n----\n\n> **Someone – somewhere:**\n> \"Why UTC? It's not even a timezone for our markets.\"\n\n> **Devs (and wikipedia):**\n> \"_Coordinated Universal Time_ or _Universal Time Coordinated_, UTC for short, is still currently _the primary time standard_ and is not affected by daylight saving time, which is usually not something that servers or software developers would want to work around.\"\n>\n> \"It's pretty simple – modern internet applications shouldn't use any other timezone in their databases, logs, API:s or other computer to computer interfaces.\"\n\n----\n\nGood timestamps and UTC – really no wild and crazy opinions. Generailly this lib is just about making it ~easier to follow common best practices~ harder to do something wrong – and that's also why `utcnow` doesn't have any configuration options. The library does what it should do – \"shoganai\".\n\n##### RULES FOR RETURNED TIMESTAMPS\n\n**The following ruleset are applied to timestamps returned by `utcnow` when requesting a string based format:**\n\n* Timestamps follow RFC 3339 (Date and Time on the Internet: Timestamps): https://tools.ietf.org/html/rfc3339.\n* Timestamps are converted to UTC timezone which we'll note in the timestamp with the \"Z\" syntax instead of the also accepted \"+00:00\". \"Z\" stands for UTC+0 or \"Zulu time\" and refers to the zone description of zero hours.\n* Timestamps are expressed as a date-time, including the full date (the \"T\" between the date and the time is optional in RFC 3339 (but not in ISO 8601) and usually describes the beginning of the time part.\n* Timestamps are 27 characters long in the format: \"YYYY-MM-DDTHH:mm:ss.ffffffZ\". 4 digit year, 2 digit month, 2 digit days. \"T\", 2 digit hours, 2 digit minutes, 2 digit seconds, 6 fractional second digits (microseconds -> nanoseconds), followed by the timezone identifier for UTC: \"Z\".\n\n`utcnow` is defined to return timestamps with 6 fractional second digits, which means timestamps down to the microsecond level. Having a six-digit fraction of a second is currently the most common way that timestamps are shown at this date.\n\nWhen using a fixed length return value for string based timestamps it'll even make the returned strings comparable to each other.\n\n\n### Where to use this – for what kind of applications or interfaces\n\nSome examples of timestamps where this formatting would be reasonable to use includes, but are not limited to any timestamp that is written to a database / datastore as a string, also when timestamps are used in log output or used within a JSON response for an API such as a REST or GraphQL based API, maybe even using custom DateTime scalars.\n\nIf any of this sounds like the use-cases within your domains, try `utcnow` out – might do the trick.\n\nIf your work require a complex mix and match back and forth using different timezones even within internal applications (which may be true for legacy systems or on purely domestic use-cases), then go for `arrow`. Also iterating: Modern internet applications shouldn't use any other timezone than UTC in app to app / computer to computer interfaces.\n\nNote that this library is built with backend developers in mind and while these date-time formatted timestamps are more readable than unix timestamps, they still usually shouldn't be used within user interfaces, however since these format of timestamps are so common basically any library will be able to convert back and forth into whatever your human users would expect, to improve readability – useful for frontend applications, app user interfaces, etc. Also, using a standard like this, the frontend devs won't banish you for changing formatting of timestamps within API responses across different services.\n\n\n## Supported input values for timestamp conversion\n\nThis library aims at going for simplicity by being explicit about the choices allowed to make. `utcnow` however allows the conversion methods to be called with the following kind of argument values:\n* RFC 3339 compliant strings, which at the very least must include the full date, but could omit the time part of a date-time, leaving only the date, or by not including the seconds, microseconds or even laving out the timezone information – `utcnow` supports all of the use-cases of RFC 3339 inputs and then converts the input into an even more complete RFC 3339 timestamp in UTC timezone.\n* The most common format for handling dates and datetimes in Python, the builtin `datetime.datetime` object values (both timezone aware values, as well as values that aren't timezone aware, as for which we'll assume UTC).\n* Also supporting object values from other commonly used libraries, such as `arrow`.\n* As a bonus – Unix time, mainly for convinience (`time.time()`) (we have many names for the things we love: epoch time, posix time, seconds since epoch, 2038-bug on 32-bit unsigned ints to time-travel back to the first radio-transmission across the atlantic, there will be movies about this ).\n\n\n## A neat side-effect of defaulted string output – comparison as strings\n\n> If date and time components are ordered from least precise to most precise, then a useful property is achieved.  Assuming that the time zones of the dates and times are the same (e.g., all in UTC), expressed using the same string (e.g., all \"Z\" or all \"+00:00\"), and all times have the same number of fractional second digits, then the date and time strings may be sorted as strings and a time-ordered sequence will result. he presence of optional punctuation would violate this characteristic.\n\nHere follows a few examples of the problems with having to work with mismatching timestamps, even though the four example statements all use RFC 3339 compliant values. For example an API is kind enough for users to submit timestamps as long as they're good enough and for where the backend application has to convert inputs to values good for the cause.\n\n*Matching two dates of different formats using strings won't go well at all. All of the following four string comparisons would've given an opposite result if compared as actual timestamps instead of as strings, where comparison is just alphabetic.*\n\n```python\n\"2022-08-01 23:51:30.000000Z\"          >  \"2022-08-01T13:51:30.000000Z\"          # False 😵\n\"2022-08-01 14:00:10\"                  >  \"2022-08-01T13:51:30.000000Z\"          # False 😵\n\"2022-08-01T14:00:10+01:00\"            >  \"2022-08-01T13:51:30.000000Z\"          # True  😵\n\"2022-08-01T13:51Z\"                    >  \"2022-08-01T13:51:30.000000Z\"          # True  😵\n```\n\n\n*Using `utcnow` on the same set of timestamps, which returns a string value for comparison.*\n\n```python\nfrom utcnow import utcnow\n\nutcnow(\"2022-08-01 23:51:30.000000Z\")  >  utcnow(\"2022-08-01T13:51:30.000000Z\")  # True  🎉\nutcnow(\"2022-08-01 14:00:10\")          >  utcnow(\"2022-08-01T13:51:30.000000Z\")  # True  ✅\nutcnow(\"2022-08-01T14:00:10+01:00\")    >  utcnow(\"2022-08-01T13:51:30.000000Z\")  # False 🥇\nutcnow(\"2022-08-01T13:51Z\")            >  utcnow(\"2022-08-01T13:51:30.000000Z\")  # False 😻\n```\n\n\n*This shown the returned values from the `utcnow` calls, and for what the comparisons is actually evaluated on.*\n\n```python\n\"2022-08-01T23:51:30.000000Z\"          >  \"2022-08-01T13:51:30.000000Z\"          # True  🎉\n\"2022-08-01T14:00:10.000000Z\"          >  \"2022-08-01T13:51:30.000000Z\"          # True  ✅\n\"2022-08-01T13:00:10.000000Z\"          >  \"2022-08-01T13:51:30.000000Z\"          # False 🥇\n\"2022-08-01T13:51:00.000000Z\"          >  \"2022-08-01T13:51:30.000000Z\"          # False 😻\n```\n\n\n## Transformation examples\n\nSome additional examples of timestamps and to what they whould be converted. Thre first three examples are from the RFC document.\n\n```python\nimport utcnow\n\n# This represents 20 minutes and 50.52 seconds after the 23rd hour of April 12th, 1985 UTC.\nutcnow.get(\"1985-04-12T23:20:50.52Z\")           # \"1985-04-12T23:20:50.520000Z\"\n\n# This represents 39 minutes and 57 seconds after the 16th hour of December 19th, 1996 with\n# an offset of -08:00 from UTC (Pacific Standard Time).  Note that this is equivalent to\n# 1996-12-20T00:39:57Z in UTC.\nutcnow.get(\"1996-12-19T16:39:57-08:00\")         # \"1996-12-20T00:39:57.000000Z\"\n\n# This represents the same instant of time as noon, January 1, 1937, Netherlands time.\n# Standard time in the Netherlands was exactly 19 minutes and 32.13 seconds ahead of UTC by\n# law from 1909-05-01 through 1937-06-30.\nutcnow.get(\"1937-01-01T12:00:27.87+00:20\")      # \"1937-01-01T11:40:27.870000Z\"\n\n# Examples of other formats of accepted inputs:\nutcnow.get(\"2021-02-18\")                        # \"2021-02-18T00:00:00.000000Z\"\nutcnow.get(\"2021-02-18 01:00\")                  # \"2021-02-18T01:00:00.000000Z\"\nutcnow.get(\"2021-02-18 03:00+01:00\")            # \"2021-02-18T02:00:00.000000Z\"\nutcnow.get(\"2021-02-18-01:00\")                  # \"2021-02-18T01:00:00.000000Z\"\nutcnow.get(\"2021-02-18+01:00\")                  # \"2021-02-17T23:00:00.000000Z\"\nutcnow.get(\"2021-02-18T23:55\")                  # \"2021-02-18T23:55:00.000000Z\"\nutcnow.get(\"2021-02-18T23:55:10\")               # \"2021-02-18T23:55:10.000000Z\"\nutcnow.get(\"2021-02-18T23:55:10.0\")             # \"2021-02-18T23:55:10.000000Z\"\nutcnow.get(\"2021-02-18T23:55:10.0+05:00\")       # \"2021-02-18T18:55:10.000000Z\"\nutcnow.get(\"2021-02-18T23:55:10.0-05:00\")       # \"2021-02-19T04:55:10.000000Z\"\nutcnow.get(\"2021-02-18T23:55:10.550-05:00\")     # \"2021-02-19T04:55:10.550000Z\"\nutcnow.get(\"2021-02-18 23:55:10.550+05:00\")     # \"2021-02-18T18:55:10.550000Z\"\nutcnow.get(\"2021-02-18 23:55:10.550-01:00\")     # \"2021-02-19T00:55:10.550000Z\"\nutcnow.get(\"2021-02-28 10:10:59.123987+00:00\")  # \"2021-02-28T10:10:59.123987Z\"\nutcnow.get(\"2021-02-28 10:10:59.123987Z\")       # \"2021-02-28T10:10:59.123987Z\"\nutcnow.get(\"2021-02-28 10:10:59.123987 UTC\")    # \"2021-02-28T10:10:59.123987Z\"\n```\n\n\n## Installation\nLike you would install any other Python package, use `pip`, `poetry`, `pipenv` or your weapon of choice.\n```\n$ pip install utcnow\n```\n\n\n## Usage and examples\n\n```python\n# Transform timestamps of many different formats to the same fixed length standard\n\nfrom utcnow import utcnow\nresult = utcnow.get(\"1984-08-01 13:38\")\n# \"1984-08-01T13:38:00.000000Z\"\n```\n\n```python\n# RFC 3339 timestamp as input – dates and datetimes – UTC assumed if tz is left out\n\nfrom utcnow import utcnow\nresult = utcnow.get(\"2077-10-27\")\n# \"2077-10-27T00:00:00.000000Z\"\n```\n\n```python\n# Simple exmple of converting a naive datetime value, assuming UTC\n\nimport datetime\nfrom utcnow import utcnow\ndt = datetime.datetime(1984, 8, 1, 13, 38, 0, 4711)\nresult = utcnow.get(dt)\n# \"1984-08-01T13:38:00.004711Z\"\n\n# for non-tz-aware datetimes, the same result would be returned by both:\n# 1. utcnow.get(dt)\n# 2. dt.strftime(\"%Y-%m-%dT%H:%M:%S.%fZ\")\n```\n\n```python\n# It's also possible to convert datetime values with tz offsets to timestamp strings\n\nimport datetime\nfrom utcnow import utcnow\ntz_EDT = datetime.timezone(offset=datetime.timedelta(hours=-4))\ndt = datetime.datetime(1997, 8, 4, 2, 14, tzinfo=tz_EDT)\nresult = utcnow.get(dt)\n# \"1997-08-04T06:14:00.000000Z\"\n\n# for timezone-aware datetimes, the same result would be returned by both:\n# 1. utcnow.get(dt)\n# 2. dt.astimezone(datetime.timezone.utc).strftime(\"%Y-%m-%dT%H:%M:%S.%fZ\")\n```\n\n```python\n# Vice versa, transforming a timestamp string to a datetime object (with tzinfo set to UTC)\n\nfrom utcnow import utcnow\nresult = utcnow.as_datetime(\"1984-08-01T13:38:00.123450Z\")\n# datetime.datetime(1984, 8, 1, 13, 38, 0, 123450, tzinfo=datetime.timezone.utc)\n```\n\n```python\n# You can even convert your value to a unix timestamp, if that ever would do you any good\n\nfrom utcnow import utcnow\nresult = utcnow.as_unixtime(\"1984-08-01T13:38:00.123450Z\")\n# 460215480.12345\n```\n\n```python\n# And the other way around again, converting from a unix timestamp to our date-time strings\n\nfrom utcnow import utcnow\nresult = utcnow.get(0)\n# \"1970-01-01T00:00:00.000000Z\"\n\nresult = utcnow.get(1614403926.108192)\n# \"2021-02-27T05:32:06.108192Z\"\n```\n\n```python\n# Example using a value from \"arrow\" – a popular date-time Python lib with large featureset\n\nimport arrow\nfrom utcnow import utcnow\nvalue = arrow.get(\"2021-04-30T07:58:30.047110+02:00\")\n# <Arrow [2021-04-30T07:58:30.047110+02:00]>\n\nstr(value)\n# \"2021-04-30T07:58:30.047110+02:00\"\n\nresult = utcnow.get(value)\n# \"2021-04-30T05:58:30.047110Z\"\n\n# the same output as via utcnow can be returned in following ways, also directly arrow:\n# 1. utcnow.get(value)\n# 2. value.to(\"UTC\").strftime(\"%Y-%m-%dT%H:%M:%S.%fZ\")\n```\n\n```python\n# Getting the current server time in UTC as a date-time timestamp string\n\nimport utcnow\nutcnow.utcnow()\n# \"2021-02-18T08:24:48.382262Z\"\n\n# Similar can be accomplished with datetime – these lines returns the same string value:\n# 1. utcnow.utcnow()\n# 2. str(utcnow)\n# 3. str(utcnow.utcnow)\n# 4. utcnow.get()\n# 5. utcnow.utcnow.get()\n# 6. datetime.datetime.utcnow().strftime(\"%Y-%m-%dT%H:%M:%S.%fZ\")\n# 7. datetime.datetime.utcnow().isoformat() + \"Z\"\n```\n\n```python\n# Or getting the current time in UTC as a datetime object\n\nfrom utcnow import utcnow\nutcnow.as_datetime()\n# datetime.datetime(2021, 2, 18, 8, 24, 48, 382262, tzinfo=datetime.timezone.utc)\n\n# this is merely a convinience, as the same value would be returned by both:\n# 1. utcnow.as_datetime()\n# 2. datetime.datetime.utcnow().replace(tzinfo=datetime.timezone.utc)\n```\n\n```python\n# As described – current server timestamp as a RFC 3339 date-time timestamp in UTC\n\nimport utcnow\nresult = str(utcnow)\n# \"2021-02-18T08:24:48.382262Z\"\n```\n\n```python\n# Easy way of adding the current date-time timestamp to a JSON response\n\nimport json\nimport utcnow\nresult = json.dumps({\"timestamp\": str(utcnow), \"status\": 200})\n# '{\"timestamp\": \"2021-02-18T08:24:48.382262Z\", \"status\": 200}'\n```\n\n```python\n# Or just adding the current time in an f-string\n\nimport utcnow\nresult = f\"Current server time is: '{utcnow}'\"\n# \"Current server time is: '2021-02-18T08:24:48.382262Z'\"\n```\n\n### Get the date part as a string from a timestamp\n\nNot as common, but every now and then you might need to get the date part from a timestamp (or for example today's date), to use in some string concatenation, S3 object keys and what not.\n\nThere's the long away around it, by generating a timestamp with `utcnow.get()` and then just keeping the first 10 characters of the timestamp – that's the date – `YYYY-MM-DD`. You could even use `datetime` and go `datetime.datetime.utcnow().date().isoformat()`, but it's not super clean.\n\n`utcnow` comes with a wrapper function `utcnow.as_date_string(value)` to fetch just the date part based on the input value's UTC timestamp. Note that the date string that is returned does not include timezone information.\n\n```python\nimport utcnow\n\ntimestamp = \"2022-04-05T13:44:52.748994Z\"\nutcnow.as_date_string(timestamp)\n# \"2022-04-05\"\n```\n\nBonus 🎉🎉 – calling the `utcnow.as_date_string()` function without arguments will return today's date, _based on the current time in UTC_. For some sugar to your code, the same function is also available under the name `utcnow.get_today()`.\n\nTo get the current date in another timezone use the keyword argument `tz` to the function call. The value for `tz` should be either a `datetime.tzinfo` object or an utcoffset represented as a string (for example \"+01:00\", \"-06:00\", etc.).\n\n```python\nimport utcnow\n\nutcnow.get_today()\n# \"2022-04-05\" (it's the 5th of April when typing this)\n\nutcnow.get_today(tz=\"+12:00\")\n# \"2022-04-06\" (time in UTC is currently 15:12 - adding 12 hours to that would yield 03:12 tomorrow)\n```\n\n### How much time between timestamp A and timestamp B?\n\nThe library also comes with a small utility function for calculating the number of seconds (usually) between two timestamps.It's called `utcnow.timediff` and works like this.\n\n```python\nimport utcnow\n\n# Afternoon meeting first work day of the year – also way too long\nbegin = \"2021-01-04T13:00:00.000000Z\"\nend = \"2021-01-04T17:30:00.000000Z\"\n\nseconds = utcnow.timediff(begin, end)\n# 16200.0\n\n# Additionally a unit can be specified as the third argument which automatically\n# just divides the number of seconds with the value relative to the unit. If not\n# specified, the default unit \"seconds\" will be applied.\n\nminutes = utcnow.timediff(begin, end, \"minutes\")\n# 270.0\n\nhours = utcnow.timediff(begin, end, \"hours\")\n# 4.5\n\ndays = utcnow.timediff(begin, end, \"days\")\n# 0.1875\n```\n\n```python\nimport utcnow\n\n# Another stupid example. How many seconds were there between unixtime epoch\n# and unixtime 1234567890.\nanswer = utcnow.timediff(0, 1234567890)\n# 1234567890.0\n\n# This can also be calculated by using the power of subtraction.\nalso_the_answer = 1234567890 - 0\n# 1234567890\n```\n\n\n## Finally\n\nThis is not a fullblown date library at all – it's lightweight, convenient utility package and should mostly just be used to output the date-time timestamp we want and at times convert values from other parts into our fixed length string format `YYYY-MM-DDTHH:mm:ss.ffffffZ` (or as `%Y-%m-%dT%H:%M:%SZ` as if used with `datetime.datetime.strftime` on a naive `datetime` value or a `datetime` value in UTC). Always uses UTC in output and always appends the UTC timezone as a `Z` to the string (instead of using `+00:00`, which a tz-aware `datetime` would do when used with `datetime.isoformat()`).\n\nUse `utcnow` when you need to store date-time timestamps (and also preferably _internet_ date-time timestamps) in any datastore as a string, using them in API responses (JSON responses usually) or when your services are adding timestamps in their log outputs.\n\nWether you choose to use this library or anything else, or just specify _this is how we do it_ in a documement, it'll be worth it. It's never too late to start aligning your formatting standards and interfaces.\n\n\n## TLDR?\n\nUse `utcnow` if you have a hard time being consistent with timestamp values in API:s and logging.\n\nIf you don't want to use `utcnow`, then here's a few key takeaways to remember.\n\n* Always include ~timezones~ timezone as UTC when storing a timestamp (to database, within logging, everywhere).\n* Always include ~timezones~ timezone as UTC when sending API responses.\n* Set strict guidelines of how timestamps must be formatted within databases, in log output and API responses. Follow them.\n* If your API accepts users to submit timestamps using arbitrary timezones or without tz info, immediately convert the timestamps to UTC.\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/kalaspuff/utcnow",
    "keywords": "utcnow,utc timestamp,modern timestamp,rfc 3339,rfc3339,timestamp,timestamps,date and time on the internet,datetime,zulu time",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "utcnow-cli",
    "package_url": "https://pypi.org/project/utcnow-cli/",
    "platform": null,
    "project_url": "https://pypi.org/project/utcnow-cli/",
    "project_urls": {
      "Homepage": "https://github.com/kalaspuff/utcnow",
      "Repository": "https://github.com/kalaspuff/utcnow"
    },
    "release_url": "https://pypi.org/project/utcnow-cli/1.0.0/",
    "requires_dist": [
      "utcnow (>=0.3.3)"
    ],
    "requires_python": ">=3.7,<4.0",
    "summary": "Timestamps as opinionated RFC 3339 (Date and Time on the Internet) formatted strings",
    "version": "1.0.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 15437089,
  "releases": {
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9a781326c13dd8739a67ce756a8b661c0515179933f89ce5236b0a4a784f7200",
          "md5": "4988bb38b29ce3ad53aaa0f53ea66648",
          "sha256": "24467d8288eec2afca52c76826671ef728d2747fc7783d9014a13ac9e52a2b68"
        },
        "downloads": -1,
        "filename": "utcnow_cli-1.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "4988bb38b29ce3ad53aaa0f53ea66648",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.7,<4.0",
        "size": 10719,
        "upload_time": "2022-10-17T14:12:02",
        "upload_time_iso_8601": "2022-10-17T14:12:02.618562Z",
        "url": "https://files.pythonhosted.org/packages/9a/78/1326c13dd8739a67ce756a8b661c0515179933f89ce5236b0a4a784f7200/utcnow_cli-1.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "aa70580fb517208b396f40e4c6aa8936c223bbf82e44d9c4bbaff307e24020ec",
          "md5": "67b7c9071a06444c84ac9a8c23c79206",
          "sha256": "422366fc645bd7205019d520f28f4fea2603cc512f899b98a9ba1432757a64ee"
        },
        "downloads": -1,
        "filename": "utcnow_cli-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "67b7c9071a06444c84ac9a8c23c79206",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.7,<4.0",
        "size": 17575,
        "upload_time": "2022-10-17T14:12:04",
        "upload_time_iso_8601": "2022-10-17T14:12:04.179159Z",
        "url": "https://files.pythonhosted.org/packages/aa/70/580fb517208b396f40e4c6aa8936c223bbf82e44d9c4bbaff307e24020ec/utcnow_cli-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "9a781326c13dd8739a67ce756a8b661c0515179933f89ce5236b0a4a784f7200",
        "md5": "4988bb38b29ce3ad53aaa0f53ea66648",
        "sha256": "24467d8288eec2afca52c76826671ef728d2747fc7783d9014a13ac9e52a2b68"
      },
      "downloads": -1,
      "filename": "utcnow_cli-1.0.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "4988bb38b29ce3ad53aaa0f53ea66648",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.7,<4.0",
      "size": 10719,
      "upload_time": "2022-10-17T14:12:02",
      "upload_time_iso_8601": "2022-10-17T14:12:02.618562Z",
      "url": "https://files.pythonhosted.org/packages/9a/78/1326c13dd8739a67ce756a8b661c0515179933f89ce5236b0a4a784f7200/utcnow_cli-1.0.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "aa70580fb517208b396f40e4c6aa8936c223bbf82e44d9c4bbaff307e24020ec",
        "md5": "67b7c9071a06444c84ac9a8c23c79206",
        "sha256": "422366fc645bd7205019d520f28f4fea2603cc512f899b98a9ba1432757a64ee"
      },
      "downloads": -1,
      "filename": "utcnow_cli-1.0.0.tar.gz",
      "has_sig": false,
      "md5_digest": "67b7c9071a06444c84ac9a8c23c79206",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7,<4.0",
      "size": 17575,
      "upload_time": "2022-10-17T14:12:04",
      "upload_time_iso_8601": "2022-10-17T14:12:04.179159Z",
      "url": "https://files.pythonhosted.org/packages/aa/70/580fb517208b396f40e4c6aa8936c223bbf82e44d9c4bbaff307e24020ec/utcnow_cli-1.0.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}