{
  "info": {
    "author": "Vantiq, Inc",
    "author_email": "fcarter@vantiq.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Programming Language :: Python :: 3.10",
      "Programming Language :: Python :: 3.8",
      "Programming Language :: Python :: 3.9"
    ],
    "description": "## Repository Contents\n\nThis repository contains the SDK for building Vantiq connectors (also known as extension sources)\nusing Python. At a high level, a connector is configured and then run, responding or sending messages to messages the Vantiq server. Each connector acts as a _source_ in a Vantiq namespace.\n\nYou will need credentials to a Vantiq server to use this SDK.  Please contact your Vantiq system administrator to obtain these credentials.\n\n## Overview of a Connector\n\nFor details about the overall structure of a connector and the protocol used between the connector and the Vantiq source, please see\n[here](https://github.com/Vantiq/vantiq-extension-sources#readme).  \n\nEach running instance of this code represents a set of connectors that connect to a single Vantiq namespace. The set of sources for the connector & the connection information is found in the server config file.  We will describe the details later.\n\nUsing the Python VantiqConnector SDK, the overall operation is as follows:\n\n* Create a `VantiqConnectorSet` that manages the set of connections (one per source listed in the `server.config` file.\n* Establish a set of _handlers_ or callbacks that will allow the connectors to respond to messages from the Vantiq server. There are callbacks for the following situations:\n    * `connect` -- when your connection to the server is established, the source configuration is provided to the connector. This can be used to tailor the behavior or local work.\n    * `publish` -- when the Vantiq server sends an event to the source, that event is delivered to the `publish` handler\n    * `query` -- when the Vantiq server queries the source, that query is delivered to the `query` handler.  The query handler can return information or errors to the application running on the server.\n    * `close` -- when the connection to the Vantiq server ends, the `close` handler is called, giving the connector a chance to clean up resources.\n\nThe connector runtime will maintain the connection, reconnecting as needed.\n\nThe following sections describe the use of this SDK to construct a connector.\n\n## Building a Connector\n\nRunning this code required Python 3.8 or later.\n\nTo use the SDK, install it into your Python environment.  Using `pip`, \n\n```commandline\npip install vantiqconnectorsdk\n```\n\nOther Python environment tools may use different commands.\n\nOnce it is installed, you can import it.\n\n```python\n\nfrom vantiqconnectorsdk import VantiqConnector, VantiqConnectorSet, VantiqConnectorException, VantiqSourceConnection\n```\n\nThe SDK is built using _asyncio_.  For details about working with _asyncio_, please see [Python `asyncio` documentation](https://docs.python.org/3/library/asyncio.html).\n\nThe Vantiq Connector SDK includes the following items:\n\n* VantiqConnector -- a set of constants defined as part of the interface.\n    * a set of constants to help in the use of these two classes:\n        * For construction errors:\n            * VantiqConnector.ERROR_CODE -- the short name for an error\n            * VantiqConnector.ERROR_TEMPLATE -- the template for the message itself\n            * VantiqConnector.ERROR_PARAMETERS -- parameters for the error message\n        * For context reference during callbacks:\n            * VantiqConnector.SOURCE_NAME -- the name of the source for which this callback is intended\n            * VantiqConnector.RESPONSE_ADDRESS -- routing information to ensure that a query response is delivered to the correct query\n        * Status codes for query responses:\n            * VantiqConnector.QUERY_COMPLETE -- the last response for this query\n            * VantiqConnector.QUERY_PARTIAL -- a partial response to a query\n            * VantiqConnector.QUERY_EMPTY -- an indication that there is no response available for this query\n* VantiqConnectorSet -- a class that manages the connections for this set of connectors\n* VantiqSourceConnection -- a class that manages the message flow and state for a single connector\n\n### Logging\n\nThe SDK uses the standard Python logging. Logger names are constructed from the class name.\nIf you need to setup logging, you can call the `VantiqConnector.setup_logging()` call.  This\nwill look for a `logger.ini` file in the `serverConfig` directory.  This is the same place we look\nfor the `server.config` file (see [below](#serverConfig)).\n\n### <a name=\"serverConfig\" id=\"serverConfig\"></a>Connector Startup Configuration\nConnectors need a minimum of three configuration properties at startup:\n\n*   `targetServer`: The URL of the Vantiq server to which the connector should connect.\n*   `authToken`: The access token that the connector will use to authenticate to the desired namespace.\n*   `sources`: The name of the source or sources (comma-separated list) managed by this set of connectors.\n\nIn addition to the configuration properties shown above, the `server.config` file can also include the following property:\n\n*   `sendPings`: A boolean property that, if set to `true`, enables the SDK to send ping messages to the Vantiq Server. \nThe ping messages are handled by the underlying websockets library.\n\nThe system expects the `server.config` file to be located in a directory named `serverConfig` in the working directory of the connector.\n\nFor users who may not want to write the `authToken` property to a file because of its sensitive nature, set the environment variable `CONNECTOR_AUTH_TOKEN` to its value. If the `authToken` is specified in the `server.config` document, that value will take precedence.\nOtherwise, if the `authToken` is not set in the configuration file, the system will retrieve whatever value is provided in the environment variable.\n\nThe server config file is written as `property=value`, with each property on its own line. The following is an example \nof a valid `server.config` file (including the `authToken`, but that can be omitted and specified as an environment \nvariable instead):\n```\nauthToken=XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\nsources=MySourceName\ntargetServer=https://dev.vantiq.com/\nsendPings=true\n```\n\n### Program Flow\n\n1. Create a `VantiqConnectorSet`. This will read the config file and establish (but not start) a `VantiqSourceConnection` for each source listed in the config file.\n2. Define the handlers to be used.  You can use a single set of handlers for all sources (using `VantiqConnectorSet.configure_handlers_for_all()`, or you can establish handlers for each source (by iterating through the connections provided by `VantiqConnectorSet.get_connections()` and then calling `VantiqSourceConnection.configure_handlers()` for each connection.\n3. Once the environment is set, you can start the connector operations.  This is done by calling `VantiqConnectorSet.run_connectors()`.  Once this call is made (and awaited), the SDK will take over management of the connections.\n4. Each source connection can perform its work by responding to calls to the `publish` and `query` handlers.\n5. If you need to send an event to the server, use `VantiqSourceConnection.send_notification()`.\n\nIf the connection closes, the SDK will automatically re-initiate the connection.  This will result in calls the `connect` handlers again, etc.  Such a reconnection can happen due to network or connection issues.  It can also happen if the source configuration on the Vantiq side is changed.  A changed configuration requires a that the connector obtain the new configuration, and that is done by simply making a new connection.\n\n\n\t\n## <a name=\"VantiqSourceConnection\" id=\"sourceConnection\"></a>Using VantiqSourceConnection\nEvery `VantiqSourceConnection` deals with a single source via its own WebSocket connection. \n\n### Setup\n\nTo operate, each `VantiqSourceConnection` must be configured with a set of handlers.  These handlers configured as follows.  (Note that a similar call can be made using the `VantiqConnectorSet` if all connections should use the same handler.\n\nCall `VantiqSourceConnection.configure_handlers(close_handler, connect_handler, publish_handler, query_handler)`.  These handlers are defined as follows.\n\n* handle_close : Callable[[dict], Awaitable[None]]\n* handle_connect : Callable[[dict, dict], Awaitable[None]\n* handle_publish : Callable[[dict, dict], Awaitable[None]\n* handle_query : Callable[[dict, dict], Awaitable[None]\n\nThese parameters specify the callbacks to handle close, connect, publish, and query calls, respectively. For each, the first parameter is a dict providing the context for the operation.  The context will contain an entry keyed with `VantiqConnector.SOURCE_NAME` whose value is the name of the source for which this is a callback.  For query calls, there will be an additional entry keyed with `VantiqConnector.RESPONSE_ADDRESS`. The value here is used to route the query response back to the caller in the Vantiq server.\n \nThis context parameter is to be used in the various query response calls.\n\nFor the handle_connect, handle_query, and handle_publish calls, there will be a second dict parameter. This will contain the message sent from Vantiq to the connector (source).\n\nNote that the handlers all return an _Awaitable_.  This means that they can operate using _asyncio_ to do other things.  However, _asyncio_ operations should be careful not to block the event loop. If an handler is going to take a long time to run, you will want to set it running separately.\n\n#### <a name=\"connect\" id=\"connect\"></a>Connection (Configuration)\n\nThe `handle_connect` callback is called as part of the Vantiq connection sequence, delivering the source configuration to the connector. receives the message containing a configuration document created on the Vantiq client.\n\nThis callback will be called with two parameter: the context and the configuration document.\nThe _context_ parameter was outlined in the previous section.\nThe _configuration_ document is a `dict` object containing the source's configuration document. There is no format specification of the configuration document -- its content is defined by the connector.  Generally, the configuration document allows the connector to be tailored to specific purposes.  It may contain database connection information, machine learning models to run, or operational information like cache sizes, etc.\n\n##### Reconnection\nUnder certain circumstances (_e.g._, a change to the source's configuration document or some network connection issue), the Vantiq server may disconnect\nyou from the source with the intent that you will immediately reconnect.\n\nThis operation is unavoidable, but is generally transparent to the connector.  When this happens, the [`handle_close` callback](#closeHandler) will be called, and then the\n[`handle_connect` callback](#closeHandler).  Since this may be an indication that the source configuration has changed, each _connect_ call should be treated as a new connection/configuration.\n\nThis process is automatic.  No special work by the connector is required.\n\n### Processing Messages\n\nMessages involving a source come in three (3) flavors:\n\n* Messages (events) sent by a source\n* Query messages sent to a source. Query messages, in turn, have responses.\n* Messages published to a source\n\nThe following sections outline the work involved here.\n\n#### Notifications\n\nNotifications are messages that the source will pass on to Vantiq rules that include \n`WHEN EVENT OCCURS ON \"/sources/<source name>\"`. To send one, simply call\n`VantiqSourceConnection.send_notification(<message to be sent>)`, which will translate the message into JSON and add everything Vantiq needs to recognize the message.  The _message to be sent_ shoud be a `dict` object.\n\n#### Queries\n\nQueries are sent to the source via VAIL code of the form\n\n```\nrow = SELECT * FROM SOURCE someSource with prop1 = value1, prop2 = value2, ...\n```\n\nA query like this will result in a query message to the source (and, thus, to the connector via the\n`handle_query` callback). The parameter value passed to the callback will be a dict object\n`{ prop1: value1, prop2: value2, ... }`.  That is, the parameter values are those passed from the _with_ clause in the VAIL SELECT statement.\n\nOnce the query message is received (_i.e._, delivered to the callback), the connector to which the\nquery was delivered must respond. It responds by making calls to return a query response or a query error.\n\n##### Query Context\n\nQuery responses are responses to a `SELECT` request from Vantiq that targets a source, and can either be a `dict` or a series of `dict` objects in the form of a `list` or `array`. They only mean anything in relation to an initial Query message received from Vantiq, and thus should\nonly be sent as part response to a query via the callback. \n\nTo enable this behavior, the callback is passed a _context_ parameter that provides information about the context of the query. This parameter will take the form of a `dict` object with two (2)\nitems: a `VantiqConnector.SOURCE_NAME` item that contains a string specifying the source toward which this query is\nsent, and a `VantiqConnector.RESPONSE_ADDRESS` item that contains the routing information to allow the query resposnes (or error) to find their way back the the Vantiq code that issued the query.\n\n##### <a name=\"queryResponse\" id=\"queryResponse\"></a>Query Responses\n\nTo send a query response, call\n\n```\nVantiqSourceConnection.send_query_response(ctx, code, message)\n```\n\nThe `ctx` or context parameter is passed in to the `handle_query` callback.  Simply pass that back unchanged.\n\nThe code is an HTTP status code. You can use the following:\n\n* `VantiqConnector.QUERY_EMPTY` to indicate that this query has an empty response.  In this case, the message parameter must be None.\n* `VantiqConnector.QUERY_PARTIAL` to indicate that this is one of a number of responses to this query. This is used if you are dynamically producing results to return.\n* `VantiqConnector.QUERY_COMPLETE` to indicate that this is the last (or only) response to this query.\n\nFor the latter two (2) codes, the `message` parameter must be either a `dict` or a `list` of `dict` objects.  These will be sent to the Vantiq server in a JSON format.\n\n##### <a name=\"queryError\" id=\"queryError\"></a>Query Errors\n\nQuery errors are sent when a Query cannot be completed successfully. To send a Query error, call\n`VantiqSourceConnection.send_query_error(ctx, message)`. \n\nThe `ctx` or query context was passed in to the `handle_query` callback.\nThe `message` (`dict`) parameter must contain the following items.\n\n* `VantiqConnector.ERROR_CODE` -- the short name for the error\n* `VantiqConnector.ERROR_TEMPLATE` -- template for the error message.  Templates contain zero-based indexed references for parameters list (_e.g._,`{0}` to refer to the first parameter, `{1}` the second, etc.).\n* `VantiqConnector.ERROR_PARAMETERS` -- a list of parameters for the template.\n\n##### <a name=\"publish\" id=\"publish\"></a>Published Messsages\n\nWhen the Vantiq server publishes an event to a source that is implemented using a connector, it is delivered via the `handle_publish` callback. As with a query message, the handler will be passed two (2) parameter:  A context and the message.\n\nThe context in this case will contain the `VantiqConnector.SOURCE_NAME` item.  It need not contain the `VantiqConnector.RESPONSE_ADDRESS` item.  You can not respond to messages delivered via the `handle_publish` callback.\n\nIf the Vantiq server executes VAIL code like\n\n```\n    PUBLISH { prop1: value1, prop2: value2, ... } TO SOURCE connectorSource\n```\n\nthe connector will receive a `handle_callback` call containing the context parameter\n\n```python\n{ \n    'source_name': 'connectorSource'\n}\n```\n\nand a message parameter containing\n\n```python\n{ \n    'prop1': value1,\n    'prop2': value2\n}\n```\n\nThe connector can then act on the message as it deems appropriate.\n\n#### Kubernetes Operation and TCP Probe\n\nIn the case that the connector is deployed within a Kubernetes cluster, the `VantiqConnectorSet` offers support for TCP Startup/Liveness/Readiness probes. The class defines two methods: `declare_healthy()` and `declare_unhealthy()`, that can be used to make the respective declarations.\n\nInternally, `declare_healthy()` and `declare_unhealthy()` open and close a TCP socket, respectively; the Kubernetes probes attempt to connect to that port. If connection is successful, the probe is considered successful; if not, the probe is unsuccessful. \n\nThe socket is opened on port 8000 by default, but this can be changed by including tcpProbePort:<portNumberHere> in the connector's `server.config` document. It is the responsibility of the connector developer to manage when the connector is healthy and when it is not.\n\nNote that `declare_healthy()` and `declare_unhealthy()` are available from the `VantiqSourceConnection` as well.  These make calls to the containing `VantiqConnectorSet`. Health status is available only on a `VantiqConnectorSet` basis.\n\nThe `VantiqConnectorSet` and `VantiqSourceConnection` classes both offer the `is_healthy()` method.  This will return `True` if the connector set has been declared healthy, `False` if it has been declared unhealthy, and `None` if no health declaration has been made.\n\n##### <a name=\"closeHandler\" id=\"closeHandler\"></a>Close\nThe closure handler does not deal with a specific message or type of message, but instead is called when either your\ncode calls `VantiqSourceConnection.close()` or the WebSocket connection is forced to close, most likely due to a problem with the connection.\n\nThe `handle_close` is passed a context containing the source name (see [publish](#publish)). At the time the handler is called, the connection has already been closed.  No interaction with the Vantiq server is possible;  this handler call allows the connector to perform any resource deallocation or other cleanup necessary.\n\n## License\nThe source code in this project is licensed under the [MIT License](https://opensource.org/licenses/MIT).  \n\nThe MIT License (MIT)\n\nCopyright (c) 2022 Vantiq, Inc.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/Vantiq/vantiq-extension-sources",
    "keywords": "",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "vantiqconnectorsdk",
    "package_url": "https://pypi.org/project/vantiqconnectorsdk/",
    "platform": null,
    "project_url": "https://pypi.org/project/vantiqconnectorsdk/",
    "project_urls": {
      "Homepage": "https://github.com/Vantiq/vantiq-extension-sources"
    },
    "release_url": "https://pypi.org/project/vantiqconnectorsdk/1.1.12/",
    "requires_dist": [
      "websockets (>=10.2)",
      "jprops (>=2.0.2)"
    ],
    "requires_python": ">=3.8",
    "summary": "SDK for building Vantiq extension sources/connectors in Python",
    "version": "1.1.12",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 14088713,
  "releases": {
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "a5d85996d073351dc8773f7bfaed8974467edf0d98eda4a73c279c1d1b641834",
          "md5": "7cf620c6342aa179604a664c075d11ea",
          "sha256": "48247e7a67b4098cd89b2bfaec2b07842cae47e02b54015c70671f7b62a44676"
        },
        "downloads": -1,
        "filename": "vantiqconnectorsdk-1.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "7cf620c6342aa179604a664c075d11ea",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 16835,
        "upload_time": "2022-05-09T21:47:17",
        "upload_time_iso_8601": "2022-05-09T21:47:17.190703Z",
        "url": "https://files.pythonhosted.org/packages/a5/d8/5996d073351dc8773f7bfaed8974467edf0d98eda4a73c279c1d1b641834/vantiqconnectorsdk-1.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1da20c8a833dd0440f217b2ad56c2082712c65ee9b602405f5a2b89884328346",
          "md5": "e059f8a29b87644c502ce7d6c481542f",
          "sha256": "94b2ae293040ac98a1359cac4993f5393377eb7bdafd676b52e0915cf6a1176b"
        },
        "downloads": -1,
        "filename": "vantiqconnectorsdk-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "e059f8a29b87644c502ce7d6c481542f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 16550,
        "upload_time": "2022-05-09T21:47:18",
        "upload_time_iso_8601": "2022-05-09T21:47:18.891101Z",
        "url": "https://files.pythonhosted.org/packages/1d/a2/0c8a833dd0440f217b2ad56c2082712c65ee9b602405f5a2b89884328346/vantiqconnectorsdk-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9dc7e1bbecc042a2b7add01d306991c887902cf1e6629cf3321c095217949fd1",
          "md5": "b1e7c007e7c0b76ae5b6f4319a6ff3ea",
          "sha256": "c59dd823a18efef1210fb38be52abea08d0f5f3068c9f516e0ddf61da8d01d17"
        },
        "downloads": -1,
        "filename": "vantiqconnectorsdk-1.0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "b1e7c007e7c0b76ae5b6f4319a6ff3ea",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 16836,
        "upload_time": "2022-05-11T03:53:13",
        "upload_time_iso_8601": "2022-05-11T03:53:13.970879Z",
        "url": "https://files.pythonhosted.org/packages/9d/c7/e1bbecc042a2b7add01d306991c887902cf1e6629cf3321c095217949fd1/vantiqconnectorsdk-1.0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "41792e13b3fb6e9aee6215e786badd1ab1d411bd2d8aaa0701d37f51d7636a52",
          "md5": "9c6a7595ed84d82e0c774f5d3c922aec",
          "sha256": "4e9147fd43c89918534db638018027e0e24e4cdbcb76094654f6d3b0be329104"
        },
        "downloads": -1,
        "filename": "vantiqconnectorsdk-1.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "9c6a7595ed84d82e0c774f5d3c922aec",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 16517,
        "upload_time": "2022-05-11T03:53:16",
        "upload_time_iso_8601": "2022-05-11T03:53:16.549766Z",
        "url": "https://files.pythonhosted.org/packages/41/79/2e13b3fb6e9aee6215e786badd1ab1d411bd2d8aaa0701d37f51d7636a52/vantiqconnectorsdk-1.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.10": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5a8be4e1ab8702d001674b69fb75f61b09b15309165b48a7dbcf88601a4c6125",
          "md5": "d00dcb132a6a2b303afcde72546edf07",
          "sha256": "36e420ddc2b3d09912b735a4118dad0ba7d5749fc4ae29864f049b267da05cdd"
        },
        "downloads": -1,
        "filename": "vantiqconnectorsdk-1.1.10-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "d00dcb132a6a2b303afcde72546edf07",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 18340,
        "upload_time": "2022-06-01T20:16:21",
        "upload_time_iso_8601": "2022-06-01T20:16:21.118050Z",
        "url": "https://files.pythonhosted.org/packages/5a/8b/e4e1ab8702d001674b69fb75f61b09b15309165b48a7dbcf88601a4c6125/vantiqconnectorsdk-1.1.10-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d3dc5d3260fe29fe27975df4c7ba8746aee405374c99694ca13bf4f7207f2956",
          "md5": "22de0f5f7eabe35e34dd58b3304e5fcd",
          "sha256": "1dea6833f1f06642f70edd63834132d641861302e0334da97ca1180829ef057a"
        },
        "downloads": -1,
        "filename": "vantiqconnectorsdk-1.1.10.tar.gz",
        "has_sig": false,
        "md5_digest": "22de0f5f7eabe35e34dd58b3304e5fcd",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 18015,
        "upload_time": "2022-06-01T20:16:23",
        "upload_time_iso_8601": "2022-06-01T20:16:23.133569Z",
        "url": "https://files.pythonhosted.org/packages/d3/dc/5d3260fe29fe27975df4c7ba8746aee405374c99694ca13bf4f7207f2956/vantiqconnectorsdk-1.1.10.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.11": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2ed2b7e49d7e0d3b76ef3bcdedac7c3c79adfc7725e11b9ddab4214aee213012",
          "md5": "d89d4808fae35a6410ace4b611282b73",
          "sha256": "e44656a20024c990e569fa3de01a19eff54ddac28dddd57a1c338131307e57fd"
        },
        "downloads": -1,
        "filename": "vantiqconnectorsdk-1.1.11-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "d89d4808fae35a6410ace4b611282b73",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 18338,
        "upload_time": "2022-06-09T23:28:12",
        "upload_time_iso_8601": "2022-06-09T23:28:12.977918Z",
        "url": "https://files.pythonhosted.org/packages/2e/d2/b7e49d7e0d3b76ef3bcdedac7c3c79adfc7725e11b9ddab4214aee213012/vantiqconnectorsdk-1.1.11-py3-none-any.whl",
        "yanked": true,
        "yanked_reason": "incomplete upload"
      }
    ],
    "1.1.12": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "1c3e2ae09dd9b43ce9465b95a27585dcb604fff604ef4c120e39bdbb97f4a9fd",
          "md5": "8c5eaee69b82dd07be8153cff04feb24",
          "sha256": "a5dddce83ba332001a361423441696529a56658d5af90e36840464a4b0a08568"
        },
        "downloads": -1,
        "filename": "vantiqconnectorsdk-1.1.12-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "8c5eaee69b82dd07be8153cff04feb24",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 18338,
        "upload_time": "2022-06-09T23:44:34",
        "upload_time_iso_8601": "2022-06-09T23:44:34.498632Z",
        "url": "https://files.pythonhosted.org/packages/1c/3e/2ae09dd9b43ce9465b95a27585dcb604fff604ef4c120e39bdbb97f4a9fd/vantiqconnectorsdk-1.1.12-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "857e29e73b3d510f48ba8e38e1aa1de6328a14b7c2f3c15368d704214e0f2945",
          "md5": "1f633de8493c43ff4162db6df2978e9b",
          "sha256": "afceffa78efa23ccf1f404aecf60517e01eb36b97cf4f14debd328a4fc2684fc"
        },
        "downloads": -1,
        "filename": "vantiqconnectorsdk-1.1.12.tar.gz",
        "has_sig": false,
        "md5_digest": "1f633de8493c43ff4162db6df2978e9b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 18017,
        "upload_time": "2022-06-09T23:44:36",
        "upload_time_iso_8601": "2022-06-09T23:44:36.046637Z",
        "url": "https://files.pythonhosted.org/packages/85/7e/29e73b3d510f48ba8e38e1aa1de6328a14b7c2f3c15368d704214e0f2945/vantiqconnectorsdk-1.1.12.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.9": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4ea044e51b58937b552b471b4877e18f61bc230f89da1b86a5108e329e5d4380",
          "md5": "c3d719c6ca9c8325cad0ee03fbff8f1c",
          "sha256": "8adc22744968d65ba5290971dbd9bba40a59a84b20c2480b06bd9f3c7385349e"
        },
        "downloads": -1,
        "filename": "vantiqconnectorsdk-1.1.9-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "c3d719c6ca9c8325cad0ee03fbff8f1c",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 18181,
        "upload_time": "2022-05-19T23:29:30",
        "upload_time_iso_8601": "2022-05-19T23:29:30.194362Z",
        "url": "https://files.pythonhosted.org/packages/4e/a0/44e51b58937b552b471b4877e18f61bc230f89da1b86a5108e329e5d4380/vantiqconnectorsdk-1.1.9-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5e5fbcb7be3bd9d9a150793431c426f9850323c4c3f593a64d0192b61a21f378",
          "md5": "dc3a432f93289dfcdc3fe660f9277c49",
          "sha256": "41fa7d74deea86d1d7656076f4bc9c8342817ea7c676ad17f604550db301652c"
        },
        "downloads": -1,
        "filename": "vantiqconnectorsdk-1.1.9.tar.gz",
        "has_sig": false,
        "md5_digest": "dc3a432f93289dfcdc3fe660f9277c49",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 17890,
        "upload_time": "2022-05-19T23:29:31",
        "upload_time_iso_8601": "2022-05-19T23:29:31.981204Z",
        "url": "https://files.pythonhosted.org/packages/5e/5f/bcb7be3bd9d9a150793431c426f9850323c4c3f593a64d0192b61a21f378/vantiqconnectorsdk-1.1.9.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "1c3e2ae09dd9b43ce9465b95a27585dcb604fff604ef4c120e39bdbb97f4a9fd",
        "md5": "8c5eaee69b82dd07be8153cff04feb24",
        "sha256": "a5dddce83ba332001a361423441696529a56658d5af90e36840464a4b0a08568"
      },
      "downloads": -1,
      "filename": "vantiqconnectorsdk-1.1.12-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "8c5eaee69b82dd07be8153cff04feb24",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.8",
      "size": 18338,
      "upload_time": "2022-06-09T23:44:34",
      "upload_time_iso_8601": "2022-06-09T23:44:34.498632Z",
      "url": "https://files.pythonhosted.org/packages/1c/3e/2ae09dd9b43ce9465b95a27585dcb604fff604ef4c120e39bdbb97f4a9fd/vantiqconnectorsdk-1.1.12-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "857e29e73b3d510f48ba8e38e1aa1de6328a14b7c2f3c15368d704214e0f2945",
        "md5": "1f633de8493c43ff4162db6df2978e9b",
        "sha256": "afceffa78efa23ccf1f404aecf60517e01eb36b97cf4f14debd328a4fc2684fc"
      },
      "downloads": -1,
      "filename": "vantiqconnectorsdk-1.1.12.tar.gz",
      "has_sig": false,
      "md5_digest": "1f633de8493c43ff4162db6df2978e9b",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.8",
      "size": 18017,
      "upload_time": "2022-06-09T23:44:36",
      "upload_time_iso_8601": "2022-06-09T23:44:36.046637Z",
      "url": "https://files.pythonhosted.org/packages/85/7e/29e73b3d510f48ba8e38e1aa1de6328a14b7c2f3c15368d704214e0f2945/vantiqconnectorsdk-1.1.12.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}