{
  "info": {
    "author": "James Brown",
    "author_email": "jbrown88@yorku.ca",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# VHEGEN 2.0: A vibronic Hamiltonian expansion generator for trigonal and tetragonal polyatomic systems\n\nVHEGEN (V-ibronic H-amiltonian E-xpansion GEN-erator) is a Python package capable of symbolically generating arbitrarily high order expansion formulas for Jahn-Teller and pseudo-Jahn-Teller vibronic Hamiltonians in vibrational coordinates.\n\n## Scope\n\nVHEGEN covers all bistate Jahn-Teller and pseudo-Jahn-Teller problems in any axial symmetries, i.e) point groups: CN, CNv, CNh, DN, DNh, DNd, SN, Cinfv, Dinfh. Unimodal problems are treated as special cases of their bistate analogues and hence also covered. Any number of modes can be included.\n\n## Compatibility\n\nVHEGEN has been tested with Python 2.7 and 3.7 on Linux, macOS, and Windows 10 operating systems.\n\n## Dependencies\n\n* [Python 2.7/3.7](https://www.python.org/)\n* [SymPy](https://www.sympy.org)\n* [NumPy](https://www.numpy.org/)\n* [a TeX distribution](http://www.tug.org/interest.html#free)\n\nVHEGEN requires base Python 2 or 3 and external libraries SymPy and NumPy. It is highly recommended the system also has a TeX distribution installed, such as TeX Live. A TeX installation will allow VHEGEN to execute `pdflatex` on the output `.tex` file and generate a LaTeX-typeset output `.pdf` file. If `pip` is installed, the Python dependencies for VHEGEN can be installed via `pip install -r requirements.txt` in the main package directory.\n\n## Installation\n\nInstallation of the VHEGEN package is as simple as\n\n```bash\npip install vhegen\n```\n\nIf you want to install VHEGEN from this git repository. \n\n```bash\npython -m build\n```\n\nfollowed by\n\n```bash\npython -m pip install .\n```\n\nThis primes the program for procedural use as an executable script, as well as for importing as a package. To ensure all dependencies are met, one can run `python testrun.py` located in the examples directory. This will execute a zeroeth to third order expansion of the E1\"x(e1'+e1'') problem in C5h symmetry. If successful, the execution should terminate after printing \"Testrun complete without errors.\" If a TeX distribution is not set up on the machine, one should remove `vhegen_instance.pdflatex()` from `testrun.py` before running.\n\n## File structure of VHEGEN\n\n* `VHEGEN` : The main VHEGEN package directory.\n  * `examples`: Directory containing a couple example scripts.\n    * `config.cfg` : The configuration file read during procedural execution of `vhegen.py`.\n    * `benzene.py` : Example of 2 state, 10 mode expansion of benzene cation.\n    * `testrun.py` : Small test example in C5h\n  * `scripts` : Contains the vhegen script that can be used to run vhegen dynamically. Will be installed in the standard bin directory.  \n  * `src`: Directory with package\n    * `modules` : Directory containing Python source code files imported by `vhegen.py`.\n    * `tables` :  Directory containing the lookup tables required by the program in the form of Python files. Included are lookup tables for symmetry eigenvalues, general form of vibronic matrices, and root expansion formulas.\n  * `setup.cfg` : Package information for build\n\n## Using VHEGEN procedurally\n\nVHEGEN is called procedurally by executing `vhegen` after installing the package or by running the vhegentest script in `scripts/vhegen`. The program settings for procedural use are read from the configuration file `config.cfg` in the same directory, the contents of which are described below.\n\n## Configuration\n\n In the configuration file, the user specifies the five parameters: `input`, `pdf_out`, `log_out`, `e_coords`, and `basis` `mctdh_out`.\n\n| Parameter  | Values              |\n|------------|---------------------|\n| `input`    | `static`, `dynamic` |\n| `pdf_out`  | `true`, `false`     |\n| `log_out`  | `true`, `false`     |\n| `e_coords` | `pol`, `cart`       |\n| `basis`    | `complex`, `real`   |\n| `mctdh_out`| `true`, `false`     |\n\n Parameter `input` is used to specify either static or dynamic input mode (discussed in the next section). When set to `true`(`false`), parameter `pdf_out` enables(disables) application of the TeX `pdflatex` command to produce a `.pdf` output file. The output file contains the input vibronic interaction, the matrix form of the vibronic Hamiltonian, and all explicit matrix element expansions typeset via LaTeX. Thus, `pdf_out` should only be set to `true` if a TeX distribution is installed on the system. Parameter `log_out` similarly enables or disables output of a text file, containing all relevant information used in the expansion process, including the independent matrix elements and their symmetry eigenvalues, and the root expansion formulas along with their constraints. All expansions in Sympy readable syntax can be found in the `log` file. Parameter `e_coords` is used to specify the coordinate system used for expressing e-type vibrational modes. When `e_coords` is set to `pol`, the expansions will be kept in polar coordinates as they were originally constructed. When `e_coords` is set to `cart`, the expansions are converted to cartesian coordinates. Both polar and cartesian coordinate expansions may be included in the final output by setting `e_coords=both`. The `basis` parameter defines which basis to use for vibronic Hamiltonians involving E-type electronic states. When set to `complex`/`real`, the output vibronic Hamiltonian matrix elements are for the complex/real E component states. Both complex and real representations can be output by setting `basis=both`. The default configuration is in the config file in examples.\n\n## Input\n\nThe procedural input to VHEGEN consists of specifying: point group symmetry; irreps of electronic states; irreps of vibrational modes; order(s) of expansion; and an output filename. There exist two input approaches, namely the \"dynamic input\" and \"static input\" modes, selected using the `input` parameter in `config.cfg`.\n\nBoth modes of input follow the same general rules for input syntax. All input parameters are case-insensitive, except the output filename. Symmetries are specified by their usual point group classification. Electronic states and vibrational modes are specified by standard Mulliken symbols for their irreducible representations. Single primes in Mulliken symbols are denoted by an apostrophe `'`, and double primes are denoted by two apostrophes `''` or a quotation mark `\"`. For pJT problems that involve two states and any number of vibrational modes, either a plus sign `+` or a comma `,` can be used to separate the two specified states or modes. When specifying the orders of expansion, a range of orders can be stated by providing non-negative integers as lower and upper inclusive bounds separated by a comma, e.g., `0,6`. If expansion at a single order is desired, then only an integer is keyed in. Output filename should avoid any operating system dependent illegal characters. If the filename parameter is unspecified or left empty, the output filename will default to value `output`.\n\n### Dynamic\n\nWhen dynamic input mode is specified in the configuration file, the user enters problem parameters and output filename dynamically through terminal prompts after executing `python vhegen.py`. Any additional arguments made when calling the program will be ignored if set to dynamic input. The user will be re-prompted at each stage if an invalid parameter is entered. The user can receive lists of valid inputs by entering `list`, and can quit the program by entering `exit`. The `list` command will show a list with numbers next to the allowable symmetries. One can key in the corresponding numbers instead of state or mode labels. Below is an example.\n\n```none\n> vhegen\nEntering dynamic input.\nEnter symmetry: C5h\n{'letter': 'C', 'rot': 5, 'extra': 'H', 'refl': False, 'print': 'C5h'}\nC5h symmetry accepted.\nEnter electronic state(s): list\n\nIrreps of C5h:\n  0:A'       1:E1'      2:E2'      3:A''      4:E1''  \n  5:E2''  \n\nRetry state(s): A'+E1''\nElectronic states (E1''+A') accepted.\nEnter vibrational mode(s): list\n\nIrreps of C5h:\n  0:A'       1:E1'      2:E2'      3:A''      4:E1''  \n  5:E2''  \n\nRetry mode(s): 0+1+2+3+4+5\nVibrational modes (a'+e1'+e2'+a''+e1''+e2'') accepted.\nOrder(s) of expansion:0,4\nOrders of expansion [0, 1, 2, 3, 4] accepted.\nEnter filename: test\n```\n\n### Static\n\nWhen input mode is set to static, a vibronic problem is specified in-line with the execution of the program via additional arguments. The following additional arguments must be specified in the static input mode: `--sym` for point group symmetry, `--states` for electronic state(s), `--modes` for vibrational mode(s), and `--o` for order(s) of expansion. Specification of a filename is done by optional argument `--f`. The general syntax for specifying the additional arguments when executing the program is `--arg=value`. For example, execution of problem E x (e+a) in C3v symmetry at the third to sixth orders is accomplished in static input mode by `python vhegen.py --sym=C3V --states=E --modes=e+a1 --o=3,6`.\n\n## Output\n\nWhen called procedurally, outputs generated by VHEGEN are found in subdirectory `outputs` from where the program was called. VHEGEN may produce seven output files upon completion of a problem:\n\n* `.tex` file: Always produced. This file contains all final matrix element expansions in the basis, coordinate system, and orders of expansion(s) specified, the matrix form of the vibronic Hamiltonian, and a count of free parameters needed to be fitted. All information is typeset to a compilable LaTeX document.\n\n* `.log` file: Produced if `log_out=true` in `config.cfg`. This is a text file containing auxiliary information regarding the matrix element expansion process, including the independent matrix elements, their symmetry eigenvalues, their root formulas, and the appropriate contraints. It also contains all final matrix element expansions in Sympy syntax.\n\n* `.pdf` file: Produced if `pdf_out=true` in `config.cfg`. This file is a read-friendly version of the `.tex` output file compiled via `pdflatex`.\n\n* `-cart.op, -pol.op, -cart.inp, -pol.inp` files: Produced if `mctdh_out=true` in `config.cfg`. These files are the input files necessary to run an mctdh simulation. One needs to fill out the fitted parameters in the `.op` files to run the simulation. The single particle basis functions will also need to have its parameters optimized but the type of basis used should remain unchanged.\n\n# Using VHEGEN as a package\n\nHerein we describe important methods and attributes of the VHEGEN class, made accessible by importing VHEGEN as a package via `import vhegen`.\n\n## Initialization\n\nTo initialize an instance of the VHEGEN class, a dictionary containing all vibronic problem parameters for the instance must be specified as its only argument. The input may be prepared by `inp.prepare_input`, which takes the five parameters: point group symmetry, the electronic state(s), the vibrational mode(s), order(s) of expansion, and an optional filename -- all given as strings following the syntax rules for procedural input. E.g.) initializing an instance of VHEGEN for the (E+A)x(e+a) problem in C4 symmetry at 12th order is shown below.\n\n```python\nimport vhegen as vhe\n\nparams = vhe.inp.prepare_input(sym='C4', states='E+A', modes='e+a', orders='12', filename='output')\n\nvhegen_instance = vhe.VHEGEN(params)\n```\n\n## Generating matrix element expansions\n\nBelow are the methods which must be sequentially called to generate the full matrix element expansions for a specified vibronic problem. For more details about the methods described, please see Section 5.3 in the associated paper.\n\n| Method                              | Description                                                                                                                                                                                                                       |\n|-------------------------------------|-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| `set_e_coords(e_coordinate_system)` | Defines the coordinate system for problems involving e-type vibrational modes. Allowed arguments for `e_coordinate_system` are `cart`, `pol`, and `both`.                                                                         |\n| `set_basis(E_component_basis)`      | Defines the E state component basis for problems involving E-type states. Allowed arguments for `E_component_basis` are `complex`, `real`, and `both`.                                                                            |\n| `get_eigenvals()`                   | Obtains unique matrix elements and their symmetry eigenvalues by initializing attribute `eigenvals`.                                                                                                                              |\n| `get_matrix_form()`                 | Obtain matrix product form of the vibronic Hamiltonian, and stores in attribute `matrix`.                                                                                                                                         |\n| `get_formulas()`                    | Performs lookup of root expansion formulas along with the required constraints, storing them in attributes `formulas` and `constraints` respectively.                                                                             |\n| `get_expansions()`                  | Generate term-by-term expansions at all specified orders, storing them in a nested dictionary in attribute `expansions`. If `basis` is set to `both`, expansions in the real basis will be stored in attribute `real_expansions`. |\n\n## The `auto()` method\n\nThe methods discussed in the previous subsection can be immediately performed after initialization of a VHEGEN instance by the `auto()` method. This method sequentially calls all mandaory processes discussed above to generate the `expansions` attribute including all matrix elements. It will also transform to the real E component basis if applicable. Below is an example script of how one would ggenerate the expanded matrix elements for a specific vibronic Hamiltonian at the desired orders.\n\n```python\nimport vhegen as vhe \n\nparams = vhe.inp.prepare_input(sym='D4h', states='Eg+A1u', modes='eg+b2u', orders='0,10')\n\nvhegen_instance = vhe.VHEGEN(params)\n\nvhegen_instance.auto()\n\nprint(vhegen_instance.expansions)\n```\n\n## Expansion output\n\nThe final expansions may be viewed by printing attribute `expansions`. Alternatively they may also be checked by executing method `pdflatex(path)` to produce a compiled output `.pdf` file similarly in procedural usage. If `path` is left unspecified, the output `.pdf` will be sent to the `outputs` subdirectory as it is in procedural usage.\n\n## Authors\n\n* James Brown (York University)\n* Robert A. Lang (University of Toronto)\n* Riley J. Hickman (University of Toronto)\n* Tao Zeng (York University)\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/T-Zeng-Group-TheoChem-YorkU/vhegen",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "vhegen",
    "package_url": "https://pypi.org/project/vhegen/",
    "platform": "",
    "project_url": "https://pypi.org/project/vhegen/",
    "project_urls": {
      "Bug Tracker": "https://github.com/T-Zeng-Group-TheoChem-YorkU/vhegen/issues",
      "Homepage": "https://github.com/T-Zeng-Group-TheoChem-YorkU/vhegen"
    },
    "release_url": "https://pypi.org/project/vhegen/2.0.21/",
    "requires_dist": [
      "numpy",
      "sympy"
    ],
    "requires_python": ">=3.6",
    "summary": "A package that generates Hamiltonians for arbitrarly large (pseudo)Jahn-Teller systems",
    "version": "2.0.21",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 10242807,
  "releases": {
    "2.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "54206f8d602b23345f6c56972d17c7075e2d69f2677662d1b502e590f6708142",
          "md5": "4942e173042de4cc2bca46379e2df40e",
          "sha256": "c39cbed604e13788fbcf1745ebbf815153b84344ba32ecf19c83d77dc60c4b13"
        },
        "downloads": -1,
        "filename": "vhegen-2.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "4942e173042de4cc2bca46379e2df40e",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 51750,
        "upload_time": "2021-04-16T15:54:03",
        "upload_time_iso_8601": "2021-04-16T15:54:03.260271Z",
        "url": "https://files.pythonhosted.org/packages/54/20/6f8d602b23345f6c56972d17c7075e2d69f2677662d1b502e590f6708142/vhegen-2.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "c287bbf97be7770c77d05aec0a416e789dd81719b6fe4059bb5eec5ddc3c9451",
          "md5": "a1bb480bbacccda456dcd2a165669454",
          "sha256": "776aa01de9cd32641500f8680da16e321fa0adf66e7f53ae439307758c545cd5"
        },
        "downloads": -1,
        "filename": "vhegen-2.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "a1bb480bbacccda456dcd2a165669454",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 54437,
        "upload_time": "2021-04-16T15:54:04",
        "upload_time_iso_8601": "2021-04-16T15:54:04.479697Z",
        "url": "https://files.pythonhosted.org/packages/c2/87/bbf97be7770c77d05aec0a416e789dd81719b6fe4059bb5eec5ddc3c9451/vhegen-2.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "e2677e963a76b5f47cbe0271167a09b9c42ffa29c46752236aae7adaebc563c3",
          "md5": "b1d10b116ff3e3d6a11b975cdf9c8c5e",
          "sha256": "6f18e882b8f36dfd70c6255aad407bbafa41b471d6d9f66d27ea04938c32dc2c"
        },
        "downloads": -1,
        "filename": "vhegen-2.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "b1d10b116ff3e3d6a11b975cdf9c8c5e",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 51813,
        "upload_time": "2021-04-16T16:20:01",
        "upload_time_iso_8601": "2021-04-16T16:20:01.518360Z",
        "url": "https://files.pythonhosted.org/packages/e2/67/7e963a76b5f47cbe0271167a09b9c42ffa29c46752236aae7adaebc563c3/vhegen-2.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5bba0e57979ae6c468372f282e50b7d64532de4136e5e17814b85e6c0b106fc2",
          "md5": "1389f7814af632a7c4315bca9b8bfa81",
          "sha256": "90f88ad59438deddc8f03561a16d20d22c728a1a333b38b962ce2617fe2a8051"
        },
        "downloads": -1,
        "filename": "vhegen-2.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "1389f7814af632a7c4315bca9b8bfa81",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 54505,
        "upload_time": "2021-04-16T16:20:02",
        "upload_time_iso_8601": "2021-04-16T16:20:02.873227Z",
        "url": "https://files.pythonhosted.org/packages/5b/ba/0e57979ae6c468372f282e50b7d64532de4136e5e17814b85e6c0b106fc2/vhegen-2.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.0.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "6620d9684cf3cccd857eb3f6705f681d0210f5d714096e05bfb6820d50ad0c6f",
          "md5": "5b0a32b712826cd0b53fb106f158facd",
          "sha256": "d1ed0c571a9fad2459b6d776720b7681a3fbe44ac9d5cbdd288191a2c59d2ccc"
        },
        "downloads": -1,
        "filename": "vhegen-2.0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "5b0a32b712826cd0b53fb106f158facd",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 51846,
        "upload_time": "2021-04-16T19:36:42",
        "upload_time_iso_8601": "2021-04-16T19:36:42.120619Z",
        "url": "https://files.pythonhosted.org/packages/66/20/d9684cf3cccd857eb3f6705f681d0210f5d714096e05bfb6820d50ad0c6f/vhegen-2.0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "b23fea661001deb496ee5dfe8d1a3adda611693431a8533fcd39e60c95e22750",
          "md5": "755729624c47534017abbc8180bd1a40",
          "sha256": "1d6ddaba36dd9c3ab76d983670d60bb2c888bd042804805880f6528d49d16514"
        },
        "downloads": -1,
        "filename": "vhegen-2.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "755729624c47534017abbc8180bd1a40",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 54626,
        "upload_time": "2021-04-16T19:36:43",
        "upload_time_iso_8601": "2021-04-16T19:36:43.520768Z",
        "url": "https://files.pythonhosted.org/packages/b2/3f/ea661001deb496ee5dfe8d1a3adda611693431a8533fcd39e60c95e22750/vhegen-2.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.0.21": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "9fefe9e76c2a7d4456875feed75cace5ed409cf12814f68f518438095e5122ef",
          "md5": "491fcbed22c500c98fd6c60ca6638df3",
          "sha256": "2c3fdb09e97a1a92685742dbde6613bd2e0aa400b2c982816cf4aaa7d4a368bb"
        },
        "downloads": -1,
        "filename": "vhegen-2.0.21-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "491fcbed22c500c98fd6c60ca6638df3",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.6",
        "size": 51860,
        "upload_time": "2021-05-03T18:03:20",
        "upload_time_iso_8601": "2021-05-03T18:03:20.897069Z",
        "url": "https://files.pythonhosted.org/packages/9f/ef/e9e76c2a7d4456875feed75cace5ed409cf12814f68f518438095e5122ef/vhegen-2.0.21-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "88f81cfe458498ee1cb6308cc739f8e3eabdf0eadf92fe18d51560aa4b358b28",
          "md5": "8e157dea069f8abf8d656bc457020ce4",
          "sha256": "e4b8b8e53e444d75869496e8f01b2d74c629f2a322940a8f445b09cdbd6af124"
        },
        "downloads": -1,
        "filename": "vhegen-2.0.21.tar.gz",
        "has_sig": false,
        "md5_digest": "8e157dea069f8abf8d656bc457020ce4",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 54649,
        "upload_time": "2021-05-03T18:03:22",
        "upload_time_iso_8601": "2021-05-03T18:03:22.356521Z",
        "url": "https://files.pythonhosted.org/packages/88/f8/1cfe458498ee1cb6308cc739f8e3eabdf0eadf92fe18d51560aa4b358b28/vhegen-2.0.21.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "9fefe9e76c2a7d4456875feed75cace5ed409cf12814f68f518438095e5122ef",
        "md5": "491fcbed22c500c98fd6c60ca6638df3",
        "sha256": "2c3fdb09e97a1a92685742dbde6613bd2e0aa400b2c982816cf4aaa7d4a368bb"
      },
      "downloads": -1,
      "filename": "vhegen-2.0.21-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "491fcbed22c500c98fd6c60ca6638df3",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6",
      "size": 51860,
      "upload_time": "2021-05-03T18:03:20",
      "upload_time_iso_8601": "2021-05-03T18:03:20.897069Z",
      "url": "https://files.pythonhosted.org/packages/9f/ef/e9e76c2a7d4456875feed75cace5ed409cf12814f68f518438095e5122ef/vhegen-2.0.21-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "88f81cfe458498ee1cb6308cc739f8e3eabdf0eadf92fe18d51560aa4b358b28",
        "md5": "8e157dea069f8abf8d656bc457020ce4",
        "sha256": "e4b8b8e53e444d75869496e8f01b2d74c629f2a322940a8f445b09cdbd6af124"
      },
      "downloads": -1,
      "filename": "vhegen-2.0.21.tar.gz",
      "has_sig": false,
      "md5_digest": "8e157dea069f8abf8d656bc457020ce4",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 54649,
      "upload_time": "2021-05-03T18:03:22",
      "upload_time_iso_8601": "2021-05-03T18:03:22.356521Z",
      "url": "https://files.pythonhosted.org/packages/88/f8/1cfe458498ee1cb6308cc739f8e3eabdf0eadf92fe18d51560aa4b358b28/vhegen-2.0.21.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}