{
  "info": {
    "author": null,
    "author_email": "Michael Stanley <stanley50@marshall.edu>",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "License :: OSI Approved :: GNU General Public License v3 (GPLv3)",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "Description\n===========\n\nThis project provides several utility scripts to help in the use of Rivendell \nRadio Automation 3.4.0+\n\n\n``Filter Cart Report For Music Scheduler`` takes the Rivendell Cart Data Dump \n(.csv) and filters out the fields, cart types, and cuts that are not needed by \nexternal scheduling software.\n\n``Load Current Log Line`` selects which log to use and which line in the log to \nuse based on the current date and time.\n\n``Import With File System Metadata`` uses the folder structure to find the \ngroup and scheduler code(s) to which a file should be imported.\n\n\n`Installation - Linux`_\n\n`Installation - Windows`_\n\n`Usage`_\n\n    #. `Filter Cart Report For Music Scheduler`_\n\n    #. `Load Current Log Line`_\n\n        `Running Load Current Log Line at Startup`_\n\n    #. `Import With File System Metadata`_\n\n        `Running Import With File System Metadata as a Service`_\n\n    #. `Logging`_\n\nInstallation - Linux\n====================\n\n#. If you are using a CentOS 7, you will need to install Python 3. (Ubuntu 22.04 Jammy Jellyfish and Linux Mint 21.1 Vera both have Python 3.10 installed by default.) This command will install Python 3.6.8, which is the most recent version in the default CentOS 7 repos. This module is tested on Python 3.6-3.11.\n\n    ``sudo yum -y install python3``\n\n#. If you are using Ubuntu 22.04 Jammy Jellyfish or Mint 21.1 Vera, you will need to install python3-venv.\n \n    ``sudo apt-get update``\n    ``sudo apt-get install python3.10-venv``\n\n#. Go to your home directory.\n\n    ``cd ~``\n\n#. Create a Python Virtual Environment for this module. Putting it into a virtual environment will prevent this module from interfering with or receiving interference from other Python 3 modules on your system.\n\n    ``python3 -m venv wmul_rivendell_venv``\n\n#. Activate the virtual environment.\n\n    ``source wmul_rivendell_venv/bin/activate``\n\n#. Update pip, because the version packaged with Python 3.6.8 is old.\n\n    ``pip3 install --upgrade pip``\n\n#. pip install this package.\n\n    ``pip3 install wmul_rivendell``\n\n\nInstallation - Windows\n======================\nWhile ``Load Current Log Line`` and ``Rivendell Audio Importer`` are only usable on the same machine as the Rivendell install, ``Filter Cart Report For Music Scheduler`` can be run on a Windows machine as well. (Presumably the same machine as the music scheduler software.)\n\n#. Download and install a recent version of Python 3 from https://www.python.org/downloads/ . This software has been tested with Python 3.6-3.11.\n\n    #. Check \"Install Launcher for all users (recommended)\" and \"Add Python 3.11 to PATH\". (Or whichever Python version you are installing.)\n    #. Click \"Customize Installation\".\n    #. Make certain that \"pip\" is checked.\n    #. Click \"Next\".\n    #. Make certain that \"Install for all users\" is checked.\n    #. Click \"Install\".\n    #. Confirm the UAC dialog when it appears.\n    #. Once the install is complete, click \"Close\".\n\n#. Open a Windows Powershell terminal.\n\n#. Change to the root of the C: drive.\n\n    ``cd \\``\n\n#. Create a Python Virtual Environment for this module. Putting it into a virtual environment will prevent this module from interfering with or receiving interference from other Python 3 modules on your system.\n\n    ``python3 -m venv wmul_rivendell_venv``\n\n#. Activate the virtual environment.\n\n    ``.\\wmul_rivendell_venv\\Scripts\\Activate.ps1``\n\n#. Update pip, because the version packaged with the Python installer is a bit old almost as soon as the installer is released.\n\n    ``pip install --upgrade pip``\n\n#. pip install using the requirements.txt file in this directory. You have to run pip while in the repo directory so that requirements.txt correctly points to the code in this directory.\n\n    ``pip3 install wmul_rivendell``\n\n\nUsage\n=====\n\nWhile these three scripts are bundled together because of their common goal of assisting the Rivendell experience, they are really three different scripts with three different usages.\n\nFilter Cart Report For Music Scheduler\n--------------------------------------\n\nThis script takes the Rivendell Cart Data Dump (.csv) and filters out the fields, cart types, and cuts that are not needed by external scheduling software.\n\nIn particular, Natural Music 5 has trouble importing the full Cart Data Dump. It seems to be due to the number of fields. The Cart Data Dump includes 33 fields and Natural Music 5 seems to only be able to handle 32.\n\nThis script can optionally remove MACRO carts from the data dump and reduce the entry for each cart down to a single cut.\n\nThis script can optionally remove any cuts belonging to specified groups. Use the ``--excluded_groups_file_name [FILENAME]`` option. The ``FILENAME`` should contain a list of group names that are to be excluded from the output file. \nEach group name should be on a separate line. Any cuts belonging to any of those groups will be exluded from the output. Usefull for keeping your non-music cuts out of your music scheduler.\n\n#. To begin, you will need to create a text file containing the field names that you want to keep. Each field needs to be on its own line. Field names are case-insensitive. Two example files are in the github repo: ``https://github.com/MikeTheHammer/wmul_rivendell/tree/main/example_files/``. \"all_fields.txt\" is every field included in Cart Data Dump. \"desired_fields.txt\" is an example of a file containing only the desired fields. Use Notepad on Windows, or \"Text Editor\" on Linux.\n\n#. Use RD Library to create a Cart Data Dump (.csv) file and save it.\n\n#. Run the filter script. Usage: ``wmul_rivendell [LOGGING] filter-cart-report RIVENDELL_CART_FILENAME  OUTPUT_FILENAME  DESIRED_FIELDS_FILENAME  [OPTIONS]`` .\n\n    a. **RIVENDELL_CART_FILENAME** is the name of the Cart Data Dump file.\n    b. **OUTPUT_FILENAME** is the name of the file to which the script should write. This is the file that you will load into your music scheduler. (If a file with this name already exists, it will be overwritten.)\n    c. **DESIRED_FIELDS_FILENAME** is the name of the file containing the list of desired fields. This is the file you created in step 1.\n    d. There are five **[OPTIONS]**:\n\n        i. **--include_macros** If this flag is set, MACROS will be included in the output.\n        ii. **--include_all_cuts** If this flag is set, all the cuts will be included in the output. If this flag is left off, only the lowest numbered cut will be output.\n        iii. **--use_trailing_comma** If this flag is set, each line of the output file will include a comma at the end. If your music scheduler cannot see the final field, try this setting. Natural Music 5 needs this flag.\n        iv. **--fix_header** Versions 3.6.4-3.6.6 of Rivendell included a bug in the Cart Data Dump (csv) where the header was malformed. Setting this flag causes that header to be fixed.\n        v. **--excluded_groups_file_name [FILENAME]** Allows you to supply a filename with a list of groups to exclude. Any cuts belonging to any of those groups will be exluded from the output. Usefull for keeping your non-music cuts out of your music scheduler.\n\n    e. For an explanation of **[LOGGING]**, see `Logging`_.\n\n#. Example: ``wmul_rivendell --log_name \"~/filter_cart_report.log\" --log_level 30 filter-cart-report \"~/cart_data_dump.csv\" \"~/cart_data_for_music_scheduler.csv\" \"~/desired_fields.txt\" --use_trailing_comma``\n\nLoad Current Log Line\n---------------------\n\nThis script will compute the log name for today, connect to the Rivendell database and find the line in that log that is closest to (but before) the current time. It can also compute this information for a provided date and time. It then sends an RML \"LL\" (Load Log) command to load that log on that line. Optionally it can send an e-mail showing that log and line were loaded.\n\nThis script must run on a system that has Rivendell installed since it depends on the ``rmlsend`` module. It's primary use-case is to start the Rivendell log in the correct place after a reboot; therefore, you will almost certainly want to install it on your main on-air machine.\n\nI am reasonably certain that this was based on Open Source Radio's 'load-log-skip-to-current-line':\nhttps://github.com/opensourceradio/ram/blob/e112952d87a64d92d564ab9693d37c9e63740607/usr/local/bin/load-log-skip-to-current-time .\nHowever, I did not document my source at the time I originally wrote this script.\n\nUsage: ``wmul_rivendell [LOGGING] load-current-log-line LOG_NAME_FORMAT RIVENDELL_HOST [OPTIONS]``\n\n#. **LOG_NAME_FORMAT**: The format of the log name. This will be the same text string that is in \"RD Admin | Manage Services | <Service> | Log Name Template\". E.G. \"WMUL-%m%d\"\n\n#. **RIVENDELL_HOST**: The hostname or IP address of the host that is running RD AirPlay.\n\n#. There are sixteen **[OPTIONS]**:\n\n    a. **--sql_host**: The host name to the SQL database. Usually localhost. Default: localhost.\n    b. **--sql_user**: The username for the SQL database. Usually rduser. Default: rduser.\n    c. **--sql_pass**: The password for the SQL database. Usually letmein. Default: letmein.\n    d. **--sql_database_name**: The Database name of the SQL database. Usually Rivendell. Default: Rivendell.\n    e. **--use_date**: The date of the log to be loaded. Format is YY-MM-DD or YYYY-MM-DD. If this option is omitted, the system date of the system running the script will be used.\n    f. **--use_time**: The time of the log line to be loaded. The script will find the line closest to, but before that time. Valid formats are HH:MM:SS AM, HH:MM AM, HH AM, HH:MM:SS, HH:MM, and HH. If AM/PM are present, HH will be 12-hour. If AM/PM are absent, HH will be 24-hour. IF MM and/or SS are omitted, they will be set to 00. If this option is omitted, the system time of the system running the script will be used.\n    g. **--dry_run**: For testing purposes. Prints out the log line that is selected, but does not load it.\n    h. **--start_immediately**: Starts the selected log line immediately. If not set, the selected log line will be 'made next'.\n    i. **--days_back**: Maximum number of days back in time to go. If a log is not available for the given day, the script will try to load the previous day's log. It will keep going back in time up to and including this many days. This option is for cases where it is preferred to load and replay an old log rather than no log.  If no logs can be found for those dates, it will try to load the default log, if provided. Set this value to 0 to not attempt previous days' logs. Defaults to 7.\n    j. **--default_log**: The full name of the last-ditch log to try to load if day based logs fail. (A future version will allow for\n    k. **--log_machine**: The log machine on which to load the playlist. Defaults to 1 (Main Log).\n    l. **--email_address**: The e-mail address to which the report should be sent.\n    m. **--mail_server**: The address of the e-mail SMTP server to use. This argument is required if email_address is supplied.\n    n. **--mail_port**: The port of the e-mail server. Defaults to 25.\n    o. **--mail_username**: The username to authenticate with the e-mail server. \n    p. **--mail_password**: The password to authenticate with the e-mail server.\n\n#. For an explanation of **[LOGGING]**, see `Logging`_.\n\nExample: ``wmul_rivendell --log_name \"~/load_current_log_line.log\" --log_level 30 load-current-log-line \"WMUL-%m%d\" 192.168.1.1 --sql_host 192.168.1.1 --email_address bob@example.com --mail_server 192.168.1.2 --mail_username bob --mail_password bobspassword``\n\nRunning Load Current Log Line at Startup\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n\nThis section explains how to setup a shell script to start RD AirPlay and run this script at startup.\n\n#. Copy the example shell script from the github repo to a text editor. \"Text Editor\" is installed by default. The sample shell script is at: ``https://github.com/MikeTheHammer/wmul_rivendell/blob/main/example_files/start_rivendell_and_load_current_log.sh`` .\n\n#. Edit the shell script.\n\n    a. The first line of this script ``rdairplay &`` starts RD AirPlay as a separate process.\n    b. The second line ``sleep 5s`` causes the shell script to sleep for 5 seconds. Sleeping gives time for RD AirPlay to load completely before the next part of the shell script runs. The 5 second pause works on my machine, which is a Core i7 9700 with an M.2 SSD. A lower performance machine may need a longer sleep.\n    c. The third line is the meat and potatoes of the shell script. Alter this line as needed to match the settings on your system.\n\n#. \"Save\" the file and exit your text editor.\n\n#. In a terminal window, enter ``chmod 700 start_rivendell_and_load_current_log.sh`` to make the shell script executable.\n\n#. In xfce, open \"Applications | Settings | Session and Startup\".\n\n#. Select the \"Application Autostart\" tab.\n\n#. Click \"Add\".\n\n#. Give the entry a name, such as \"Start RD AirPlay and load current log\". Optionally, give the entry a description.\n\n#. Click the folder icon next to the \"Command\" box.\n\n#. ``start_rivendell_and_load_current_log.sh`` should be in the \"Recently Used\" folder. If not, navigate to the \"rd\" home directory.\n\n#. Select ``start_rivendell_and_load_current_log.sh`` and then click \"OK\".\n\n#. Click \"OK\" again. This script should now run each time the ``rd`` user logs in.\n\nImport With File System Metadata\n--------------------------------\n\nThis script is different than the others. It is intended to run as a service. It continuously scans a directory and all of its subdirectories. When it detects a .wav file, it derives the Rivendell group and scheduler code(s) from the names of the subfolders. It then calls rdimport on the file and with the derived group and scheduler code(s).\n\nThis script is the almost the equivalent of being able to configure a dropbox with the Metadata Pattern of ``%g/%i.wav`` . (There is no metadata wildcard for scheduler codes.)\n\nThis script must run on a system that has Rivendell installed since it depends on the ``rdimport`` module.\n\nExamples:\n\n#. ``/Rivendell Import/FLASHBACK/Queen - Save Me.wav`` - Will be imported into the \"FLASHBACK\" group, with no scheduler codes.\n\n#. ``/Rivendell Import/FLASHBACK/1980/Queen - Save Me.wav`` - Will be imported into the \"FLASHBACK\" group, with the \"1980\" scheduler code.\n\n#. ``/Rivendell Import/FLASHBACK/1980/Vinyl/Queen - Save Me.wav`` - Will be imported into the \"FLASHBACK\" group, with the \"1980\" and \"Vinyl\" scheduler codes.\n\nNote: This script makes no attempt to verify that the group or scheduler code(s) are valid before calling ``rdimport``.\n\nLimitations:\n\n#. This importer will only detect .wav files.\n\n#. The rdimport options: \"--autotrim-level=0\", \"--normalization-level=0\", \"--title-from-cartchunk-cutid\", \"--delete-source\", \"--verbose\" are hardcoded.\n\n#. The rdimport option: \"--set-string-description=\" is hardcoded to the filename. E.G. ``--set-string-description=\"Queen - Save Me.wav\"`` .\n\nThese limitations may be removed in future versions.\n\nUsage:\n\n#. Usage: ``wmul_rivendell [LOGGING] import-with-file-system-metadata SOURCE_PATHS [OPTIONS]``\n\n#. **SOURCE_PATHS**: One or more system paths to search for files. Each subdirectory off each source path will be recursively searched. Any file in the root directory will be ignored since it doesn't have a group. ``\\source_path\\group\\scheduler code``\n\n#. There are three **[OPTIONS]**:\n\n    a. **--cache_duration**: How long (in seconds) this importer will remember a given file name after sending it to the Rivendell importer. For this duration, this importer will ignore any other files with this name. Defaults to 180 seconds (3 minutes).\n\n    b. **--rdimport_syslog**: Tell rdimport to log to syslog. Mutually Exclusive with **--rdimport_log_file_name**.\n\n    c. **--rdimport_log_file_name**: Tell rdimport to log to this filename. Mutually Exclusive with **--rdimport_syslog**.\n\n#. For an explanation of **[LOGGING]**, see `Logging`_.\n\n#. Example: ``wmul_rivendell --log_name \"/home/rd/import_with_file_system_metadata.log\" --log_level 30 import-with-file-system-metadata \"/mnt/Rivendell Import Folder/\"``\n\nRunning Import With File System Metadata as a Service\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n\nYou almost certainly want to run ``Import With File System Metadata`` as a service that will load and restart automatically. An example ``.service`` file is at: ``https://github.com/MikeTheHammer/wmul_rivendell/blob/main/example_files/wmul_rivendell_importer.service`` .\n\n#. Login as a user with ``sudo`` permission.\n\n#. Copy the example to a text editor. Save the file as ``wmul_rivendell_importer.service`` in your home folder. \n\n#. Alter the line starting with ``ExecStart=/home/rd/wmul_rivendell_venv/bin/wmul_rivendell`` as needed to match the settings on your system.\n\n#. Copy file to the ``/lib/systemd/system/`` directory. ``sudo cp /home/rd/wmul_rivendell_importer.service /lib/systemd/system/`` .\n\n#. Make the service file executable. ``sudo chmod 644 /lib/systemd/system/wmul_rivendell_importer.service`` .\n\n#. Enable the service.\n\n    ``sudo systemctl daemon-reload``\n\n    ``sudo systemctl enable wmul_rivendell_importer.service``\n\n    ``sudo systemctl start wmul_rivendell_importer.service``\n\nLogging\n-------\n**--log_name** is the path to the log file.\n\n**--log_level** is the log level: 10: Debug, 20: Info, 30: Warning, 40: Error, 50: Critical. Intermediate values (E.G. 32) are permitted, but will essentially be rounded up (E.G. Entering 32 is the same as entering 40. Logging messages lower than the log level will not be written to the log. E.G. If 30 is input, then all Debug, Info, and Verbose messages will be silenced.\n\nTo utilize this module's logging feature for debugging, the log directives need to be included between the ``wmul_rivendell`` command and the specific script command.\n\nExample: ``wmul_rivendell --log_name \"/home/rd/filter_cart_report.log\" --log_level 30 filter-cart-report [filter-cart-report-args]``\n\n(A future version may modify this.)\n",
    "description_content_type": "text/x-rst",
    "docs_url": null,
    "download_url": null,
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": null,
    "keywords": null,
    "license": null,
    "maintainer": null,
    "maintainer_email": null,
    "name": "wmul_rivendell",
    "package_url": "https://pypi.org/project/wmul_rivendell/",
    "platform": null,
    "project_url": "https://pypi.org/project/wmul_rivendell/",
    "project_urls": {
      "Bug Tracker": "https://github.com/MikeTheHammer/wmul_rivendell/issues",
      "Home": "https://github.com/MikeTheHammer/wmul_rivendell"
    },
    "release_url": "https://pypi.org/project/wmul_rivendell/0.12.1/",
    "requires_dist": [
      "wmul_logger>=0.5.1",
      "wmul_emailer>=0.5.0",
      "click",
      "mysql-connector-python<8.0.29;python_version < '3.7.0'",
      "mysql-connector-python>8.0;python_version > '3.7.0'",
      "cachetools",
      "protobuf>=3.19.0;python_version > '3.7.0'",
      "protobuf<=3.19.4;python_version < '3.7.0'",
      "dataclasses;python_version < '3.7.0'",
      "pytest ; extra == \"test\"",
      "pytest-mock ; extra == \"test\"",
      "pyfakefs ; extra == \"test\"",
      "wmul_test_utils>=0.3.1 ; extra == \"test\"",
      "tox ; extra == \"tox\""
    ],
    "requires_python": null,
    "summary": "Various scripts to help use Rivendell Radio Automation 3.4.1+",
    "version": "0.12.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17496574,
  "releases": {
    "0.11.1": [
      {
        "comment_text": null,
        "digests": {
          "blake2b_256": "d6ae569dec0937692f91f65aa4bccb07b5e557843afa8cce62413819eb0e40a0",
          "md5": "df52d7638328a70d95178b0d6f0d9574",
          "sha256": "72a65708dbdff29a08afc142e2a1b611edba875c1b65f5379ab4fcd83d5ce373"
        },
        "downloads": -1,
        "filename": "wmul_rivendell-0.11.1-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "df52d7638328a70d95178b0d6f0d9574",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": null,
        "size": 33639,
        "upload_time": "2023-01-20T20:51:33",
        "upload_time_iso_8601": "2023-01-20T20:51:33.081490Z",
        "url": "https://files.pythonhosted.org/packages/d6/ae/569dec0937692f91f65aa4bccb07b5e557843afa8cce62413819eb0e40a0/wmul_rivendell-0.11.1-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": null,
        "digests": {
          "blake2b_256": "adb92e0b5bbc37d9cff9606ac90c57578bbd8f38562dff9680ecf5c7c1315ecc",
          "md5": "cc375a6093c63c8347beab23b33ea24a",
          "sha256": "3d83f904e43ae6405f82de6d584c138844fe33b844eb45624f7fc47b40e840ef"
        },
        "downloads": -1,
        "filename": "wmul_rivendell-0.11.1.tar.gz",
        "has_sig": false,
        "md5_digest": "cc375a6093c63c8347beab23b33ea24a",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 52404,
        "upload_time": "2023-01-20T20:51:34",
        "upload_time_iso_8601": "2023-01-20T20:51:34.554417Z",
        "url": "https://files.pythonhosted.org/packages/ad/b9/2e0b5bbc37d9cff9606ac90c57578bbd8f38562dff9680ecf5c7c1315ecc/wmul_rivendell-0.11.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.12.0": [
      {
        "comment_text": null,
        "digests": {
          "blake2b_256": "529c94d9c65098f52ee1923faa4cf33654b43207e6b6dd1be3adbaccfd07b2df",
          "md5": "08e16d8c19435b5190a80f4e799fd04e",
          "sha256": "8d6c03de568e8516ff7041aaa8e28d4ce52981c708121e624e11b8d0458e0561"
        },
        "downloads": -1,
        "filename": "wmul_rivendell-0.12.0-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "08e16d8c19435b5190a80f4e799fd04e",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": null,
        "size": 34100,
        "upload_time": "2023-03-28T20:21:52",
        "upload_time_iso_8601": "2023-03-28T20:21:52.785303Z",
        "url": "https://files.pythonhosted.org/packages/52/9c/94d9c65098f52ee1923faa4cf33654b43207e6b6dd1be3adbaccfd07b2df/wmul_rivendell-0.12.0-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": null,
        "digests": {
          "blake2b_256": "97eeb688e686c87bde0d4b5b979b2f8c162fef154bea07b2be13b38f6a4e0aed",
          "md5": "86ef7a9b6c27b4741686a4b714f5152f",
          "sha256": "3b581738d6cebf9a24e0d8cd48661e2b12c38dc3d2313f99a9a67ab91751a45d"
        },
        "downloads": -1,
        "filename": "wmul_rivendell-0.12.0.tar.gz",
        "has_sig": false,
        "md5_digest": "86ef7a9b6c27b4741686a4b714f5152f",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 53504,
        "upload_time": "2023-03-28T20:21:54",
        "upload_time_iso_8601": "2023-03-28T20:21:54.553538Z",
        "url": "https://files.pythonhosted.org/packages/97/ee/b688e686c87bde0d4b5b979b2f8c162fef154bea07b2be13b38f6a4e0aed/wmul_rivendell-0.12.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.12.1": [
      {
        "comment_text": null,
        "digests": {
          "blake2b_256": "d4023303b5987d3b13d87d6b9869281fc955086a1bc91f4c3f8779ac9b75e743",
          "md5": "a339418feb43132364236fdf9c7fbb4c",
          "sha256": "dea7263f6cad53c03a57de1321f776890a10c79e714be3a8193299ff2009801a"
        },
        "downloads": -1,
        "filename": "wmul_rivendell-0.12.1-py2.py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "a339418feb43132364236fdf9c7fbb4c",
        "packagetype": "bdist_wheel",
        "python_version": "py2.py3",
        "requires_python": null,
        "size": 34102,
        "upload_time": "2023-03-29T17:06:01",
        "upload_time_iso_8601": "2023-03-29T17:06:01.953553Z",
        "url": "https://files.pythonhosted.org/packages/d4/02/3303b5987d3b13d87d6b9869281fc955086a1bc91f4c3f8779ac9b75e743/wmul_rivendell-0.12.1-py2.py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": null,
        "digests": {
          "blake2b_256": "b644d59d3ec112a9b4d196e18fe4436f5c89bd5afb967d446153f5c97e8d5b45",
          "md5": "040e7697b8b10f607036167326562af2",
          "sha256": "21e42a60f25960b804fa1323c15eb0e9af7a085192ec61d17e80596bf1bc731f"
        },
        "downloads": -1,
        "filename": "wmul_rivendell-0.12.1.tar.gz",
        "has_sig": false,
        "md5_digest": "040e7697b8b10f607036167326562af2",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 53503,
        "upload_time": "2023-03-29T17:06:04",
        "upload_time_iso_8601": "2023-03-29T17:06:04.694229Z",
        "url": "https://files.pythonhosted.org/packages/b6/44/d59d3ec112a9b4d196e18fe4436f5c89bd5afb967d446153f5c97e8d5b45/wmul_rivendell-0.12.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": null,
      "digests": {
        "blake2b_256": "d4023303b5987d3b13d87d6b9869281fc955086a1bc91f4c3f8779ac9b75e743",
        "md5": "a339418feb43132364236fdf9c7fbb4c",
        "sha256": "dea7263f6cad53c03a57de1321f776890a10c79e714be3a8193299ff2009801a"
      },
      "downloads": -1,
      "filename": "wmul_rivendell-0.12.1-py2.py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "a339418feb43132364236fdf9c7fbb4c",
      "packagetype": "bdist_wheel",
      "python_version": "py2.py3",
      "requires_python": null,
      "size": 34102,
      "upload_time": "2023-03-29T17:06:01",
      "upload_time_iso_8601": "2023-03-29T17:06:01.953553Z",
      "url": "https://files.pythonhosted.org/packages/d4/02/3303b5987d3b13d87d6b9869281fc955086a1bc91f4c3f8779ac9b75e743/wmul_rivendell-0.12.1-py2.py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": null,
      "digests": {
        "blake2b_256": "b644d59d3ec112a9b4d196e18fe4436f5c89bd5afb967d446153f5c97e8d5b45",
        "md5": "040e7697b8b10f607036167326562af2",
        "sha256": "21e42a60f25960b804fa1323c15eb0e9af7a085192ec61d17e80596bf1bc731f"
      },
      "downloads": -1,
      "filename": "wmul_rivendell-0.12.1.tar.gz",
      "has_sig": false,
      "md5_digest": "040e7697b8b10f607036167326562af2",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 53503,
      "upload_time": "2023-03-29T17:06:04",
      "upload_time_iso_8601": "2023-03-29T17:06:04.694229Z",
      "url": "https://files.pythonhosted.org/packages/b6/44/d59d3ec112a9b4d196e18fe4436f5c89bd5afb967d446153f5c97e8d5b45/wmul_rivendell-0.12.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}