{
  "info": {
    "author": "WSU CECS, Owen O'Connor",
    "author_email": "cse-support@wright.edu",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 4 - Beta",
      "Environment :: Console",
      "Intended Audience :: Education",
      "License :: OSI Approved :: MIT License",
      "Natural Language :: English",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3 :: Only",
      "Topic :: Education :: Computer Aided Instruction (CAI)"
    ],
    "description": "# autograder\nAutomatic grading using coding and algorithms.\n\n![Demo of the autograder in action](screenshots/demo.gif \"Demo!\")\n\n## How It Works\n\nGrading is done by gathering the output of a large-ish number of test cases from both the student and the grader program.\nThere's no limit to the number of test cases that can be used, but it seems like a reasonable number to start at is around 5 or 6.\nOnce the outputs from a program are collected, they are broken into individual tokens and the tokens are then compared. Tokens \nthat show significant differences between the test cases are marked as being important to the grade, and tokens that remain\nthe same are discarded. This allows the autograder to ignore any potential whitespace, wording, or spelling differences between\nthe project description and the student program without the need to construct huge rigorous regular expressions for each test case.\n\n\n## Usage\n\n### Installation \n\nCurrently working on getting a PyPI package setup. When it's done, you will be able to install the autograder using `pip install wsu-autograder`\n\n### CLI Options\n\n- `-c`, `--config`: Path to a json containing the grading parameters and test cases\n- `-s`, `--student-directory`: Path to a student directory. Instead of grading all student submissions, only grade the one specified\n- `-n`, `--no-cat`: Boolean flag. If present, the student code isn't displayed and all test cases are run automatically\n\nStandard usage is `autograder -c path/to/config.json`\n\n### JSON Structure\n\nThe Json is divided into two main parts, `settings` and `tests`:\n\n- `settings`: Generic settings to be used while compiling, running, and grading the programs\n  - `penalties`: Penalties to be applied when various errors are detected\n    - `character_penalty`: (float, default 50) Penalty applied for every character difference between student and grader word tokens.\n    - `compile_failure_penalty`: (float, default 1000) Penalty applied once if the student program fails to compile (not implemented).\n    - `missing_string_penalty`: (float, default 100) Penalty applied for every required string that wasn't found in the stdout or stderr of the student program.\n    - `numeric_penalty`: (float, default 10) Penalty applied whenever there is a difference between student and grader numeric token. \n    - `run_failure_penalty`: (float, default 100) Penalty applied once if the student program has a non-zero exit code.\n      Penalty is scaled by the approximate percent difference between the tokens.\n    - `timeout_penalty`: (float, default 100) Penalty applied once if the student program exceeded a runtime limit set for the test case.\n    - `token_count_penalty`: (float, default 50) Penalty applied once if there is a mismatch between the number of student and grader tokens.\n    - `type_penalty`: (float, default 20) Penalty applied whenever there is a type mismatch between student and grader tokens.\n  - `all_tokens_strings`: (bool, default false) Forces all tokens to be treated as wither words or whitespace. Very useful for dealing with text processing programs\n    that might output numbers as a result of the input, but you don't want the numbers to be graded differently.\n  - `collapse_whitespace`: (bool, default true) Whether or not the amount of whitespace between characters should be considered important for this program.\n  - `connect_adjacent_words`: (bool, default false) When set to true, adjacent word tokens that have all been marked as important will be combined into one large token.\n    Very useful for programs that primarily deal with text processing.\n  - `enforce_floating_point`: (bool, default false) If the grader has a decimal point in the output, the student must too and vice versa. If false, `10.0` and `10` will\n    be considered to be equal.\n  - `grader_directory`: (path, default 'Grader') The relative path from the config json to the directory containing all of the grader code.\n  - `ignore_nonumeric_tokens`: (bool, default false) The opposite of `all_tokens_strings`. Discards any tokens that aren't either ints or floats when grading.\n  - `language`: (string, default 'java') The language that the program being graded is written in. Current valid options are `'bash'`, `'c'`, `'cpp'`, `'c++'`,\n    `'java'`, `'python'`, `'sh'`, and `'shell'`.\n  - `pass_threshold`: (float, default 95) The grade out of 100 considered to be a passing grade for the tests. Mostly only effects the formatting of output.\n  - `penalty_weight`: (float, default 0.1) A constant used to set how much the accumulated penalties will effect the student's score. Score is computed\n    using the equation `100 * exp(penalty * weight)`.\n  - `student_directory`: (path, default 'Student') The relative path from the config json to the directory containing all of the student directories.\n- `test`: an array of dictionaries with the following structure:\n  - `args`: (array(string), default []) An array of strings to be passed as command line arguments to the student program when running this test case.\n  - `command` (array(string), default None) Specifies a custom command to be used to run this test case. Should only be used in very certain cases, since the\n    `args` and `runner_args` flags should usually work in most any situation.\n  - `description`: (string, default '') A human readable description of the test case.\n  - `required_strings`: (array(string), default []) A list of strings that are required to be present in the stdout of the program. For each of the strings that are missing\n    the `missing_string_penalty` will be applied.\n  - `required_strings_stderr`: (array(string), default []) A list of strings that are required to be present in the stderr of the program. For each of the strings that are \n    missing, the `missing_string_penalty` will be applied.\n  - `runner_args`: (array(string), default []) A list of strings to be prepended to the command used to run the test case. Useful for testing with valgrind or running\n    student code inside of a container.\n  - `stdin`: (string, default '') The data to be piped into stdin of the program while running the test case.\n  - `timeout`: (float, default 5) The number of seconds to wait before terminating the program being graded and marking it as having timed out on the test case.\n  - `weight`: (float, default 1) The weight to be applied to the test case's grade when computing the overall grade.\n\n\n## Limitations\n\nThere are currently a few limitations to what the autograder can handle. There are workarounds that allow some these cases to\nbe handled properly, but they are less than ideal and full support will need to be added to the autograder in the future.\n\n### Floats starting with `.`\n\nIf a floating point number in the output is in the form `.###` or `-.###`, it will currently be split into two individual tokens.\nThe first token will be a word containing `.` or `-.` and the second token will be an integer equal to `###`. If a student program\nuses this format and the grader program doesn't a numeric mismatch between `0.###` and `###` will be detected and the student marked\nas incorrect. There is currently no workaround for this issue.\n\n### Out of order tokens\n\nThe autograder will discard any unimportant tokens, but the important tokens found must be in the exact same order in the student\nprogram and the grader program, otherwise the student will be graded incorrectly. For example, if the grader prints the size of a box\nas `length x height` and the student prints the size of the box as `height x length`, the student will be marked incorrect even if\nthe values printed out were correct. There is currently no workaround for this issue.\n\n### Random number generators\n\nThe output of a program must be deterministically determined by its inputs and command line arguments, within a very small margin of\nerror to allow for IEEE-754 uncertainties. As such, if a programs output is partially or completely determined by a random number\ngenerator, the autograder will not be able to detect and compare the tokens correctly. A workaround for this issue is to either have\nthe student take their RNG seed from an argument or stdin, or to simply have their code use a constant seed while grading.\n\n### Programs looping over varying length input\n\nIf the program executes and prints results from the same block of code depending on the length of the user input, extra tokens can\nbe incorrectly detected as being important. For example, if the assignment being graded is to make a simple shell and the shell prompt\nis printed for every line in user input it can be flagged as an important token even though it's not required to have any particular value.\nA potential workaround for this is to make sure all the supplied test cases will loop over the same number of iterations.\n\n### Programs with constant output\n\nIf a program's output is fixed and doesn't change based on stdin or arguments, there will be no test cases for the autograder to compare\nand the important tokens will not be detected.\n\n## Notes\n\n### Required libraries\n\nThere are several python libraries required to run the autograder. They are:\n\n- **binaryornot** (Used to check if a file is binary): `conda install binaryornot` or `pip install binaryornot`\n- **lark** (Used to parse student output): `conda install -c conda-forge lark-parser` or `pip install lark-parser`\n- **pygments** (Used for syntax highlighting): `conda install pygments` or `pip install Pygments`\n- **tqdm** (Used for progress bars): `conda install tqdm` or `pip install tqdm`\n\nAn exported yaml of the conda environment used to develop the autograder can be found in the `environment.yml` file in this repository.\n\n### TODOs\n\n- An extra tool that will automatically extract and grade a pilot bulk download\n- A web interface for grading. Upload config, Grader, and Student zip and go\n- Add a similar field to the `required_strings` that can be used to specify a list of regexes that need to match the student output\n- Add another thing kinda like `required_strings`, only that all it does is that it automatically flags any matching text as a token\n- The ability to capture and display the stdin and stdout of the program alongside each other. The stdout will need to be unbuffered to do this. Look at pty?\n- A prompt to display the student's code after inspecting incorrect results?\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/wrightedu/autograder",
    "keywords": "grading,automation,wright state university",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "wsu-autograder",
    "package_url": "https://pypi.org/project/wsu-autograder/",
    "platform": "",
    "project_url": "https://pypi.org/project/wsu-autograder/",
    "project_urls": {
      "Homepage": "https://github.com/wrightedu/autograder"
    },
    "release_url": "https://pypi.org/project/wsu-autograder/1.0.1/",
    "requires_dist": [
      "binaryornot",
      "lark-parser",
      "Pygments",
      "tqdm"
    ],
    "requires_python": "",
    "summary": "An intelligent autograder tool written and used by the Wright State University CECS department",
    "version": "1.0.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 10444007,
  "releases": {
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "0e06b923d53d60d454d36c67ebdb542ec08ff95f0d709751bf6bcb7f41ba3986",
          "md5": "6f0e637e16ba9b26187d698ba7a99307",
          "sha256": "6af27aaed1b0a56ba83edfe2350a2ee99a146c635a70636cd958b54335941b0a"
        },
        "downloads": -1,
        "filename": "wsu_autograder-1.0.1-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "6f0e637e16ba9b26187d698ba7a99307",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": null,
        "size": 19582,
        "upload_time": "2021-05-22T22:19:23",
        "upload_time_iso_8601": "2021-05-22T22:19:23.849849Z",
        "url": "https://files.pythonhosted.org/packages/0e/06/b923d53d60d454d36c67ebdb542ec08ff95f0d709751bf6bcb7f41ba3986/wsu_autograder-1.0.1-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "4de45fc96c04103506d5208e3366a8a6c47774d81467b9fb10bdcd3e5b154a12",
          "md5": "bde38504fa32a67fb498a7dbf16709dd",
          "sha256": "79aa5717a9a49a8bfa0ddc94d960a4feb2736c39aa7a61dd82f5299eadca5558"
        },
        "downloads": -1,
        "filename": "wsu-autograder-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "bde38504fa32a67fb498a7dbf16709dd",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 21627,
        "upload_time": "2021-05-22T22:19:25",
        "upload_time_iso_8601": "2021-05-22T22:19:25.575665Z",
        "url": "https://files.pythonhosted.org/packages/4d/e4/5fc96c04103506d5208e3366a8a6c47774d81467b9fb10bdcd3e5b154a12/wsu-autograder-1.0.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "0e06b923d53d60d454d36c67ebdb542ec08ff95f0d709751bf6bcb7f41ba3986",
        "md5": "6f0e637e16ba9b26187d698ba7a99307",
        "sha256": "6af27aaed1b0a56ba83edfe2350a2ee99a146c635a70636cd958b54335941b0a"
      },
      "downloads": -1,
      "filename": "wsu_autograder-1.0.1-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "6f0e637e16ba9b26187d698ba7a99307",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 19582,
      "upload_time": "2021-05-22T22:19:23",
      "upload_time_iso_8601": "2021-05-22T22:19:23.849849Z",
      "url": "https://files.pythonhosted.org/packages/0e/06/b923d53d60d454d36c67ebdb542ec08ff95f0d709751bf6bcb7f41ba3986/wsu_autograder-1.0.1-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "4de45fc96c04103506d5208e3366a8a6c47774d81467b9fb10bdcd3e5b154a12",
        "md5": "bde38504fa32a67fb498a7dbf16709dd",
        "sha256": "79aa5717a9a49a8bfa0ddc94d960a4feb2736c39aa7a61dd82f5299eadca5558"
      },
      "downloads": -1,
      "filename": "wsu-autograder-1.0.1.tar.gz",
      "has_sig": false,
      "md5_digest": "bde38504fa32a67fb498a7dbf16709dd",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 21627,
      "upload_time": "2021-05-22T22:19:25",
      "upload_time_iso_8601": "2021-05-22T22:19:25.575665Z",
      "url": "https://files.pythonhosted.org/packages/4d/e4/5fc96c04103506d5208e3366a8a6c47774d81467b9fb10bdcd3e5b154a12/wsu-autograder-1.0.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}