{
  "info": {
    "author": "Chris R. Vernon",
    "author_email": "chris.vernon@pnnl.gov",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "[![DOI](https://zenodo.org/badge/88797535.svg)](https://zenodo.org/badge/latestdoi/88797535)\n\n# Xanthos\nXanthos is an open-source hydrologic model, written in Python, designed to quantify and analyze global water availability. Xanthos simulates historical and future global water availability on a monthly time step at a spatial resolution of 0.5 geographic degrees. Xanthos was designed to be extensible and used by scientists that study global water supply and work with the Global Change Analysis Model (GCAM). Xanthos uses a user-defined configuration file to specify model inputs, outputs and parameters. Xanthos has been tested using actual global data sets and the model is able to provide historical observations and future estimates of renewable freshwater resources in the form of total runoff, average streamflow, potential evapotranspiration, actual evapotranspiration, accessible water, hydropower potential, and more.\n\n# Get Started with Xanthos\nSet up Xanthos using the following steps:\n1.  Install Xanthos from PyPi using:\n    ```bash\n    pip install xanthos\n    ```\n2.  Download the example data using the following in a Python prompt:\n    ```python\n    import xanthos\n    \n    # the directory that you want to download and extract the example data to\n    data_dir = \"<my data download location>\"\n    \n    # download and unzip the package data to your local machine\n    xanthos.get_package_data(data_dir)\n    ```\n3.  Setup your configuration file (.ini).  Examples are located in the \"example\" directory that you just downloaded.  Be sure to change the following variables to represent the local path to your example data:  `RootDir`, `TempMinFile`, `PrecipitationFile`.\n4.  To run Xanthos:\n\n    ```python\n    import xanthos\n    \n    # the path and file name that my example configuration (.ini) file was downloaded to\n    config_file = '<path to my example config file>/pm_abcd_mrtm.ini'\n    \n    # run Xanthos \n    xanthos.run_model(config_file)\n    ```\n\n# Setting up a Xanthos run\nA detailed Wiki set up to describe how to set up a Xanthos run can be viewed here:  https://github.com/JGCRI/xanthos/wiki/Tutorial-1:--Setting-up-a-Xanthos-run\n\n# Available Modules\nA detailed Wiki set up to describe available modules, as well as their associated configuration settings, can be viewed here: https://github.com/JGCRI/xanthos/wiki/Available-modules\n\n# Xanthos 2 - Upgrades\nWith the ability to simulate historical and future global water availability on a monthly time step at a spatial resolution of 0.5 geographic degrees, Xanthos version 1.0 provided a solid foundation for continued advancements in global water dynamics science.  The goal of Xanthos version 2 was to build upon previous investments by creating an accessible computing environment where core components of the model (potential evapotranspiration (PET), runoff generation, and river routing) could be interchanged or added to without having to start from scratch.  Xanthos 2 utilizes a component-style architecture which enables researchers to quickly incorporate and test cutting-edge research in a stable modeling environment prebuilt with a diagnostics module.  Major advancements for Xanthos 2.0 were also achieved by creating a more robust default configuration for the model that is now available to the scientific community.  These advancements include the addition of:  the Penman-Monteith PET module to capture the impacts of evolving land cover, the ABCD water balance module to account for groundwater recharge and discharge in runoff projections, improved water velocity considerations for the Modified River Transport Model (MRTM) routing module, a built-in differential evolution optimization module to calibrate ABCD parameters to modeled global runoff, and hydropower production assessment and potential capacity modules.  The figure below demonstrates the optimization module’s ability to calibrate Xanthos 2 runoff to the complex Variable Infiltration Capacity (VIC) model runoff projections when forced by the same climate data. Xanthos can be calibrated against other land surface models and Earth system models.\n\n![Xanthos to VIC](https://github.com/JGCRI/xanthos/blob/master/docs/xanthos2_to_vic_watch_basins.png)\nFigure:  Xanthos 2.0 performance when calibrated to the VIC model forced by WATCH observational climate data.  Each point represents the mean annual runoff for each of the 235 river basins in GCAM.\n\n# Contact Us\nFor questions, technical supporting and user contribution, please contact:\n\nChris Vernon <chris.vernon@pnnl.gov>\n\nZarrar Khan <zarrar.khan@pnnl.gov>",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/JGCRI/xanthos",
    "keywords": "",
    "license": "BSD2-Simplified",
    "maintainer": "",
    "maintainer_email": "",
    "name": "xanthos",
    "package_url": "https://pypi.org/project/xanthos/",
    "platform": "",
    "project_url": "https://pypi.org/project/xanthos/",
    "project_urls": {
      "Homepage": "https://github.com/JGCRI/xanthos"
    },
    "release_url": "https://pypi.org/project/xanthos/2.4.1/",
    "requires_dist": null,
    "requires_python": ">=3.6",
    "summary": "A global hydrologic modeling framework",
    "version": "2.4.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 11142764,
  "releases": {
    "2.4.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "694c1b2f24bc75b871bd5d2297e14e2de3c803e5439ca2dd29ca929f805124df",
          "md5": "97d56fd8c0749a425de178eba6bb3bba",
          "sha256": "09ae3955514fa6eb43b3c71b85957133903a022155282a57325be9f27fd2e0c3"
        },
        "downloads": -1,
        "filename": "xanthos-2.4.1.tar.gz",
        "has_sig": false,
        "md5_digest": "97d56fd8c0749a425de178eba6bb3bba",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.6",
        "size": 692163,
        "upload_time": "2021-08-10T20:55:25",
        "upload_time_iso_8601": "2021-08-10T20:55:25.660579Z",
        "url": "https://files.pythonhosted.org/packages/69/4c/1b2f24bc75b871bd5d2297e14e2de3c803e5439ca2dd29ca929f805124df/xanthos-2.4.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "694c1b2f24bc75b871bd5d2297e14e2de3c803e5439ca2dd29ca929f805124df",
        "md5": "97d56fd8c0749a425de178eba6bb3bba",
        "sha256": "09ae3955514fa6eb43b3c71b85957133903a022155282a57325be9f27fd2e0c3"
      },
      "downloads": -1,
      "filename": "xanthos-2.4.1.tar.gz",
      "has_sig": false,
      "md5_digest": "97d56fd8c0749a425de178eba6bb3bba",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 692163,
      "upload_time": "2021-08-10T20:55:25",
      "upload_time_iso_8601": "2021-08-10T20:55:25.660579Z",
      "url": "https://files.pythonhosted.org/packages/69/4c/1b2f24bc75b871bd5d2297e14e2de3c803e5439ca2dd29ca929f805124df/xanthos-2.4.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}