{
  "info": {
    "author": "Eliot Bush",
    "author_email": "bush@hmc.edu",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: GNU General Public License v3 (GPLv3)",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "======\nxenoGI\n======\n\nCode for reconstructing genome evolution in clades of microbes.\n\nRequirements\n------------\n\n* NCBI blast+\n\n  We need blastp and makeblastdb executables (ftp://ftp.ncbi.nlm.nih.gov/blast/executables/blast+/LATEST/).\n\n* MUSCLE V5 (https://www.drive5.com/muscle/). For creating protein or DNA alignments.\n\n* FastTree (http://www.microbesonline.org/fasttree/). For making gene trees.\n\n* GeneRax (https://github.com/BenoitMorel/GeneRax). For making (species tree aware) gene trees. This is optional but recommended.\n  \n* Python 3\n\n* Python package dependencies\n\n  - Biopython (http://biopython.org/). This is for parsing genbank files and can be installed using pip:\n      ``pip3 install biopython``\n\n  - Parasail (https://github.com/jeffdaily/parasail). This is an optimized alignment library, used in calculating scores between proteins. It can also be installed using pip:\n      ``pip3 install parasail``\n\n  - Numpy (http://www.numpy.org/).\n      ``pip3 install numpy``\n    \n  - Scipy (https://www.scipy.org/).\n    ``pip3 install scipy``\n\n(The pip you use needs to correspond to a version of Python 3. In some cases it may just be called pip instead of pip3).\n\n* Additional dependencies\n\n  If you make use of the ``makeSpeciesTree`` flag or ``xlMode.py``, you will also need the following\n\n  - ASTRAL (https://github.com/smirarab/ASTRAL/).\n\n* Comments on platforms.\n\n  xenoGI is developed on Linux. The docker image (linked below) is the easiest way to run on Mac and Windows.\n\nInstallation\n------------\n\nVia pip::\n\n  pip3 install xenoGI\n\n(You will separately need to install blast+, MUSCLE, FastTree, and optionally GeneRax and ASTRAL.)\n\nVia docker. For some instructions on using docker, go here:\n\n  https://hub.docker.com/r/ecbush/xenogi\n\nUsing docker, xenoGI get's run within a virtual machine. This is nice because you don't have to worry about all the dependencies above (they're provided in our image). This does come at some cost in terms of performance.\n  \nCitation\n--------\n\nIf you use xenoGI in a publication, please cite the following:\n\nBush EC, Clark AE, DeRanek CA, Eng A, Forman J, Heath K, Lee AB, Stoebel DM, Wang Z, Wilber M, Wu H. xenoGI: reconstructing the history of genomic island insertions in clades of closely related bacteria. BMC Bioinformatics. 19(32). 2018.\n\nLiu J, Mawhorter R, Liu I, Santichaivekin S, Bush E, Libeskind-Hadas R. Maximum Parsimony Reconciliation in the DTLOR Model. BMC Bioinformatics. 22(394). 2021.\n\nHow to use\n----------\n\nAn ``example/`` directory is included in this repository.\n\nThe sections below give some instructions about how to run xenoGI on this example. You can use this to make sure you've installed it properly and so forth. The github repository also contains a TUTORIAL which you can run through after completing the README.\n\nThe basic method works on a set of species with known phylogenetic relationships. In the example, these species are: E. coli K12, E. coli ATCC 11775, E. fergusonii and S. bongori. In cases where you don't know the species tree, xenoGI has methods to help you reconstruct it.\n\nRequired files\n~~~~~~~~~~~~~~\n\nThe working directory must contain:\n\n* A parameter file. In the provided ``example/`` directory this is called ``params.py``.\n\n* A newick format tree representing the relationships of the strains. In the example this is called ``example.tre``. Note that branch lengths are not used in xenoGI, and ``example.tre`` does not contain branch lengths. Also note that internal nodes should be given names in this tree. In the example.tre we label them s0, s1 etc. The parameter ``speciesTreeFN`` in ``params.py`` has the path to this tree file. If a strain tree is not available, xenoGI has some accessory methods, described below, to help obtain one.\n\n* A subdirectory of sequence files. In the example, this is called ``ncbi/``. Contained in this subdirectory will be genbank (gbff) files for the species. The parameter ``genbankFilePath`` in ``params.py`` has the path to these files.\n\nNaming of strains\n~~~~~~~~~~~~~~~~~\n\nThe system needs a way to connect the sequence files to the names used in the tree.\n\nIn the example, the sequence files have names corresponding to their assembly accession number from ncbi. We connect these to the human readable names in example.tre using a mapping given in the file ``ncbiHumanMap.txt``. This file has two columns, the first giving the name of the genbank file, and the second giving the name for the strain used in the tree file. In ``params.py`` the parameter ``fileNameMapFN`` is set to point to this file.\n\nNote that the strain names should not contain any dashes, spaces, commas or special characters.\n\nAnother approach is to change the names of the sequence files to match what's in the tree. If you do this, then you should set ``fileNameMapFN = None`` in ``params.py``. (This is not necessary in the example, which is already set to run the other way).\n\nPointing xenoGI to various executables\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nBefore running xenoGI you'll have to ensure that it knows where various executables are. Edit ``params.py`` using a text editor such as emacs, vim, nano, Visual Studio Code etc. You should edit the following to give the absolute (full) path to the directory where the ``blastp`` and ``makeblastdb`` executables reside::\n\n  blastExecutDirPath = '/usr/bin/'\n\n(Change '/usr/bin/' to correspond to the right location on your system).\n\nAlso make sure that the absolute paths to MUSCLE and FastTree are correct in ``params.py`` (the parameters ``musclePath`` and ``fastTreePath``). If you intend to use generax to make species tree aware gene trees, then you also need to set ``geneRaxPath``. (The default parameter file is set to use generax, so unless you change the ``useGeneRaxToMakeSpeciesTrees`` parameter, described below, you'll need to supply a ``geneRaxPath``).\n\nIf you will be using the makeSpeciesTree functionality, then you will also need to specify ``astralPath`` and ``javaPath``.\n\nRunning the code\n~~~~~~~~~~~~~~~~\n\nIf you install via pip, then you should have an executable script in your path called xenoGI.\n\nYou run the code from within the working directory. To run the example, you would cd into the ``example/`` directory. You will need to ensure that the ``params.py`` parameters file contains the correct path to the directory with the blastp and makeblastdb executables in it, as well as the MUSCLE and FastTree executables. Then, the various steps of xenoGI can be run all at once like this::\n\n  xenoGI params.py runAll\n\nThey can also be run individually::\n\n  xenoGI params.py parseGenbank\n  xenoGI params.py runBlast\n  xenoGI params.py calcScores\n  xenoGI params.py makeFamilies\n  xenoGI params.py makeIslands\n  xenoGI params.py refine\n  xenoGI params.py printAnalysis\n  xenoGI params.py createIslandBed\n\nIf for some reason you don't want to install via pip, then you can download the repository and run the code like this::\n\n  python3 path-to-xenoGI-github-repository/xenoGI-runner.py params.py runAll\n\n(In this case you will have to make sure all the python package dependencies are satisfied.)\n\nWhat the steps do\n~~~~~~~~~~~~~~~~~\n\n* ``parseGenbank`` runs through the genbank files and produces input files that are used by subsequent code. This step pulls out every CDS feature that has a ``/translation`` tag. The fields that are recorded (if present) are locus_tag, protein_id, product (that is gene description), and chromosomal coordinates as well as the protein sequence. If the parameter ``dnaBasedGeneTrees`` is True, the DNA sequence for each gene is kept as well.\n  \n* ``runBlast`` does an all vs. all protein blast of the genes in these strains. The number of processes it will run in parallel is specified by the ``numProcesses`` parameter in the parameter file. Before running a particular comparison, runBlast checks to see if the output file for that comparison already exists (e.g. from a previous run). If so it skips the comparison.\n  \n* ``calcScores`` calculates similarity and synteny scores between genes in the strains. It is also (mostly) parallelized.\n  \n* ``makeFamilies`` calculates gene families using blast, FastTree, GeneRax (optionally), and a customized variant of the DTL reconciliation algorithm called DTLOR. This approach considers synteny in the family formation process.\n\n* ``makeIslands`` groups families according to their origin, putting families with a common origin together as islands. It is partly parallelized.\n\n* ``refine`` reconsiders certain families in light of the output of makeIslands. In particular, this step looks at cases where there are multiple most parsimonious reconciliations, and chooses the reconciliation that is most consistent with neighboring families. It then re-runs makeIslands.\n  \n* ``printAnalysis`` produces a number of analysis/output files intended for the end user.\n\n* ``createIslandBed`` produces bed files for each genome.\n\nLocus families and locus islands\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nA brief illustration will allow us to define some terminology used in xenoGI's output. The basic goal of xenoGI is to group genes with a common origin and map them onto a phylogenetic tree.\n\nConsider a clade of three species: (A,B),C. In this group, A and B are most closely related, and C is the outgroup. Gene a in species A has an ortholog b in species B. These two genes have high synteny, but have no ortholog in C. We call a and b a *locus family* because they are descended from a common ancestor, and occur in the same syntenic location.\n\nWhen a genomic island inserts as a part of a horizontal transfer event, it typically brings in multiple locus families at the same time. xenoGI will attempt to group these into a *locus island*. In the a/b case, if there were several other locus families nearby that also inserted on the branch leading to the A,B clade, we would group them together into a single locus island.\n\nInitial families, origin families and the DTLOR model\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nIn fact, a locus family has several possible origins. It may be due to a horizontal transfer event coming from some other genome. Alternatively, it may reflect a rearrangement event within a genome, moving genes to a new syntenic location (for example in conjunction with a duplication event). A final possibility is that it is a core family and originated in the common ancestor of the strains under consideration. One of xenoGI's goals is to distinguish between these possibilities for each locus family (and also for the locus islands that contain them).\n\nxenoGI does this during the process of family formation. It begins by forming large gene groupings using single linkage clustering and sequence similarity as determined by blast. It then takes these \"blast families\", breaks up the larger ones (which must be done for reasons of time efficiency in later steps), and uses them as a basis for making a set of families which we call initial families. For each initial family, xenoGI creates a gene tree using MUSCLE and FastTree (the user can determine whether this should be done with DNA or protein by setting the input parameter dnaBasedGeneTrees). It then reconciles each resulting gene tree to the species tree using the DTLOR model.\n\nDTLOR is an extension we have developed to the DTL (duplication-transfer-loss) reconciliation model. It is especially suited to reconciliation in clades of closely related microbes because it allows some of the evolution of a gene family to occur outside of the given species tree. In particular, it allows multiple entry events into the species tree (where DTL allows only one). To facilitate the recognition of such entry events, the model also keeps track of the *syntenic region* of each gene as it evolves in the species tree. Two genes are said to be in the same syntenic region if they share a substantial fraction of core genes in a relatively large window around them and, second, they share a certain amount of similarity among all genes in a smaller window around them. Thus, in addition to duplication, transfer, and loss events, the DTLOR model adds *origin* events to indicate that a gene is transferred from outside of the species tree and *rearrangement* events that account for changes in the syntenic regions of genes within the same the genome.\n\nxenoGI obtains a reconciliation for each initial family, and then uses these to break the initial families up according to origin events. The new families that result from this are called *origin families* because each one has an origin event at its base. Origin events can either correspond to core genes (if they occur at the root of the species tree) or to horizontal transfer events (if they occur below the root). In general, users will be more interested in origin families than initial families. However the class representing initial families does contain some information (the raw reconciliation output) which isn't present in the origin families, and may occasionally be of interest.\n\nIt may be helpful to give an example of the sort of thing one might find in an origin family. Consider a clade of four species: ((W,X),Y),Z::\n\n              _____ W\n         ____|s2\n    ____|s1  |_____ X\n   |    |\n  _|s0  |__________ Y\n   |\n   |_______________ Z\n\nWe've labeled the internal nodes on this tree s0,s1, and s2.\n\nImagine that genes w1 and x1 represent a locus family in the W,X clade. They are orthologs sharing high synteny. (And they have no ortholog in species Y or Z). Imagine that there is also a paralog x2 that occurs in a different syntenic region (and that there is no w2, y2 or z2, ie W, Y and Z have no paralogs in this syntenic region). This situation could arise if there had been a horizontal transfer from outside the clade on the lineage leading to s2, and then a subsequent duplication and rearrangement after s2 on the lineage leading to X. If this were the case, xenoGI would place x1, y1, and x2 into a single origin family. w1 and x1 would be put in one locus family, and x2 in another. (In general, an origin family consists of one or more locus families.)\n  \nNotes on several input parameters\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n* ``rootFocalClade`` defines the focal clade where we will do the reconstruction. It is specified by giving the name of an internal node in the species tree. It should be chosen such that there are one or more outgroups outside the focal clade. These outgroups help us to better recognize core genes given the possibility of deletion in some lineages. \n\n* ``numProcesses`` determines how many separate processes to run in parts of the code that are parallel. If you have a machine with 32 processors, you would typically set this to 32 or less.\n\n* ``dnaBasedGeneTrees`` specifies what will be used to make gene trees. If this is set to True, the method will use DNA based alignments, otherwise it will use protein alignments.\n\n* ``useGeneRaxToMakeSpeciesTrees``. If set to True, xenoGI uses GeneRax in addition to FastTree to make species trees. GeneRax produces species-tree-aware gene trees, which are known to be of higher quality than gene trees calculated from gene sequences alone. (The cost is that GeneRax is slower). If using GeneRax then you also need to specify the parameter ``geneRaxPath``.\n  \n* The DTLOR cost parameters: ``duplicationCost``, ``transferCost``, ``lossCost``, ``originCost``, ``rearrangeCost``. The parsimony based reconciliation algorithm finds the minimum cost mapping of a gene tree onto the species tree. These parameters specify the costs for each of the DTLOR operations. The params.py file included in the example directory contains a set of costs we have found to work reasonably well, however users may potentially want to adjust these. The same parameters are used for all reconciliations, with one exception (see next bullet).\n\n* ``reconcilePermissiveOriginGeneListPath``. This parameter is commented out by default, and will only be useful in certain situations. There are some genomic islands that insert repeatedly in the same syntenic region. An example is the SCCmec element in *Staphylococcus aureus*. In such cases, it is desirable to do the reconciliation with cost parameters that are permissive to origin events. xenoGI allows users to identify families that should be handled in this way. The first step is to create a file of xenoGI genes belonging to such families (one gene per line). We then set the ``reconcilePermissiveOriginGeneListPath`` to point to this file. The script ``getProteinsWithBlastHitsVsMultifasta.py`` in the misc/ directory may be useful in producing this file. The documentaiton for the misc directory has some further information.\n\nOutput files\n~~~~~~~~~~~~\n\nThe last two steps, printAnalysis and createIslandBed make the output files relevant to the user.\n\n* ``printAnalysis``\n\n  - This script produces a set of species specific genome files. These files all have the name ``genes`` in their stem, followed by the strain name, and the extension .tsv. In the example/ data set, ``genes-E_coli_K12.tsv`` is one such. These files contain all the genes in a strain laid out in the order they occur on the contigs. Each line corresponds to one gene and contains:\n    + gene name\n    + origin of the gene, specified by a single character: a C indicating core gene, or an X indicating xeno horizontal transfer. This field is an interpretation of the O event from the DTLOR reconcilation based on its placement in the species tree.\n    + gene history, specified by a string. This gives the history of the gene from its origin until the tip of the gene tree, and consists of single letters corresponding to the operations in the reconcilation model. D, duplication; T, transfer (within the species tree); O, origin; R, rearrangement; S, cospeciation.\n    + locus island number\n    + initial family number\n    + origin family number\n    + locus family number\n    + gene description\n\n  - ``islands.tsv`` tab delimited listing of locus islands. Each line corresponds to one locus island. The first field is the locus island number, the second field is its mrca (most recent common ancestor), and the third is a string giving the origin of each locus family in the locus island (possible values for each locus family are C for core gene, X for xeno HGT, and R for rearrangement). Subsequent fields give the locus families in this locus island. Each locus family is listed with its number, and then the genes it contains, separated by commas.\n  \n  - ``islandsSummary.txt`` A more human readable summary of locus islands, organized by node. This includes a tabular printout of the island, as well as a listing of each gene and its description if any.\n\n* ``createIslandBed`` creates a subdirectory called bed/ containing bed files for each genome showing the locus islands in different colors. (Color is specified in the RGB field of the bed).\n\nInteractive analysis\n~~~~~~~~~~~~~~~~~~~~\n\nAfter you have done runAll, it is possible to bring up the interpreter for interactive analysis::\n\n  xenoGI params.py interactiveAnalysis\n  \nFrom within python, you can then run functions such as\n\n* printLocusIslandsAtNode\n\n  Usage::\n\n    printLocusIslandsAtNode('s2')         # All locus islands at node s2\n    printLocusIslandsAtNode('E_coli_K12') # All locus islands on the E. coli K12 branch\n\n* findGene\n\n  Usage::\n  \n    findGene('gadA')\n\n  Find information about a gene. Searches all the fields present in the geneInfo file, so the search string can be a locus tag, protein ID, a common name, or something present in the description. For each hit, prints the gene, LocusIsland, initialFamily, originFamily, LocusFamily and gene description.\n  \n* printLocusIsland\n\n  Say we've identified locus island 1550 as being of interest. We can print it like this::\n\n    printLocusIsland(1550,10) # First argument is locus island id, second is the number of genes to print to each side\n    \n  printLocusIsland prints the locus island in each strain where it's present. Its output includes the locus island and family numbers for each gene, the most recent common ancestor (mrca) of the family, and a description of the gene.\n\n* printFam\n\n  Print scores within a particular gene family, and also with similar genes not in the family::\n  \n    printFam(originFamiliesO,5426)\n\n  This function also prints a summary of the reconciliation between the gene tree for this family and the species tree.\n    \n  Note that this function takes a family number, not a locus family number.\n\nObtaining a species tree if you don't already have one\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nHaving an accurate species tree is a key to the xenoGI method.\n\nThe package does include some functions that may be helpful if you don't have a species tree. These use MUSCLE and FastTree to make gene trees, and ASTRAL to consolidate those gene trees into a species tree.\n\nYou begin by running the first three steps of xenoGI::\n\n  xenoGI params.py parseGenbank\n  xenoGI params.py runBlast\n  xenoGI params.py calcScores\n\nYou can then run ``makeSpeciesTree``::\n\n  xenoGI params.py makeSpeciesTree\n\nIn the ``params.py`` file, the parameter ``dnaBasedGeneTrees`` determines whether DNA or protein are used to make genes trees. (If True, DNA is used).\n\nIn order to use ``makeSpeciesTree``, you will also need to add one parameter to ``params.py``. There should be a parameter outGroup which specifies a single outgroup species to be used in rooting the species tree.\n\nOnce ``makeSpeciesTree`` has completed, you can proceed with the rest of xenoGI::\n\n  xenoGI params.py makeFamilies\n  xenoGI params.py makeIslands\n  xenoGI params.py refine\n  xenoGI params.py printAnalysis\n  xenoGI params.py createIslandBed\n  \nAdditional flags\n~~~~~~~~~~~~~~~~\n\nPrint the version number::\n   \n  xenoGI params.py version\n\nCalculate the amino acid identity between strains::\n\n  xenoGI params.py aminoAcidIdentity\n\nThis uses blast output, and so should be run after the runBlast step. It identifies the best reciprocal hits between each pair of strains. It then averages protein identity across these, weighted by alignment length.\n  \nProduce a set of pdf files showing histograms of scores between all possible strains::\n\n  xenoGI params.py plotScoreHists\n  \n    \nAdditional files\n----------------\n\nThe github repository also contains an additional directory called misc/. This contains various python scripts that may be of use in conjunction with xenoGI. Installation via pip does not include this, so to use these you need to clone the github repository. There is some brief documentation included in the misc/ directory.\n\n\n",
    "description_content_type": "text/x-rst",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/ecbush/xenoGI",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "xenoGI",
    "package_url": "https://pypi.org/project/xenoGI/",
    "platform": null,
    "project_url": "https://pypi.org/project/xenoGI/",
    "project_urls": {
      "Homepage": "https://github.com/ecbush/xenoGI"
    },
    "release_url": "https://pypi.org/project/xenoGI/3.1.1/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "Python command line application for detecting genomic island insertions in clades of microbes.",
    "version": "3.1.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16116279,
  "releases": {
    "1.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "95e2cd87ba303e02d33e4f5e9006609da565358462286fe802b4980fd3bc05a6",
          "md5": "bd6fd97bfd9d1f3cfbb673148ad2aec4",
          "sha256": "f96a9b19d01bea5a99b1237a1487a2a57003a3ac7bc14d430b1376884720769d"
        },
        "downloads": -1,
        "filename": "xenoGI-1.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "bd6fd97bfd9d1f3cfbb673148ad2aec4",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 51590,
        "upload_time": "2018-06-02T19:07:36",
        "upload_time_iso_8601": "2018-06-02T19:07:36.888643Z",
        "url": "https://files.pythonhosted.org/packages/95/e2/cd87ba303e02d33e4f5e9006609da565358462286fe802b4980fd3bc05a6/xenoGI-1.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "87bf843085ce397e1162816caa94652d22908496f052bc609e902f873e02c6e2",
          "md5": "b45863b6cf77b40dc7dd557ef6899f94",
          "sha256": "428765758238e97edcdf777a147f6d42ad08b0d3727973389ab0103e85ff8ce0"
        },
        "downloads": -1,
        "filename": "xenoGI-1.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "b45863b6cf77b40dc7dd557ef6899f94",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 53817,
        "upload_time": "2018-06-11T22:47:38",
        "upload_time_iso_8601": "2018-06-11T22:47:38.364138Z",
        "url": "https://files.pythonhosted.org/packages/87/bf/843085ce397e1162816caa94652d22908496f052bc609e902f873e02c6e2/xenoGI-1.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "1.1.2": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "738045fd2fbab804ac2e9c5143cb71f4380adbd41d3eee51dd1b6f17ba0c2189",
          "md5": "e58bd2f066d9473759c2f69b96d58bb3",
          "sha256": "96a0d0a23bc8adc83b8bb94eafce05ce7650db6f35547583cffe25ec8bcdf078"
        },
        "downloads": -1,
        "filename": "xenoGI-1.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "e58bd2f066d9473759c2f69b96d58bb3",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 54443,
        "upload_time": "2018-10-06T18:43:17",
        "upload_time_iso_8601": "2018-10-06T18:43:17.619324Z",
        "url": "https://files.pythonhosted.org/packages/73/80/45fd2fbab804ac2e9c5143cb71f4380adbd41d3eee51dd1b6f17ba0c2189/xenoGI-1.1.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "425500ed84e6a21e9daab118969c1cba593dacd9b85a2e05024c2360ba242119",
          "md5": "e1fb3337929b6293a08455739993d8f4",
          "sha256": "760bf4cfd24df6c4fb8d3cb53f142cffc37d456f7fbe3d4ad29f70c6f6d8c8cd"
        },
        "downloads": -1,
        "filename": "xenoGI-2.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "e1fb3337929b6293a08455739993d8f4",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 65232,
        "upload_time": "2019-03-20T19:56:01",
        "upload_time_iso_8601": "2019-03-20T19:56:01.013422Z",
        "url": "https://files.pythonhosted.org/packages/42/55/00ed84e6a21e9daab118969c1cba593dacd9b85a2e05024c2360ba242119/xenoGI-2.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "cbe6e305c1843a868d99b159c3624c8848bd10db634d2ae35b7b6449494bf27f",
          "md5": "0d7ac6f356868550bff55a8c85803747",
          "sha256": "636b23009a29fa5d3eaf126a879ea6c8f8b82ed06f2aa73662c66b6bee331d2e"
        },
        "downloads": -1,
        "filename": "xenoGI-2.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "0d7ac6f356868550bff55a8c85803747",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 67886,
        "upload_time": "2019-05-29T14:41:37",
        "upload_time_iso_8601": "2019-05-29T14:41:37.997812Z",
        "url": "https://files.pythonhosted.org/packages/cb/e6/e305c1843a868d99b159c3624c8848bd10db634d2ae35b7b6449494bf27f/xenoGI-2.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "2.2.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "7f275aade3ece47e77d824f7ee6262d489867d4ed28173ad1a5d238a917929d5",
          "md5": "50c2fa130520d9c8718f4cbb6ec0543b",
          "sha256": "b18a33fa40fa28cd14208c63912b5d177601ecc8e0ab92998fc8154d1514f801"
        },
        "downloads": -1,
        "filename": "xenoGI-2.2.0.tar.gz",
        "has_sig": false,
        "md5_digest": "50c2fa130520d9c8718f4cbb6ec0543b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 77297,
        "upload_time": "2019-07-29T23:18:29",
        "upload_time_iso_8601": "2019-07-29T23:18:29.578961Z",
        "url": "https://files.pythonhosted.org/packages/7f/27/5aade3ece47e77d824f7ee6262d489867d4ed28173ad1a5d238a917929d5/xenoGI-2.2.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "3.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "affe14b2d57b0e56e7a9579d714402424e014eccd749eccee312d43d1f3ab16b",
          "md5": "55bfac61cf413ee5fbaf26f2d1551ab5",
          "sha256": "469a86898d41d8268e29e1c579ef2c93380a1e9082e42e33d922c4d394231b09"
        },
        "downloads": -1,
        "filename": "xenoGI-3.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "55bfac61cf413ee5fbaf26f2d1551ab5",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 126414,
        "upload_time": "2021-02-01T19:14:01",
        "upload_time_iso_8601": "2021-02-01T19:14:01.578377Z",
        "url": "https://files.pythonhosted.org/packages/af/fe/14b2d57b0e56e7a9579d714402424e014eccd749eccee312d43d1f3ab16b/xenoGI-3.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "3.1.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "5a592fa130f9df420f3b86372fd69d8cc5e310a6e269b719be027d6a2563a761",
          "md5": "c241981c06861b9b017760a929a4886d",
          "sha256": "c5f4de7025a6c63ec7c70df10211d4330dd858022daa5845f789345eed64e036"
        },
        "downloads": -1,
        "filename": "xenoGI-3.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "c241981c06861b9b017760a929a4886d",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 134017,
        "upload_time": "2022-09-10T14:48:41",
        "upload_time_iso_8601": "2022-09-10T14:48:41.797412Z",
        "url": "https://files.pythonhosted.org/packages/5a/59/2fa130f9df420f3b86372fd69d8cc5e310a6e269b719be027d6a2563a761/xenoGI-3.1.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "3.1.1": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "2d7f4b99f33639a5e28737bd269397731c8f7f71c4091743f0d3ff7926ce81b1",
          "md5": "fb52a1706e2320f61255a4ea03672abe",
          "sha256": "f194f6e5f83f5b9c22e313a70882eb38029a8f1d24369222f060d3e54a68d740"
        },
        "downloads": -1,
        "filename": "xenoGI-3.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "fb52a1706e2320f61255a4ea03672abe",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": null,
        "size": 134598,
        "upload_time": "2022-12-15T17:39:15",
        "upload_time_iso_8601": "2022-12-15T17:39:15.850836Z",
        "url": "https://files.pythonhosted.org/packages/2d/7f/4b99f33639a5e28737bd269397731c8f7f71c4091743f0d3ff7926ce81b1/xenoGI-3.1.1.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "2d7f4b99f33639a5e28737bd269397731c8f7f71c4091743f0d3ff7926ce81b1",
        "md5": "fb52a1706e2320f61255a4ea03672abe",
        "sha256": "f194f6e5f83f5b9c22e313a70882eb38029a8f1d24369222f060d3e54a68d740"
      },
      "downloads": -1,
      "filename": "xenoGI-3.1.1.tar.gz",
      "has_sig": false,
      "md5_digest": "fb52a1706e2320f61255a4ea03672abe",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 134598,
      "upload_time": "2022-12-15T17:39:15",
      "upload_time_iso_8601": "2022-12-15T17:39:15.850836Z",
      "url": "https://files.pythonhosted.org/packages/2d/7f/4b99f33639a5e28737bd269397731c8f7f71c4091743f0d3ff7926ce81b1/xenoGI-3.1.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}