{
  "info": {
    "author": "Ghiles Meddour",
    "author_email": "ghiles.meddour@munic.io",
    "bugtrack_url": null,
    "classifiers": [
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# POÈME POUR YASMINE\n\n[pdf](./src/yasmine/texte/texte.pdf) – [html](./src/yasmine/texte/texte.html) – [txt](./src/yasmine/texte/texte.txt)\n\n```\n$ pip install yasmine\n$ python -m yasmine\n```\n\n```\nPOÈME POUR YASMINE\n\nSi facile d’aimer, si dur de n’aimer plus :\nQui vient vider la chambre où le cœur est reclus\nDes parfums enchâssés, des goûts, des sens, des traces,\nDes souvenirs présents et des objets vivaces ?\n\nNul ne peut effacer, après avoir marqué\nAu fer rouge, un mot dit et plus tard révoqué :\nNulle force, nul dieu, tant le passé m’habite,\nNe peut faire sortir mon cœur de son orbite.\n\nJe suis un homme entier, au cœur tendre et châtié ;\nJe ne sais ni mentir, ni aimer à moitié :\nQuand j’aime je ne sais comment tourner la page,\nNi, quand il faut partir, comment plier bagage.\n\nJe vois devant mes yeux un film se défiler ;\nSpectateur impuissant, je vois tout s’effiler :\nJe vois mon désarroi nargué par la vitesse\nDu temps qui passe, court, file et tout seul me laisse.\n\nQue ce monde est changeant, qu’il est impermanent ;\nQue le calme trahit et que le sermon ment.\nIl change qu’il surprend : il donne et prend, redonne\nEt reprend, il t’adopte et enfin t’abandonne.\n\nIl arrache et fait don, reprend après donner,\nDonne à sa guise et prend en faisant ordonner\nQue toujours ses sujets s’enferment dans son coffre\nEt restent satisfaits de ce peu qu’il leur offre.\n\nMon âme n’est pas faite à céder aux violents \nQui veulent, comme ça, ces fous, ces insolents,\nSans avertissement, sans avis, sans prélude,\nLa faire renoncer à sa vieille habitude.\n\nComment peut-on laisser un cœur clair s’imprégner\nD’amour jusqu’à la moelle et ensuite espérer\nQu’il sache par lui même obéir sur demande\nEt qu’il change au signal d’une télécommande ?\n\nPerte totale – oh Dieu – j’ai perdu, tout perdu !\nParti l’objet perdu dont j’étais éperdu :\nMon esprit est désert et mon âme est déserte,\nSeuls mes yeux sont restés pour regretter ma perte.\n\nJe n’aurai plus besoin – à mon plus grand regret –\nNi de comploter pour nous voir dans le secret,\nNi, pour te retrouver, de traverser la terre,\nNi de feindre la foi pour séduire ta mère.\n\nTu ne pourras plus, belle, enlacer mon chemin,\nNi découvrir Paris en me tenant la main.\nMoi, je ne pourrai plus t’embrasser ma très chère\nEt je ne viendrai pas te voir en Angleterre.\n\nMon vingt-mètres parisien ne connaîtra pas\nL’odeur de ta présence et le bruit de tes pas.\nPont Neuf ne sera pas témoin de notre idylle\nEt l’eau sous Mirabeau ne sera plus utile.\n\nLa Seine sous l’Alma coule avec vanité :\nFace à moi le néant de la banalité\nÀ regarder sans toi, j’en deviens une épave,\nLe fleuve parisien noyer les pieds du Zouave.\n\nTous les ponts de Paris croulent devant mes yeux\nIls croulent et je croule, et je coule avec eux.\nL’homme est frêle et fragile : une feuille d’érable\nSur la Seine – et la mer pour dernier réceptacle.\n\nAu centre Pompidou, nous n’irons pas demain\nPour rire et nous moquer de l’art contemporain.\nIl y a là un objet : sorte de vieux potage\nQu’on court vite oublier au tout dernier étage.\n\nImages et tableaux, plein de créations ;\nCent mille arts et autant d’hallucinations :\nRepense à ce chef-d'œuvre aux écouteurs filaires\nPêle-mêle emmêlés sur fond de sons stellaires.\n\nSouviens-toi, tu voulais venir et rajouter\nTes écouteurs à toi, pour bien la compléter.\nMême sans moi, fais, fais : elle en sera sauvée\nQuand tu compléteras cette œuvre inachevée.\n\nBoulevard Saint-Michel jusqu’au Lion de Belfort,\nNous ne marcherons pas voir le lion qui ne dort\nJamais : objet altier entre les créatures\nMais morose et maussade à voir trop de voitures.\n\nNous n’irons pas, ma chère, à Denfert-Rochereau :\nVide sera Denfert, seul est le tourtereau.\nNous n’irons ni nourrir au square les colombes,\nNi approcher la Mort au fond des Catacombes.\n\nLes crânes parisiens resteront seuls, sans nous :\nCes admirables os posés sur des cailloux,\nAgrémentés de vers – parfois réduits en miettes ;\nQui me regardera regarder ces squelettes ?\n\nLa fontaine Carpeaux ne sait rendre vivant ;\nLa Mort fauche et prend tout, prend et passe au suivant.\nLe joli monument nous montre notre monde :\nPrison sur pieds boiteux que l’injustice inonde.\n\nLes fleurs du Luxembourg devront, sans nous, fleurir\nAlors que notre absence astreint tout à mourir ;\nLa prochaine saison, le jardin sera fade\nEt, à ne pas nous voir, demeurera malade.\n\nLe monde est dépeuplé, fantôme est Vaugirard ;\nLa nuit sombre en plein jour prolonge le brouillard ;\nLa noirceur voile tout dans mon âme confuse,\nEt dans mon cœur contrit où l’obscurité fuse.\n\nLe pavé de Férou nous attendra longtemps :\nLes volets sont amers, les balcons mécontents\nDe ne pas voir venir nos deux êtres qui s’aiment,\nEnsemble joints, s’asseoir et lire le poème.\n\nNous ne serons pas, chère, adossés, face au mur,\nTransis devant la fresque où le texte d’Arthur\nRimbaud dit et dit tout, se révèle et se livre ;\nL’Amérique c’est toi : je suis le Bateau Ivre.\n\nNous n’irons pas, ma chère, admirer le voilier \nDe la maison Vuitton ; voir le flot régulier\nVenir jusqu’à nos pieds, sans nous toucher nous faire\nFlotter sur le bassin jusqu’à nous satisfaire.\n\nMoqueurs, nous n’irons pas dans ces lieux fourmillants\nDe gens, moquer, choquer un à un les croyants ;\nEt ne sera jamais par nos mots offusquée\nL’église Saint-Sulpice ou la Grande Mosquée.\n\nRappelle-toi du film et entends mon soupir,\nMidnight in Paris, chère, en as-tu souvenir ?\nNous nous sommes promis de faire cette ville\nÀ deux, mais aujourd’hui mon espoir est fragile.\n\nNous ne pourrons jamais ma petite souris\nDresser le palmarès des croissants de Paris.\nEt ce Paris-Brest va rester dans sa vitrine,\nQuel intérêt peut-il avoir sans toi Yasmine ?\n\nLe métro parisien et le métro d’Alger\nN’auront pas le bonheur de nous voir voyager :\nIl devra démarrer, le train, sans nous attendre,\nEt lors de ses arrêts, nous ne pourrons descendre.\n\nIl démarre toujours et, sans aucun retard,\nLa cruelle Nature annonce son départ ;\nLe train des jours s’en va sans doute ou réticence\nEt laisse à ces humains le froid de son absence.\n\nIl m’aveugle les yeux de sa coruscation\nEt me laisse esseulé au quai de la station :\nIl trace son chemin d’une vitesse fière\nEt fait derrière lui un halo de lumière.\n\nRappelle-toi, mon cœur, notre premier baiser,\nAux Beaux-Arts, à Alger, où l’art sait apaiser\nUn gardien pour fermer l’œil sur notre indécence\nEt nous laisser aimer à notre convenance.\n\nNous nous sommes aimés, nous nous sommes fâchés\nQuelques fois ; mais toujours nous étions attachés\nL’un à l’autre et à nous : nos deux cœurs toujours trouvent\nLe moyen pour s’aimer et pour qu’ils se retrouvent.\n\nAprès un petit froid de grêle et de grêlons\nLe beau soleil revient et darde ses rayons :\nMa chère, n’est-ce pas le gris de nos grisailles\nQui rend sublime et fait le goût des retrouvailles ?\n\nChère, comme étions-nous si proche dans ce train\nQuand nous serrions nos mains avec force et entrain :\nNous nous y sentions seuls – pourtant bondé de monde,\nLe train se mouvait sans troubler l’union profonde.\n\nL’un à l’autre collés, nous blaguions à loisir\nEntre deux longs regards pénétrés de désir :\nNous voulions que le temps allège son allure,\nQue le train tombe en panne et que ce moment dure.\n\nMa main dans tes cheveux venait sans prévenir\nFrôler ta chevelure avant de revenir\nDans le creux de ta paume (avec ma main oisive)\nÉcraser le chewing-gum baignant dans ta salive.\n\nNous étions tous les deux contre l’adversité\nEn symbiose et unis devant l’éternité :\nUne chanson disait en boucle dans nos têtes\nNotre amour – et le reste était aux oubliettes.\n\nCette musique en boucle ondulait dans nos cœurs ,\nResserrait notre lien et repoussait nos peurs.\nFrissons sur tout le corps, papillons dans le ventre ;\nLe monde était à nous : nous en étions le centre.\n\nUn banc à Boumerdès, dans un petit jardin,\nUn jour qui aurait pu être un jour anodin\nSi ce n’était nous deux qui étions de passage\nEt qui avons manqué d’être un couple bien sage.\n\nRappelle-toi, mon cœur, notre complicité ;\nNous aimions notre union dans sa simplicité :\nComment peut-on après avoir été si proches\nDevenir étrangers aux cœurs remplis de roches ?\n\nJ’aimais – te souviens-tu ? – te donner à manger,\nTe nourrir de ma main, et pour t’encourager,\nTe dire que c’est bien, petit bébé, mon ange,\nJe n’ai de goût que quand c’est Yasmine qui mange.\n\nJ’adorais, souviens-toi, venir après manger,\nPorter jusqu’à ta bouche une eau pour soulager\nTa soif et l’étancher : que j’aime voir descendre\nL’eau à travers ta gorge et un peu se répandre.\n\nJ’aime te voir manger et t’entendre croquer ;\nJ’aime ton rototo et j’aime ton hoquet ;\nJ’aime te voir mâcher et t’entendre le faire ;\nEt quand t'en mets partout, c’est ce que je préfère.\n\nJ’aime presser ta lèvre et ta bouche carmin\nPour l’essuyer après boire et avec ma main\nEffacer chaque tache et chaque salissure,\nLa miette sur ta joue et sur ta commissure.\n\nPour t’oublier, je fais l’effort de me mentir,\nDe m’occuper à tout et de me divertir :\nJe regarde Squid Game et je vois cette actrice,\nTon visage à nouveau dans ma tête se hisse.\n\nMon ange, mon amour, mon opium adoré,\nMon koala, mon cœur, mon sucre coloré,\nMa mignonne, mon tout, ma douce, ma berbère,\nMon minouche, mon chou, ma Bougiote, ma chère.\n\nTu m’as laissé t’aimer sans jamais prévenir\nQue tu pouvais un jour brutalement partir :\nTu m’as ouvert les bras, tu m’as ouvert la porte ;\nTu ne peux, aujourd’hui, la fermer de la sorte.\n\nJe ne sais désaimer ce que j’aime une fois\nEt ne sais me soumettre, entre toutes les lois,\nQu’à celle de mon cœur qui sait tout et ignore\nCesser ce qu’il commence : il aime et aime encore.\n\n\nVillejuif, 7 novembre 2021\n```\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/ghilesmeddour/yasmine",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "yasmine",
    "package_url": "https://pypi.org/project/yasmine/",
    "platform": "",
    "project_url": "https://pypi.org/project/yasmine/",
    "project_urls": {
      "Bug Tracker": "https://github.com/ghilesmeddour/yasmine/issues",
      "Homepage": "https://github.com/ghilesmeddour/yasmine"
    },
    "release_url": "https://pypi.org/project/yasmine/1.0.0/",
    "requires_dist": [
      "pygame"
    ],
    "requires_python": ">=3.8",
    "summary": "POÈME POUR YASMINE",
    "version": "1.0.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 11950653,
  "releases": {
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "d6cdb14dd8ea496016bce19c8ca0ca6c3d7c70bbd5c86a9e3f702c82887bcdba",
          "md5": "5dfd0194dfaf503e5b9cf1ad464c4870",
          "sha256": "ce0886550966a6871309f1e3e5b000aa3c9d73096f875c88020e5a60cb309f84"
        },
        "downloads": -1,
        "filename": "yasmine-1.0.0-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "5dfd0194dfaf503e5b9cf1ad464c4870",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.8",
        "size": 3054565,
        "upload_time": "2021-11-07T10:22:37",
        "upload_time_iso_8601": "2021-11-07T10:22:37.195202Z",
        "url": "https://files.pythonhosted.org/packages/d6/cd/b14dd8ea496016bce19c8ca0ca6c3d7c70bbd5c86a9e3f702c82887bcdba/yasmine-1.0.0-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": "",
        "digests": {
          "blake2b_256": "63f51ea805fdd4e7dcc7b4a7b817cb9a77b2dd2f4fd5f9ab9e141d2b0a5fe5b8",
          "md5": "21980ac6607323a196a56c2a2ee3a21c",
          "sha256": "415d15d0aacfedf192a024038da0d57bf8026e963fdbf2d85249953809da20e8"
        },
        "downloads": -1,
        "filename": "yasmine-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "21980ac6607323a196a56c2a2ee3a21c",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.8",
        "size": 3061893,
        "upload_time": "2021-11-07T10:22:40",
        "upload_time_iso_8601": "2021-11-07T10:22:40.368270Z",
        "url": "https://files.pythonhosted.org/packages/63/f5/1ea805fdd4e7dcc7b4a7b817cb9a77b2dd2f4fd5f9ab9e141d2b0a5fe5b8/yasmine-1.0.0.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "d6cdb14dd8ea496016bce19c8ca0ca6c3d7c70bbd5c86a9e3f702c82887bcdba",
        "md5": "5dfd0194dfaf503e5b9cf1ad464c4870",
        "sha256": "ce0886550966a6871309f1e3e5b000aa3c9d73096f875c88020e5a60cb309f84"
      },
      "downloads": -1,
      "filename": "yasmine-1.0.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "5dfd0194dfaf503e5b9cf1ad464c4870",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.8",
      "size": 3054565,
      "upload_time": "2021-11-07T10:22:37",
      "upload_time_iso_8601": "2021-11-07T10:22:37.195202Z",
      "url": "https://files.pythonhosted.org/packages/d6/cd/b14dd8ea496016bce19c8ca0ca6c3d7c70bbd5c86a9e3f702c82887bcdba/yasmine-1.0.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "63f51ea805fdd4e7dcc7b4a7b817cb9a77b2dd2f4fd5f9ab9e141d2b0a5fe5b8",
        "md5": "21980ac6607323a196a56c2a2ee3a21c",
        "sha256": "415d15d0aacfedf192a024038da0d57bf8026e963fdbf2d85249953809da20e8"
      },
      "downloads": -1,
      "filename": "yasmine-1.0.0.tar.gz",
      "has_sig": false,
      "md5_digest": "21980ac6607323a196a56c2a2ee3a21c",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.8",
      "size": 3061893,
      "upload_time": "2021-11-07T10:22:40",
      "upload_time_iso_8601": "2021-11-07T10:22:40.368270Z",
      "url": "https://files.pythonhosted.org/packages/63/f5/1ea805fdd4e7dcc7b4a7b817cb9a77b2dd2f4fd5f9ab9e141d2b0a5fe5b8/yasmine-1.0.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}