{
  "info": {
    "author": "Matthew Gula",
    "author_email": "mlbshowdownbot@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: The Unlicense (Unlicense)",
      "Programming Language :: Python :: 3.7",
      "Programming Language :: Python :: 3.8"
    ],
    "description": "![Image](./static/interface/ShowdownLogo.png)\n# Showdown Bot\n\n[Showdown Bot](https://showdownbot.com) is the simplest way of creating custom MLB Showdown cards. Simply enter a player's **name**, **season**, and **image**. The Showdown Bot takes care of the rest. \n\n![](./static/interface/Example.gif)\n\n----\n\n\n## Table of Contents\n* [Getting Started](#getting-started)\n    * [Prerequisites](#prerequisites)\n    * [Installation](#installation)\n* [How it Works](#how-it-works)\n    * [Player Identification](#player-identification)\n    * [Gather Player Data](#gather-player-data)\n    * [Overrides](#overrides)\n    * [Convert to MLB Showdown Card](#convert-to-mlb-showdown-card)\n* [Card Methodology](#card-methodology)\n    * [Creating a Chart](#creating-a-chart)\n    * [Defense](#defense)\n    * [Innings Pitched](#innings-pitched)\n    * [Speed](#speed)\n    * [Icons](#icons)\n    * [Points](#points)\n    * [Multi-Year Cards](#multi-year-cards)\n    * [Negro Leagues and Pre-20th Century](#negro-leagues-and-pre-20th-century)\n    * [shOPS+](#shops)\n* [Editions](#editions)\n* [2022 Sets](#2022-sets)\n* [Showdown Library](#showdown-library)\n* [Showdown Explorer](#showdown-explorer)\n* [Running Locally](#running-locally)\n* [Contact the Dev](#contact-the-dev)\n\n----\n\n## Getting Started\n\n### Prerequisites\n* [Python3](https://www.python.org/downloads/)\n\n* (Optional) [pyenv](https://github.com/pyenv/pyenv) or [virtualenv](https://virtualenv.pypa.io/en/latest/)\n\n### Installation\n\nMLB Showdown Bot is available on PyPi\n\n```sh\npip install mlb-showdown-bot\n```\n\nMLB Showdown Bot can be run directly from the CLI\n\n```sh\nshowdownbot --name \"Mike Piazza\" --year 1997 --context 2001\n```\n\nExample Python use:\n\n```python\nfrom mlb_showdown_bot.showdown_player_card_generator import ShowdownPlayerCardGenerator\nfrom mlb_showdown_bot.baseball_ref_scraper import BaseballReferenceScraper\n\nname = 'Mike Piazza'\nyear = '1997'\n\n# GET PLAYER DATA\nscraper = BaseballReferenceScraper(name=name,year=year)\nstatline = scraper.player_statline()\n\n# CREATE SHOWDOWN CARD \nshowdown = ShowdownPlayerCardGenerator(\n    name=name,\n    year=year,\n    stats=statline,\n    context='2001',\n    print_to_cli=True\n)\n\n# CREATE SHOWDOWN CARD IMAGE\nshowdown.player_image(show=True)\n```\n\n----\n\n\n## How it Works\n\n### Player Identification\n\nAt minimum, the bot takes a player's NAME and SEASON as inputs. The first step is identifying which player the user is trying to create a card for. \n\nIncluded in the Bot's files is a mapping of Player Name (ex: Jacob DeGrom) -> Baseball Reference Id (ex: degroja01). The Bot will use this mapping if the entered name matches ONE player in the mapping file.\n\nBecause there have been around 20,000 unique players in the history of the MLB, there are cases of multiple players sharing the same name (ex: Frank Thomas _(1951-1966)_ and Frank Thomas _(1990-2008)_).\n\nTo solve for this, the bot first searches the phrase **\"baseball reference {name} {year}\"**. (Ex: \"baseball reference frank thomas 1994\"). Using Google's indexing algorithm, the bot chooses the first search result and derives the player's unique baseball reference id from it. \n\n![Image](./static/interface/GoogleSearch.png)\n\n### Gather Player Data\n\nThe bot uses [Baseball Reference](https://www.baseball-reference.com) as it's source for player data. Baseball Reference stores statistics for all of the ~20,000 players to make an appearance in the big leagues. \n\nStats are extracted from the the baseball reference page for the player id selected in the previous step. Stats like batting average, home runs, and defensive metrics (tzr/drs) are extracted only for the chosen season(s). For pitchers, opponent batting results are used (ex: batting average against). \n\nSome of this player data is unavailable for certain years or timeframes. Below is a list of unsupported time periods:\n1. Postseason (no batting against data)\n2. Minor Leagues (no batting against data)\n3. Spring Training (no batting against data)\n\nIf the selected season occured after 2015, sprint speed is also extracted from [Baseball Savant](https://baseballsavant.mlb.com/sprint_speed_leaderboard). A player's average sprint speed is used to determine in-game SPEED.\n\n### Overrides\n\nOverrides give additional ways to customize a player's card. They are applied by adding text after the player's name. These are the available overrides:\n\n- **(PITCHER)**: Type override to use a player's pitching stats. Can be applied to create proper 2-way players (ex: Shohei Ohtani (Pitcher)) or create pitching cards for position players (ex: Anthony Rizzo (Pitcher)).\n- **(HITTER)**: Type override to use a player's hitting stats. Can be applied to create proper 2-way players (ex: Michael Lorenzen (Hitter)) or create hitting cards for position players (ex: Mike Hampton (Hitter)).\n- **({TEAM_ID})**: Override to only use stats for a specific team. Can be used to create partial year cards for players that switched teams mid-season! (ex: Manny Ramirez (LAD)). Team Ids are found on the player's baseball reference page in the \"Tm\" column. Limited to seasons after 1918 and does not apply to multi-year or career long cards.\n\n### Convert to MLB Showdown Card\n\nThe stats scraped in the previous step are used as inputs to determine the player's MLB Showdown card for the selected season. The player's in-game abilities are derived using the probability of outcome for each result on an MLB Showdown chart. More about that process is detailed below in the [Card Methodology](#card-methodology) section.\n\nTo create the card image, the [Pillow](https://pillow.readthedocs.io/en/stable/) library is leveraged to dynamically create the final jpg. The user can add optional enhancements like selecting an image and adding _Super Season_ or _Cooperstown Collection_ graphics.\n\n----\n\n\n## Card Methodology\n\n\n### Creating a Chart\n\n##### _**NOTE: A player's ONBASE (hitter) or CONTROL (pitcher) are referred to in this repository as COMMAND**._ \n\nThe following steps are used to select the most accurate MLB Showdown card stats for a player:\n\n1. Calculate **Onbase Pct** for each possible **Command/Out** combination.\n2. Produce a chart for each **Command/Out** combination using the player's real life statline.\n3. Choose the most accurate chart + **Command/Out** combination by comparing projected Showdown statline to real life statline for that set's weight categories (ex: OBP, SLG)\n\nEach of these steps work by a using baseline opponent to project in-game outcomes. A baseline opponent represents the approximate average pitcher or hitter a player would face in-game. The baseline stats are represented by a dictionary that includes **Command**, **Outs**, and number of chart results for each category (SO, BB, HR, etc). Baseline opponents differ for each MLB Showdown set. \n\n\n###### _Example baseline pitcher for 2001 set. **Note that all weight categories may not add up to 20 perfectly._\n    \n    '2001': {\n        'command': 3.0,\n        'outs': 16.0,\n        'so': 4.1,\n        'bb': 1.35,\n        '1b': 2.0,\n        '2b': 0.62,\n        '3b': 0.00,\n        'hr': 0.11\n    }\n\nThese baseline opponents are vital to determining the final output of the player card. Adjusting these values will change which chart the bot decides is the most accurate. Because the actual baselines used to create the original sets are unknown, these are estimations based on set averages and testing against WOTC cards. The goal is to find the baseline weights that most closely resemble the original sets from 2000-2005.\n\n### **Command/Out --> Onbase Pct**\n\nFor each set, a static list of possible **Command/Out** combinations is defined for each player type (Hitter, Pitcher) in the [showdown constants](https://github.com/mgula57/mlb_showdown_card_bot/blob/master/mlb_showdown/showdown_constants.py) file. This list is used to generate the expected **Onbase Pct** for each combination using the baseline described above as the opponent. The following formula is used: \n\n`P(My Advantage) * P(Walk Or Hit on My Chart) + P(Opponent Advantage) * P(Walk Or Hit on Opponent's Chart)`\n\nOnly a few **Command/Out** combinations that are closest to the player's real life onbase pct are further processed. This is for efficiency and greater accuracy. \n\n### Generating Player Chart\n\nNow that a list of the most accurate **Command/Out** combinations (in terms of onbase pct) has been generated, a player's full in-game chart can be produced for each combination.\n\nA player's chart is generated by populating each result category.\n\n* Pitcher: _(PU, SO, GB, FB, BB, 1B, 2B, HR)_\n* Hitters: _(SO, GB, FB, BB, 1B, 1B+, 2B, 3B, HR)_\n\nThe number of results (out of 20 slots) assigned to each category are calculated using this formula:\n\n`(category_real_life_results_per_400_pa - (baseline_opponent_advantages_per_20_rolls * baseline_opponent_category_results)) / my_advantages_per_20_rolls`\n\n**Important caveats:** \n\n* Stats are normalized to 400 Plate Appearances to mirror the 400 possible showdown roll combinations (_20 (Pitch Roll) * 20 (Swing Roll)_).\n* FB, GB, PU are limited to OUT constraints. They use a different formula involving **Ground/Air Out Ratio** and **Infield FB Pct**.\n* 1B+ is determined by dividing stolen bases per 400 PA by a weighting determined by the player's Onbase. This yields higher 1B+ chart slots for player's with a lower Onbase. For example lets say Player A had 30 steals per 400PA and an Onbase of 6, while Player B had 30 steals per 400PA and an Onbase of 9. Player A will have more 1B+ on his card, as he gets the advantage less.\n* 1B is filled with the slots remaining after all other categories are populated.\n* The Maximum BB on a hitter's chart is 13 (thanks Barry Bonds '04).\n* The maximum HR on a hitter's chart is 10.\n\n### Selecting Most Accurate Chart\n\nNow that a chart has been generated for each **Command/Out** combination, the bot has all the required datapoints needed to determine accuracy. \n\nThe player's **Command** and chart values are used to estimate the player's _in-game_ statline for 400 Plate Appearances. That statline is then compared to the player's _real life_ statline per 400 Plate Appearances. Some stat categories are given more weight than others (ex: _OBP_ accuracy is weighted more heavily than _SLG_ accuracy). _Both real and in-game statlines are displayed in website and CLI outputs._\n\n**The chart with the highest aggregate accuracy is chosen as the final chart returned by the bot.**\n\nTo display one of the other chart outputs, add the optional **offset**/ argument on the CLI or the **Stats Version** option on the website. It allows the user to use any of the other charts from the Top 5 most accurate list. Use the `--offset` argument if in the CLI or choose an **Stats Version** > 1 in the _Stats Version_ section of the website.\n\n### **Defense**\n\n#### _Hitters_\nEach player can have a maximum of **2 positions** or WOTC sets (2000-2005). That is expanded to **3 positions** for 2022 sets. For a position to qualify, the player has to make at least **7 appearances** or at least **15%** of games at that position. The positions are then limited to the top by number of appearances. \n\nIn-game defensive ratings are calculated based on either Outs Above Avg (OAA), Total Zone Rating (tzr), Defensive Runs Saved (drs), or Defensive Wins Above Replacement (dWAR). The bot will choose which metric to use depending on the year:\n\n- 1870-1953: dWAR\n- 1953-2002: TZR\n- 2003-2015: DRS\n- 2016-PRES: OAA (EXCEPT CATCHERS)\n\nAll these metrics work by comparing a certain player to the average replacement at that position (0). For example a +10 TZR is an above average rating, while a -7 TZR is below average.\n\nThe player's in-game rating is calculated with a percentile within a range. The player's in-game rating is calculated based on that percentile multiplied by the highest rating for each position (Ex: **3B: +4**, **SS: +5**, **LF/RF: +2**).\n\nEx: David Wright 2007 (+12 DRS)\n```\n* 3B Rating = Percentile * 3B In-Game Max  \n* 3B Rating = 0.8 * 4\n* 3B Rating = 3.2\n* 3B Rating = +3\n```\n\nFor multi-year cards, the bot will take an average or median depending on which metric is used. Below is the breakdown for each metric.\n\n- dWAR - MEDIAN\n- TZR - MEDIAN\n- DRS - MEDIAN\n- OAA - AVG PER 162 GAMES AT POSITION\n\nIf the multi-year card spans across available metrics (ex: a card using 2014-2022), it will use the metric available for the entire period.\n\n#### _Pitchers_\nPitchers fall under the following categories\n1. STARTER: >40% of pitcher's appearances were starts\n2. RELIEVER: <=40 % of pitcher's appearances were in relief\n3. CLOSER: pitcher had at least 10 saves\n\n### **Speed**\n\nIn-game SPEED is calculated differently depending on the year. \n* If the year is AFTER 2015, SPRINT SPEED is used. _(Sourced from Baseball Savant)_\n* If the year is BEFORE or ON 2015, STOLEN BASES (per 650 PA) is used.\n\nEither SPRINT SPEED or STOLEN BASES is then converted to a percentile based off a range (the same way that defense is calculated). That percentile is then multiplied by the maximum in-game speed.\n\nFor example, the range of SPRINT SPEED is from 23 ft/sec to 31 ft/sec. If a player's SPRINT SPEED was 27ft/sec, they are in the 50th percentile (0.5). If the maximum in-game speed was 25, then this player's in-game SPEED is equal to 25 * 0.5, which rounds to **13**.\n\n\n_** Pitchers are automatically given a SPEED of 10._\n\n### **Innings Pitched**\n\nInnings pitched is calculated based a Pitcher's innings pitched / games played (IP/G). The components of that equation will change depending on the pitcher's type (STARTER vs RELIEVER). \n\n- STARTER: IP/GS\n- RELIEVER: (IP - (GS * IP/GS)) / (G-GS)\n\nEx: Nestor Cortes (2021) (RELIEVER)\n```\nStats:\n    G: 39\n    GS: 12\n    IP/GS: 5.5\n    IP: 123.2\n\nIP = (IP - (GS * IP/GS)) / (G-GS)\n   = (123.67 - (12 * 5.5)) / (39-12)\n   = 57.67 / 27\n   = 2.09\n   = 2 IP\n```\n### **Icons**\n\nIcons were a feature introduced in 2003 MLB Showdown sets. \n\nThis is the list of available icons and how a player is eligible:\n\n_** Some of these thresholds are slightly different than the original game._\n\n* **SS**: Won Silver Slugger Award.\n* **GG**: Won Gold Glove Award.\n* **V**: Won AL or NL Most Valuable Player Award.\n* **CY**: Won AL or NL CY Young Award.\n* **R**: Selected season was player's first year in MLB.\n* **RY**: Won AL or NL Rookie of the Year Award.\n* **20**: Won 20 or more games as a Pitcher.\n* **K**: Struck out at least 215 batters.\n* **HR**: Hit at least 40 Home Runs or led either league in Home Runs.\n* **SB**: Stole at least 40 bases or led either league in Steals.\n* **RP**: Led AL or NL in Saves.\n\n### **Points**\n\nA player's point value is calculated by summing up a player's value provided in the following categories:\n\n_Hitters_\n* Onbase Pct\n* Batting Avg\n* Slugging Pct\n* Defense\n* Speed\n* Home Runs\n* Icons (03+)\n\n_Pitchers_\n* Onbase Pct Against\n* Batting Avg Against\n* Slugging Pct Against\n* Innings Pitched\n* Icons (03+)\n* CLOSER Bonus (00 ONLY)\n\nA player's point value in each category is calculated by multiplying the WEIGHT given to the category by the PERCENTILE the player placed in. \n\nThe WEIGHT is the number of points provided if the player achieves the 100th percentile in that category. The percentile is calculated by taking difference between the player's stat and minimum values for a category, and dividing it by the difference between maximum and minimum values assigned to the category. The WEIGHT represents how many points a player will receive if they are in the 100th percentile in the category. _NOTE: WEIGHTS change across sets._\n\nThis calculation is performed for each category. The categorical point values are summed into the player's final total point value. \n\nEx: **Larry Walker, 550 PTS** _(2003 Base Set)_\n```\nStatline:\n    BA: .348\n    OBP: .419\n    SLG: .608\n\n    PA: 553\n    1B: 104\n    2B: 33\n    3B: 1\n    HR: 29 (34.5 per 650 PAs)\n    BB: 68\n    SO: 67\n\n    SPD: SPEED C (11)\n    ICONS: G\n\nPoints (OBP) = WEIGHT * PERCENTILE\n             = 160 * (0.419 - 0.270) / (0.425 - 0.270)\n             = 160 * 0.96\n             = 154 pts.\nPoints (SLG) = WEIGHT * PERCENTILE\n             = 160 * 1.29\n             = 206 pts.\nPoints (BA)  = WEIGHT * PERCENTILE\n             = 50 * 1.37\n             = 68.5 pts.\nPoints (HR)  = WEIGHT * PERCENTILE\n             = 60 * 0.98\n             = 59 pts.\nPoints (SPD) = WEIGHT * PERCENTILE\n             = 55 * 0.10\n             = 5.5 pts.\nPoints (DEF) = WEIGHT * PERCENTILE\n             = 45 * 1.00\n             = 45 pts.\nPoints (G Icon) = WEIGHT\n                = 10 pts.\n\nPoints (Total) = Round(154 + 206 + 68.5 + 59 + 5.5 + 45 + 10)\n               = 550\n\n```\n##### _Note: Pitchers have some categories (ex: BAA) where is percentile is reversed (1-percentile)_\n\nThere are additional weights/logic applied across the different sets to try to match to the original WOTC sets. \n\n- **Allow Negatives**: If True, allows a player to be penalized in the negative for a bad category. For example if a player is under the threshold defined for OBP, they will receive negative PTS for OBP. If False, player gets +0 PTS for that category if below threshold.\n- **Normalize Towards Median**: If True, a player over a certain value will get overall points reduced in order to keep a \"Bell Curve\" of point distribution. Scaler increases as point value above set value increases.\n- **Positional Defense Weights**: In some sets, certain positions are weighted lower than others. For example in the 2003 set, LF/RF max defense (+2) is worth 25% less than max CF defense (+3)\n- **Command Outs Adjustment**: In some sets, certain Command - Out combinations receive a manual adjustment to closer match WOTC. These are often small adjustments (1-5%) that only are applied to slashline and HR point categories. These help balance out points for cards that work better for stategy and advanced play.\n\n### **Multi-Year Cards**\n\nMulti-year or career long cards can be created on Showdown Bot using the year input. Here are some examples:\n\n- 2005-2010\n- 2005+2007+2010+2013\n- CAREER\n\nCard methodology will slightly change if the user enters a multi-year card. Differences include:\n\n- **SPEED**: Speed rating is based on the avg across the selected years. If the card crosses between using SB and Sprint Speed as metrics, it will use Sprint Speed if 35% of the seasons choosen are after 2015. Otherwise it will use SB as the benchmark.\n- **TEAM**: If the choosen player played for multiple teams, the Bot will assign the team with the most games played.\n- **DEFENSE**: For each qualified position, the Bot uses the **median** defensive metric (drs/tzr/dWar) calculated across the choosen years. If outs above avg is available, it takes uses 162 game average instead of a median. The qualification for positions increases from 15% -> 25%.\n- **GB/FB**: The GO/AO ratio is averaged across choosen years.\n- **Icons**: If the player qualified for an icon in any of the choosen seasons, he is granted the icon in the multi-year variant. This is excluding the R icon, which is only available in single-year cards.\n\n### **Negro Leagues and Pre-20th Century**\n\nAs of the 3.0 update, Showdown Bot now supports all players from Baseball Reference, including the Negro Leagues and pitchers from the 19th century. Data for these players is not fully available, so the Bot does it's best to fill in gaps through estimation. Any estimation will show a **'*'** next to the category in the breakdown section.\n\nHere are the stats that the Bot will estimate if unavailable:\n\nPitchers\n- PA: Uses BF if available, otherwise predicts PA based on IP * 4.25 (represents a league avg)\n- 2B: Predicts 2B based on player's ERA percentile (1.0-5.0). Max value is 25% of total hits allowed.\n- 3B: Predicts 2B based on player's ERA percentile (1.0-5.0). Max value is 2.5% of total hits allowed.\n- SLG: Derived from 2B and 3B estimations from above.\n- OBP: Derived using PA estimation from above as denominator.\n- RATIO: Estimates GO/AO ratio based on estimated SLG (higher the SLG, more FB on chart)\n\nHitters\n- SB: Will use SPEED 12 if SB not available.\n\n### **shOPS+**\n\nshOPS+ takes a player's projected in-game OPS and normalizes it across the entire set in that year (26 players/team). It adjusts a player's OPS slightly to account for a typical Showdown manager's tendency to draft higher Onbase/Control cards. A score of 100 is league average, and 175 is 75% better than the league average.\n\nFor example, Yandy Diaz's **2022 CLASSIC** card (10 Onbase) had a projected .838 OPS, which was 48% better than the 2022 MLB average after being adjusted to account for higher control pitching. As a result, his shOPS+ was 148.\n\n\n**Calculation:**\n\n##### _Note: Numerator and deominator are flipped for pitchers._\n```\n((PLAYER_PROJ_OBP / LEAGUE_AVG_PROJ_OBP) + (PLAYER_PROJ_SLG * COMMAND_ADJUSTMENT_FACTOR / LEAGUE_AVG_PROJ_SLG) - 1) x 100\n```\n\n**How does the Command Adjustment work?**\n\nThe `Command Adjustment Factor` is a way for shOPS+ to account for normal Showdown draft tendencies. Managers tend to weight gaining the advantage over number of outs on their player's chart. One player's stats against the \"avg\" player in a set may not match the typical card drafted in a real Showdown draft setting.\n\nFor example, let's compare **Mike Clevinger** vs **Blake Snell** in the **2022-CLASSIC** set.\n\n![Image](./static/interface/shOPSComparison.png)\n\nThese 2 cards have very similar projected OPS against (Clevinger having the slight edge at .622 vs Snell's .625), meaning their non-adjusted shOPS+ numbers are similar (Clevinger at 116, Snell at 114).\n\nMost Showdown managers however would see a larger difference between these 2 cards, as Mike Clevinger's +4 Control performs significantly better against higher Onbase opponents, especially with no 2B on his chart. shOPS+ accounts for that, applying a **1.04** adjustment factor to Clevinger's SLG and a **0.94** to Snell. This results in a larger disparity between the 2 pitchers, with Clevinger ending with a 120 shOPS+ vs Snell's 108.\n\n## **Editions**\n\nUse Editions to add style variety to your cards. There are currently 6 different Editions available on Showdown Bot.\n\n1. [Cooperstown Collection](#cooperstown-collection)\n2. [Super Season](#super-season)\n3. [Nationality](#nationality)\n4. [All-Star Game](#all-star-game)\n5. [Rookie Season](#rookie-season)\n6. [Holiday](#holiday)\n\n### **Cooperstown Collection**\n\n![Image](./static/interface/CooperstownPlayers.png)\n\nCooperstown theme is available on all sets. It replaces the player's team logo with a the official Cooperstown Collection logo, changes the template color in 04/05 sets, and some certain players adds new player art.\n\nCustom player art is available in 2003, 2004, and 2005 sets. 2022 sets will use the official Cooperstown color scheme in the chart.\n\n### **Super Season**\n\n![Image](./static/interface/SuperSeasonPlayers.png)\n\nSuper Seasons highlight outstanding single season performances throughout baseball history. A custom super season logo will replace the player's team logo, and certain years add a list of 3 accolades as well.\n\nHere are the available accolade categories, ordered by priority:\n - MVP\n - SILVER SLUGGER\n - GOLD GLOVE\n - CY YOUNG\n - RoY\n - HR\n - CYA FINALIST\n - MVP FINALIST\n - RoY FINALIST\n - ALL-STAR\n - ERA\n - W\n - SV\n - BA\n - RBI\n - H\n - dWAR\n - OPS+\n - bWAR\n\n2004 and 2005 sets feature a special red template, as well as a grid pattern in the background of select players.\n\n### **Nationality**\n\n![Image](./static/interface/NationalityPlayers.png)\n\nReplaces a player's MLB team with their birthplace country. Adds a custom background for all sets that is inspired by WOTC promo cards. For automated images, there will be some World Baseball Classic player images available.\n\nList of supported countries:\n - United States\n - Domican Republic\n - Venezuela\n - Cuba\n - Canada\n - Mexico\n - Puerto Rico\n - Panama\n - Japan\n - Great Britain\n - Australia\n - Colombia\n - South Korea\n - Netherlands\n - Italy\n - China\n - Israel\n - Czech Republic\n - Nicaragua\n - Germany\n - Taiwan\n - Curacao\n\n2004 and 2005 sets feature a special red template, as well as a grid pattern in the background of select players. 2022 sets feature a new gradient design for the outs portion of player charts.\n\n### **All-Star Game**\n\n![Image](./static/interface/AllStarPlayers.png)\n\nAll Star Game logos are available on all sets for all seasons since 1980. Since 2021, custom background art and is available and will continued to be updated every year.\n\n### **Rookie Season**\n\n![Image](./static/interface/RookiePlayers.png)\n\nRookie Season replaces a player's team logo with a custom rookie season icon. Some players in 2022 CLASSIC/EXPANDED sets also have special edition flashback card art shown above.\n\n### **Holiday**\n\n![Image](./static/interface/HolidayPlayers.png)\n\nThe Holiday theme adds a simple Christmas Tree inspired border to any card. This includes user uploaded photos, automated images, and silhouettes. \n\n## **2022 Sets**\n\n **Showdown Bot now includes new sets that modernize the look and play of MLB Showdown!**\n\n\n### **Design**\n\nThe 2022 set design takes elements from classic MLB Showdown sets and adds a modern twist, resulting in a streamlined design that will look great with any background image. Chart and Command colors will change from team to team, creating a blend of 2000/2001's color with 2004/2005's simplicity.\n\n\n![Image](./static/interface/Example2022Headliner.png)\n\n\n\n### **Styles**\n\nThese sets are split between **Classic** and **Expanded** styles, with the goal of offering modern cards to every type of Showdown fan. The Classic style is most compatible with 2000/2001 sets, while Expanded fits with 2002-2005 sets. You will see a visual indicator of the card style in the bottom left of each card.\n\n![Image](./static/interface/Example2022SetDifference.png)\n\n### **Classic Style**\n\nThe Classic Style is made for the OG Showdown fan who prefers the 2000/2001 sets. In this style, hitters have lower Onbase numbers (between 4-12) but better charts. It uses the 2001 set as a starting point, but alters the original formula to fix gaps while maintaining compatibility.\n\nChanges from 2001 set:\n- **SPEED**: Expands options from 10/15/20 to the full range of 8-25.\n- **HITTING**: The formula has been tweaked to account for the shift in balance between hitter and pitcher. Hitter charts will be slightly better than in the 2001 set to due to better Pitcher opponents!\n- **ICONS**: Icons will appear on the card. Players can optionally incorporate them into gameplay or simply have them as a visual representation of awards and rookie status.\n- **PITCHER CHART HRS**: To account for an increase in HRs, the minimum requirement for HR on a pitcher's chart has decreased, resulting in more HR results.\n- **MORE COMMAND-OUT COMBINATIONS**: In order to increase variety and accuracy of cards, more possible Onbase/Control + Out combinations have been added. For example it is possible to have a 4 Control pitcher with 19 outs, or a 9 Onbase hitter with 6 Outs. This will help increase balance of low onbase and high SLG hitters (ex: Javy Baez), who under normal Showdown constraints were constrained to lower Onbase numbers.\n- **STRIKEOUTS**: The number of strikeouts on a hitters chart should slightly decrease, with the assumption that pitcher charts will have more SO results than in 2000-2001.\n- **DEFENSIVE RANGES**: Certain positions will see an increase in AVG in-game defense. This includes SS, CF, and 3B. Ex: 2018 Francisco Lindor goes from +5 SS in 2001 set to +7 SS in 2022 set. It also allows for negative defense across all positions (ex: Matt Kemp 2010).\n- **NUMBER OF POSITIONS**: Now a player has a maximum of 3 available positions. This provides more value to super utility players like Ben Zobrist and Kris Bryant.\n\n### **Expanded Style**\n\nThe Expanded Style is made for the new school Showdown fan who prefers the 2002-2005 sets. In this style, hitters have higher Onbase numbers (between 7-16) but less impactful charts. Charts also expand past 20, creating possible results outside of the normal 1-20 range. It uses the 2005 set as a starting point, but alters the original formula to fix gaps while maintaining compatibility.\n\nChanges from 2005 set:\n- **SPEED**: Reduces maximum speed to 25, helping reduce automatic steals and advances from players like Lou Brock and Rickey Henderson.\n- **HITTING**: The formula has been tweaked to account for the shift in balance between hitter and pitcher. Hitter charts will be slightly better than in the 2005 set to due to better Pitcher opponents!\n- **PITCHER CHART HRS**: To account for an increase in HRs, the minimum requirement for HR on a pitcher's chart has decreased, resulting in more HR results.\n- **MORE COMMAND-OUT COMBINATIONS**: In order to increase variety and accuracy of cards, more possible Onbase/Control + Out combinations have been added. For example it is possible to have a 4 Control pitcher with 19 outs, or a 10 Onbase hitter with 8 Outs. This will help increase balance of low onbase and high SLG hitters (ex: Javy Baez), who under normal Showdown constraints were constrained to lower Onbase numbers.\n- **STRIKEOUTS**: The number of strikeouts on a hitters chart should slightly decrease, with the assumption that pitcher charts will have more SO results than in 2002-2005.\n- **DEFENSIVE RANGES**: Certain positions will see an increase in AVG in-game defense. This includes SS, CF, and 3B. Ex: 2021 Francisco Lindor goes from +3 SS in 2005 set to +4 SS in 2022 set. It also allows for negative defense across all positions (ex: Matt Kemp 2010).\n- **NUMBER OF POSITIONS**: Now a player has a maximum of 3 available positions. This provides more value to super utility players like Ben Zobrist and Kris Bryant.\n\n### **Dark Mode**\n\nThere is now an additional option for **Dark Mode**, available on 2022 Classic and Expanded sets only. Works with any player!\n\n![Image](./static/interface/Example2022LightVsDark.png)\n\n\n<img align=\"right\" src=\"./static/interface/ShowdownLibraryLogo.png\" width=\"90\">\n\n## Showdown Library \n\nThe Showdown Library is a backend system used to: \n1. Store historical data. \n2. Allow Showdown fans access to cards more efficiently.\n3. Power advanced features.\n4. Centralize Showdown Bot data into one location.\n5. Enable Official Showdown Bot Set Releases.\n\nIt leverages the combination of Firebase's Realtime Database and the Google Drive API to deliver realtime Showdown Cards without the need for on-demand processing. \n\nWhen a user submits a card on Showdown Bot, it will check to see if the user requested card is stored in the database, and if so will return the card and corresponding image in less than a second.\n\nThere are some cases in which the Bot will leverage the data from Showdown Library, but will still need to generate an image live. \n\nList of reasons it will not used pre-stored image:\n- No automated image exists.\n- Non V1 Card.\n- Custom set number\n- Has special edition (ex: CC, SS, RS)\n- Expansion does not match (ex: TD, PR)\n- Has variable speed ('00-'01 Only)\n- Is a Foil\n- Img Link was provided by the user\n- Img Upload was provided by the user\n\n----\n## Showdown Explorer\n\nThe Showdown Explorer tool leverages the power of the Showdown Library to provide the user with the ability to discover and explore cards from 1900-2022.\n\n_In depth walkthroughs and guides will be linked here in a future update._\n\n----\n## Running Locally\n\nYou can [clone](https://docs.github.com/en/repositories/creating-and-managing-repositories/cloning-a-repository) this repository and run it locally on your machine. Be sure you have went through the [prerequisites](#prerequisites) before proceeding.\n\nHere are the high level steps:\n\n1. [Clone](https://docs.github.com/en/repositories/creating-and-managing-repositories/cloning-a-repository) this repository to your local machine\n2. Open Terminal (MacOS) or Windows CLI\n3. Change the current working directory to the location where you cloned in step 1.\n4. Create a new [virtual environment](https://virtualenv.pypa.io/en/latest/) (optional)\n5. Install required package dependencies ([instructions](https://stackoverflow.com/questions/7225900/how-can-i-install-packages-using-pip-according-to-the-requirements-txt-file-from))\n\nAfter installing and handling any package errors, you can run Showdown Bot from the command line or locally in a browser.\n\nCommand Line\n```\npython mlb_showdown_bot --name \"Mike Piazza\" --year 1997 --context 2001\n```\n\nFlask App (opened via Browser)\n```\npython app.py\n```\n\n----\n## Contact the Dev\n\nYou can reach out to the developer of MLB Showdown Bot through email mlbshowdownbot@gmail.com\n\nFollow MLB Showdown Bot Twitter for updates and card posts!\n\n[![Twitter](https://img.shields.io/twitter/url/https/twitter.com/mlbshowdownbot.svg?style=social&label=Follow%20%40mlbshowdownbot)](https://twitter.com/mlbshowdownbot)\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/mgula57/mlb_showdown_card_bot",
    "keywords": "",
    "license": "Unlicense",
    "maintainer": "",
    "maintainer_email": "",
    "name": "mlb-showdown-bot",
    "package_url": "https://pypi.org/project/mlb-showdown-bot/",
    "platform": null,
    "project_url": "https://pypi.org/project/mlb-showdown-bot/",
    "project_urls": {
      "Homepage": "https://github.com/mgula57/mlb_showdown_card_bot"
    },
    "release_url": "https://pypi.org/project/mlb-showdown-bot/3.4.822/",
    "requires_dist": [
      "apiclient (>=1.0.4)",
      "beautifulsoup4 (>=4.9.3)",
      "bs4 (>=0.0.1)",
      "firebase-admin (>=6.0.1)",
      "google (>=3.0.0)",
      "google-api-python-client (>=2.7.0)",
      "lxml (>=4.6.1)",
      "numpy (>=1.19.4)",
      "oauth2client (>=4.1.3)",
      "pandas (>=1.1.4)",
      "Pillow (>=7.2.0)",
      "requests (>=2.25.0)",
      "simplejson (>=3.17.6)",
      "Unidecode (==1.2.0)",
      "urllib3 (>=1.26.2)",
      "xlrd (>=1.2.0)"
    ],
    "requires_python": ">=3.7",
    "summary": "Create custom MLB Showdown cards",
    "version": "3.4.822",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17551776,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "903391e43e09a62e3df46cdf33f650bf0e6633247e1d47e174f6605728c37f91",
        "md5": "b0f073657e8b2af8d5b06b9dafffb201",
        "sha256": "7e5dacf0ec6e7c079395ba439e642fde27a17b14094999bd990dc04db3e05f43"
      },
      "downloads": -1,
      "filename": "mlb_showdown_bot-3.4.822-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "b0f073657e8b2af8d5b06b9dafffb201",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.7",
      "size": 80683304,
      "upload_time": "2023-04-02T23:53:11",
      "upload_time_iso_8601": "2023-04-02T23:53:11.676406Z",
      "url": "https://files.pythonhosted.org/packages/90/33/91e43e09a62e3df46cdf33f650bf0e6633247e1d47e174f6605728c37f91/mlb_showdown_bot-3.4.822-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "1ccd23a790422589451ba14a11bd938f787543cb4cdf5132baeecc7aef44ee5a",
        "md5": "4f3505f562cacc362469387ed29d9fef",
        "sha256": "ff07927c70354ed60b284dbe12db5b0137bc55c89b1827ae43ca2654320e4eed"
      },
      "downloads": -1,
      "filename": "mlb-showdown-bot-3.4.822.tar.gz",
      "has_sig": false,
      "md5_digest": "4f3505f562cacc362469387ed29d9fef",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7",
      "size": 102500483,
      "upload_time": "2023-04-02T23:54:17",
      "upload_time_iso_8601": "2023-04-02T23:54:17.680246Z",
      "url": "https://files.pythonhosted.org/packages/1c/cd/23a790422589451ba14a11bd938f787543cb4cdf5132baeecc7aef44ee5a/mlb-showdown-bot-3.4.822.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}