{
  "info": {
    "author": "Grace Cox",
    "author_email": "grace.cox@dias.ie",
    "bugtrack_url": null,
    "classifiers": [
      "Programming Language :: Python :: 3"
    ],
    "description": "Welcome to MagPySV!\n===================================\n|build-status| |docs-status| |code-health| |coverage| |license|\n\nFull documentation is hosted at http://magpysv.readthedocs.io/en/latest/\n\nIntroduction\n------------\n\nMagPySV is an open-source Python package designed to provide a consistent, and automated as far as possible, means of generating high resolution SV time series from raw observatory hourly means distributed by the World Data Centre (WDC) for Geomagnetism at the British Geological Survey (BGS), Edinburgh. It uses a second Python package developed by BGS to download data for a given time range and list of observatories.\n\nThe package may be run on the command line or within an interactive Jupyter notebook, and allows the user to obtain data in WDC format from BGS servers for a user-specified time period and list of observatories. It produces time series of the X, Y and Z components of the internally-generated magnetic field and secular variation (SV) at the desired frequency (typically monthly or annual means), and applies corrections for all documented baseline changes. Optionally, the user may exclude data using the `ap index`_, which removes effects from documented high solar activity periods such as geomagnetic storms. Robust statistics are used to identify and remove outliers. \n\nThe software develops previously published denoising methods, which aim to remove external field contamination from the internal field, using principal component analysis, a method that uses the covariance matrix of the residual between the observed SV and that predicted by a global field model to create and remove a proxy for external field signal from the data. This method, based on `Wardinski & Holme (2011)`_, creates a single covariance matrix for all observatories of interest combined and applies the external field correction to all locations simultaneously, resulting in cleaner time series of the internally-generated SV.\n\nInstallation\n------------\n\nMagPySV can be installed via the Python Package Index (PyPI) using the command\n``pip install magpysv``. This also installs all required dependencies, including the BGS data downloading app. The example Juypyter notebooks (see below) are not included in the PyPI installation and need to be downloaded from a separate GitHub project page after the software is installed.\n\nExample workflows\n-----------------\n\nIn the paper accompanying this software (in prep), we present two case studies of cleaned data in different geographic regions and discuss their application to geomagnetic jerks: monthly first differences for Europe, and annual differences for northern high latitude regions. A second GitHub repository accompanying this package includes two notebooks that can be used to download the relevant hourly data from BGS and reproduce the figures for these case studies. Note that MagPySV must be installed before using the notebooks (preferably using ``pip``).\n\nTo obtain the notebooks, go to their GitHub project page at https://github.com/gracecox/MagPySV-examples and click the green \"clone or download\" button. From the dropdown menu, select \"download zip\" and save the file to the desired location. Unzip the file and navigate to the resulting folder. To open the notebooks, launch a Jupyter notebook from the folder (e.g. by typing ``jupyter notebook`` into the command line from that directory) and then select the desired notebook from the list that appears in your web browser.\n\nThe `Jupyter documentation`_ contains a step-by-step tutorial on installing and running notebooks, and is aimed at new users who have no familiarity with Python.\n\nContributing\n------------\n\nWe hope others in the geomagnetism community find this code useful and welcome suggestions, feedback and contributions. Requesting new features or reporting bugs can be done by creating a `GitHub issue`_ for the repository.\n\nIf you would like to fix bugs or implement new features yourself, this is very welcome! This is done by\n\n1. Forking MagPySV's GitHub repository\n2. Creating a branch for your changes\n3. Making your changes to the code\n4. Submitting a pull request to the repository\n\nThose unfamiliar with this process might find `GitHub's tutorials`_ useful. If this still looks too complicated, you are welcome to create a GitHub issue or get in touch with us directly for help.\n\nReference\n---------\n\nA manuscript describing MagPySV is currently in preparation. The paper also presents two case studies of cleaned data at European and high latitude observatories, and their application to geomagnetic jerks.\n\n.. _ap index: https://www.gfz-potsdam.de/en/kp-index/\n.. _Wardinski & Holme (2011): https://doi.org/10.1111/j.1365-246X.2011.04988.x\n.. _Jupyter documentation: https://jupyter-notebook-beginner-guide.readthedocs.io/en/latest/\n.. _GitHub issue: https://github.com/gracecox/MagPySV/issues\n.. _GitHub's tutorials: https://guides.github.com/\n\n\n.. |build-status| image:: https://travis-ci.org/gracecox/MagPySV.svg?branch=master\n    :target: https://travis-ci.org/gracecox/MagPySV\n    :alt: Build Status\n\n.. |docs-status| image:: https://readthedocs.org/projects/magpysv/badge/?version=latest\n    :target: http://magpysv.readthedocs.io/en/latest/?badge=latest\n    :alt: Documentation Status\n\n.. |coverage| image:: https://coveralls.io/repos/github/gracecox/MagPySV/badge.svg?branch=master\n   :target: https://coveralls.io/github/gracecox/MagPySV?branch=master\n   :alt: Coverage\n\n.. |license| image:: https://img.shields.io/badge/license-MIT-blue.svg\n   :target: https://opensource.org/licenses/MIT\n   \n.. |code-health| image:: https://api.codacy.com/project/badge/Grade/e22cd43f7e364892ab42c874ada808ad\n   :alt: Codacy Health\n   :target: https://app.codacy.com/app/gracecox/MagPySV?utm_source=github.com&utm_medium=referral&utm_content=gracecox/MagPySV&utm_campaign=badger\n\nThe project's main directory contains the readme file, license and various setup files. The `magpysv` directory contains all of the Python modules that make up the package, detailed descriptions of all functions contained within each module are found in the full documentation hosted at http://magpysv.readthedocs.io/en/latest/. The code documentation can also be accessed using Python's help function by typing a command in this format: ``help(magpysv.modulename.functionname)``",
    "description_content_type": "",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/gracecox/MagPySV",
    "keywords": "",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "magpysv",
    "package_url": "https://pypi.org/project/magpysv/",
    "platform": "",
    "project_url": "https://pypi.org/project/magpysv/",
    "project_urls": {
      "Homepage": "https://github.com/gracecox/MagPySV"
    },
    "release_url": "https://pypi.org/project/magpysv/1.0/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "Download, process and denoise geomagnetic observatory data",
    "version": "1.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 9589807,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "2f21794eb7323b247e305ca0447babb699189100c12a461ee55503f8966a217d",
        "md5": "e8e70eb4bc587f24872214c131c98608",
        "sha256": "ac9a073ff821cae92ad78fad6beab02f46f844f5f4be306e2773cf2e50bfd646"
      },
      "downloads": -1,
      "filename": "magpysv-1.0.tar.gz",
      "has_sig": false,
      "md5_digest": "e8e70eb4bc587f24872214c131c98608",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 31255,
      "upload_time": "2018-05-19T12:09:14",
      "upload_time_iso_8601": "2018-05-19T12:09:14.977145Z",
      "url": "https://files.pythonhosted.org/packages/2f/21/794eb7323b247e305ca0447babb699189100c12a461ee55503f8966a217d/magpysv-1.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}