{
  "info": {
    "author": "Naratna",
    "author_email": "antar.espadas@hotmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# minecraft-movie-player\n\nA command line program that generates a datapack that plays videos in vanilla Minecraft\n\nThe goal of this program is to take a video file and convert its frames into structure block files so that it can be played inside a Minecraft world through the use of a datapack and a resourcepack\n\n## Quick start tutorial\n\n**Prerequisites**\n\n - [Python >= 3.8](https://www.python.org/downloads/) \n - [ffmpeg](https://ffmpeg.org/download.html) or [libav](https://libav.org/download/)\n - [Minecraft Java Edition](https://www.minecraft.net/en-us/store/minecraft-java-edition) 1.16 (May work on earlier versions but is untested)\n\nMake sure both python and ffmpeg/libav are present in your system's PATH environment variable\n\n**Installation**\n\nthe installation can be done through a command line terminal using [pip](https://pypi.org/project/pip/)\n\n    $ python -m pip install minecraft-movie-player\n\n**Basic usage**\n\nThe program can be called from a command line with\n\n    $ mc-movie\n\nor, alternatively, with\n\n    $ python -m minecraft_movie_player\n\nThe easiest way to generate the necessary files is through the sub command `all` provided by the cli, like so:\n \n    $ mc-movie all OUTPUT_FOLDER -v VIDEO\n   \nOUTPUT_FOLDER should be replaced with the path to a (preferably empty) folder where all the generated files will be saved.\nVIDEO should be replaced with the path to the video that is to be played inside Minecraft\n\nOnce the program begins, it can take from a few minutes to a few hours for it to finish, depending on the length of the video as well as the performance of your processor.\n\nThroughout this process, hundreds (or even thousands) of files will be dumped inside the output folder, try not to mess with any of them and don't worry about the mess, by the end all that will be left in there is a single folder and a zip file.\n\nIf the process in interrupted, it can be resumed later simply by providing the path to the output folder that was being used, provided the files within it are still intact.\n\n    $ mc-movie all SAME_OUTPUT_FOLDER\n\n**Getting the video inside Minecraft**\n\nOnce the program is done, go inside the output folder, where you will find a folder named `player` and a zip file named `resources.zip`. Go into Minecraft, select the world of your choice, click the button `Edit` on the bottom left and then the button `Open world folder`. Copy `resources.zip` to this folder, then head inside the folder named `datapacks` and copy the folder `player` to it.\n\nAfter all that is done, open your Minecraft world and pick the location for the screen's bottom left corner, stand there, open the chat (default key is `t`), then send\n\n    /function player:setup_video\n\nand\n\n    /function player:setup_audio\n\nFinally, when you wish to start the video, send\n\n    /function player:restart\n   \nThat's it! If everything went accordingly, your video should be playing inside vanilla Minecraft.\nAdditionally, the following commands should be available to pause/play the video:\n\n    /funtcion player:pause\n    /function player:play\n\n## Using a custom block palette\n\nIn order to use a custom set of blocks for the creation of the video, we will need to provide our own custom block palette. The program provides some of the tools necessary for creating this file.\n\nThe palette is a file that contains information about the blocks we wish to use and their average RGB color. The program then uses this palette to find the most appropriate block for each pixel on the video.\n\nCreating the palette can be done through two main steps. First, we create an index file, this file lists all the blocks that are to be used in the palette, along with the filenames of their corresponding textures. Secondly, we feed this palette into the program, which will look for the specified textures, calculate their average RGB color then store them in a palette file.\n\nIn this guide, we will be creating an index file from scratch. Note however that an index file is already bundled along the program's files, so it is probably a good idea to modify it to suit your needs instead of creating one from scratch.\n\nThe first thing wee need is a folder containing all the block textures we wish to use. If we wanted to use the vanilla Minecraft textures, then we would head to [.minecraft](https://minecraft.gamepedia.com/.minecraft#Locating_.minecraft)/versions/[version number] and extract the contents of the file [version number].jar with a tool such as 7zip or WinRAR. Then, along the files we just extracted, we would locate the folder assets/minecraft/textures/block. This is the folder containing all of the block textures.\n\nIt is also possible to want to create a custom block palette to use along a resource pack, since the colors of the blocks may differ from those in the vanilla textures. Any resource pack you download should also contains the folder assets/minecraft/textures/block.\n\nWe now want to make a copy of the `block` folder and start deleting the textures for all the blocks we do not wish to include. It is a good idea to delete textures that\n\n- **Are not full blocks**, such as doors, levers, rails, pots, flowers, anvils, etc.\n- **Can never face the side**, such as the tops of ancient debris, crafting tables, beehives, etc.\n- **Can not stay forever**, such as living corals, which will die, water which will flow, frosted ice, which will melt, etc.\n- **Produce light**, such as glowstone, sea lanterns, etc.\n- **Are transparent**, such as glass, ice, etc.\n- **Can not stand on their own**, such as sand, gravel, concrete powder, etc.\n- **May interact with other blocks**, such as lava, redstone, carved pumpkins, TNT, etc.\n- **Produce particles**, such as wet sponges.\n- **Can not be seen from a distance**, such as shulker boxes.\n- **Don't belong to any actual blocks**, such as block breaking textures and debug textures.\n\nAfter all that work is done, we need to make an index file. The index file is an Excel flavored csv file with the texture's filename on the first column, its corresponding block ID on the second column, and any additional nbt data required for the texture to face the side on the third column. We can generate a template for this file using the following command:\n\n    $ mc-movie index PATH_TO_BLOCK_FOLDER PATH_TO_INDEX_FILE -f\n\nPATH_TO_BLOCK_FOLDER is the path to the folder containing all the block textures we wish to use.\nPATH_TO_INDEX_FILE is the path where we wish to save the index template\n\nthis will produce a file that looks something like this:\n\n    acacia_log.png;acacia_log;\n    acacia_log_top.png;acacia_log_top;\n    acacia_planks.png;acacia_planks;\n    ancient_debris_side.png;ancient_debris_side;\n    andesite.png;andesite;\n    [...]\n    yellow_glazed_terracotta.png;yellow_glazed_terracotta;\n    yellow_terracotta.png;yellow_terracotta;\n    yellow_wool.png;yellow_wool;\n\nAs you can see, a lot of these lines are already as they should be, but some of them are not. Take for instance the following entry:\n\n    acacia_log_top.png;acacia_log_top;\n\nMinecraft has no block with ID `acacia_log_top`, as the texture in question is merely one of the sides of the acacia log, with id `acacia_log`. So we change the ID and end up up with the following:\n\n    acacia_log.png;acacia_log;\n    acacia_log_top.png;acacia_log;\n    acacia_planks.png;acacia_planks;\n    [...]\n\nHowever, this is not enough, since we want the texture `acacia_log_top.png` to face the side, we need a way to tell Minecraft that the block should be placed on its side. To do so, we can head into Minecraft and place an acacia log with its top facing **south**, then open the debug menu (default key is `f3`), and point towards the block. On the right, we see information about the block, including its ID and its properties. We are interested in the one that says `axis: z`, since it is the one responsible for the orientation.\n\n![log_1.png](images/log_1.png)\n\nSo we add `{'axis': 'z'}` on the third column:\n\n    acacia_log.png;acacia_log;\n    acacia_log_top.png;acacia_log;{'axis': 'z'}\n    acacia_planks.png;acacia_planks;\n    [...]\n\nSomething similar happens in the case of blocks such as furnaces\n\n    [...]\n    end_stone_bricks.png;end_stone_bricks;\n    furnace_front.png;furnace_front;\n    furnace_side.png;furnace_side;\n    gold_block.png;gold_block;\n    [...]\n\nIn this case, both of the IDs are wrong, it should simply be `frunace`.\nAdditionally, for the front to face south, the block should have the property `{'facing': 'south'}` and for the side to face south, the furnace needs to face east, west or north. Pick your poison.\n\n    [...]\n    end_stone_bricks.png;end_stone_bricks;\n    furnace_front.png;furnace;{'facing': 'south'}\n    furnace_side.png;furnace;{'facing': 'north'}\n    gold_block.png;gold_block;\n    [...]\n\nFor most blocks, the only two properties we will have to worry about are `axis` and `facing`, although there are a few exceptions such as mushroom blocks, barrels and beehives.\n\nAfter we are done adding nbt data and fixing incorrect block IDs, we are practically done, all we need to do is tell the program to generate a palette based on this index using the following command\n\n    $ mc-movie palette PATH_TO_BLOCK_FOLDER PATH_TO_PALETTE -i PATH_TO_INDEX\n\nPATH_TO_BLOCK_FOLDER is the path to the folder containing all the block textures. Note that it doesn't matter if this folder contains any extra files, as any file not present in the index will not be considered.\nPATH_TO_PALETTE is the path where we wish to save the generated palette\nPATH_TO_INDEX is the path to the index file we just created.\n\nAfter a few seconds, the program will have generated a palette file; we are now done. The file can used through the cli's subcommands `all` and `video` using the argument `-i PATH_TO_PALETTE`\n\n## Complete usage instructions\n\n**the `all` subcommand**\n\nAs explained above, this command easily generates all the required files without much hassle.\n\nRequired positional arguments:\n- `path_to_output_folder`: the path to the folder where all the generated files will be dumped. Additionally, a `progress.txt` file will be created inside the folder, it helps the program pick up where it left off in case it is interrupted. If the file is present, all provided optional arguments will be ignored in favor of the values present inside `progress.txt`. If the file is not present, the argument `-v`/`--video` becomes obligatory.\n\nOptional arguments:\n- `-v` or `--video`: the path to the video that is to be used as a base for generating all the required files. The video's frames will be converted into structure block (nbt) files. The audio will be split into 60 seconds-long segments and saved as vorbis encoded .ogg files. If the video contains more than one audio track, the one marked as default within the file will be used. If the video has no sound, all of the steps pertaining to audio playback will be skipped.\n- `d` or `--datapack-name`: the name that will be assigned to the generated datapack, it must contain only legal characters, as explained in the [wiki](https://minecraft.gamepedia.com/Tutorials/Creating_a_data_pack#Legal_characters), and in this case, be no longer than 13 characters.\n- `p` or `--palette`: the path to a custom block palette file. More information about this file can be found below.\n- `t` or `--ticks-per-frame`: an integer above 0 that states the amount of game ticks in between every video frame. The lower this number, the higher the framerate. The lowest possible number, 1, yields a framerate of 20 fps, since Minecraft runs at 20 ticks per second. The default is 2.\n- `x` or `--width`: the with in blocks of the structures that will be generated. Defaults to 75 if no width or height are given.\n- `y` or `--height`: the height in blocks of the structure that will be generated.\n\nNote: if only one of `-x`/`width` or `-y`/`--height` is provided, the other one will be calculated automatically as to preserve the aspect ratio.\n\n- `-m` or `--adjust-mode`: can be one of either `fit` or `fill`. If both `-x`/`--width` and `-y`/`--height` are specified and their aspect ratio differs from that of the original video, this option tells the program how it should resize every frame. `fit` makes it so that black bars are added to the sides or to the top/bottom of the image in order to adjust it to the given dimensions. `fill` makes it so that the image is cropped in order to adjust to the given dimensions. This option is ignored unless both dimensions are specified.\n\nThe `all` subcommand described above is merely a shortcut for a set of more complicated commands that are used to generate all of the individual parts of the datapack and resource pack. These commands can be used if more advanced options are required or if only one of the many parts needs to be generated, instead of all of them.\n\n**The `video` subcommand**\n\nThis command takes the frames of a video and converts them to .nbt files that can be used to place structures inside minecraft. One file will be generated per frame.\n\nRequired positional arguments:\n\n- `path_to_video`: the path to the video whose frames are to be converted to nbt files.\n- `path_to_output_folder`: the path to the folder where all the nbt files will be dumped.\n\nOptional arguments:\n\n- `-p` or `--paeltte`: the path to a custom block palette file. More information about this file can be found below.\n- `-n` or `--name-prefix`: the name that is to be prefixed to every generated file. For instance, the option `-n foo_` yields files such as `foo_0.nbt`, `foo_1.nbt`, etc.\n- `-t` or `--ticks-per-frame`: an integer above 0 that states the amount of game ticks in between every video frame. The lower this number, the higher the framerate. The lowest possible number, 1, yields a framerate of 20 fps, since Minecraft runs at 20 ticks per second. The default is 2.\n- `x` or `--width`: the with in blocks of the structures that will be generated. Defaults to 75 if no width or height are given.\n- `y` or `--height`: the height in blocks of the structure that will be generated.\n\nNote: if only one of `-x`/`width` or `-y`/`--height` is provided, the other one will be calculated automatically as to preserve the aspect ratio.\n\n- `-m` or `--adjust-mode`: can be one of either `fit` or `fill`. If both `-x`/`--width` and `-y`/`--height` are specified and their aspect ratio differs from that of the original video, this option tells the program how it should resize every frame. `fit` makes it so that black bars are added to the sides or to the top/bottom of the image in order to adjust it to the given dimensions. `fill` makes it so that the image is cropped in order to adjust to the given dimensions. This option is ignored unless both dimensions are specified.\n- `-u` or `--unoptimized`: by default, every generated frame contains only the blocks that differ from the previous frame in an attempt to save resources. If this argument is present, the optimization will be disabled.\n- `-s` or `--subprocesses`: in order to speed up the generation of frames, the work is done in parallel by different subprocesses. This option specifies the amount of subprocesses that are to be used to divide the workload. Defaults to the amount of cores on your CPU.\n\n**The `resourcepack audio` subcommand**\n\nThis subcommand takes the audio track from a video or audio file and splits it up into chunks that are saved as vorbis encoded ogg files. These files can be used inside a resourcepack and played with Minecraft's `/playsound` command.\n\nRequired positional arguments:\n\n- `path_to_audio`: the path to the file that is to be split into chunks and converted.\n- `path_to_output_folder`: the path to the folder where all the files will be dumped.\n\nOptional arguments:\n\n- `-s` or `--split-size`: the duration in seconds of of every generated audio chunk. Default is 60.\n- `-p` or `--name-prefix`: the name that is to be prefixed to every generated audio file. For instance, the option `-p bar_` yields files such as `bar_0.ogg`, `bar_1.ogg`, etc.\n\n**The `resourcepack json` subcommand**\n\nIn order for the audio files to be recognized by a resourcepack, and therefor by the `/playsound` command, a `sounds.json` file containing all the audio filenames must be generated. That is the purpose of this subcommand.\n\nRequired positional arguments:\n\n- `output_folder`: the path to the folder where the `sounds.json` file is to be dumped.\n- `amount_of_sound_files`: the amount of sound files that should be included inside `sounds.json`.\n\nOptional arguments:\n\n- `-p` or `--name_prefix`: the name that was used as a prefix for the audio files.\n- `-f` or `--subfolder-name`: the name of the subfolder inside the resourcepack where the game will look for the audio files.\n- `-m` or `--merge`: if another `sounds.json` file is found in the output folder and this argument is present, the contents of both `sounds.json` files will be merged. Otherwise, the old `sounds.json` file will be overwritten.\n\n**The `functions video` subcommand**\n\nIn order for the structures to be placed sequentially in the world, producing the video, a series of functions is required and can be generated using this subcommand.\n\nRequired positional arguments:\n\n-   `output_folder`: the folder where all the generated mcfunction files are to be dumped.\n- `amount_of_frames`: the amount of frames (nbt files) that make up the video.\n\nOptional arguments:\n\n- `-d` or `-datapack-name`: the name that will be assigned to the generated datapack, it must contain only legal characters, as explained in the [wiki](https://minecraft.gamepedia.com/Tutorials/Creating_a_data_pack#Legal_characters), and in this case, be no longer than 13 characters. It must also remain consistent across the different generated files.\n- `-p` or `--name-prefix`: the name that is prefixed to every frame (nbt file). For instance, if we had files such as `foo_0.nbt`, `foo_1.nbt`, etc. the prefix `foo_` should be given.\n- `-m` or `--max-commands`: the program will have to generate at least one Minecraft `execute` command for every frame. Keeping all of these commands in a single file will cause the game to attempt to run all of them every tick. It is however possible to mitigate this by keeping fewer commands in every file. This option specifies the maximum amount of commands that will be allowed per file.\n- `-t` or `--ticks-per-frame`: the amount of game ticks in between every frame. If this number does not match the one the frames were generated with, the video will be sped up or slowed down.\n\n**The `functions audio` subcommand**\n\nSimilar to the previous subcommand, this one generates the functions required to play the different audio chunks in order.\n\nRequired positional arguments:\n\n- `output_folder`: the folder where all the generated mcfunction files are to be dumped.\n- `amount_of_sound_files`: the amount of sound (ogg) files that make up the video's audio track.\n\nOptional arguments:\n\n- `-n` or `--datapack-name`: the name that will be assigned to the generated datapack, it must contain only legal characters, as explained in the [wiki](https://minecraft.gamepedia.com/Tutorials/Creating_a_data_pack#Legal_characters), and in this case, be no longer than 13 characters. It must also remain consistent across the different generated files.\n- `-p` or `--name-prefix`: the name that is prefixed to every sound file. For instance, if we had files such as `bar_0.ogg`, `bar_1.ogg`, etc. and their subfolder within the resource pack was `foo`, the prefix that should be given is `foo.bar_`.\n- `-d` or `--sound-duration`: the duration of the audio chunks. If this number differs from the actual duration, the audio will act up.\n- `-m` or `--max-commands`: the maximum amount of `execute` commands allowed for every file. Not as important as with the frames since much fewer files are expected.\n\n**The `functions playback-control` subcommand**\n\nThis subcommand generates the functions required to play, pause and restart the video.\n\nRequired positional arguments:\n\n- `output_folder`: the folder where all the generated mcfunction files are to be dumped.\n\nOptional arguments:\n\n- `-d` or `--datapack-name`: the name that will be assigned to the generated datapack, it must contain only legal characters, as explained in the [wiki](https://minecraft.gamepedia.com/Tutorials/Creating_a_data_pack#Legal_characters), and in this case, be no longer than 13 characters. It must also remain consistent across the different generated files.\n- `-a` or `--control-audio`: if present, the program will include commands required to control audio playback. Playback control will break if this option is present but there is no audio.\n\n**The `make` subcommand**\n\nThis subcommand is in charge of taking all of the files generated through the previous commands an nicely bundling them together inside a folder (for the datapack), and a zip file (for the resourcepack), as well as generating a few other necessary files.\n\nRequired positional arguments:\n\n- `containing_folder`: the path to the folder containing all of the files generated through the previous commands.\n\nOptional arguments:\n\n- `-f` or `--audio-subfolder`: the program will try to automatically identify the name of the subfolder where it should put the sound files through the information present through the `sounds.json` file, however, this may fail in some cases, so it is a good idea to specify it manually.\n- `-d` or `--datapack-name`: the program will try to automatically detect what name was given to the datapack through the information present in the mcfunction files. It is a good idea to specify it, in case the automatic detection was to fail.\n\n**The `index` subcommand**\n\nThis subcommand takes a folder containing Minecraft block textures and uses it to generate a template for an index file.\n\nRequired positional arguments:\n\n- `path_to_block_folder`: the path to the folder containing all the block textures that are to be used.\n- `destination_file`: the path to the file that will be generated.\n\nOptional arguments:\n\n- `-f` or `--filename-is-id`: if this option is present, the filenames of the images will be included in the index template as if they were their corresponding block's ID. This is useful since, in a lot of cases, the filename of a block is in fact its ID.\n\n**The `palette` subcommand**\n\nThis subcommand will calculate the average color for all the specified block images and save them in a fila, along with their block IDs and any additional nbt data provided.\n\nRequired positional arguments:\n\n- `path_to_block_folder`: the path to the folder containing all the block textures that are to be used.\n- `destination_file`: the path to the file that will be generated.\n\nOptional arguments:\n\n- `-i` or `--index`: the path to the index file that should be used to generate the palette. Alternatively, if this option is not provided, the program will calculate the average color for all  the blocks inside the given folder and use their filenames as block IDs.",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/Naratna/minecraft-movie-player",
    "keywords": "",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "minecraft-movie-player",
    "package_url": "https://pypi.org/project/minecraft-movie-player/",
    "platform": "",
    "project_url": "https://pypi.org/project/minecraft-movie-player/",
    "project_urls": {
      "Homepage": "https://github.com/Naratna/minecraft-movie-player"
    },
    "release_url": "https://pypi.org/project/minecraft-movie-player/1.0.0/",
    "requires_dist": null,
    "requires_python": ">=3.8",
    "summary": "A command line program that generates a datapack that plays videos in vanilla Minecraft",
    "version": "1.0.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 8355976,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "8a900c520d5eb948dcce4a4d1dc2f1ecb9d5fc3eb91141f64e4e1612889b097c",
        "md5": "51b8a36c6469953f4f174abf70669faa",
        "sha256": "422b3014d3a958c51febf825ebf5a6b88e02e47e823f0f03aa7dcd0a490f0c22"
      },
      "downloads": -1,
      "filename": "minecraft-movie-player-1.0.0.tar.gz",
      "has_sig": false,
      "md5_digest": "51b8a36c6469953f4f174abf70669faa",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.8",
      "size": 33368,
      "upload_time": "2020-10-07T04:14:41",
      "upload_time_iso_8601": "2020-10-07T04:14:41.076032Z",
      "url": "https://files.pythonhosted.org/packages/8a/90/0c520d5eb948dcce4a4d1dc2f1ecb9d5fc3eb91141f64e4e1612889b097c/minecraft-movie-player-1.0.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}