{
  "info": {
    "author": "Peter Styk",
    "author_email": "humans@madcore.ai",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 3 - Alpha",
      "Environment :: Console",
      "Intended Audience :: Developers",
      "License :: OSI Approved :: MIT License",
      "Programming Language :: Python :: 2.7"
    ],
    "description": "================\nMadcore Core CLI\n================\n**************************************************************\nDeep Learning & Machine Intelligence Infrastructure Controller\n**************************************************************\n\n.. image:: https://travis-ci.org/madcore-ai/cli.svg?branch=master\n\nWhat is Madcore\n------------------\n\nMadcore CLI is a tool for auto-configuration of deployment of Madcore Core. A small, private instance in AWS where you can experiment with Kubernetes, Auto Scaling Groups based on Spot Instances, Spark, Cuda7, Deep Learning and AI frameworks.\n\nIt allows you quickly run data mining and data processing tasks, scale clusters as needed, auto-save config and data. Destroy everything when not used (small backup saved on S3), restore when you're back to working mood. Utilizing Auto Scaling Groups and Spot Instances so you can work at fraction of Amazon AWS on-demend pricing. Madcore is perfect choice if you want to forget about setting up containerized infrastructure and just focus on your work.\n\nInstall\n------------------\n\n.. code-block:: bash\n\n   pip install madcore\n\nRuntime Prerequesites\n---------------------\n\n * Create AWS IAM User\n * Run “aws configure” to setup key, secret and default region will be used by madcore\n * Create AWS EC2 Key-Pair (or reuse existing, remember keys are per region)\n * Create or get your Bitbucket user ready\n * Make sure you have at least one Team in Bitbucket (even if only you)\n * run “madcore” on your terminal\n\n1st Time Run\n------------------\n\nFirst time you run \"madcore\" the cli will required an extra authorization to make sure your subodmain is properly delegated on \"madcore.cloud\" or \"devopshosted.com\" domain. For example if you have a Bitbucket team \"TheATeam\" you will have a choice to mount it as a subdomain on top of either \"madcore.cloud\" or \"devopshosted.com\" domain. Example: \"theateam.madcore.cloud\"  You will recieve full DNS delegation for the zone and all future deployments and endpoints will have services mapped on that subdomain. For example  \"kubedash.theateam.madcore.cloud\" or \"jenkins.theateam.madcore.cloud\"\n\nmadcore configuration will then automatically proceed to deploy the following madcore cloud formation stacks\n\n================  =====\nStack Name         Description\n================  =====\nMadcore-NET        Isolated VPC, Subnets, Integrent Gateway only for madcore\nMadcore-FollowMe   SG autoconfigured based on your public ip address\nMadcore-S3         Your private S3 bucket used by Core nodes\nMadcore-DNS        Your madcore subdomain, delegated by Madcore\nMadcore-Core       Core Instance, t2.small or m3.medium\n================  =====\n\nAutomated Installation and Configuration\n----------------------------------------\n\nWith exception of few initial questions, entire process is fully automated. At the end Madcore will reconfigure HAproxy 443 (SSL) entry point and run first jenkins job (madcore.registration) which will obtain Let's Encrypt certificate and connect everything together. Installation takes about 20 minutes. End result is you having your own, fully private (only from your ip) access to the following:\n\n.. code-block:: bash\n\n  https://kubedash.theateam.madcore.cloud (Kubernetes Master Dashboard)\n  https://jenkins.theateam.madcore.cloud (Jenkins with Madcore DSL Jobs)\n  https://grafana.theateam.madcore.cloud (Grafana Metrics Visualization)\n  https://influxdb.theateam.madcore.cloud (Influx DB storage for Grafana)\n  https://registry.theateam.madcore.cloud (Docker Registry)\n  https://kubeapi.theateam.madcore.cloud (Kubernetes API)\n\nAbove is a list of exposed endpoints only.\n\n\nCLI Command: configure\n----------------------\n\nConfigure is triggered when you first time run \"madcore\"  it starts by creating ~/.madcore folder and config file that stores information used for auto configuration. Configure builds network, storage, dns and core instance as described above. It also registers ssl certificate or restores existing certificate. When configure was run before and Core was terminated with Destroy command, configure will run unattended (because config has all the answers)\n\nCLI Command: destroy\n--------------------\n\nCore installation is done through CloudFormation stacks mentioned above so can be completely removed when not required. Two stacks survive destructions, DNS and S3.  Dns is valid delegated subdomain. S3 bucket is used for ssl certificates and redis backup/restore.\n\nCLI Command: halt\n-----------------\n\nStops core instance. When not used, stopped instance is not charged EC2 charges.\n\nCLI Command: up\n-----------------\n\nStarts core instance.\n\nCLI Command: ssh\n-----------------\n\nAutomatically connects to core instance. Uses private key path you specified during configure step. And core should have been created using matching public EC2 key selected during configure step.\n\nCLI Command: plugin list\n------------------------\n\nList currently available community Madcore plugins.\n\n=============  =====\nPlugin Name    Description\n=============  =====\nflasker        Example. Build simple flask python application into Docker Container, Store container in local private docker registry, create kubernetes pod with new docker image, deploy pod into kubernetes directly from local private docker registry\nflasker-hub    Example. Use existing Docker Hub image, create kubenretes pod, deploy pod into kubernetes directly from public Docker Hub\nk8s            Extend Kubernetes Nodes into Auto Scaling Group using Spot Instances\nspark          Install Spark on Kubernetes, Extend Kubernetes Nodes and dedicate them to Spark using Auto Scaling Group and based on Spot Instances\ngpu            Amazon Ai AMI's running Cuda7 Nvidia GPU framework, DeepLearning4j deployments are delivered directly into instance (no containerization) Auto Scaling Group using Spot Instances\n=============  =====\n\nCLI Command: plugin install <name>\n----------------------------------\n\nExtends your existing Core with functionality described by the plugin.\n\n\nCLI Command: plugin delete <name>\n---------------------------------\n\nRemoves plugin and all traces of clusters from the Core (with exception of data saved to madcore private S3 bucket directly from instance/node/pod)\n\nCLI Commands added by plugin\n----------------------------\n\nEach plugin can (but doesn't have to) extend CLI with new commands. For example in case of spark it can be either python or java spark code that will perform functions specific to spark cluster.\n\nChat with us on Gitter\n----------------------\n\nIf you want to try Madcore, make sure you join us on Gitter. We are now focused on building Machine Learning and Ai plugins as well as building Ingress listeners for social media and queueing mechanisms in Spark and Kafka.  All based on Kubernetes. Chat with us now: https://gitter.im/madcore-ai/core\n\nMailing List\n-----------------\n\nVisit https://madcore.ai to sign up for weekly newsletter on Machine Learning and AI simulations that are now possible with Madcore\n\nCredits\n-----------------\n\nWe will be adding a formal Credits file into this project. For now just want to make clear that all registered brands remain property of their respective owners.\n\nLicense\n-----------------\n\nMadcore Project is distributed on MIT License (c) 2016-2017 Madcore Ltd (London, UK)\n",
    "description_content_type": "",
    "docs_url": null,
    "download_url": "https://github.com/madcore-ai/cli/tarball/master",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/madcore-ai/cli",
    "keywords": "aws",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "madcore",
    "package_url": "https://pypi.org/project/madcore/",
    "platform": "Any",
    "project_url": "https://pypi.org/project/madcore/",
    "project_urls": {
      "Download": "https://github.com/madcore-ai/cli/tarball/master",
      "Homepage": "https://github.com/madcore-ai/cli"
    },
    "release_url": "https://pypi.org/project/madcore/1.9.8/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "Madcore Core CLI - Deep Learning & Machine Intelligence Infrastructure Controller",
    "version": "1.9.8",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 4208916,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "5ceb0e48b8bfe520429f7049edda484e32c254fdc5118296d104ecb1a93a169e",
        "md5": "acb770aa85d70d8a5cc77b18326709a3",
        "sha256": "c33db603948b8335f70ba1743fe6fe9a3107eb5dafcc403c6d32eef99e1d02df"
      },
      "downloads": -1,
      "filename": "madcore-1.9.8.tar.gz",
      "has_sig": false,
      "md5_digest": "acb770aa85d70d8a5cc77b18326709a3",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 38158,
      "upload_time": "2018-04-29T10:14:49",
      "upload_time_iso_8601": "2018-04-29T10:14:49.278182Z",
      "url": "https://files.pythonhosted.org/packages/5c/eb/0e48b8bfe520429f7049edda484e32c254fdc5118296d104ecb1a93a169e/madcore-1.9.8.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}