{
  "info": {
    "author": "Talha Ahsan",
    "author_email": "tahsan@mmm.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: BSD License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "[![CI](https://github.com/3mcloud/magellan-models/actions/workflows/gh_actions.yml/badge.svg)](https://github.com/3mcloud/magellan-models/actions/workflows/gh_actions.yml)\n\n# Magellan-Models\n\nDynamically Generate client-side models for interfacing with your own OpenAPI 3.0 compliant JSON API endpoints.\n\n![Magellan Models Moose](./docs/images/originalImageViaRyanHagerty2021.png)\n\n## What is it?\n\nMagellan Models (referred to as Magellan throughout the rest of this documentation) is a code generator that generates \"client-side models\" for a given OpenAPI spec that follows (by default) the JSON:API specification. A developer can modify their own configuration to provide support for other API specifications so long as they can also provide their own OpenAPI 3.0 json specification.\n\n### But why?\n\nOriginally born as part of the Skylab initiative inside 3M, Magellan seeked to provide an easier means of programmatically accessing the Materials Informatics backend APIs available to researchers. While now Magellan is platform agnostic, the goal is still to provide a wrapper around an API, authentication, and potentially authorization, such that any developer can begin to play around with a given API without necessarily needing to deeply be aware of the various specific quirks that that API offers.\n\n### How does Magellan compare to other OpenAPI client libraries like pyswagger, swagger-codegen, or bravado?\n\nMagellan prides itself in having an easier time to set up and get running. Most other OpenAPI client libraries require setting up authorization and importing custom clients and the result is a verbose and clunky syntax. Magellan instead tries to parse responses back for the user to ensure that accessing and modifying response elements is a seamless task. Alternative libraries often tend to differentiate between the client which sends requests and receives responses and the model itself which is a representation of data. Magellan however treats them both as the same, leading to less mental overhead for the developer (when things work).\n\nMagellan however will require some more setup in the configuration, often requiring you to override parts of the configuration you don't want to keep. The other libraries will let you do so in a more pythonic way at runtime without resorting to creating a new magellanConfig inheriting class defintion.\n\n### How does Magellan compare to other JSON:API consumer libraries like [json-api-smart](https://github.com/NilssonPL/json-api-smart)?\n\nOh wow, that looks really similar to what Magellan does! You even query the backend in almost the exact same way! If you're willing to document out your API manually as a part of your project, then you'll probably have better luck with a package like json-api-smart. The allure of Magellan in this instance is that Magellan will autogenerate models for you to use via the OpenAPI specification file, while other JSON:API clients tend to require you to define your endpoint and your models and attributes manually. Magellan will try to parse out attributes for you, assign types, and further create helper methods for relationships (including matching relationships to models if it can find a direct match).\n\nAs a user, it's up to you to decide if the automated functionality (and less present documentation) that Magellan provides is sufficient for your use case, or if you'd prefer a more \"typed\" out experience that other client libraries tend to offer.\n\n## Installation\n\n`pip install git+ssh://git@github.com/3mcloud/magellan-models.git` will install the latest \"master\" branch version of Magellan.\n\n\n## Potential workflow\n\n```python\n    from magellan_models.initializers import initialize_with_endpoint\n    from magellan_models.config import MagellanConfig\n    from my_json_file import myJsonSpec\n\n    ... \n\n    conf = MagellanConfig() \n\n    # Modify Configuration settings inside of the config object\n    conf.api_endpoint = \"https://myAPIurl\" \n\n    # Now Generate a tuple of models, functions, and a configuration object via the initialization function\n    (models, funcs, config) = initialize_with_json(open_api_spec=myJsonSpec, model_config= conf)\n\n    ... \n\n    # Pull a model out of the models dictionary\n    ModelResource = models[\"ModelResource\"]\n\n    # Here we are doing a GET request to \"/model_resources/uuid_str_id_variable\" and parse the response into a Magellan \"Model\" instance\n    instance = ModelResource.find(uuid_str_id_variable)\n\n    # You can then access response attributes as model attributes for a given instance\n    print(f\"{instance.title}: created at: {instance.created}, modified at: {instance.modified}\")\n\n    ... \n\n    # Alternatively use the \"where\" method to search for collections with your own filtering options\n\n    Sample = models[\"Sample\"]\n\n    # The config will dictate how we parse these arguments and format them into a filter\n    # It could be as simple as filter[lotNum]=\"myLotNum\"&filter[\"creator_id\"=my_creator_id\n    # or more complex like filters=[{field: \"lotNum\", val: \"myLotNum\", op: \"eq\"}, {field: \"creator_id\", val: my_creator_id, op: \"eq\"}]\n    # It all depends on how you define your Magellan config!\n    samples = Sample.where(lotNum=\"myLotNum\", creator_id= my_creator_id) # Returns a MagellanResponse which handles pagination to prevent large stalling periods\n    for sample in samples: \n        # Let's print the title out as we iterate through our results!\n        print(sample.title)\n\n```\n\n## Model features\n\n* CRUD route functionality baked in with functions for POST, PATCH, DELETE, and GET\n* Automatic response parsing from GET calls to return either a singular Model instance or a List of Model instances\n* Attributes from the response are set up as \"native\" attributes for a given model (given {\"data\": {\"attributes\": {\"title\": \"foo\"}}} a model will know that instance.title refers to \"foo\")\n* Filtering operations are built to map an easy to use developer interface to whatever filtering strategy employed by the API\n* Proper serialization into a format that can be PATCH/POSTed to the endpoint url\n* Relationships data is parsed and helper functions are provided to access relationship entities\n\n## Overview Docs\n\nFor specific documentation that's more in depth on each of the various facets of Magellan, check out the specific documentation pages!\n\n* [The MagellanConfig class and setup](./docs/configuration.md)\n* [The initializer functions](./docs/initialization.md)\n* [Querying the backend API](./docs/querying.md)\n* [Model Attributes and relationships (reading and writing)](./docs/model_attributes.md)\n* [Modifying via POST and PATCH to the backend API](./docs/modifying.md)\n* [Notes about the Model Representation Object](./docs/representation.md)\n* [Information about the functions generated by Magellan](./docs/generated_functions.md)\n\n### Configuration setting\n\nEach initialization requires a passed in MagellanConfig entity. If you want to override any functionality or specify your API url, you'll want to modify the configuration instance that you've passed in. These modifications can also be done after initialization! Say your token is stored in a configuration instance and expires, you can choose to override your token value with a new one during runtime while not interrupting any of your models' functionality! See the `configuration.md` file in the Docs for more information about MagellanConfig.\n\n### Getting entities\n\nAll entities are returned via class methods. The main ones you'll want to use are `where()` and `query()`. For most use cases, `where()` will probably be sufficient but `query()` is designed with more complex querying in mind.\n\n#### `where()`\n\n`where()` takes in any number of arguments where the argument name corresponds to the attribute you want to filter on. For example, `where(lotNum=\"blah\")` sets a filter for `lotNum` to be equal to `blah`. `where()` also has a \"limit\" key which defaults to None and defines how many results to return (by default finding all available results).\n\n`where()`also takes in a \"filtering_arguments\" argument which is a dictionary. This dictionary has the arguments passed in as keys, and has the filtering operation as the return value. These filtering operations default to \"eq\" if not specified but can be values such as \"in\" or \"ilike\" etc.\n\nPassing in a \"sort\" argument also lets you order elements in the backend as well.\n\nexample:\n` Sample.where(lotNum=[\"blah\", \"foo\", \"bar\"], creator_id= steves_id, attribute_mapping={\"lotNum\": \"in\"}, limit=100) `\n\nThis call searches for the first 100 Samples created by Steve where the lotNum is either \"blah\", \"bar\", or \"foo\"\n\n#### `query()`\n\nThis method is currently somewhat functional. It takes in a list of filters, a page_number value, and per_page value, and returns the results as model instances.\n\nFilters are dictionaries with \"key\", \"op\", \"val\" keys.\n\nExample:\n`Sample.query(parameters={\"filters\": [{\"key\": \"title\", \"op\": \"eq\", \"val\": \"Sample Title\" }], \"page_number\": 1, \"per_page\"=30}, limit=30 )`\nReturns all the entities returned from a single GET call with 30 results max, in the first page of the pagination results, where the \"Title\" equals \"Sample Title\"\n\n#### Singular Queries\n\nWhat if you wanted to get a single item by a \"title\" field or \"id\"? The easiest way is to use the `find(id)` method, which submits a GET request to the `https://api/model_resource/ID` route. If that ID exists, you'll get a model instance back, and if it 404s, you'll get None returned.\n\n` Sample.find(\"a valid UUID\") -> instance_of_a_sample `\n` Sample.find(\"invalid ID\") -> None `\n\nIf you wanted to find a single entity by a given attribute, you can also do that using the `find_by_{attribute}` helper methods. These methods return THE FIRST entity that matches a given attribute.\n\nExample:\n`Sample.find_by_lotNum(\"a valid lotNumb\") -> instance_of_a_sample`\n\n### Modifying Entities\n\n#### Attributes\n\nAs part of the schema parsing steps when initializing the models, Magellan will go through the response and request bodies and parse out a set of attributes. These attributes will then be converted into instance properties for each class.\n\nTo get a list of Attributes, the static method `list_attributes()` will return the possible attributes parsed from the specification.\n\nFor example, say a resource \"/users\" returns entities with the attributes \"first_name\", \"last_name\", \"id\", and \"email\". The `User` model corresponding to this resource will have defined attributes corresponding to each of those 4 that the server states it accepts and receives.\n\nexample:\n\n```python\n    user = User()\n    user.first_name = \"Tycho\"\n    user.last_name = \"Brahe\"\n    user.email = \"iwantmynoseback@spacemail.com\n    print(user.first_name + \" \" + user.last_name) # -> Tycho Brahe\n```\n\nIf you're getting a model instance back from the server (say via the `find()` method), these attributes will be prepopulated with the server response.\n\nexample:\n\n```python\n    user = User.find_by_id(tycho_id)\n    print(user.first_name) # -> Tycho\n```\n\n#### Relationships\n\nRelationships are also parsed from the OpenAPI schema. There are two cases that each relationship can fall into: singular (there's a single entity like \"experiment\" or \"user\" being returned), or plural (there's an array of entities being returned (like \"experiments\"). **Differentiation is done via the pluralization of the relationship key**. If the relationship key is a singular value, it will be treated as a singular relationship. Eventually this will be updated, but at the moment, it functions of key pluralization rather than the specification itself. You can call `list_relationship_functions()` to get a list of possible relationship modification functions.\n\n##### Singular Relationships\n\nFor singular relationships, you can retrieve the relationship object's ID through the `{relationship}()` method. You can also call the `set_{relationship}_id(id)` method to set the relationship object via its id. You can also call `set_{relationship}( relationship_instance)` to update the relationship using an object instance that you want to couple (rather than passing the object's ID in).\n\n##### Plural Relationships\n\nPlural relationships expect a list of relationship object IDs. instead of having the `set_{relationship}_id(id)` method, you'll instead be able to use `add_{relationship}(id)` and `remove_{relationship}(id)` methods which modify that list of relationship IDs for a given model instance.\n\nYou can also call the `{relationship}()` method which converts each of those ID entities into an object instance to manipulate **if the relationship name maps to a generated Class** or `{relationship}_json()` which returns the raw json for the relationship body.\n\n```python\n# Example of plural relationships;\n# If a given Sample has many Tests\nSample.tests() #-> [Test1<>, Test2<>, Test3<>, ...] \nSample.add_test(test_four_id) \nSample.remove_test(test_two_id) \nSample.tests() #-> [Test1<>, Test3<>, Test4<>...]\n```\n\n### Creating and Updating Entities\n\n#### `post()`\n\nTo create an entity on the backend, you can call the `post()` method. This sends a POST request to the `/{resource}` path. A successful post should then also generate an ID for the instance and updates the instance with the server response attributes (oftentimes useful for updating the timestamps of a given class instance).\n\n#### `patch()`\n\nPatching is used for class instances that have an ID associated with them on the backend. calling `patch()` sends a PATCH request to the `/{resource}/{instance_id}` path. The class instance is then updated with the server response after the PATCH request.\n\n### Deletions\n\n`delete_self()` can be used to send a delete request. Try to avoid using this too often since the data then becomes lost. `delete_self()` only works for entities that have been created on the API end, and for entities that have an ID as a result.\n\n## Contributing\n\n1. Create a new branch from Master\n2. Make changes in your new branch\n3. Open a Pull Request and request approval from any of the contributors of the code base (most likely talha-ahsan)\n4. Upon approval it'll be merged into master, if this PR should be its own standalone \"release\" it'll then be released at that time.\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/3mcloud/magellan-models",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "magellan-models",
    "package_url": "https://pypi.org/project/magellan-models/",
    "platform": "",
    "project_url": "https://pypi.org/project/magellan-models/",
    "project_urls": {
      "Homepage": "https://github.com/3mcloud/magellan-models"
    },
    "release_url": "https://pypi.org/project/magellan-models/1.0.0/",
    "requires_dist": [
      "requests (>=2.24.0)",
      "inflection (>=0.5.0)",
      "pyyaml (>=5.4.1)",
      "jsonschema (>=3.2.0)",
      "pytest (>=5.4.3) ; extra == 'dev'",
      "pytest-cov (>=2.10.0) ; extra == 'dev'",
      "requests-mock (>=1.8.0) ; extra == 'dev'",
      "coverage (>=5.2) ; extra == 'dev'",
      "pytest-mock (>=3.6.1) ; extra == 'dev'"
    ],
    "requires_python": ">=3.6",
    "summary": "An API wrapper library that creates 'ActiveRecord' inspired models to access JSON:API compliant endpoints via OpenAPI specifications",
    "version": "1.0.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 11146533,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "b7e175062837d483a8a3cb2a346eca0c728f1e775b9505a8b301e0342c8e6083",
        "md5": "838b2f610e35da26415be1205b514dc3",
        "sha256": "bc1ca153d52ba4c96de99d42c910836cadb54c981caecc4b955fd68a080c69a7"
      },
      "downloads": -1,
      "filename": "magellan_models-1.0.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "838b2f610e35da26415be1205b514dc3",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6",
      "size": 54555,
      "upload_time": "2021-08-11T03:27:28",
      "upload_time_iso_8601": "2021-08-11T03:27:28.670470Z",
      "url": "https://files.pythonhosted.org/packages/b7/e1/75062837d483a8a3cb2a346eca0c728f1e775b9505a8b301e0342c8e6083/magellan_models-1.0.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "c7aff4c08b057abeca3ce7391edc693b2467144c5544d605004eb7a86a09e710",
        "md5": "d3a85b2781b1bcb244732031f44268b4",
        "sha256": "9ac5545f8938e20ca9c21c3064130261f4b5bc59aa3a50191542b218341b45e8"
      },
      "downloads": -1,
      "filename": "magellan-models-1.0.0.tar.gz",
      "has_sig": false,
      "md5_digest": "d3a85b2781b1bcb244732031f44268b4",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 45907,
      "upload_time": "2021-08-11T03:27:30",
      "upload_time_iso_8601": "2021-08-11T03:27:30.107014Z",
      "url": "https://files.pythonhosted.org/packages/c7/af/f4c08b057abeca3ce7391edc693b2467144c5544d605004eb7a86a09e710/magellan-models-1.0.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}