{
  "info": {
    "author": "Cisco System",
    "author_email": "contact@mindmeld.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 2 - Pre-Alpha",
      "Intended Audience :: Developers",
      "Natural Language :: English",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.5",
      "Programming Language :: Python :: 3.6"
    ],
    "description": "Package History\n===============\n\n4.0.0 (2019-02-25)\n------------------\n\nMajor Features and Improvements\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n\n- Improved entity resolution for voice-based apps using n-best ASR transcripts\n\n- Add support for user-defined custom feature extractors\n\n- Replace wit-ai/duckling_old (deprecated numerical parser) with facebook/duckling (actively maintained library)\n\n- Add support for Dialogue flows, an improved methodology for authoring constrained multi-turn dialogues\n\n- Add support for entity recognition on n-best ASR transcripts\n\n\nBreaking Changes\n^^^^^^^^^^^^^^^^\n\n- Refactor dialogue state handlers by adding a read-only request object and a writable responder object\n\n- New modular project structure for MindMeld apps\n\n- New model format using consistent internal feature representations\n\n\n\nBug Fixes and Other Changes\n^^^^^^^^^^^^^^^^^^^^^^^^^^^\n\n- Implement the ``predict_proba()`` method for role classifiers and entity classifiers\n\n- Add support for viewing feature weights for model introspection\n\n- Improve support for MindMeld applications as python packages\n\n- Add support for query stemming during feature extraction\n\n- Add support for numerical parser features for domain and intent classification\n\n- Add support for word shape features for domain and intent classification\n\n- Add support for dynamic gazetteers, which are online gazetteers that bias the natural language processor's prediction for the current turn\n\n- Add support for asynchronous dialogue state handlers\n\n- Refactor classifier features names to make them more consistent\n\n- Re-enable automatic blueprint loading using the ``blueprint`` command\n\n- Deprecate the ``session`` object and replace it with the ``context`` object\n\n- Add support for parallel processing of entity recognition for n-best ASR transcripts\n\n- MindMeld version compatibility checks are warnings, not exceptions\n\n\n3.4.0 (2018-08-20)\n------------------\n\nEnhancements\n^^^^^^^^^^^^\n\n- Add the ability to add dialogue middleware to dialogue managers\n\n- Add the ability to denote a handler as only reachable via target_dialogue_state\n\n- Add the ability to explicitly denote a default handler\n\n- Add the ability to specify different custom datasets for different NLP models\n\n- Add support for frequency-based thresholding of n-gram features\n\n- Add CLI command to generate predicted markup for queries\n\n3.3.0 (2018-05-10)\n------------------\n\nEnhancements\n^^^^^^^^^^^^\n\n- Add the ability to inspect learned feature weights for certain kinds of text classifiers\n\n- Add character n-gram features to domain, intent, and entity models\n\n- Add support for better management of multiple datasets within the same project\n\n- Add the ability to override global classifier configurations with custom settings per domain, intent, or entity type\n\n- Add the ability for incremental NLP model building to reduce overall training time\n\n- Add the ability to specify the time zone and timestamp associated with each query to inform NLP predictions\n\n- Add the ability to define custom preprocessors that can make arbitrary transformations on the input query before sending it to the NLP pipeline\n\nBug Fixes\n^^^^^^^^^\n\n- The help messages for MindMeld command line tools (``python app.py`` and ``mmworkbench``) should show the correct list of compatible commands\n\n- Various fixes to improve the numerical parser's robustness and logging\n\n\n3.2.0 (2017-10-23)\n------------------\n\nEnhancements\n^^^^^^^^^^^^\n\n- Add Long Short Term Memory (LSTM) network as a model option for the entity recognizer\n\n- Add support for TensorFlow-based deep learning models in MindMeld\n\n- Add the ability to evaluate all NLP models at once with a single method/command\n\n- Add functionality to specify a target dialogue state or a set of allowable intents for the next turn\n\n- Add in-built support for conversational history management instead of relying on the client to preserve history across turns\n\n- Improve interfaces for constructing responses within the dialogue state handlers (see **Compatibility Notes** below)\n\n\nCompatibility Notes\n^^^^^^^^^^^^^^^^^^^\n\n- The ``prompt()`` and ``respond()`` methods of the ``DialogueResponder`` object are deprecated in MindMeld 3.2. See :doc:`Working with the Dialogue Manager <../userguide/dm>` to learn how to use new ``DialogueResponder`` methods in your dialogue state handlers.\n\n3.1.0 (2017-09-20)\n------------------\n\nEnhancements\n^^^^^^^^^^^^\n\n- Add linear-chain conditional random field (CRF) as a model option for the entity recognizer\n\n- Allow the role classifier to be trained with other text models (e.g. SVM, decision tree, etc.) in addition to logistic regression\n\n- Make model configuration format for all classifiers consistent [See \"Compatibility Notes\" below]\n\n- Add new metrics for better error analysis of entity recognition performance\n\n- Add support for modularizing dialogue state handling logic by allowing arbitrary module imports in ``app.py`` (see **Compatibility Notes** below)\n\n- Make blueprints check the current MindMeld package version to validate compatibility\n\n- Only load NLP resources that are needed by active feature extractors (as defined in the model config) to improve runtime performance\n\nBug Fixes\n^^^^^^^^^\n\n- Correctly compute entity spans in queries with special characters\n\n- Warn the developer and proceed with model training (if possible) when entity mapping or gazetteer files are missing\n\nCompatibility Notes\n^^^^^^^^^^^^^^^^^^^\n\n- To make the interfaces for NLP classifiers consistent, the model configuration formats for the entity recognizer and the role classifier have been updated to be in line with the domain and intent classifiers. The model configurations for entity recognizer and role classifier from MindMeld 3.0 **will not** work with MindMeld 3.1. Refer to the user guide for those components to learn how to rewrite your 3.0 configs in the new 3.1 format.\n\n- To support modular organization of dialogue state handling logic by allowing arbitrary package/module imports in the application container (``app.py``), MindMeld now needs to load the project folder as a Python package. Every project in MindMeld 3.1 must hence have an empty ``__init__.py`` file at its root level. Projects created for MindMeld 3.0 **will not** work with MindMeld 3.1 unless an ``__init__.py`` file is added. Refer to the user guide for the dialogue manager to learn how to use imports in your application container.\n\n\n3.0.0 (2017-08-14)\n------------------\n\n* First release of the MindMeld conversational AI toolkit\n\n\n",
    "description_content_type": "",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/cisco/mindmeld",
    "keywords": "mindmeld",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "mindmeld",
    "package_url": "https://pypi.org/project/mindmeld/",
    "platform": "",
    "project_url": "https://pypi.org/project/mindmeld/",
    "project_urls": {
      "Homepage": "https://github.com/cisco/mindmeld"
    },
    "release_url": "https://pypi.org/project/mindmeld/4.0.2/",
    "requires_dist": [
      "bleach (==1.5.0)",
      "Click (~=6.0)",
      "click-log (==0.1.8)",
      "elasticsearch5 (~=5.5)",
      "Flask (~=0.12)",
      "Flask-Cors (~=3.0)",
      "nltk (~=3.2)",
      "numpy (~=1.14)",
      "pandas (~=0.22)",
      "pip (>=9.0.1)",
      "py (~=1.4)",
      "python-dateutil (~=2.6)",
      "pytz (>=2017.2)",
      "requests (~=2.19)",
      "scipy (~=0.9)",
      "scikit-learn (<0.20,>=0.18.1)",
      "tqdm (~=4.15)",
      "urllib3 (~=1.23)",
      "python-crfsuite (~=0.9)",
      "sklearn-crfsuite (<1.0,>=0.3.6)",
      "tensorflow (~=1.2)",
      "attrs (~=18.2)",
      "distro (~=1.3)",
      "immutables (~=0.9)"
    ],
    "requires_python": "",
    "summary": "A Conversational AI platform.",
    "version": "4.0.2",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 15617870,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "64c5094c71fc75fc15d3dee503c32514283988031546580352a9c853ff42c9c7",
        "md5": "c5c2101f3b1d686b440c7b63a9a09921",
        "sha256": "92ca20c09bad120ce89e2d41e56f17a6c75b4c9ba93e441d3268f0358d03bc3b"
      },
      "downloads": -1,
      "filename": "mindmeld-4.0.2-py2.py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "c5c2101f3b1d686b440c7b63a9a09921",
      "packagetype": "bdist_wheel",
      "python_version": "py2.py3",
      "requires_python": null,
      "size": 11054241,
      "upload_time": "2019-04-19T17:51:05",
      "upload_time_iso_8601": "2019-04-19T17:51:05.599642Z",
      "url": "https://files.pythonhosted.org/packages/64/c5/094c71fc75fc15d3dee503c32514283988031546580352a9c853ff42c9c7/mindmeld-4.0.2-py2.py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}