{
  "info": {
    "author": "Diego Gonzalez (jimuisrael)",
    "author_email": "dgonzalez.jim@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "Environment :: Web Environment",
      "Framework :: Django",
      "Framework :: Django :: 3.0",
      "Intended Audience :: Developers",
      "License :: OSI Approved :: BSD License",
      "Operating System :: OS Independent",
      "Programming Language :: Python",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3 :: Only",
      "Programming Language :: Python :: 3.6",
      "Programming Language :: Python :: 3.7",
      "Programming Language :: Python :: 3.8",
      "Topic :: Internet :: WWW/HTTP",
      "Topic :: Internet :: WWW/HTTP :: Dynamic Content"
    ],
    "description": "# DWLL\n## _Django Web Launch Library_\n\nDjango Web Launch Library es una librería de elementos utilitarios que le permitirán generar aplicaciones Web (Backend-Frontend) bajo framework Django, de forma rápida y sencilla, asi evitaremos la construcción de elementos habituales en la mayoria de sistemas Web, y aceleraremos el desarrollo de su aplicación. DWLL contiene elementos que cubre los siguientes módulos:\n\n- Vistas\n- Formularios\n- Modelos\n- Mensajes y Traducciones\n- Configuración\n- URLs\n- Login\n\n## Características\n\n- Modelos y Mixins base para auditar modelos, filtros de activos y permitir soft-delete\n- Vistas virtuales que permiten crear vistas de formato CRUD con muy pocas lineas de codigo\n- Sistema de mensajes de texto a ser usados en todo el sitio Web y en el backend, con su respectiva administración de textos por lenguaje para la gestión de su traducción.\n- Sistema de configuraciones para agregar banderas y propiedades administrables a su aplicación Web.\n- Autogenerador de una apĺicación (plantilla) principal que le permitirán arrancar el desarrollo rápidamente.\n\nDWLL permite que los desarrolladores tomen un camino claro y directo en la construcción de sus aplicaciones, siguiendo el principio DRY, Don't Repeat Yourself:\nComo [Joaquin Medina] escribe en [su Blog][df1]\n\n> DRY, es una filosofía de definición de procesos que \n> promueve la reducción de la duplicación especialmente \n> en programación. Según este principio toda pieza de \n> información nunca debería ser duplicada debido a que \n> la duplicación incrementa la dificultad en los cambios \n> y evolución posterior, puede perjudicar la claridad \n> y crear un espacio para posibles inconsistencias\n\nEsta librería permitirá evitar que rescriba los elementos más comunes en el desarrollo de aplicaciones Web. Proporciona un camino definido a seguir, y con la menor cantidad de código posible.\n\n## Tecnología\n\nDWLL esta dirigido al desarrollo de aplicaciones Web con Django 4.0 y hace uso de las siguientes librerías:\n\n- [Allauth] - Librería para Django que permite el manejo de todo lo relacionado con la autenticación y registro de usuarios.\n- [Beautifulsoup4] - Librería que permite el manejo de archivos html usados por el autogenerador de DWLL\n- [Locust] - Librería que permite realizar pruebas, de estress y de carga, a las pantallas de las aplicaciones autogeneradas con DWLL\n\n## Instalación\n\nDWLL requiere [Django](https://docs.djangoproject.com/en/4.0/releases/4.0/) v4.0+ para funcionar.\n\nSi se encuentra usando Windows puede hacer uso de una consola como [Gitbash](https://gitforwindows.org/ ) e instalar [Python 3](https://www.python.org/downloads/release/python-396/) en ese entorno.\n\n1. Instale un entorno virtual para instalar Django y DWLL.\n\n### Linux\n```sh\nsudo apt-get install python3-pip\nsudo pip3 install virtualenv \nvirtualenv -p python3 venv\nsource venv/bin/activate\n```\n\n### Windows\n```sh\npython -m pip install --upgrade pip\npython -m pip install --user virtualenv\npython -m venv ve_pruebas\nsource ve_pruebas/Scripts/actívate\n```\n\n2. Instale Django, dependencias, y DWLL\n\n```sh\npip install django django-allauth locust beautifulsoup4\npip install dwll\n```\n\n3. Cree un proyecto Django, en este ejemplo llamaremos a este proyecto (o el nombre que usted quiera): \"myproject\"\n\n```\ndjango-admin startproject myproject\ncd myproject\n```\n\n4. Incluir las siguientes aplicaciones en INSTALLED_APPS de su archivo myproject/myproject/settings.py:\n\n```\n'allauth',\n'allauth.account',\n'allauth.socialaccount',\n'dwll',\n```\n\n5. Ejecute el generador de su primera aplicación...\n\n```\n./manage.py dwll-gen\n```\n\n...y siga las instrucciones indicadas en la consola. Puede elegir generar la plantilla de una aplicación con un modelo de ejemplo, o solamente la estructura base de una aplicación para iniciar. En este ejemplo llamaremos a la aplicacion \"myapp\" y al modelo \"mymodel\" (El nombre de la aplicación, y el modelo, puede ser el que usted quiera).\n\nAl ejecutar la consola, además, se agregarán lineas de código, a su archivo de settings.py y urls.py, que permiten que la nueva aplicación pueda ejecutarse en página de inicio.\n\n**Nota:** Luego puede formatear el código autogenerado a discreción.\n\n6. Una vez generado el proyecto, realizaremos la migracion a la base de datos, esto solo deberá realizarlo si ha seleccionado generar el modelo de ejemplo, caso contrario omita la primera linea del siguiente comando:\n\n```\n./manage.py makemigrations myapp\n./manage.py migrate\n```\n\nAl ejecutar lo anterior, deberia conseguir una salida similar a la siguiente (y adicionalmente un listado de todos los modelos migrados a su base de datos temporal):\n\n```\nMigrations for 'myapp':\n  myapp/migrations/0001_initial.py\n    - Create model MyModel\n```\n\n7. Ahora es necesario crear un super usuario para probar la aplicación y la administración del sistema.\n\n### Linux\n```\n./manage.py createsuperuser\n```\n\n### Windows\nwinpty python manage.py createsuperuser\n\nDeberá seguir las instrucciones en consola. Puede ingresar el nombre, email y clave que prefiera, pero deberá recordarlos para poder usar esos datos luego.\n\n8. Finalmente, ejecutaremos el proyecto con el siguiente comando:\n```\n./manage.py runserver\n```\n\n9. Podremos ingresar a la siguiente URL para ver nuestro nuevo home-page http://localhost:8000. Además, si ha seleccionado generar un modelo de ejemplo, podrá revisar un ejemplo del CRUD autogenerado para dicho modelo en la siguiente dirección: http://localhost:8000/mymodels/ (para acceder deberá autenticarse con su usuario generado, o con cualquier usuario registrado en la consola administrativa de Django: http://localhost:8000/admin)\n\n## Pruebas\nDWLL autogenera dos archivos que permiten al desarrollador probar la funcionalidad y eficiencia de su nueva aplicación.\n\n### Funcionalidad\nPara probar la funcionalidad de una algoritmo o un segmento de su codigo ejecute el siguiente comando>\n```\n./manage.py test myapp\n```\n\n### Estress y Carga\nPara realizar pruebas de carga y estress a sus pantallas, ejecute los siguientes comandos:\n```\ncd myapp\nlocust\n```\nEsto inicia el servidor de Locust para pruebas de carga y estress. Para iniciar la preparación y ejecución de las pruebas simplemente ingrese a la siguiente dirección: http://localhost:8089/, alli podrá ejecutar cualquier clase de prueba con varios usuarios recurrentes a la vez y medir el rendimiento de su aplicación Web, aún luego de incluir mayor funcionalidad que la autogenerada.\n\n## Licencia\n\nMIT, UIsrael\n\n**Free Software, Hell Yeah!**\n\n[//]: # (These are reference links used in the body of this note and get stripped out when the markdown processor does its job. There is no need to format nicely because it shouldn't be seen. Thanks SO - http://stackoverflow.com/questions/4823468/store-comments-in-markdown-syntax)\n\n   [Allauth]: <https://django-allauth.readthedocs.io/en/latest/overview.html>\n   [Beautifulsoup4]: <https://pypi.org/project/beautifulsoup4/>\n   [dwll]: <https://github.com/jimuisrael/dwll>\n   [df1]: <http://joaquin.medina.name/web2008/documentos/informatica/documentacion/logica/OOP/Principios/2012_07_30_OopNoTeRepitas.html>\n   [Locust]: <https://locust.io/>",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/jimuisrael/dwll",
    "keywords": "django acelerator,fast login,messages,configuration,rehuse",
    "license": "BSD",
    "maintainer": "",
    "maintainer_email": "",
    "name": "dwll",
    "package_url": "https://pypi.org/project/dwll/",
    "platform": null,
    "project_url": "https://pypi.org/project/dwll/",
    "project_urls": {
      "Homepage": "https://github.com/jimuisrael/dwll"
    },
    "release_url": "https://pypi.org/project/dwll/1.0.2/",
    "requires_dist": null,
    "requires_python": ">=3.5",
    "summary": "My app description",
    "version": "1.0.2",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 15206883,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "98f975acb3794ac9a5cab3ace411f6f709299c7d135e391dc4587c59c5df9994",
        "md5": "46eb8d9d237f4cb35aed701e23804018",
        "sha256": "7a6487ea5c652cf763e4a2e5bc8e1d46f7c87f94a85f8f098f5b301c8d1f6607"
      },
      "downloads": -1,
      "filename": "dwll-1.0.2.tar.gz",
      "has_sig": false,
      "md5_digest": "46eb8d9d237f4cb35aed701e23804018",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.5",
      "size": 34241,
      "upload_time": "2022-09-25T19:55:09",
      "upload_time_iso_8601": "2022-09-25T19:55:09.013930Z",
      "url": "https://files.pythonhosted.org/packages/98/f9/75acb3794ac9a5cab3ace411f6f709299c7d135e391dc4587c59c5df9994/dwll-1.0.2.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}