{
  "info": {
    "author": "Olivier Vincent",
    "author_email": "ovinc.py@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: BSD License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.6",
      "Programming Language :: Python :: 3.7",
      "Programming Language :: Python :: 3.8",
      "Programming Language :: Python :: 3.9"
    ],
    "description": "# About\n\n**drapo** (_**dra**ggable **p**lot **o**bjects_) is a Python 3 package that provides a set of interactive graphical objects on Matplotlib figures: draggable line, draggable rectangle, moving cursor, and interactive click to define active figure/axes.\n\nBased on these tools, the package also provides graphical input functions for measuring/extracting data interactively from a figure, such as ginput (get location of clicks) and rinput (get region of interest from interactive rectangle).\n\nMatplotlib must be using an interactive backend such as Qt or Tk. In Jupyter, use `%matplotlib qt` or `%matplotlib tk` (or simply `%matplotlib`). The *MacOSX* backend can cause problems (see *Tips and Troubleshooting* below).\n\n### Draggable shapes\n- **Line** is a class that creates a draggable line.\n- **Rect** is a class that creates a draggable rectangle.\n\n### Moving cursor\n- **Cursor** is a class that creates a cursor that follows the mouse\n\n### Graphical input functions\n- **ginput** is a function based on the Cursor class that returns position data from clicks/keystrokes.\n- **rinput** is a function based on the Rect class that returns position data delimited by an interactive rectangle.\n\n### Other\n- **ClickFig** is a class that activates figures and axes (makes them the current ones) by mouse hovering and clicking.\n\n\n![](https://raw.githubusercontent.com/ovinc/drapo/master/media/demo.gif)\n\n\n\n# Install\n\n```bash\npip install drapo\n```\n\n\n# Quick start\n\nBelow is a brief overview on how to use the package contents with the most basic features. For full documentation, see *DOCUMENTATION.md*. For background code and development info, see *DEVELOPMENT.md*.\n\nFor a brief demo of various objects:\n```bash\npython -m drapo.demo\n```\n(it is possible to specify a backend and/or to turn on/off blitting using the `--backend` and `--blit` flags, see help with `python -m drapo.demo -h`)\n\nTo use individual objects and functions:\n\n```python\nfrom drapo import Line, Cursor, Rect, ClickFig, ginput, rinput\n```\n\n## Draggable objects\n\n`Line()` creates a line in the current axes of the current figure (creates new figure if none existing) that is draggable by left-clicking on it. Motion is different whether click is done on the line ends or on the line itself. To remove the line, right-click on it.\n\n`Rect()` creates a draggable rectangle in the current or specified figure. Motion is triggered by left-clicking on the edges (lines), vertices (corner points), or in the center (marked by a cross). Right-click to delete.\n\nSee documentation for options to change the appearance of these objects.\nSee ClickFig below to activate axes interactively to be able to create the objects in specific axes as needed.\n\n## Moving cursor\n\n`Cursor()` creates a cursor in the current figure, but contrary to the draggable objects, the cursor is not bound to specific axes. It is however bound to a figure, and will appear on whatever axes the mouse is currently on; it will switch axes if the mouse goes over other axes. No cursor is visible if the mouse is not currently on axes.\n- Use <kbd>⇧ Shift</kbd> + left/right arrow keys to change color.\n- Use <kbd>⇧ Shift</kbd> + up/down keys to change thickness.\n- Use the <kbd>space</kbd> bar to toggle visibility on/off.\n\n## Graphical input functions\n\n`ginput()` will return the data coordinates (x, y) of one click on any axes of the current figure.\n- Use `ginput(n)` to record exactly n data points (returns list of tuples).\n- Use `ginput(-1)` for an undefined amount of points.\n- Left click or press <kbd>a</kbd> to add point.\n- Right click or press <kbd>z</kbd> to remove point.\n- Middle click or press <kbd>enter</kbd> to finish input.\n\n`rinput()` will instantiate an interactive rectangle and return its position as a tuple (xmin, ymin, width, height) when the <kbd>enter</kbd> key is pressed.\n\n## Activate specific figure/axes (ClickFig)\n\nSometimes the current figure/axes are not the ones where one wants to create the objects. To solve this problem, it is possible to use the ClickFig class.\n\n`ClickFig()` will make all existing figures and axes clickable (hovering the mouse should highlight the fig/ax under it with a light blue color). Simply left-click in the ones you would like to activate. By default, activation stops after one click.\n\n`ClickFig(-1)` will keep all fig/ax active for an undefined amount of clicks. Since ClickFig is non-blocking, this is a way to be able to be able to keep activating axes during a work session, without having to instantiate a ClickFig every time. In this situation, deactivation of the ClickFig is done by right-click.\n\n`ClickFig(highlight=False)` allows not using color highlighting of the fig/ax if it is bothersome.\n\n\n# Tips and Troubleshooting\n\n## Tips\n\n- When instantiating an object from the command line on an existing figure, Matplotlib figures need to not block the console. For this, use `plt.show(block=False)` when creating the figure.\n\n- If selecting objects is difficult, either increase the `pickersize` property, or upgrade drapo and/or Matplotlib (see *Requirements* below).\n\n## General issues\n\nIf encountering problems, try the following:\n\n- Use a different matplotlib backend, e.g. `matplotlib.use('Qt5Agg')`, `matplotlib.use('Qt4Agg')` or `matplotlib.use('TkAgg')`.\n\n- Similarly, in Jupyter, an interactive backend needs to be used, with the command `%matplotlib qt` or `%matplotlib tk` (or simply `%matplotlib`).\n\n- Pass `blit=False` in the argument of any class or function (except ClickFig) to see if the problem comes from the blitting strategy used for fast rendering.\n\n## MacOSX issues\n\nThe *MacOSX* backend of Matplotlib seems to cause problems where the figure crashes, or objects get duplicated on the figure, among other things. If encountering problems on a Mac, usually they are solved by either turning off blitting for fast rendering, or by choosing a different backend (see above).\n\n# Requirements\n\n## Packages\n\n- matplotlib\n- importlib-metadata\n- numpy (optional, only needed to run demos and examples)\n\n**Note**: a bug in drapo < 1.0.5 makes it very difficult to select objects when using Matplotlib <3.3. This has been corrected in drapo <= 1.0.5.\n\n## Python\n\nPython : >= 3.6\n\n# Author\n\nOlivier Vincent\n\n(ovinc.py@gmail.com)\n\n# License\n\n3-Clause BSD (see *LICENSE* file).\n\nBSD 3-Clause License\n\nCopyright (c) 2020, Olivier VINCENT\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n* Redistributions of source code must retain the above copyright notice, this\n  list of conditions and the following disclaimer.\n\n* Redistributions in binary form must reproduce the above copyright notice,\n  this list of conditions and the following disclaimer in the documentation\n  and/or other materials provided with the distribution.\n\n* Neither the name of the copyright holder nor the names of its\n  contributors may be used to endorse or promote products derived from\n  this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/ovinc/drapo",
    "keywords": "interactive,matplotlib,draggable,cursor,line,rectangle,ginput",
    "license": "BSD 3-Clause License",
    "maintainer": "",
    "maintainer_email": "",
    "name": "drapo",
    "package_url": "https://pypi.org/project/drapo/",
    "platform": "",
    "project_url": "https://pypi.org/project/drapo/",
    "project_urls": {
      "Homepage": "https://github.com/ovinc/drapo"
    },
    "release_url": "https://pypi.org/project/drapo/1.0.5/",
    "requires_dist": [
      "matplotlib",
      "importlib-metadata"
    ],
    "requires_python": ">=3.6",
    "summary": "Interactive features (cursor, draggable lines & rectangles, graphical input, clik-to-make-axes active, etc.) for Matplotlib",
    "version": "1.0.5",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16621652,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "0c613d8cc039b1a8f1ade8fc96023ed039362195a34192917787ee14b5f901b2",
        "md5": "c77c70af2bb0e0d03c5a492fbeea5b54",
        "sha256": "241fe1eb49447cda2a27d5ef6070b849c53a207021dbc9d4bde31744980d9266"
      },
      "downloads": -1,
      "filename": "drapo-1.0.5-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "c77c70af2bb0e0d03c5a492fbeea5b54",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6",
      "size": 46684,
      "upload_time": "2021-01-22T19:00:19",
      "upload_time_iso_8601": "2021-01-22T19:00:19.270048Z",
      "url": "https://files.pythonhosted.org/packages/0c/61/3d8cc039b1a8f1ade8fc96023ed039362195a34192917787ee14b5f901b2/drapo-1.0.5-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "a1abefeeb0a15eebf0dbe2e8c822e1a0fabc5560896806660d9f38d7eaafc060",
        "md5": "e66dd6c272234e20663b63bb75e9b16b",
        "sha256": "78fd009f409c78096e87b32f7308ad256f107e59243162b43ee19b37fa5e5035"
      },
      "downloads": -1,
      "filename": "drapo-1.0.5.tar.gz",
      "has_sig": false,
      "md5_digest": "e66dd6c272234e20663b63bb75e9b16b",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 904303,
      "upload_time": "2021-01-22T19:00:23",
      "upload_time_iso_8601": "2021-01-22T19:00:23.049749Z",
      "url": "https://files.pythonhosted.org/packages/a1/ab/efeeb0a15eebf0dbe2e8c822e1a0fabc5560896806660d9f38d7eaafc060/drapo-1.0.5.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}