{
  "info": {
    "author": "Liang Liu",
    "author_email": "liangliu@main.sdu.edu.cn",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 4 - Beta",
      "License :: OSI Approved :: GNU General Public License v3 (GPLv3)",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3",
      "Topic :: Scientific/Engineering :: Physics",
      "Topic :: Scientific/Engineering :: Visualization"
    ],
    "description": "# mcsolver\nA user friendly and efficient tool implementing Monte Carlo simulations to estimate Curie/Neel temperature\n\nSupport multiple ocassions, e.g. standard ferromangetic/anti-ferromagnetic systems, DMI, Kiteav non-diagonal exchange interactions, dipole-dipole long-range couplings, with external fields.\n\nOriginal version contributor: Dr. Liang Liu* 1.Shenzheng University 2.Shandong University\nEmail: liangliu@mail.sdu.edu.cn\n\nYou can download the packed .exe (only tested in Windows 10 platform) from the following link. Wish it can find something helpful for you. And if it was used for publication, please cite:\n[1] Magnetic switches via electric field in BN nanoribbons. Applied Surface Science 480(2019)\n\nLink for exe: https://pan.baidu.com/s/1EaDqOOdB7AP9WXrwEIEaxQ\npasswd: 52ze\n\n\nBrief tutorial:\n\nA. using mcsolver via .exe, e.g., in Windows platform\n\n  NOTE: the mcsolver.exe maybe reported to be virus and removed by some anti-virus software. I still have no ideal about this and maybe you need add it into white list. Otherwise you can use mcsolver as a python package (see Section B below).\n\n  Download .exe file from upper link, then open exe (maybe wait 10+ sec.), fill out all parameters, click startMC Btn, then wait for the results.\n\n  How to define parameters?\n\n  Style I Define parameters via GUI:\n\n    1. Define the three lattice vectors of primitive cell.\n\n    2. Define all basic spins in primitive cell, note that the fractional coordinates are supposed. Ani represents the single-ion anisotropies in xyz directions (It is useless in Ising model, and only former two are used in XY model). As well as, note that the units of anisotropies are in Kelvin. \n\n    3. Define all exchange interactions (bonds). There are nine matrix elements for one J including Jxx, Jyy, Jzz, Jxy, Jxz, Jyz, Jyx, Jzx, Jzy, respectively. Each element discribes the coupling between two components of spins. For example, a basic bond term can be expressed as S1\\dot J\\dot S2 = S_{1x}J_{xx}S_{2x} + S_{1y}J_{yy}S_{2y} + S_{1z}J_{zz}S_{2z} + S_{1x}J_{xy}S_{2y} +...\n    For Ising model, since only one component is available for each spin, only the first element Jxx is used. As well as for XY model, only Jxx, Jyy, Jxy, Jyz are used. \n    In this step, you can click one of the bonds to review the actual linking in lattice on view pannel. Activated bond is depicted with bold and yellow line while others are green. You may drag left/right mouse Btn to rotate and expand/shrink the model shown in view pannel. \n\n    4. Define other parameters, including \n    the start and end temperatures, number of temperature interpolations (for the temperature scanning)\n    the start, end and number of samplings for external field (for the magnetic field scanning)\n    nthermal is the total steps to make system enter balanced states, nsweep is the total steps involved in mesearing, tau denotes the MC updates for each step\n    xAxis denote the physical quantity put in x-axis of right-hand Result viewer, it can be either T(for illustration of M-T curv) or H (for illustration of hysteresis loop).\n    model type, algorithm (only Metropolis and Wolff are supported now)\n    nFrame is the num. of output spin configurations, using for illustrating spin configurations in equilibrium or non-equilibrium states.\n\n    5. Set spin_i and spin_j and the lattice vector between them, for correlation mesearments. (if spin_i=spin_j and overLat=0 0 0, then you will get susceptibility for spin_i)\n\n    6. Set the core resources for parallel calc.\n\n    7. (Optional) Save current parameters into file.\n\n    8. Click startMC Btn to start.\n\n    9. Wait for the diagram update in right pannel. Afterwards, you can find a file result.txt in the root directory of mcsolver, there are many useful informations including the averaged spin (on spin_i and j defined in step 5), correlation between spin_i and j, internal energy, specific heat capacith, and Binder cumulant U4, etc. If you handle the sims with more than one cores then the results may not be ordered according to temperature, however, the correspondences in every line are ok.\n\n  Style II Define parameters via loading file\n\n    1. click load Btn to load settings, and here I prepared the setting for CrI3 with exchanges up to 2nd nearest neiboring. You can modify the sample file for your own purposes, with any txt editor. \n\n    2. Click startMC Btn to start.\n\nB. using mcsolver as a python package\n\n  Style I Build form binary file in Windows platform\n\n    Install the package via command:\n\n    pip install mcsolver\n\n    Note that python>=3, matplotlib, numpy, tkinter are prerequisite\n\n    Afterwards, you can import mcsolver into your own python code and use function:\n\n    mcsolver.loadMC(\"parameterfile\")\n\n    to start simulation. Preparation of parameterfile is the same as in section A.\n\n    There are one sample file sim_XYmodel_under_Windows.py in sample folder. To use this, change your current path (in console) into sample folder, and type command: python sim_XYmodel_under_Windows.py\n\n    NOTE: since mcsolver employ python-parallel you have to use freeze_support() before calling loadMC(...).\n\n  Style II Build from source in Linux platform\n\n    Download all codes presented here, use install command:\n\n    python setup.py install\n\n    Afterwards, you can import mcsolver into your own python code and use function:\n\n    mcsolver.loadMC(\"parameterfile\")\n\n    to start simulation. Preparation of parameterfile is the same as in section A.\n\n    There are one sample file sim_XYmodel_under_Windows.py in sample folder. To use this, cd to sample folder, and type command: python sim_XYmodel_under_Linux.py\n\n    Note that the parallelization of mcsolver is not perfect. Now it cannot parallelize between multiple machines but amongst mutiple cores in a single machine (that is, only SMP mode is efficient). Therefore submit the job into one node if you are working with clusters.\n\nC. using code mode (not recommend)\n\n   Download all codes, compile the .c file inito .so using c99 standard and run cmd: \"python win.py\" to load GUI and conduct simulations.\n\n",
    "description_content_type": "",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/golddoushi/mcsolver",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "mcsolver",
    "package_url": "https://pypi.org/project/mcsolver/",
    "platform": "",
    "project_url": "https://pypi.org/project/mcsolver/",
    "project_urls": {
      "Homepage": "https://github.com/golddoushi/mcsolver"
    },
    "release_url": "https://pypi.org/project/mcsolver/2.0.1/",
    "requires_dist": [
      "matplotlib",
      "numpy"
    ],
    "requires_python": ">=3.7",
    "summary": "A user friendly program to do Monte Carlo sims for magnetic systems",
    "version": "2.0.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 10515363,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "ef1bda06920c54e4dd49169f9747a25f2c410886731385977fff57f07ea2f0b1",
        "md5": "8e301aef7c2c9f9b58447d3df44fc766",
        "sha256": "504d7cd9aa7a8a322bacf01199dc14d88685dc36d85e784bd7a9bd264e78b9af"
      },
      "downloads": -1,
      "filename": "mcsolver-2.0.1-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "8e301aef7c2c9f9b58447d3df44fc766",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.7",
      "size": 110315,
      "upload_time": "2020-06-29T06:55:13",
      "upload_time_iso_8601": "2020-06-29T06:55:13.210885Z",
      "url": "https://files.pythonhosted.org/packages/ef/1b/da06920c54e4dd49169f9747a25f2c410886731385977fff57f07ea2f0b1/mcsolver-2.0.1-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}