{
  "info": {
    "author": "Jérôme BUISINE",
    "author_email": "jerome.buisine@univ-littoral.fr",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "License :: OSI Approved :: MIT License",
      "Programming Language :: Python :: 3.8",
      "Topic :: Scientific/Engineering",
      "Topic :: Utilities"
    ],
    "description": "# Minimalist And Customisable Optimisation Package\n\n[![status](https://joss.theoj.org/papers/9ea7d55c4fa83808f96929cb87adff3e/status.svg)](https://joss.theoj.org/papers/9ea7d55c4fa83808f96929cb87adff3e) \n[![](https://img.shields.io/github/workflow/status/jbuisine/macop/build)](https://github.com/jbuisine/macop/actions/workflows/python-app.yml)\n[![PyPI](https://img.shields.io/pypi/v/macop)](https://pypi.org/project/macop/) \n[![](https://img.shields.io/pypi/dm/macop)](https://pypi.org/project/macop/)\n[![GitHub](https://img.shields.io/github/license/jbuisine/macop?style=flat)](https://github.com/jbuisine/macop/blob/master/LICENCE)\n\n<p align=\"center\">\n    <img src=\"https://github.com/jbuisine/macop/blob/master/docs/source/_static/logo_macop.png\" alt=\"\" width=\"50%\">\n</p>\n\n\n## Description\n\n`Macop` is a python package for solving discrete optimisation problems in nature. Continuous optimisation can also applicable if needed. The objective is to allow a user to exploit the basic structure proposed by this package to solve a problem specific to him. The interest is that he can quickly abstract himself from the complications related to the way of evaluating, comparing, saving the progress of the search for good solutions but rather concentrate if necessary on his own algorithm. Indeed, `Macop` offers the following main and basic features: \n\n- **solutions:** representation of the solution;\n- **validator:** such as constraint programmig, a `validator` is function which is used for validate or not a solution data state;\n- **evaluator:** stores problem instance data and implement a `compute` method in order to evaluate a solution;\n- **operators:** mutators, crossovers operators for update and obtain new solution;\n- **policies:** the way you choose the available operators (might be using reinforcement learning);\n- **algorithms:** generic and implemented optimisation research algorithms;\n- **callbacks:** callbacks to automatically keep track of the search space advancement and restart from previous state if nedded.\n\n<p align=\"center\">\n    <img src=\"https://github.com/jbuisine/macop/blob/master/docs/source/_static/documentation/macop_behaviour.png\" alt=\"\" width=\"50%\">\n</p>\n\n\n## Motivation\n\nFlexible discrete optimisation package allowing a quick implementation of your problems. In particular it meets the following needs:\n\n- **Common basis:** the interaction loop during the solution finding process proposed within the package is common to all heuristics. This allows the user to modify only a part of this interaction loop if necessary without rendering the process non-functional.\n- **Hierarchy:** a hierarchical algorithm management system is available, especially when an algorithm needs to manage local searches. This hierarchy remains transparent to the user. The main algorithm will be able to manage and control the process of searching for solutions.\n- **Flexibility:** although the algorithms are dependent on each other, it is possible that their internal management is different. This means that the ways in which solutions are evaluated and updated, for example, may be different.\n- **Abstraction:** thanks to the modular separability of the package, it is quickly possible to implement new problems, solutions representation, way to evaluate, update solutions within the package.\n- **Extensible:** the package is open to extension, i.e. it does not partition the user in these developer choices. It can just as well implement continuous optimization problems if needed while making use of the main interaction loop proposed by the package.\n- **Easy Setup:** as a pure Python package distributed is ``pip`` installable and easy to use.\n\n## Target Audience \n\nThis package would meet the expectations of people wishing to: \n- Solve a complex problem oriented evolutionary algorithm but who do not wish to develop their own framework. They can rely on what the package already proposes but also on its generic and flexible contribution in order to adapt their own content;\n- Conduct research work leading to the rapid modification of meta-heuristics and the interaction of different algorithms. More precisely:\n  - test new combinations of algorithms. Changing algorithms during evaluations, e.g. different local searches;\n  - provide reinforcement learning during searches (e.g. adaptive operator choice strategy).\n  - test new multi-objective methods quickly thanks to the proposed algorithmic hierarchy allowing to easily decompose the multi-objective problem into single-objective sub-problems.\n- Take advantage of a system for launching calculations from a backup in order to avoid any loss in case of unwanted program interruption;\n- Quickly model a problem that is still unknown, i.e. the type of solution and the evaluation function, while taking advantage of the interaction loop proposed by the package.\n\n## Content\n\nThe primary advantage of using Python is that it allows you to dynamically add new members within the new implemented solution or algorithm classes. This of course does not close the possibilities of extension and storage of information within solutions and algorithms. It all depends on the need in question.\n\n### In `macop.algorithms` module:\n\nBoth single and multi-objective algorithms have been implemented for demonstration purposes. \n\nA hierarchy between dependent algorithms is also available, based on a parent/child link, allowing quick access to global information when looking for solutions, such as the best solution found, the number of global evaluations.\n\nThe mono-objective Iterated Local Search algorithm which aims to perform local searches (child algorithms linked to the main algorithm) and then to explore again (explorations vs. exploitation trade-off). On the multi-objective side, the MOEA/D algorithm has been implemented by using the weighted-sum of objectives to change multi-objectives problem into a set of mono-objective (Tchebycheff approach can also be used). Hence, this algorithm aims at decomposing the multi-objective problem into `mu` single-objective problems in order to obtain the Pareto front where single-objective problems are so-called child algorithms linked to the multi-objective algorithm.\n\nThe main purpose of these developed algorithms is to show the possibilities of operational search algorithm implementations based on the minimalist structure of the library.\n\n### In `macop.solutions` module:\n\nCurrently, only combinatorial solutions (discrete problem modelisation) are offered, with the well-known problem of the knapsack as an example. Of course, it's easy to add your own representations of solutions. Solutions modeling continuous problems can also be created by the anyone who wants to model his own problem.\n\n### In `macop.operators` and `macop.policies` modules:\n\nA few mutation and crossover operators have been implemented, however, it remains quite simple. What is interesting here is that it is possible to develop one's own strategy for choosing operators for the next evaluation. The available UCBPolicy class proposes this functionality as an example, since it will seek to propose the best operator to apply based on a method known as the Adaptive Operator Selection (AOS) via the use of the Upper Confidence Bound (UCB) algorithm. \n\n### In `macop.callbacks` module:\n\nThe use of callback instance, allows both to do an action every $k$ evaluations of information, but also to reload them once the run of the algorithm is cut. Simply inherit the abstract Callback class and implement the `apply` method to backup and `load` to restore. It is possible to add as many callbacks as required. Such as an example, implemented UCBPolicy has its own callback allowing the instance to reload previously collected statistics and restart using them.\n\n\n## Documentation\n\nBased on all of these generic and/or implemented functionalities, the user will be able to quickly develop a solution to his problem while retaining the possibility of remaining in control of his development by overloading existing functionalities if necessary.\n\nMain idea about this Python package is that it does not which doesn't implement every algorithm in the literature but let the possibility to the user to quickly develop and test its own algorithms and strategies. The main objective of this package is to provide maximum flexibility, which allows for easy experimentation in implementation..\n\nFully documentation of package with examples is [available](https://jbuisine.github.io/macop). \n\nYou can also see examples of use:\n-  in the [knapsackExample.py](https://github.com/jbuisine/macop/blob/master/examples/knapsackExample.py) for mono-objective knapsack instance.\n-  in the [knapsackMultiExample.py](https://github.com/jbuisine/macop/blob/master/examples/knapsackMultiExample.py) for multi-objective knapsack instance.\n-  in the [qapExample.py](https://github.com/jbuisine/macop/blob/master/examples/qapExample.py) for mono-objective QAP instance.\n-  in the [ubqpExample.py](https://github.com/jbuisine/macop/blob/master/examples/ubqpExample.py) for mono-objective UBQP problem instance.\n\n## Add as dependency\n\n```bash\ngit submodule add https://github.com/jbuisine/macop.git\n```\n\n## Current projects which use `Macop`:\n\n- [@prise3d/noise-detection-attributes-optimization](https://github.com/prise-3d/noise-detection-attributes-optimization): use of a parent algorithm with the real (but very expensive) evaluation function, and then inner local searches which use a substitution model (a model that has learned to approximate the real cost function with a quick-to-evaluate function). Hence, two evaluation functions have been used in order to accelerate the search in the set of solutions.\n\n## License\n\n[The MIT License](LICENSE)\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/prise-3d/macop",
    "keywords": "",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "macop",
    "package_url": "https://pypi.org/project/macop/",
    "platform": "",
    "project_url": "https://pypi.org/project/macop/",
    "project_urls": {
      "Homepage": "https://github.com/prise-3d/macop"
    },
    "release_url": "https://pypi.org/project/macop/1.0.15/",
    "requires_dist": [
      "numpy"
    ],
    "requires_python": "",
    "summary": "Minimalist And Customisable Optimisation Package",
    "version": "1.0.15",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 9608630,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "d5500c36635bca165722adf295eeb718fff539d0b07ce2acdd75bb5b45f2d148",
        "md5": "7ed28c4b676ab78b835379ab736ab772",
        "sha256": "5e9cd37cb166bae5df65a485b7e6107d9e15dab2daade9a16d30db16e331ac99"
      },
      "downloads": -1,
      "filename": "macop-1.0.15-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "7ed28c4b676ab78b835379ab736ab772",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 41842,
      "upload_time": "2021-02-24T08:58:27",
      "upload_time_iso_8601": "2021-02-24T08:58:27.794776Z",
      "url": "https://files.pythonhosted.org/packages/d5/50/0c36635bca165722adf295eeb718fff539d0b07ce2acdd75bb5b45f2d148/macop-1.0.15-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "4c2f8fcfcb0a53517a47dd4d1fbc584932833a47cc867611152b9c532a708728",
        "md5": "8b43c1e115b28dd7286a7bd45892aaeb",
        "sha256": "f5327e8fc17c52fdcd2c070831a186672cc882db21b9e38dc1e6ada92eed878d"
      },
      "downloads": -1,
      "filename": "macop-1.0.15.tar.gz",
      "has_sig": false,
      "md5_digest": "8b43c1e115b28dd7286a7bd45892aaeb",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 30265,
      "upload_time": "2021-02-24T08:58:29",
      "upload_time_iso_8601": "2021-02-24T08:58:29.746783Z",
      "url": "https://files.pythonhosted.org/packages/4c/2f/8fcfcb0a53517a47dd4d1fbc584932833a47cc867611152b9c532a708728/macop-1.0.15.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}