{
  "info": {
    "author": "Tao Liu",
    "author_email": "vladimir.liu@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 4 - Beta",
      "Environment :: Console",
      "Intended Audience :: Developers",
      "Intended Audience :: Science/Research",
      "License :: OSI Approved :: Artistic License",
      "Operating System :: MacOS :: MacOS X",
      "Operating System :: POSIX",
      "Programming Language :: Python",
      "Topic :: Scientific/Engineering :: Bio-Informatics"
    ],
    "description": "=====================\nREADME for MACS (2.1)\n=====================\nTime-stamp: <2012-07-03 16:52:45 Tao Liu>\n\nIntroduction\n============\n\nWith the improvement of sequencing techniques, chromatin\nimmunoprecipitation followed by high throughput sequencing (ChIP-Seq)\nis getting popular to study genome-wide protein-DNA interactions. To\naddress the lack of powerful ChIP-Seq analysis method, we present a\nnovel algorithm, named Model-based Analysis of ChIP-Seq (MACS), for\nidentifying transcript factor binding sites. MACS captures the\ninfluence of genome complexity to evaluate the significance of\nenriched ChIP regions, and MACS improves the spatial resolution of\nbinding sites through combining the information of both sequencing tag\nposition and orientation. MACS can be easily used for ChIP-Seq data\nalone, or with control sample with the increase of specificity.\n\nInstall\n=======\n\nPlease check the file 'INSTALL' in the distribution.\n\nUsage of macs2\n==============\n\nUsage::\n  macs2 [-h] [--version]\n             {callpeak,filterdup,bdgpeakcall,bdgcmp,randsample,bdgdiff,bdgbroadcall}\n             ...\n\nExample: ``macs2 callpeak -t ChIP.bam -c Control.bam -f BAM -g hs -n test -B -q 0.01``\n\nor example for broad peak calling: ``macs2 -t ChIP.bam -c Control.bam --broad -g hs``\n\nThere are seven major functions available in MACS serving as sub-commands.\n\n\n** Parameters:\n\n*** -t/--treatment FILENAME\n\nThis is the only REQUIRED parameter for MACS.\n\n*** -c/--control\n\nThe control or mock data file in either BED format or any ELAND output\nformat specified by --format option. Please follow the same direction\nas for -t/--treatment.\n\n*** -n/--name\n\nThe name string of the experiment. MACS will use this string NAME to\ncreate output files like 'NAME_peaks.xls', 'NAME_negative_peaks.xls',\n'NAME_peaks.bed' , 'NAME_summits.bed', 'NAME_model.r' and so on. So\nplease avoid any confliction between these filenames and your existing\nfiles.\n\n*** -f/--format FORMAT\n\nFormat of tag file, can be \"ELAND\", \"BED\", \"ELANDMULTI\",\n\"ELANDEXPORT\", \"ELANDMULTIPET\" (for pair-end tags), \"SAM\", \"BAM\" or\n\"BOWTIE\". Default is \"AUTO\" which will allow MACS to decide the format\nautomatically. Please use \"AUTO\" only when you combine different\nformats of files.\n\nThe BED format is defined in \"http://genome.ucsc.edu/FAQ/FAQformat#format1\".\n\nIf the format is ELAND, the file must be ELAND result output file,\neach line MUST represents only ONE tag, with fields of:\n\n 1. Sequence name (derived from file name and line number if format is not Fasta)\n 2. Sequence\n 3. Type of match: \n NM - no match found.\n QC - no matching done: QC failure (too many Ns basically).\n RM - no matching done: repeat masked (may be seen if repeatFile.txt was specified).\n U0 - Best match found was a unique exact match.\n U1 - Best match found was a unique 1-error match. \n U2 - Best match found was a unique 2-error match. \n R0 - Multiple exact matches found.\n R1 - Multiple 1-error matches found, no exact matches.\n R2 - Multiple 2-error matches found, no exact or 1-error matches.\n 4. Number of exact matches found.\n 5. Number of 1-error matches found.\n 6. Number of 2-error matches found.\n Rest of fields are only seen if a unique best match was found (i.e. the match code in field 3 begins with \"U\").\n 7. Genome file in which match was found.\n 8. Position of match (bases in file are numbered starting at 1).\n 9. Direction of match (F=forward strand, R=reverse).\n 10. How N characters in read were interpreted: (\".\"=not applicable, \"D\"=deletion, \"I\"=insertion).\n Rest of fields are only seen in the case of a unique inexact match (i.e. the match code was U1 or U2).\n 11. Position and type of first substitution error (e.g. 12A: base 12 was A, not whatever is was in read).\n 12. Position and type of first substitution error, as above. \n\nIf the format is ELANDMULTI, the file must be ELAND output file from\nmultiple-match mode, each line MUST represents only ONE tag, with\nfields of:\n\n 1. Sequence name \n 2. Sequence \n 3. Either NM, QC, RM (as described above) or the following: \n 4. x:y:z where x, y, and z are the number of exact, single-error, and 2-error matches found\n 5. Blank, if no matches found or if too many matches found, or the following:\n    BAC_plus_vector.fa:163022R1,170128F2,E_coli.fa:3909847R1 This says\n    there are two matches to BAC_plus_vector.fa: one in the reverse\n    direction starting at position 160322 with one error, one in the\n    forward direction starting at position 170128 with two\n    errors. There is also a single-error match to E_coli.fa.\n\nIf the data is from Pair-End sequencing. You can sepecify the format\nas ELANDMULTIPET ( stands for ELAND Multiple-match Pair-End Tags),\nthen the --treat (and --control if needed) parameter must be two file\nnames separated by comma. Each file must be in ELAND multiple-match\nformat described above. e.g.\n\nmacs2 --format ELANDMULTIPET -t s_1_1_eland_multi.txt,s_2_1_eland_multi.txt ...\n\nIf you use ELANDMULTIPET, you may need to modify --petdist parameter.\n\nIf the format is BAM/SAM, please check the definition in\n(http://samtools.sourceforge.net/samtools.shtml).  Pair-end mapping\nresults can be saved in a single BAM file, if so, MACS will\nautomatically keep the left mate(5' end) tag.\n\nIf the format is BOWTIE, you need to provide the ASCII bowtie output\nfile with the suffix '.map'. Please note that, you need to make sure\nthat in the bowtie output, you only keep one location for one\nread. Check the bowtie manual for detail if you want at\n(http://bowtie-bio.sourceforge.net/manual.shtml)\n\nHere is the definition for Bowtie output in ASCII characters I copied\nfrom the above webpage:\n\n   1.  Name of read that aligned\n\n   2. Orientation of read in the alignment, - for reverse complement,\n   + otherwise\n\n   3. Name of reference sequence where alignment occurs, or ordinal ID\n   if no name was provided\n\n   4. 0-based offset into the forward reference strand where leftmost\n   character of the alignment occurs\n\n   5. Read sequence (reverse-complemented if orientation is -)\n\n   6. ASCII-encoded read qualities (reversed if orientation is -). The\n   encoded quality values are on the Phred scale and the encoding is\n   ASCII-offset by 33 (ASCII char !).\n\n   7. Number of other instances where the same read aligns against the\n   same reference characters as were aligned against in this\n   alignment. This is not the number of other places the read aligns\n   with the same number of mismatches. The number in this column is\n   generally not a good proxy for that number (e.g., the number in\n   this column may be '0' while the number of other alignments with\n   the same number of mismatches might be large). This column was\n   previously described as \"Reserved\".\n\n   8. Comma-separated list of mismatch descriptors. If there are no\n   mismatches in the alignment, this field is empty. A single\n   descriptor has the format offset:reference-base>read-base. The\n   offset is expressed as a 0-based offset from the high-quality (5')\n   end of the read.\n\nNotes:\n\n1) For BED format, the 6th column of strand information is required by\nMACS. And please pay attention that the coordinates in BED format is\nzero-based and half-open\n(http://genome.ucsc.edu/FAQ/FAQtracks#tracks1).\n\n2) For plain ELAND format, only matches with match type U0, U1 or U2 is\naccepted by MACS, i.e. only the unique match for a sequence with less\nthan 3 errors is involed in calculation. If multiple hits of a single\ntag are included in your raw ELAND file, please remove the redundancy\nto keep the best hit for that sequencing tag.\n\n3) For the experiment with several replicates, it is recommended to\nconcatenate several ChIP-seq treatment files into a single file. To do\nthis, under Unix/Mac or Cygwin (for windows OS), type:\n\n$ cat replicate1.bed replicate2.bed replicate3.bed > all_replicates.bed\n\nFor BAM or SAM files, samtools can be used to combine replicates.\n\n4) ELAND export format support sometimes may not work on your\ndatasets, because people may mislabel the 11th and 12th column. MACS\nuses 11th column as the sequence name which should be the chromosome\nnames.\n\n** --petdist=PETDIST     \n\nBest distance between Pair-End Tags. Only available when format is\n'ELANDMULTIPE'. Default is 200bps. When MACS reads mapped positions\nfor 5' tag and 3' tag, it will decide the best pairing for them using\nthis best distance parameter. A simple scoring system is used as following,\n\nscore = abs(abs(p5-p3)-200)+e5+e5\n\nWhere p5 is one of the position of 5' tag, and e5 is the\nmismatch/error for this mapped position of 5' tag. p3 and e3 are for\n3' tag. Then the lowest scored paring is regarded as the best\npairing. The 5' tag position of the pair is kept in model building and\npeak calling.\n\n*** -g/--gsize\n\nPLEASE assign this parameter to fit your needs!\n\nIt's the mappable genome size or effective genome size which is\ndefined as the genome size which can be sequenced. Because of the\nrepetitive features on the chromsomes, the actual mappable genome size\nwill be smaller than the original size, about 90% or 70% of the genome\nsize. The default hs -- 2.7e9 is recommended for UCSC human hg18\nassembly. Here are all precompiled parameters for effective genome size:\n\n-g hs   =  -g 2.7e9\n-g mm   =  -g 1.87e9\n-g ce   =  -g 9e7\n-g dm   =  -g 1.2e8\n\n*** -s/--tsize\n\nThe size of sequencing tags. If you don't specify it, MACS will try to\nuse the first 10 sequences from your input treatment file to determine\nthe tag size. Specifying it will override the automatic determined tag\nsize.\n\n*** --bw\n\nThe band width which is used to scan the genome ONLY for model\nbuilding. You can set this parameter as the sonication fragment size\nexpected from wet experiment. The previous side effect on the peak\ndetection process has been removed. So this parameter only affects the\nmodel building.\n\n*** -q/--qvalue\n\nThe qvalue (minimum FDR) cutoff to call significant regions. Default\nis 0.01. For broad marks, you can try 0.05 as cutoff. Q-values are\ncalculated from p-values using Benjamini-Hochberg procedure.\n\n*** -p/--pvalue\n\nThe pvalue cutoff. If -p is specified, MACS2 will use pvalue instead of qvalue.\n\n*** -m/--mfold\n\nThis parameter is used to select the regions within MFOLD range of\nhigh-confidence enrichment ratio against background to build\nmodel. The regions must be lower than upper limit, and higher than the\nlower limit of fold enrichment. DEFAULT:10,30 means using all regions\nnot too low (>10) and not too high (<30) to build paired-peaks\nmodel. If MACS can not find more than 100 regions to build model, it\nwill use the --shiftsize parameter to continue the peak detection.\n\nCheck related *--off-auto* and *--shiftsize* for detail.\n\n** --nolambda\n\nWith this flag on, MACS will use the background lambda as local\nlambda. This means MACS will not consider the local bias at peak\ncandidate regions.\n\n** --slocal, --llocal\n\nThese two parameters control which two levels of regions will be\nchecked around the peak regions to calculate the maximum lambda as\nlocal lambda. By default, MACS considers 1000bp for small local\nregion(--slocal), and 10000bps for large local region(--llocal)\nwhich captures the bias from a long range effect like an open\nchromatin domain. You can tweak these according to your\nproject. Remember that if the region is set too small, a sharp spike\nin the input data may kill the significant peak.\n\n** --off-auto\n\nWhether turn off the auto paired-peak model process. If not set, when\nMACS failed to build paired model, it will use the nomodel settings,\nthe '--shiftsize' parameter to shift and extend each tags. If set,\nMACS will be terminated if paried-peak model is failed.\n\n** --nomodel\n\nWhile on, MACS will bypass building the shifting model.\n\n** --shiftsize\n\nWhile '--nomodel' is set, MACS uses this parameter to shift tags to\ntheir midpoint. For example, if the size of binding region for your\ntranscription factor is 200 bp, and you want to bypass the model\nbuilding by MACS, this parameter can be set as 100. This option is\nonly valid when --nomodel is set or when MACS fails to build\npaired-peak model.\n\n**  --keep-dup\n\nIt controls the MACS behavior towards duplicate tags at the exact same\nlocation -- the same coordination and the same strand. The default\n'auto' option makes MACS calculate the maximum tags at the exact same\nlocation based on binomal distribution using 1e-5 as pvalue cutoff;\nand the 'all' option keeps every tags.  If an integer is given, at\nmost this number of tags will be kept at the same location. Default:\nauto\n\n** --broad              \n\nWhen this flag is on, MACS will try to composite broad regions in\nBED12 ( a gene-model-like format ) by putting nearby highly enriched\nregions into a broad region with loose cutoff. The broad region is\ncontrolled by another cutoff through --broad-cutoff. The maximum\nlength of broad region length is 4 times of d from MACS. DEFAULT:\nFalse\n\n** --broad-cutoff\n\nCutoff for broad region. This option is not available unless --broad\nis set. If -p is set, this is a pvalue cutoff, otherwise, it's a\nqvalue cutoff.  DEFAULT: 0.1\n\n** --to-large\n\nWhen set, linearly scale the smaller dataset to the same depth as\nlarger dataset, by default, the smaller dataset will be scaled towards\nthe larger dataset. Beware, to scale up small data would cause more\nfalse positives.\n\n** --down-sample\n\nWhen set, random sampling method will scale down the bigger sample. By\ndefault, MACS uses linear scaling. This option will make the results\nunstable and irreproducible since each time, random reads would be\nselected, especially the numbers (pileup, pvalue, qvalue) would\nchange. Consider to use 'randsample' script before MACS2 runs instead.\n\n** -B/--bdg\n\nIf this flag is on, MACS will store the fragment pileup, control\nlambda, -log10pvalue and -log10qvalue scores in bedGraph files. The\nbedGraph files will be stored in current directory named\nNAME+'_treat_pileup.bdg' for treatment data,\nNAME+'_control_lambda.bdg' for local lambda values from control,\nNAME+'_treat_pvalue.bdg' for Poisson pvalue scores (in -log10(pvalue)\nform), and NAME+'_treat_qvalue.bdg' for q-value scores from\nBenjamini–Hochberg–Yekutieli procedure\n<http://en.wikipedia.org/wiki/False_discovery_rate#Dependent_tests>\n\n** --half-ext (experimental option)\n\nWhen this flag is on, MACS will only extend each tag with 1/2 d\n(predicted ChIP fragment size) instead of full d. \n\n** -w/--wig is obsolete.\n\n** -S/--single-profile is obsolete.\n\n** --space=SPACE is obsolete since we don't generate wiggle file.\n\n** --call-subpeaks is currently not functional.\n\nIf set, MACS will invoke Mali Salmon's PeakSplitter software through\nsystem call. If PeakSplitter can't be found, an instruction will be\nshown for downloading and installing the PeakSplitter package. The\nPeakSplitter can refine the MACS peaks and split the wide peaks into\nsmaller subpeaks. For more information, please check the following URL:\n\nhttp://www.ebi.ac.uk/bertone/software/PeakSplitter_Cpp_usage.txt\n\nNote this option doesn't work if -B/--bdg is on.\n\n*** --verbose\n\nIf you don't want to see any message during the running of MACS, set\nit to 0. But the CRITICAL messages will never be hidden. If you want\nto see rich information like how many peaks are called for every\nchromosome, you can set it to 3 or larger than 3.\n\n** --diag is currently not functional.\n\nA diagnosis report can be generated through this option. This report\ncan help you get an assumption about the sequencing saturation. This\nfuntion is only in beta stage.\n\n** --fe-min, --fe-max & --fe-step are currently not functional.\n\nFor diagnostics, FEMIN and FEMAX are the minimum and maximum fold\nenrichment to consider, and FESTEP is the interval of fold\nenrichment. For example, \"--fe-min 0 --fe-max 40 --fe-step 10\" will\nlet MACS choose the following fold enrichment ranges to consider:\n[0,10), [10,20), [20,30) and [30,40).\n\n* Output files\n\n 1. NAME_peaks.xls is a tabular file which contains information about\n called peaks. You can open it in excel and sort/filter using excel\n functions. Information include: chromosome name, start position of\n peak, end position of peak, length of peak region, absolute peak\n summit position, pileup height at peak summit, -log10(pvalue) for the\n peak summit (e.g. pvalue =1e-10, then this value should be 10), fold\n enrichment for this peak summit against random Poisson distribution\n with local lambda, -log10(qvalue) at peak summit. Coordinates in XLS\n is 1-based which is different with BED format.\n\n 2. NAME_peaks.bed is BED format file which contains the peak\n locations. You can load it to UCSC genome browser or Affymetrix IGB\n software. The file can be loaded directly to UCSC genome\n browser. Remove the beginning track line if you want to analyze it by\n other tools.\n\n 3. NAME_peaks.encodePeak is BED6+4 format file which contains the\n peak locations together with peak summit, pvalue and qvalue. You can\n load it to UCSC genome browser. Definition of some specific columns\n are: 5th: -log10pvalue*10, 7th: fold-change, 8th: -log10pvalue, 9th:\n -log10qvalue, 10th: relative summit position to peak start. The file\n can be loaded directly to UCSC genome browser. Remove the beginning\n track line if you want to analyze it by other tools.\n\n 4. NAME_summits.bed is in BED format, which contains the peak summits\n locations for every peaks. The 5th column in this file is\n -log10pvalue the same as NAME_peaks.bed. If you want to find the\n motifs at the binding sites, this file is recommended. The file can\n be loaded directly to UCSC genome browser. Remove the beginning track\n line if you want to analyze it by other tools.\n\n 5. NAME_broad_peaks.bed is in BED12 format which contains both the\n broad region and narrow peaks. The 5th column is 100*-log10pvalue, to\n be more compatible to UCSC standard. Tht 7th is the start of the\n first narrow peak in the region, and the 8th column is the end. The\n 9th column should be RGB color key, however, we keep 0 here to use\n the default color, so change it if you want. The 10th column tells\n how many blocks including the starting 1bp and ending 1bp of broad\n regions. The 11th column shows the length of each blocks, and 12th\n for the starts of each blocks. The file can be loaded directly to\n UCSC genome browser. Remove the beginning track line if you want to\n analyze it by other tools.\n\n 6. NAME_model.r is an R script which you can use to produce a PDF\n image about the model based on your data. Load it to R by:\n\n$ R --vanilla < NAME_model.r\n\nThen a pdf file NAME_model.pdf will be generated in your current\ndirectory. Note, R is required to draw this figure.\n\n 7. The .bdg files are in bedGraph format which can be imported to\n UCSC genome browser or be converted into even smaller bigWig\n files. Four kinds of bdg files include treat_pileup, control_lambda,\n treat_pvalue, and treat_qvalue. \n\n 8. NAME_pqtable.txt store the -log10pvalue, -log10qvalue, rank of\n  this pvalue, and number of bp having this pvalue.\n\n* Usage of macs2diff\n\nWill update it later...\n\n* Other useful links\n\nCistrome web server for ChIP-chip/seq analysis: http://cistrome.org/ap/\n\nbedTools -- a super useful toolkits for genome annotation files: http://code.google.com/p/bedtools/\n\nUCSC toolkits: http://hgdownload.cse.ucsc.edu/admin/exe/\n\n* Tips of fine-tuning peak calling\n\nCheck the three scripts within MACSv2 package:\n\n 1. bdgcmp can be used on *_treat_pileup.bdg and *_control_lambda.bdg\n or bedGraph files from other resources to calculate score track;\n\n 2. bdgpeakcall can be used on *_treat_pvalue.bdg or the file\n generated from bdgcmp or bedGraph file from other resources to call\n peaks with given cutoff, maximum-gap between nearby mergable peaks\n and minimum length of peak. bdgbroadcall works similarly to\n bdgpeakcall, however it will output _broad_peaks.bed in BED12 format.\n\n 3. Differential calling tool -- bdgdiff, can be used on 4 bedgraph\n files which are scores between treatment 1 and control 1, treatment 2\n and control 2, treatment 1 and treatment 2, treatment 2 and treatment\n 1. It will output the consistent and unique sites according to\n parameter settings for minimum length, maximum gap and cutoff.\n",
    "description_content_type": null,
    "docs_url": null,
    "download_url": "UNKNOWN",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "http://github.com/taoliu/MACS/",
    "keywords": null,
    "license": "UNKNOWN",
    "maintainer": null,
    "maintainer_email": null,
    "name": "MACS2",
    "package_url": "https://pypi.org/project/MACS2/",
    "platform": "UNKNOWN",
    "project_url": "https://pypi.org/project/MACS2/",
    "project_urls": {
      "Download": "UNKNOWN",
      "Homepage": "http://github.com/taoliu/MACS/"
    },
    "release_url": "https://pypi.org/project/MACS2/2.0.10.07132012/",
    "requires_dist": null,
    "requires_python": null,
    "summary": "Model Based Analysis for ChIP-Seq data",
    "version": "2.0.10.07132012",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 7002241,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "5c3db5f84a98527a4c781c4d6c35c5fede1fc56822f72ce18d216f961cf38970",
        "md5": "7cec7f629b3633ff2cf221a2feeb153a",
        "sha256": "9c7c004c63e5a3c272ad25df34dcdecdc9991d02ad363910f2f4310bd5091f89"
      },
      "downloads": -1,
      "filename": "MACS2-2.0.10.07132012.tar.gz",
      "has_sig": true,
      "md5_digest": "7cec7f629b3633ff2cf221a2feeb153a",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 1295440,
      "upload_time": "2012-07-13T15:46:00",
      "upload_time_iso_8601": "2012-07-13T15:46:00.557898Z",
      "url": "https://files.pythonhosted.org/packages/5c/3d/b5f84a98527a4c781c4d6c35c5fede1fc56822f72ce18d216f961cf38970/MACS2-2.0.10.07132012.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}