{
  "info": {
    "author": "Tao Liu",
    "author_email": "vladimir.liu@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 4 - Beta",
      "Environment :: Console",
      "Intended Audience :: Developers",
      "Intended Audience :: Science/Research",
      "License :: OSI Approved :: BSD License",
      "Operating System :: MacOS :: MacOS X",
      "Operating System :: POSIX",
      "Programming Language :: Python",
      "Topic :: Scientific/Engineering :: Bio-Informatics"
    ],
    "description": "========================\nREADME for MACS (2.1.0)\n========================\nTime-stamp: <2014-06-17 16:58:37 Tao Liu>\n\nIntroduction\n============\n\nWith the improvement of sequencing techniques, chromatin\nimmunoprecipitation followed by high throughput sequencing (ChIP-Seq)\nis getting popular to study genome-wide protein-DNA interactions. To\naddress the lack of powerful ChIP-Seq analysis method, we present a\nnovel algorithm, named Model-based Analysis of ChIP-Seq (MACS), for\nidentifying transcript factor binding sites. MACS captures the\ninfluence of genome complexity to evaluate the significance of\nenriched ChIP regions, and MACS improves the spatial resolution of\nbinding sites through combining the information of both sequencing tag\nposition and orientation. MACS can be easily used for ChIP-Seq data\nalone, or with control sample with the increase of specificity.\n\nInstall\n=======\n\nPlease check the file 'INSTALL' in the distribution.\n\nUsage of MACS2\n==============\n\n::\n\n  macs2 [-h] [--version]\n             {callpeak,filterdup,bdgpeakcall,bdgcmp,randsample,bdgdiff,bdgbroadcall}\n\n:Example for regular peak calling: ``macs2 callpeak -t ChIP.bam -c Control.bam -f BAM -g hs -n test -B -q 0.01``\n\n:Example for broad peak calling: ``macs2 -t ChIP.bam -c Control.bam --broad -g hs``\n\nThere are seven major functions available in MACS serving as sub-commands.\n\n:callpeak:            Main MACS2 Function to `Call peaks`_ from alignment results.\n:bdgpeakcall:         Call peaks from bedGraph output.\n:bdgbroadcall:        Call broad peaks from bedGraph output.\n:bdgcmp:              Deduct noise by comparing two signal tracks in bedGraph.\n:bdgdiff:             Differential peak detection based on paired four bedgraph files.\n:diffpeak:            Another differential peak detection based on paired four bedgraph files, with more statistics.\n:filterdup:           Remove duplicate reads at the same position, then convert acceptable format to BED format.\n:predictd:            Predict d or fragment size from alignment results.\n:pileup:              Pileup aligned reads with a given extension\n                      size (fragment size or d in MACS language). Note there will be no\n                      step for duplicate reads filtering or sequencing depth scaling, so you may need to do certain post-\n                      processing.\n:randsample:          Randomly sample number/percentage of total reads.\n:refinepeak:          (Experimental) Take raw reads alignment, refine peak\n                          summits and give scores measuring balance of forward-\n                          backward tags. Inspired by SPP.\n\n\nWe only cover 'callpeak' module in this document. Please use 'macs2\nCOMMAND -h' to see the detail description for each option of each\nmodule.\n\nCall peaks\n~~~~~~~~~~\n\nThis is the main function in MACS2. It can be invoked by 'macs2\ncallpeak' command. If you type this command without parameters, you\nwill see a full description of commandline options. Here we only list\ncommonly used ones.\n\nOptions\n--------------\n\n-t/--treatment FILENAME\n```````````````````````\n\nThis is the only REQUIRED parameter for MACS. File can be in any\nsupported format specified by --format option. Check --format for\ndetail. If you have more than one alignment files, you can specify\nthem as ```-t A B C```. MACS will pool up all these files together.\n\n-c/--control\n````````````\n\nThe control or mock data file. Please follow the same direction as for\n-t/--treatment.\n\n-n/--name\n`````````\n\nThe name string of the experiment. MACS will use this string NAME to\ncreate output files like 'NAME_peaks.xls', 'NAME_negative_peaks.xls',\n'NAME_peaks.bed' , 'NAME_summits.bed', 'NAME_model.r' and so on. So\nplease avoid any confliction between these filenames and your\nexisting files.\n\n--outdir\n````````\n\nMACS2 will save all output files into speficied folder for this\noption.\n\n-f/--format FORMAT\n``````````````````\n\nFormat of tag file, can be \"ELAND\", \"BED\", \"ELANDMULTI\",\n\"ELANDEXPORT\", \"ELANDMULTIPET\" (for pair-end tags), \"SAM\", \"BAM\",\n\"BOWTIE\" or \"BAMPE\". Default is \"AUTO\" which will allow MACS to decide\nthe format automatically. \"AUTO\" is also usefule when you combine\ndifferent formats of files.\n\nThe BED format can be found at `UCSC genome browser website <http://genome.ucsc.edu/FAQ/FAQformat#format1>`_.\n\nIf the format is ELAND, the file must be ELAND result output file,\neach line MUST represents only ONE tag, with fields of:\n\n1. Sequence name (derived from file name and line number if format is not Fasta)\n2. Sequence\n3. Type of match:\n\n:NM: no match found.\n:QC: no matching done: QC failure (too many Ns basically).\n:RM: no matching done: repeat masked (may be seen if repeatFile.txt was specified).\n:U0: Best match found was a unique exact match.\n:U1: Best match found was a unique 1-error match. \n:U2: Best match found was a unique 2-error match. \n:R0: Multiple exact matches found.\n:R1: Multiple 1-error matches found, no exact matches.\n:R2: Multiple 2-error matches found, no exact or 1-error matches.\n\n4. Number of exact matches found.\n5. Number of 1-error matches found.\n6. Number of 2-error matches found.  \n   Rest of fields are only seen if a unique best match was found\n   (i.e. the match code in field 3 begins with \"U\").\n7. Genome file in which match was found.\n8. Position of match (bases in file are numbered starting at 1).\n9. Direction of match (F=forward strand, R=reverse).\n10. How N characters in read were interpreted: (\".\"=not applicable,\n    \"D\"=deletion, \"I\"=insertion). Rest of fields are only seen in\n    the case of a unique inexact match (i.e. the match code was U1 or\n    U2).\n11. Position and type of first substitution error (e.g. 12A: base 12\n    was A, not whatever is was in read).\n12. Position and type of first substitution error, as above. \n\nIf the format is ELANDMULTI, the file must be ELAND output file from\nmultiple-match mode, each line MUST represents only ONE tag, with\nfields of:\n\n1. Sequence name \n2. Sequence \n3. Either NM, QC, RM (as described above) or the following: \n4. x:y:z where x, y, and z are the number of exact, single-error, and 2-error matches found\n5. Blank, if no matches found or if too many matches found, or the following:\n   BAC_plus_vector.fa:163022R1,170128F2,E_coli.fa:3909847R1 This says\n   there are two matches to BAC_plus_vector.fa: one in the reverse\n   direction starting at position 160322 with one error, one in the\n   forward direction starting at position 170128 with two\n   errors. There is also a single-error match to E_coli.fa.\n\nIf the format is BAM/SAM, please check the definition in\n(http://samtools.sourceforge.net/samtools.shtml).  Pair-end mapping\nresults can be saved in a single BAM file, if so, MACS will\nautomatically keep the left mate(5' end) tag. However, when format\nBAMPE is specified, MACS will use the real fragments inferred from\nalignment results for reads pileup.\n\nIf the format is BOWTIE, you need to provide the ASCII bowtie output\nfile with the suffix '.map'. Please note that, you need to make sure\nthat in the bowtie output, you only keep one location for one\nread. Check the bowtie manual for detail if you want at\n(http://bowtie-bio.sourceforge.net/manual.shtml)\n\nHere is the definition for Bowtie output in ASCII characters I copied\nfrom the above webpage:\n\n1. Name of read that aligned\n2. Orientation of read in the alignment, '-' for reverse complement, '+'\n   otherwise\n3. Name of reference sequence where alignment occurs, or ordinal ID\n   if no name was provided\n4. 0-based offset into the forward reference strand where leftmost\n   character of the alignment occurs\n5. Read sequence (reverse-complemented if orientation is -)\n6. ASCII-encoded read qualities (reversed if orientation is -). The\n   encoded quality values are on the Phred scale and the encoding is\n   ASCII-offset by 33 (ASCII char !).\n7. Number of other instances where the same read aligns against the\n   same reference characters as were aligned against in this\n   alignment. This is not the number of other places the read aligns\n   with the same number of mismatches. The number in this column is\n   generally not a good proxy for that number (e.g., the number in\n   this column may be '0' while the number of other alignments with\n   the same number of mismatches might be large). This column was\n   previously described as \"Reserved\".\n8. Comma-separated list of mismatch descriptors. If there are no\n   mismatches in the alignment, this field is empty. A single\n   descriptor has the format offset:reference-base>read-base. The\n   offset is expressed as a 0-based offset from the high-quality (5')\n   end of the read.\n\nNotes:\n\n1) For BED format, the 6th column of strand information is required by\nMACS. And please pay attention that the coordinates in BED format is\nzero-based and half-open\n(http://genome.ucsc.edu/FAQ/FAQtracks#tracks1).\n\n2) For plain ELAND format, only matches with match type U0, U1 or U2\nis accepted by MACS, i.e. only the unique match for a sequence with\nless than 3 errors is involed in calculation. If multiple hits of a\nsingle tag are included in your raw ELAND file, please remove the\nredundancy to keep the best hit for that sequencing tag.\n\n3) For the experiment with several replicates, it is recommended to\nconcatenate several ChIP-seq treatment files into a single file. To\ndo this, under Unix/Mac or Cygwin (for windows OS), type:\n\n```$ cat replicate1.bed replicate2.bed replicate3.bed > all_replicates.bed```\n\nFor BAM or SAM files, samtools can be used to combine replicates.\n\n4) ELAND export format support sometimes may not work on your\ndatasets, because people may mislabel the 11th and 12th column. MACS\nuses 11th column as the sequence name which should be the chromosome\nnames.\n\n5) A special mode will be triggered while format is specified as\n'BAMPE'. In this way, MACS2 will process the BAM files as paired-end\ndata. Instead of building bimodal distribution of plus and minus\nstrand reads to predict fragment size, MACS2 now will use actual\ninsert sizes of pairs of reads to build fragment pileup. \n\n\n-g/--gsize\n``````````\n\nPLEASE assign this parameter to fit your needs!\n\nIt's the mappable genome size or effective genome size which is\ndefined as the genome size which can be sequenced. Because of the\nrepetitive features on the chromsomes, the actual mappable genome size\nwill be smaller than the original size, about 90% or 70% of the genome\nsize. The default hs -- 2.7e9 is recommended for UCSC human hg18\nassembly. Here are all precompiled parameters for effective genome\nsize:\n\n:hs: 2.7e9\n:mm: 1.87e9\n:ce: 9e7\n:dm: 1.2e8\n\n-s/--tsize\n``````````\n\nThe size of sequencing tags. If you don't specify it, MACS will try to\nuse the first 10 sequences from your input treatment file to determine\nthe tag size. Specifying it will override the automatically determined\ntag size.\n\n--bw\n````\n\nThe band width which is used to scan the genome ONLY for model\nbuilding. You can set this parameter as the sonication fragment size\nexpected from wet experiment. The previous side effect on the peak\ndetection process has been removed. So this parameter only affects the\nmodel building.\n\n-q/--qvalue\n```````````\n\nThe qvalue (minimum FDR) cutoff to call significant regions. Default\nis 0.01. For broad marks, you can try 0.05 as cutoff. Q-values are\ncalculated from p-values using Benjamini-Hochberg procedure.\n\n-p/--pvalue\n```````````\n\nThe pvalue cutoff. If -p is specified, MACS2 will use pvalue instead\nof qvalue.\n\n-m/--mfold\n``````````\n\nThis parameter is used to select the regions within MFOLD range of\nhigh-confidence enrichment ratio against background to build\nmodel. The regions must be lower than upper limit, and higher than\nthe lower limit of fold enrichment. DEFAULT:10,30 means using all\nregions not too low (>10) and not too high (<30) to build\npaired-peaks model. If MACS can not find more than 100 regions to\nbuild model, it will use the --extsize parameter to continue the\npeak detection ONLY if --fix-bimodal is set.\n\n\n--nolambda\n``````````\n\nWith this flag on, MACS will use the background lambda as local\nlambda. This means MACS will not consider the local bias at peak\ncandidate regions.\n\n--slocal, --llocal\n``````````````````\n\nThese two parameters control which two levels of regions will be\nchecked around the peak regions to calculate the maximum lambda as\nlocal lambda. By default, MACS considers 1000bp for small local\nregion(--slocal), and 10000bps for large local region(--llocal) which\ncaptures the bias from a long range effect like an open chromatin\ndomain. You can tweak these according to your project. Remember that\nif the region is set too small, a sharp spike in the input data may\nkill the significant peak.\n\n--fix-bimodal\n`````````````\n\nWhether turn on the auto paired-peak model process. If it's set, when\nMACS failed to build paired model, it will use the nomodel settings,\nthe '--extsize' parameter to extend each tags. If set, MACS will be\nterminated if paried-peak model is failed.\n\n--nomodel\n`````````\n\nWhile on, MACS will bypass building the shifting model.\n\n--extsize\n`````````\n\nWhile '--nomodel' is set, MACS uses this parameter to extend reads in\n5'->3' direction to fix-sized fragments. For example, if the size of\nbinding region for your transcription factor is 200 bp, and you want\nto bypass the model building by MACS, this parameter can be set\nas 200. This option is only valid when --nomodel is set or when MACS\nfails to build model and --fix-bimodal is on.\n\n--shift\n```````\n\nNote, this is NOT the legacy --shiftsize option which is replaced by\n--extsize! You can set an arbitrary shift in bp here. Please Use\ndiscretion while setting it other than default value (0). When\n--nomodel is set, MACS will use this value to move cutting ends (5')\nthen apply --extsize from 5' to 3' direction to extend them to\nfragments. When this value is negative, ends will be moved toward\n3'->5' direction, otherwise 5'->3' direction. Recommended to keep it\nas default 0 for ChIP-Seq datasets, or -1 * half of EXTSIZE together\nwith --extsize option for detecting enriched cutting loci such as\ncertain DNAseI-Seq datasets. Note, you can't set values other than 0\nif format is BAMPE for paired-end data. Default is 0.\n\nHere are some examples for combining --shift and --extsize:\n\n1. To find enriched cutting sites such as some DNAse-Seq datasets. In\nthis case, all 5' ends of sequenced reads should be extended in both\ndirection to smooth the pileup signals. If the wanted smoothing window\nis 200bps, then use '--nomodel --shift -100 --extsize 200'.\n\n2. For certain nucleosome-seq data, we need to pileup the centers of\nnucleosomes using a half-nucleosome size for wavelet analysis\n(e.g. NPS algorithm). Since the DNA wrapped on nucleosome is about\n147bps, this option can be used: '--nomodel --shift 37 --extsize 73'.\n\n--keep-dup\n``````````\n\nIt controls the MACS behavior towards duplicate tags at the exact same\nlocation -- the same coordination and the same strand. The default\n'auto' option makes MACS calculate the maximum tags at the exact same\nlocation based on binomal distribution using 1e-5 as pvalue cutoff;\nand the 'all' option keeps every tags.  If an integer is given, at\nmost this number of tags will be kept at the same location. The\ndefault is to keep one tag at the same location. Default: 1\n\n--broad\n```````\n\nWhen this flag is on, MACS will try to composite broad regions in\nBED12 ( a gene-model-like format ) by putting nearby highly enriched\nregions into a broad region with loose cutoff. The broad region is\ncontrolled by another cutoff through --broad-cutoff. The maximum\nlength of broad region length is 4 times of d from MACS. DEFAULT:\nFalse\n\n--broad-cutoff\n``````````````\n\nCutoff for broad region. This option is not available unless --broad\nis set. If -p is set, this is a pvalue cutoff, otherwise, it's a\nqvalue cutoff.  DEFAULT: 0.1\n\n--to-large\n``````````\n\nWhen set, linearly scale the smaller dataset to the same depth as\nlarger dataset, by default, the smaller dataset will be scaled\ntowards the larger dataset. Beware, to scale up small data would\ncause more false positives.\n\n--down-sample\n`````````````\n\nWhen set, random sampling method will scale down the bigger\nsample. By default, MACS uses linear scaling. This option will make\nthe results unstable and irreproducible since each time, random reads\nwould be selected, especially the numbers (pileup, pvalue, qvalue)\nwould change. Consider to use 'randsample' script before MACS2 runs\ninstead.\n\n-B/--bdg\n````````\n\nIf this flag is on, MACS will store the fragment pileup, control\nlambda, -log10pvalue and -log10qvalue scores in bedGraph files. The\nbedGraph files will be stored in current directory named\nNAME+'_treat_pileup.bdg' for treatment data,\nNAME+'_control_lambda.bdg' for local lambda values from control,\nNAME+'_treat_pvalue.bdg' for Poisson pvalue scores (in -log10(pvalue)\nform), and NAME+'_treat_qvalue.bdg' for q-value scores from\nBenjamini–Hochberg–Yekutieli procedure\n<http://en.wikipedia.org/wiki/False_discovery_rate#Dependent_tests>\n\n--call-summits\n``````````````\n\nMACS will now reanalyze the shape of signal profile (p or q-score\ndepending on cutoff setting) to deconvolve subpeaks within each peak\ncalled from general procedure. It's highly recommended to detect\nadjacent binding events. While used, the output subpeaks of a big\npeak region will have the same peak boundaries, and different scores\nand peak summit positions.\n\n--verbose\n`````````\n\nIf you don't want to see any message during the running of MACS, set\nit to 0. But the CRITICAL messages will never be hidden. If you want\nto see rich information like how many peaks are called for every\nchromosome, you can set it to 3 or larger than 3.\n\nOutput files\n~~~~~~~~~~~~\n\n1. NAME_peaks.xls is a tabular file which contains information about\n   called peaks. You can open it in excel and sort/filter using excel\n   functions. Information include: chromosome name, start position of\n   peak, end position of peak, length of peak region, absolute peak\n   summit position, pileup height at peak summit, -log10(pvalue) for\n   the peak summit (e.g. pvalue =1e-10, then this value should be\n   10), fold enrichment for this peak summit against random Poisson\n   distribution with local lambda, -log10(qvalue) at peak\n   summit. Coordinates in XLS is 1-based which is different with BED\n   format.\n\n2. NAME_peaks.narrowPeak is BED6+4 format file which contains the\n   peak locations together with peak summit, pvalue and qvalue. You\n   can load it to UCSC genome browser. Definition of some specific\n   columns are: 5th: integer score for display, 7th: fold-change,\n   8th: -log10pvalue, 9th: -log10qvalue, 10th: relative summit\n   position to peak start. The file can be loaded directly to UCSC\n   genome browser. Remove the beginning track line if you want to\n   analyze it by other tools.\n\n3. NAME_summits.bed is in BED format, which contains the peak summits\n   locations for every peaks. The 5th column in this file is\n   -log10pvalue the same as NAME_peaks.bed. If you want to find the\n   motifs at the binding sites, this file is recommended. The file\n   can be loaded directly to UCSC genome browser. Remove the\n   beginning track line if you want to analyze it by other tools.\n\n4. NAME_peaks.broadPeak is in BED6+3 format which is similar to\n   narrowPeak file, except for missing the 10th column for annotating\n   peak summits.\n\n4. NAME_peaks.gappedPeak is in BED12+3 format which contains both the\n   broad region and narrow peaks. The 5th column is 10*-log10qvalue,\n   to be more compatible to show grey levels on UCSC browser. Tht 7th\n   is the start of the first narrow peak in the region, and the 8th\n   column is the end. The 9th column should be RGB color key, however,\n   we keep 0 here to use the default color, so change it if you\n   want. The 10th column tells how many blocks including the starting\n   1bp and ending 1bp of broad regions. The 11th column shows the\n   length of each blocks, and 12th for the starts of each blocks. 13th:\n   fold-change, 14th: -log10pvalue, 15th: -log10qvalue. The file can be\n   loaded directly to UCSC genome browser. \n\n5. NAME_model.r is an R script which you can use to produce a PDF\n   image about the model based on your data. Load it to R by:\n\n   ```$ Rscript NAME_model.r```\n\n   Then a pdf file NAME_model.pdf will be generated in your current\n   directory. Note, R is required to draw this figure.\n\n6. The .bdg files are in bedGraph format which can be imported to\n   UCSC genome browser or be converted into even smaller bigWig\n   files. There are two kinds of bdg files: treat_pileup, and\n   control_lambda.\n\nOther useful links\n==================\n\n:Cistrome: http://cistrome.org/ap/\n:bedTools: http://code.google.com/p/bedtools/\n:UCSC toolkits: http://hgdownload.cse.ucsc.edu/admin/exe/\n\nTips of fine-tuning peak calling\n================================\n\nCheck the three scripts within MACSv2 package:\n\n1. bdgcmp can be used on ```*_treat_pileup.bdg``` and\n   ```*_control_lambda.bdg``` or bedGraph files from other resources\n   to calculate score track.\n\n2. bdgpeakcall can be used on ```*_treat_pvalue.bdg``` or the file\n   generated from bdgcmp or bedGraph file from other resources to\n   call peaks with given cutoff, maximum-gap between nearby mergable\n   peaks and minimum length of peak. bdgbroadcall works similarly to\n   bdgpeakcall, however it will output _broad_peaks.bed in BED12\n   format.\n\n3. Differential calling tool -- bdgdiff, can be used on 4 bedgraph\n   files which are scores between treatment 1 and control 1,\n   treatment 2 and control 2, treatment 1 and treatment 2, treatment\n   2 and treatment 1. It will output the consistent and unique sites\n   according to parameter settings for minimum length, maximum gap\n   and cutoff.\n",
    "description_content_type": null,
    "docs_url": null,
    "download_url": "UNKNOWN",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "http://github.com/taoliu/MACS/",
    "keywords": null,
    "license": "UNKNOWN",
    "maintainer": null,
    "maintainer_email": null,
    "name": "MACS2",
    "package_url": "https://pypi.org/project/MACS2/",
    "platform": "UNKNOWN",
    "project_url": "https://pypi.org/project/MACS2/",
    "project_urls": {
      "Download": "UNKNOWN",
      "Homepage": "http://github.com/taoliu/MACS/"
    },
    "release_url": "https://pypi.org/project/MACS2/2.1.0.20140616/",
    "requires_dist": null,
    "requires_python": null,
    "summary": "Model Based Analysis for ChIP-Seq data",
    "version": "2.1.0.20140616",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 7002241,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "1995b29a5a5c2d367d0224d500d99272e81f88beb32519f55f0bfe6bf214c59e",
        "md5": "ad105b9ad25bc2eedc78c38d54cf76e8",
        "sha256": "c68a58d3cb6861d7535feee591819853e43c1d252f15abcbb11ce2ad0c8f9586"
      },
      "downloads": -1,
      "filename": "MACS2-2.1.0.20140616.tar.gz",
      "has_sig": true,
      "md5_digest": "ad105b9ad25bc2eedc78c38d54cf76e8",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 1463830,
      "upload_time": "2014-06-17T21:10:58",
      "upload_time_iso_8601": "2014-06-17T21:10:58.484475Z",
      "url": "https://files.pythonhosted.org/packages/19/95/b29a5a5c2d367d0224d500d99272e81f88beb32519f55f0bfe6bf214c59e/MACS2-2.1.0.20140616.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}