{
  "info": {
    "author": "Devora Witty",
    "author_email": "devorawitty@chelem.co.il",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "Academic License Agreement\n\nThe D+ software (\"Software\") has been developed by the contributing researchers from the group of Prof. Uri Raviv, (\"Developers\") of the Hebrew University of Jerusalem (\"HUJ\") and made available through HUJ for your internal, non-profit research use.\n\nHUJ and the Developers allow researchers at your institution to run, display, copy and modify Software on the following conditions:\n\nThe Software remains at your institution and is not published, distributed, or otherwise transferred or made available to other than institution employees and students involved in research under your supervision.\n\nYou agree to make results generated using Software available to other academic researchers for non-profit research purposes. If you wish to obtain Software for any commercial purposes, including fee-based service projects, you will need to execute a separate licensing agreement with Yissum Research Development Company of the Hebrew University of Jerusalem Ltd. and pay a fee. In that case, please contact: uri.raviv@mail.huji.ac.il or info@yissum.co.il.\n\nYou retain in Software and any modifications to Software, the copyright, trademark, or other notices pertaining to Software as provided by HUJ and the Developers.\n\nYou provide the Developers with feedback on the use of the Software in your research, and that the Developers and HUJ are permitted to use any information you provide in making changes to the Software. All bug reports and technical questions shall be sent to the email address: uri.raviv@mail.huji.ac.il.\n\nYou acknowledge that the Developers, HUJ and its licensees may develop modifications to the Software that may be substantially similar to your modifications of the Software, and that the Developers, HUJ and its licensees shall not be constrained in any way by you in Developer's, HUJ's or its licensees' use or management of such modifications. You acknowledge the right of the Developers and HUJ to prepare and publish modifications to the Software that may be substantially similar or functionally equivalent to your modifications and improvements, and if you obtain patent protection for any modification or improvement to the Software you agree not to allege infringement of your patent by the Developers, HUJ or by any of HUJ's or Yissum's licensees obtaining and using modifications or improvements to the Software from HUJ or the Developers or attempt to enjoin the use of such modifications or improvements to the Software.\n\nYou agree to acknowledge the contribution Developers and the Software make to your research, and cite appropriate references about the Software in your publications. In particular, please cite the paper: Ginsburg A, Ben-Nun T, Asor R, Shemesh A, Ringel I, Raviv U. Reciprocal grids: a hierarchical algorithm for computing solution x-ray scattering curves from supramolecular complexes at high resolution. Journal of chemical information and modeling. 2016; 56 (8) :1518-1527.\n\nYou and your institution assume all risk associated with using the Software at your institution. The Software is experimental in nature and is made available as a research courtesy \"AS IS,\" without obligation by HUJ or the Developers to provide accompanying services or support.\n\nHUJ AND THE DEVELOPERS EXPRESSLY DISCLAIM ANY AND ALL WARRANTIES REGARDING THE SOFTWARE, WHETHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO WARRANTIES PERTAINING TO NON-INFRINGEMENT, MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.\n\n\nCustomer Service\nFor any questions, please contact Prof. Uri Raviv\nPhone: +972-2-6586030\nEmail: uri.raviv@mail.huji.ac.il\n\n\nDescription: UNKNOWN\nPlatform: UNKNOWN\nClassifier: Development Status :: 4 - Beta\nClassifier: Environment :: Console\nClassifier: Intended Audience :: Science/Research\nClassifier: License :: Other/Proprietary License\nClassifier: Operating System :: OS Independent\nClassifier: Programming Language :: Python\nClassifier: Programming Language :: Python :: 3.4\nClassifier: Topic :: Scientific/Engineering :: Chemistry\n",
    "description_content_type": "",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://scholars.huji.ac.il/uriraviv",
    "keywords": "",
    "license": "D+ Software",
    "maintainer": "",
    "maintainer_email": "",
    "name": "dplus-api",
    "package_url": "https://pypi.org/project/dplus-api/",
    "platform": "",
    "project_url": "https://pypi.org/project/dplus-api/",
    "project_urls": {
      "Homepage": "https://scholars.huji.ac.il/uriraviv"
    },
    "release_url": "https://pypi.org/project/dplus-api/4.3.5/",
    "requires_dist": [
      "numpy (>=1.10)",
      "psutil (==5.2.2)",
      "requests (==2.10.0)"
    ],
    "requires_python": "",
    "summary": "Call the DPlus Calculation Backend",
    "version": "4.3.5",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 14530274,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "e4d32dd6fc7aa7ae1ec42562266b05f97dff8d096677b4ab63ad7d9c87df5c6e",
        "md5": "39c3e4050756e5af20ca161ef149d36e",
        "sha256": "08950b55d842342bc8c700f8f4ef44c3edfd36b9c00f46c3c42c2b595d0a78f1"
      },
      "downloads": -1,
      "filename": "dplus_api-4.3.5-cp35-cp35m-win_amd64.whl",
      "has_sig": false,
      "md5_digest": "39c3e4050756e5af20ca161ef149d36e",
      "packagetype": "bdist_wheel",
      "python_version": "cp35",
      "requires_python": null,
      "size": 329114,
      "upload_time": "2019-09-10T12:27:02",
      "upload_time_iso_8601": "2019-09-10T12:27:02.384461Z",
      "url": "https://files.pythonhosted.org/packages/e4/d3/2dd6fc7aa7ae1ec42562266b05f97dff8d096677b4ab63ad7d9c87df5c6e/dplus_api-4.3.5-cp35-cp35m-win_amd64.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "9751f4b99d739dc1e23fb0d406550a6ce68c1c7fc870e7c28542f8a75aea432a",
        "md5": "97a4fcf332a78ca90d9e6ed592c5fa10",
        "sha256": "eb8784fe81b19b5e1bc2a3b46ac58b1e9c78fa2268b3fed778111d3624b25e46"
      },
      "downloads": -1,
      "filename": "dplus-api-4.3.5.tar.gz",
      "has_sig": false,
      "md5_digest": "97a4fcf332a78ca90d9e6ed592c5fa10",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 971769,
      "upload_time": "2019-09-10T12:27:07",
      "upload_time_iso_8601": "2019-09-10T12:27:07.611670Z",
      "url": "https://files.pythonhosted.org/packages/97/51/f4b99d739dc1e23fb0d406550a6ce68c1c7fc870e7c28542f8a75aea432a/dplus-api-4.3.5.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}