{
  "info": {
    "author": "Bruce Ashfield",
    "author_email": "bruce.ashfield@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: BSD License",
      "Operating System :: POSIX :: Linux",
      "Programming Language :: Python :: 3"
    ],
    "description": "# Overview:\n\nFundamentally, lopper takes an input device tree (normally a system device tree),\napplies operations to that tree, and outputs one or more modified/processed trees.\n\nSee the README-architecture.txt for details on how lopper works. This README file\nhas practical information, known limitations and TODO items.\n\n# config/setup:\n\nLopper is in a single repository, and is available via git or pypi:\n\n### git:\n\n   % git clone git://github.com/devicetree-org/lopper\n\n   Ensure that the prerequisite tools are installed on your host. Lopper is written\n   in python3, and requires that standard support libraries are installed. Current\n   testing has been against python3.5.x, but no issues are expected on newer 3.x\n   releases.\n\n   In addition to the standard libraries, Lopper uses: pcpp (or cpp), dtc and libfdt for\n   processing and manipulating device trees. These tools must be installed and\n   on the PATH.\n\n   **Note:** (python cpp) pcpp is optional (available on PyPi), and if not available cpp\n   will be used for pre-processing input files. If comments are to be maintained\n   through the processing flow, pcpp must be used since it has functionality to\n   not strip them during processing.\n\n   For yaml file processing, lopper has an optional dependency on python's yaml\n   and ruamel as well as anytree for importing the contents of yaml files.\n\n### pypi:\n\n   % pip install lopper\n\n   The pip installation will pull in the required dependencies, and also contains\n   the following optional features:\n\n      - 'server' : enable if the ReST API server is required\n      - 'yaml'   : enable for yaml support\n      - 'dt'     : enable if non-libfdt support is required\n      - 'pcpp'   : enable for enhanced preprocessing functionality\n\n   i.e.:\n\n   % pip install loppper[server,yaml,dt,pcpp]\n\n   **Note:** lopper (via clone or pip) contains a vendored python libfdt (from dtc), since\n   it is not available via a pip dependency. If the vendored versions do not match\n   the python in use, you must manually ensure that libfdt is installed and\n   available.\n\n   If it is not in a standard location, make sure it is on PYTHONPATH:\n\n   % export PYTHONPATH=<path to pylibfdt>:$PYTHONPATH\n\n# Lopper overview:\n\nlopper.py --help\n\n    Usage: lopper.py [OPTION] <system device tree> [<output file>]...\n      -v, --verbose       enable verbose/debug processing (specify more than once for more verbosity)\n      -t, --target        indicate the starting domain for processing (i.e. chosen node or domain label)\n        , --dryrun        run all processing, but don't write any output files\n      -d, --dump          dump a dtb as dts source\n      -i, --input         process supplied input device tree description\n      -a, --assist        load specified python assist (for node or output processing)\n      -A, --assist-paths  colon separated lists of paths to search for assist loading\n        , --enhanced      when writing output files, do enhanced processing (this includes phandle replacement, comments, etc\n        . --auto          automatically run any assists passed via -a\n        , --permissive    do not enforce fully validated properties (phandles, etc)\n      -o, --output        output file\n        , --overlay       Allow input files (dts or yaml) to overlay system device tree nodes\n      -x. --xlate         run automatic translations on nodes for indicated input types (yaml,dts)\n        , --no-libfdt     don't use dtc/libfdt for parsing/compiling device trees\n      -f, --force         force overwrite output file(s)\n        , --werror        treat warnings as errors\n      -S, --save-temps    don't remove temporary files\n        , --cfgfile       specify a lopper configuration file to use (configparser format)\n        , --cfgval        specify a configuration value to use (in configparser section format). Can be specified multiple times\n      -h, --help          display this help and exit\n      -O, --outdir        directory to use for output files\n        , --server        after processing, start a server for ReST API calls\n        , --version       output the version and exit\n\nA few command line notes:\n\n -i <file>: these can be either lop files, or device tree files (system device\n            tree or other). The compatible string in lop files is used to\n            distinguish operation files from device tree files. If passed, multiple\n            device tree files are concatenated before processing.\n\n <output> file: The default output file for the modified system device tree. lopper\n                operations can output more variants as required\n\n**Note:** Since lopper manipulates dtb's (as compiled by dtc), some information\nthat is in the source dts is lost on the output of the final dts. This includes\ncomments, symbolic phandles, formatting of strings, etc. If you are transforming\nto dts files and want to maintain this information, use the --enhanced flag.\nThis flag indicates that lopper should perform pre-processing and output phandle\nmapping to restore both comments, labels and symbolic phandles to the final\noutput.\n\n**Note:** By default Lopper puts pre-processed files (.pp) into the same\ndirectory as the system device tree. This is required, since in some cases when\nthe .pp files and device tree are not in the same directory, dtc cannot resolve\nlabels from include files, and will error. That being said, if the -O option is\nused to specify an output directory, the pre-processed file will be placed\nthere. If we get into a mode where the system device tree's directory is not\nwriteable, or the -O option is breaking symbol resolution, then we'll have to\neither copy everything to the output directory, or look into why dtc can't\nhandle the split directories and include files.\n\n## Sample run:\n\n  % ./lopper.py -f --enhanced --werror -v -v -i lops/lop-load.dts -i lops/lop-domain-r5.dts device-trees/system-device-tree.dts modified-sdt.dts\n\n\n  % python -m lopper -f --enhanced --werror -v -v -i lops/lop-load.dts -i lops/lop-domain-r5.dts device-trees/system-device-tree.dts modified-sdt.dts\n\n## Limitations:\n\n - This is a pre-release, internal interfaces are still subject to change",
    "description_content_type": "text/plain",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/devicetree-org/lopper",
    "keywords": "",
    "license": "BSD",
    "maintainer": "",
    "maintainer_email": "",
    "name": "lopper",
    "package_url": "https://pypi.org/project/lopper/",
    "platform": "",
    "project_url": "https://pypi.org/project/lopper/",
    "project_urls": {
      "Homepage": "https://github.com/devicetree-org/lopper"
    },
    "release_url": "https://pypi.org/project/lopper/1.0/",
    "requires_dist": null,
    "requires_python": ">=3.5",
    "summary": "A devicetree pruner",
    "version": "1.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 14730627,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "288bc1c4096e4353ca9a7678c57e8f91b373201ca49084822e7384da8b5b850f",
        "md5": "458128831f1bac80261b99b2b5519ebe",
        "sha256": "f4a2a7d84bf5c315526dbc77e4bae21075f0fcc264417d16e85d3fd303824691"
      },
      "downloads": -1,
      "filename": "lopper-1.0.tar.gz",
      "has_sig": false,
      "md5_digest": "458128831f1bac80261b99b2b5519ebe",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.5",
      "size": 1029272,
      "upload_time": "2021-11-03T15:25:12",
      "upload_time_iso_8601": "2021-11-03T15:25:12.589309Z",
      "url": "https://files.pythonhosted.org/packages/28/8b/c1c4096e4353ca9a7678c57e8f91b373201ca49084822e7384da8b5b850f/lopper-1.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}