{
  "info": {
    "author": "Roberto Rosario",
    "author_email": "roberto.rosario@mayan-edms.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "Environment :: Web Environment",
      "Framework :: Django",
      "Intended Audience :: Developers",
      "Intended Audience :: Education",
      "Intended Audience :: Information Technology",
      "License :: OSI Approved :: Apache Software License",
      "Natural Language :: English",
      "Programming Language :: Python",
      "Programming Language :: Python :: 2.7",
      "Topic :: Communications :: File Sharing",
      "Topic :: Internet :: WWW/HTTP",
      "Topic :: Internet :: WWW/HTTP :: WSGI :: Application"
    ],
    "description": "|pypi| |builds| |coverage| |python| |license| |docker_pulls| |docker_stars| |docker_layers|\n\n\n.. image:: https://gitlab.com/mayan-edms/mayan-edms/raw/master/docs/_static/mayan_logo.png\n    :align: center\n    :width: 200\n    :height: 200\n\nMayan EDMS is a document management system. Its main purpose is to store,\nintrospect, and categorize files, with a strong emphasis on preserving the\ncontextual and business information of documents. It can also OCR, preview,\nlabel, sign, send, and receive thoses files. Other features of interest\nare its workflow system, role based access control, and REST API.\n\n.. image:: https://gitlab.com/mayan-edms/mayan-edms/raw/master/docs/_static/overview.gif\n    :align: center\n    :width: 300\n\nThe easiest way to use Mayan EDMS is by using the official Docker_ image.\nMake sure Docker is properly installed and working before attempting to install\nMayan EDMS.\n\nFor the complete set of installation instructions visit the Mayan EDMS documentation\nat: https://docs.mayan-edms.com/topics/installation.html\n\n.. _Docker: https://www.docker.com/\n\nHardware requirements\n\n- 2 Gigabytes of RAM (1 Gigabyte if OCR is turned off).\n- Multiple core CPU (64 bit, faster than 1 GHz recommended).\n\n\nImportant links\n\n- `Homepage <http://www.mayan-edms.com>`__\n- `Documentation <https://docs.mayan-edms.com>`__\n- `Wiki <https://wiki.mayan-edms.com>`__\n- `Contributing <https://gitlab.com/mayan-edms/mayan-edms/blob/master/CONTRIBUTING.md>`__\n- `Forum <https://forum.mayan-edms.com>`__\n- `Source code, issues, bugs <https://gitlab.com/mayan-edms/mayan-edms>`__\n- `Plug-ins, other related projects <https://gitlab.com/mayan-edms/>`__\n- `Translations <https://www.transifex.com/rosarior/mayan-edms/>`__\n- `Videos <https://www.youtube.com/channel/UCJOOXHP1MJ9lVA7d8ZTlHPw>`__\n\n\n.. |pypi| image:: http://img.shields.io/pypi/v/mayan-edms.svg\n   :target: http://badge.fury.io/py/mayan-edms\n.. |builds| image:: https://gitlab.com/mayan-edms/mayan-edms/badges/master/build.svg\n   :target: https://gitlab.com/mayan-edms/mayan-edms/pipelines\n.. |coverage| image:: https://codecov.io/gitlab/mayan-edms/mayan-edms/coverage.svg?branch=master\n   :target: https://codecov.io/gitlab/mayan-edms/mayan-edms?branch=master\n.. |python| image:: https://img.shields.io/pypi/pyversions/mayan-edms.svg\n.. |license| image:: https://img.shields.io/pypi/l/mayan-edms.svg?style=flat\n.. |docker_pulls| image:: https://img.shields.io/docker/pulls/mayanedms/mayanedms.svg?maxAge=3600\n   :target: https://hub.docker.com/r/mayanedms/mayanedms/\n.. |docker_stars| image:: https://img.shields.io/docker/stars/mayanedms/mayanedms.svg?maxAge=3600\n   :target: https://hub.docker.com/r/mayanedms/mayanedms/\n.. |docker_layers| image:: https://images.microbadger.com/badges/image/mayanedms/mayanedms.svg\n   :target: https://microbadger.com/images/mayanedms/mayanedms\n\n\n3.1.10 (2019-04-04)\n===================\n* Backport test case improvements from the development branch. Add random\n  primary key mixin. Split test case code into mixins. Make the view test\n  case and the API test cases part of the same class hierarchy. Update tests\n  that failed due to the new import locations.\n* Add support for disabling the content type checking test case mixin.\n* Update document indexing tests to be order agnostic. GitLab issue #559.\n* Add test for the advanced search API.\n* Apply merge !36 by Simeon Walker (@simeon-walker) to fix the advanced search\n  API.\n* Apply merge !35 by Manoel Brunnen (@mbru) to fix building the Docker image\n  on the armv7l platform (RasperryPi, Odroid XU4, Odroid HC2). Also fixes\n  assertion errors from pip (https://github.com/pypa/pip/issues/6197).\n* Apply merge !37 by Roger Hunwicks (@roger.hunwicks) to allow\n  TestViewTestCaseMixin to work with a custom ROOT_URLCONF. GitLab issue #566.\n* Apply merge !40 by Roger Hunwicks (@/roger.hunwicks) to pin the Tornado\n  version used to 6.0 and continue supporting Python 2.7. GitLab issue #568.\n* Apply merge !41 by Jorge E. Gomez (@jorgeegomez) to fix the compressed class\n  method name. GitLab issue #572.\n* Remove notification badge AJAX setup. Individual link AJAX workers are\n  obsolete now that the menu is being rendered by its own AJAX renderer.\n  GitLab issue #562.\n* Add support for server side link badges.\n* Add API to list all templates.\n* Remove newlines from the rendered templates.\n* Reject emails attachments of size 0. Thanks to Robert Schoeftner\n  (@robert.schoeftner)for the report and solution. GitLab issue #574.\n* Add missing document index API view create permission.\n* Fix index list API view. Add index create, delete, detail API tests.\n  GitLab issue #564. Thanks to the Stéphane (@shoyu) for the report and debug\n  information.\n* Validate the state completion value before saving. Thanks to Manoel Brunnen\n  (@mbru) for the report and debug information. GitLab issue #557.\n* Add the MIMETYPE_FILE_READ_SIZE setting to limit the number of bytes read\n  to determine the MIME type of a new document.\n* Force object to text when raising PermissionDenied to avoid\n  UnicodeDecodeError. Thanks to Mathias Behrle (@mbehrle) for the report\n  and the debug information. GitLab issue #576.\n* Add support for skipping a default set of tests.\n\n3.1.9 (2018-11-01)\n==================\n* Convert the furl instance to text to allow serializing it into\n  JSON to be passed as arguments to the background task.\n\n3.1.8 (2018-10-31)\n==================\n* Reorganize documentation into topics and chapters.\n* Add Workflows and API chapters.\n* Add new material from the Wiki to the documentation.\n* Add data migrations to the sources app migraton 0019 to ensure all labels\n  are unique before performing the schema migations.\n* Add improvements to the metadata URL encoding and decoding to support\n  ampersand characters as part of the metadata value. GitLab issue\n  #529. Thanks to Mark Maglana @relaxdiego for the report.\n* Add custom validator for multiple emails in a single text field.\n  Change the widget of the email fields in the mailer app to avoid\n  browser side email validation. Closes GitLab issue #530.\n  Thanks to Mark Maglana @relaxdiego for the report.\n* Add configuration option to change the project/installation URL.\n  This is used in the password reset emails and in the default\n  document mailing templates.\n* Increase the size of the workflow preview image.\n* Center the workflow preview image.\n* Move the noop OCR backend to the right place.\n* Add new management command to display the current configuration\n  settings.\n* Default the YAML flow format to False which never uses inline.\n* Add support for reindexing documents when their base properties like\n  the label and description are edited.\n\n3.1.7 (2018-10-14)\n==================\n* Fix an issue with some browsers not firing the .load event on cached\n  images. Ref: http://api.jquery.com/load-event/\n* Remove duplicate YAML loading of environment variables.\n* Don't load development apps if they are already loaded.\n* Make sure all key used as input for the cache key hash are\n  bytes and not unicode. GitLab issue #520. Thanks to TheOneValen\n  @TheOneValen for the report.\n* Ignore document stub from the index mirror. GitLab issue\n  #520. Thanks to TheOneValen @TheOneValen for the report.\n* Fix for the Docker image INSTALL_FLAG path. Thanks to\n  Mark Maglana @relaxdiego for the report and to Hamish Farroq @farroq_HAM\n  for the patch. GitLab issue #525.\n* Fix the typo in the Docker variable for worker concurrency. Thanks to\n  Mark Maglana @relaxdiego for the report and to Hamish Farroq @farroq_HAM\n  for the patch. GitLab issue #527.\n* Add a noop OCR backend that disables OCR and the check for the\n  Tesseract OCR binaries. Set the OCR_BACKEND setting or MAYAN_OCR_BACKEND\n  environment variable to ocr.backends.pyocr.PyOCR to use this.\n* All tests pass on Python 3.\n* documentation: Add Docker installation method using a dedicated\n  Docker network.\n* documentation: Add scaling up chapter.\n* documentation: Add S3 storage configuration section.\n\n3.1.6 (2018-10-09)\n==================\n* Improve index mirroring value clean up code to remove the spaces at the\n  starts and at the end of directories. Closes again GitLab issue #520\n  Thanks to TheOneValen @ for the report.\n* Improve index mirroring cache class to use the hash of the keys\n  instead of the literal keys. Avoid warning about invalid key\n  characters. Closes GitLab issue #518. Thanks to TheOneValen @ for the\n  report.\n* Only render the Template API view for authenticated users.\n  Thanks rgarcia for the report.\n* Add icon to the cabinet \"Add new level\" link.\n* Display the cabinet \"Add new level\" link in the top level view too.\n\n3.1.5 (2018-10-08)\n==================\n* Consolidate some document indexing test code into a new mixin.\n* Split the code of the mountindex command to be able to add tests.\n* Fix the way the children of IndexInstanceNode are accessed. Fixes GitLab\n  issue #518. Thanks to TheOneValen @TheOneValen for the report.\n* Remove newlines from the index name levels before using them as FUSE\n  directories.\n* Fixed duplicated FUSE directory removal.\n* Add link and view to show the parsed content of each document page.\n* Add a modelform for adding and editing transformation and perform YAML\n  validation of arguments.\n* Add stricted error checking to the crop transformation.\n* Update compressed files class module to work with Python 3.\n* Update document parsing app tests to work with Python 3.\n* Handle office files in explicit binary mode for Python 3.\n* Return a proper list of SearchModel instances (Python 3).\n* Specify FUSE literals in explicit octal notation (Python 3).\n* URL quote the encoded names of the staging files using Django's compat\n  module. (Python 3)\n* Open staging file in explicit binary mode. (Python 3)\n* Add separate Python 2 and Python 3 versions of the MetadataType model\n  .comma_splitter() static method.\n* Update the metadata app tests to work on Python 3.\n* Make sure metadata lookup choices are a list to be able to add the\n  optional marker (Python 3).\n* Make sure the image in the document preview view is centered when it is\n  smaller than the viewport.\n* Restore use of the .store_body variable accidentally remove in\n  63a77d0235ffef3cd49924ba280879313c622682. Closes GitLab issue #519.\n  Thanks to TheOneValen @TheOneValen for the report.\n* Add shared cache class and add mounted index cache invalidation when\n  document and index instance nodes are updated or deleted.\n* Fix document metadata app view error when adding multiple optional\n  metadata types. Closes GitLab issue #521. Thanks to the TheOneValen\n  @TheOneValen for the report.\n\n3.1.4 (2018-10-04)\n==================\n* Fix the link to the documenation. Closes GitLab issue #516.\n  Thanks to Matthias Urlichs @smurfix for the report.\n* Update related links. Add links to the new Wiki and Forum.\n* Add Redis config entries in the Docker images to disable\n  saving the database and to only provision 1 database.\n* Remove use of hard coded font icon for document page\n  rendering busy indicator.\n* Disable the fancybox caption link if the document is\n  in the trash.\n* Load the DropZone CSS from package and remove the\n  hard code CSS from appearance/base.css.\n* Add support for indexing on OCR content changes.\n* Add support for reindexing document on content parsing\n  changes.\n* Strip HTML entities from the browser's window title.\n  Closes GitLab issue #517. Thanks to Daniel Carrico @daniel1113\n  for the report.\n* Improve search app. Refactored to resolve search queries\n  by terms first then by field.\n* Add explanation to the launch workflows tool.\n\n3.1.3 (2018-09-27)\n==================\n* Make sure template API renders in non US languages.\n* Fix user groups view.\n* Add no results help text to the document type -> metadata type\n  association view.\n* Expose the Django INSTALLED_APPS setting.\n* Add support for changing the concurrency of the Celery workers in the\n  Docker image. Add environment variables MAYAN_WORKER_FAST_CONCURRENCY,\n  MAYAN_WORKER_MEDIUM_CONCURRENCY and MAYAN_WORKER_SLOW_CONCURRENCY.\n* Add latest translation updates.\n* Fixes a few text typos.\n* Documentation updates in the deployment and docker chapters.\n\n3.1.2 (2018-09-21)\n==================\n* Database access in data migrations defaults to the 'default' database.\n  Force it to the user selected database instead.\n* Don't use a hardcoded database alias for the destination of the database\n  conversion.\n* Improve natural key support in the UserOptions model.\n* Update from Django 1.11.11 to 1.11.15.\n* Add support to the convertdb command to operate on specified apps too.\n* Add test mixin to test the db conversion (dumping and loading) of a specific app.\n* Add an user test mixin to group user testing.\n* Add test the user managament app for database conversion.\n* Add support for natural keys to the DocumentPageImageCache model.\n* Add database conversion test to the common app.\n* Fix label display for resolved smart links when not using a dynamic label.\n* Only show smart link resolution errors to the user with the smart link edit\n  permission.\n* Intercept document list view exception and display them as an error message.\n\n3.1.1 (2018-09-18)\n==================\n* CSS tweak to make sure the AJAX spinner stays in place.\n* Fix 90, 180 and 270 degrees rotation transformations.\n\n3.1 (2018-09-17)\n================\n- Improve database vendor migration support\n- Add convertdb management command.\n- Add error checking to the crop transformation arguments.\n- Update dropzone.js' timeout from 30 seconds to 120 to allow upload\n  of large files on slow connections.\n- Increase gunicorn's timeout from 30 seconds to 120.\n- Update packages versions: Pillow:5.2.0, PyYAML:3.13, django-environ:0.4.5,\n  django-model-utils:3.1.2, django-mptt:0.9.1, django-widget-tweaks: 1.4.2,\n  flanker:0.9.0, flex:6.13.2, furl:1.2, gevent:1.3.5, graphviz: 0.8.4,\n  gunicorn:19.9.0, pyocr:0.5.2, python-dateutil:2.7.3\n- Remove use of django-compressor and cssmin now that the project used\n  Whitenoise.\n- Display error when attempting to recalculate the page count of an empty\n  document (document stub that has no document version).\n- Add support for client side caching of document page images. The time\n  the images are cached is controlled by the new setting\n  DOCUMENTS_PAGE_IMAGE_CACHE_TIME which defaults to 31556926 seconds (1 year).\n- The document quick label selection field now uses a select2 widget.\n- Include querystring when force reload of a bare template view.\n- Speed up document image fade in reveal.\n- Use reseteable timer to ensure more document panels heights are matched.\n- Rewrote Mayan's JavaScript suite MayanApp into ECMAScript2015.\n- Remove use is waitForJQuery.\n- Remove code statistics from the documentation.\n- Remove the pending work chapter. This is now available in the Wiki:\n  wiki.mayan-edms.com\n- Unify template title rendering.\n- Add support for template subtitles.\n- Make sure the on entry action of the initial state of workflows\n  executes on document creation.\n- Add new document app events: document type created and document type\n  edited.\n- Add link to document type events.\n- Add new metadata app events: metadata type created, metadata type edited,\n  metadata type to document type relationship update.\n- Add link to metadata type events.\n- Add support for subscribing to metadata type events.\n- Add link to view the events of a tag.\n- Add support for subscribing to the events of a tag.\n- Add the tag events view permissions to the tag model ACL.\n- Hide the title link of documents in the trash.\n- Add support for document metadata events: add, edit and remove.\n- Add workflow action to update the label and description of a document.\n- Add COMMON_PROJECT_TITLE as a setting option to customize the title\n  string.\n- Add support for YAML configuration files.\n- Add support for editing setting options and saving them using the\n  new YAML configuration file support.\n- Add new revertsettings management command.\n- Add new permission to edit setting via the UI.\n- Renamed setting LOCK_MANAGER_DEFAULT_BACKEND to LOCK_MANAGER_BACKEND.\n- Add help texts to more setting options.\n- Add ACL support for metadata types.\n- Add cascade permission checks for links. Avoid allowing users\n  to reach a empty views because they don't access to any of\n  the view's objects.\n- Apply link permission cascade checks to the message of the day,\n  indexing and parsing, setup link.\n- Add ACL support to the message of the day app.\n- The index rebuild permission can now be set as part of the index\n  ACL for each individual index.\n- Add cascade permission check to the index rebuild tool link.\n- The index rebuild tool now responds with the number of indexes\n  queued to rebuild instead of a static acknowledment.\n- Add missing permission check to the document duplicate scan\n  link.\n- Add new document indexing permission. This permission allows\n  user to view an index instance as opposed to the current\n  permission which allows viewing an index definiton on the\n  setup menu.\n- Add support to conditionally disable menus.\n- Disable the Tags menu when the user doesn't have the\n  tag create permission or the tag view access for any tag.\n- Disable the Cabinets menu when the user doesn't have the\n  cabinet create permission or the cabinet view permission\n  for any cabinet.\n- Update forum link in the about menu.\n- Only show the settings namespace list link where it is\n  relevant.\n- Add support for the fillcolor argument to the rotate\n  transformation.\n- Sort documents by label.\n- Add recently added document list view. The setting\n  DOCUMENTS_RECENT_COUNT has been renamed to\n  DOCUMENTS_RECENT_ACCESS_COUNT. New setting\n  DOCUMENTS_RECENT_ADDED_COUNT added.\n- Use platform independant hashing for transformations.\n- Add support to the ObjectActionMixin to report on instance action\n  failures. Add also an error_message class property and the new\n  ActionError exception.\n- Add favorite documents per user. Adds new setting option\n  DOCUMENTS_FAVORITE_COUNT.\n- Add new class based dashboard widget. This new widget supports\n  subclassing and is template based. All exising widgets have been\n  converted. ACL filtering was added to the widget results.\n- In addition to the document view permission, the checkout detail\n  view permission is now needed to view the list of checked out\n  document.\n- After queuing a chart for update, the view will now redirect\n  to the same chart.\n- The multiple document action dropdown is now sorted alphabetically.\n- Improve statistics subclassing. Split class module into classes\n  and renderers.\n- Sort facet link, object, secondady and sidebar actions.\n- Add support for extended templates when there are no results.\n- Add help messages and useful links to several apps when there\n  are no results available.\n- Add a new column to settings showing if they are overrided\n  via environment variable.\n- The official config filename is config.yml.\n- Interpret ALLOWED_HOSTS as YAML.\n- Don't show the document types of an index instance.\n- Add the tag created and tag edited events.\n- Add support for blocking the changing of password for specify users.\n- Add support for changing the HOME_VIEW, LOGIN_URL and LOGIN_REDIRECT_URL\n  from the settings view.\n- Instead of the document content view, the document type parsing setup\n  permissions is now required to view the parsing error list.\n- The document type parsing setup permission can now be granted for\n  individual document types.\n- Add link to view a specific page's OCR content.\n- Remove the duplicated setting pdftotext_path from the OCR path.\n  This is now handled by the document parsing app.\n- Implement partial refresh of the main menu.\n- Remove usage of pace.js. Would cause XMLRequest to fallback to\n  synchronous mode.\n- Add custom AJAX spinner.\n- Complete refactor of the compress archive class support. Closes\n  GitLab issue #7.\n- Add support for preserving the extension of document files when\n  using the quick label feature. Added to the document properties\n  edit view and the document upload view. Closes GitLab issue\n  #360.\n- Add new dashboard item to display the total page count.\n- Show the document type being uploaded in the source view title.\n- Setting SOURCE_SCANIMAGE_PATH is now SOURCES_SCANIMAGE_PATH.\n- Refactor the staging file image generation to support\n  background task generation, caching and cache sharing.\n- New queue: sources_fast. Used for staging file generation.\n- New settings: SOURCES_STAGING_FILE_CACHE_STORAGE_BACKEND and\n  SOURCES_STAGING_FILE_CACHE_STORAGE_BACKEND_ARGUMENTS to control\n  where and how staging file caching is done.\n- Fix an edge case on the document indexing where an empty\n  node could be left behind.\n- Improve the speed of the document indexing.\n- Move the matchHeight call from lazy loading to image loading.\n  Reduces the chance of wrongly sized cards.\n- Generalize the JavaScript menu rendering into an API for\n  templates that only refresh the menu when there are changes.\n  Closes GitLab issue #511. Thanks to Daniel Carrico\n  @daniel1113 for the report.\n- Refactor the ModelAttribute class into two separate classes:\n  ModelAttribute for executable model attributes and ModelField\n  for actual ORM fields.\n- Expose more document fields for use in smart links.\n- The size of the document type label field has been increased\n  from 32 to 96 characters.\n- Add file_size and datetime fields to the DocumentPageCachedImage\n  model.\n- Make icon classes file template based.\n- Add the current step and total steps of a wizard in the template context.\n\n3.0.3 (2018-08-17)\n==================\n- Tags app: Add explicit casting of escaped tag labels to prevent exploit\n  of cross site scripting. Thanks to Lokesh (@lokesh1095) for\n  the report and proposed solutions. Closes GitLab issue #496.\n- Tags app: Add explicit post action redirect for the tag attach and\n  tag remove actions when working on a single document.\n\n3.0.2 (2018-08-16)\n==================\n- Docker install script: Default to verbose.\n- Docker install script: Increase startup timer to 10 seconds.\n- Docker install script: Allow configuring the PostgreSQL port.\n- Documentation: Add deployment step that configures Redis to discard\n  unused task data when it runs out of memory.\n- Index app: Add natural key support to the Index model.\n- Mailer app: Add natural key support to the mailer app.\n- Cabinets: Redirect to the cabinet list view after creating a new cabinet.\n- Builds: Limit the number of branches that trigger the full test suit.\n- Converter app: Fix crop transformation argument parsing.\n- Converter app: Add error checking to the crop transformation arguments.\n  Thanks to Jordan Wages (@wagesj45) for the report and investigation on the issue.\n  Closes GitLab issue #490\n- Common app: Fix post login redirection to honor the ?next= URL query string\n  argument. Thanks go to K.C. Wong (@dvusboy1). Closes GitLab\n  issue #489.\n- Docker install script: Detect if Docker installed and provide help\n  text if not.\n- Sources app: Update dropzone.js' timeout from 30 seconds to 120 to allow\n  upload of large files on slow connections.\n- Documentation: Increase gunicorn's timeout from 30 seconds to 120.\n- Documents app: Display error when attempting to recalculate the page\n  count of an empty\n  document (document stub that has no document version).\n- Appearance app: Include querystring when force reload of a bare template view.\n- Documents app: Fix trashed document count and document page count swapped\n  dashboard icons.\n- Documents app: Rename the multi document download link from \"Download\" to\n  \"Advanced download\" for consistency.\n- Documentation: Remove code statistics from the documentation.\n- Documentation: Remove the pending work chapter. This is now available in\n  the Wiki: wiki.mayan-edms.com\n- Appearance app: Add support for hiding a links icon. Hide all object menu\n  links' icons.\n- Documents app: Hide the title link of documents in the trash.\n- Workflow app: Define a redirection after workflow actions are edited.\n- Appearance app: avoid setting window.location directly to avoid exploit\n  of cross site scripting. Thanks to Lokesh (@lokesh1095) for the report\n  and solution. Closes GitLab issue #494.\n- Cabinets app: Escape cabinet labels to avoid possible exploit of\n  cross site scripting. Thanks to Lokesh (@lokesh1095) for the report\n  and proposed solutions. Closes GitLab issue #495.\n- Language translation synchonization.\n\n3.0.1 (2018-07-08)\n==================\n- Pin javascript libraries to specific versions to avoid using\n  potentianlly broken updates automatically. GitLab issue #486.\n- French and Polish language translation updates.\n- Merge request #25. Thanks to Daniel Albert @esclear\n  for the patch.\n\n3.0 (2018-06-29)\n================\n- Rename the role groups link label from \"Members\" to \"Groups\".\n- Rename the group users link label from \"Members\" to \"Users\".\n- Don't show full document version label in the heading of the document\n  version list view.\n- Show the number of pages of a document and of document versions in\n  the document list view and document versions list views respectively.\n- Display a document version's thumbnail before other attributes.\n- User Django's provided form for setting an users password.\n  This change allows displaying the current password policies\n  and validation.\n- Add method to modify a group's role membership from the group's\n  view.\n- Rename the group user count column label from \"Members\" to \"Users\".\n- Backport support for global and object event notification.\n  GitLab issue #262.\n- Remove Vagrant section of the document. Anything related to\n  Vagrant has been move into its own repository at:\n  https://gitlab.com/mayan-edms/mayan-edms-vagrant\n- Add view to show list of events performed by an user.\n- Allow filtering an event list by clicking on the user column.\n- Display a proper message in the document type metadata type relationship\n  view when there are no metadata types exist.\n- Require the document view permission to view trashed documents.\n- Make the multi object form perform an auto submit when the value is changed.\n- Improved styling and interaction of the multiple object action form.\n- Add checkbox to allow selecting all item in the item list view.\n- Revise and improve permission requirements for the documents app API.\n- Downloading a document version now requires the document download permission\n  instead of just the document view permission.\n- Creating a new document no longer works by having the document create\n  permission in a global manner. It is now possible to create a document via\n  the API by having the document permission for a specific document type.\n- Viewing the version list of a document now required the document version\n  view permission instead of the document view permission.\n- Not having the document version view permission for a document will not\n  return a 403 error. Instead a blank response will be returned.\n- Reverting a document via API will new require the document version revert\n  permission instead of the document edit permission.\n- Fix permission filtering when performing document page searching.\n- Fix cabinet detail view pagination.\n- Update project to work with Django 1.11.11.\n- Fix deprecations in preparation for Django 2.0.\n- Improve permission handling in the workflow app.\n- The checkedout detail view permission is now required for the checked out document detail API view.\n- Switch to a resource and service based API from previous app based one.\n- Add missing services for the checkout API.\n- Fix existing checkout APIs.\n- Update API vies and serializers for the latest Django REST framework version. Replace DRF Swagger with DRF-YASG.\n- Update to the latest version of Pillow, django-activity-stream, django-compressor, django-cors-headers,\n  django-formtools, django-qsstats-magic, django-stronghold, django-suit, furl, graphviz, pyocr,\n  python-dateutil, python-magic, pytz, sh.\n- Update to the latest version the packages for building, development, documentation and testing.\n- Add statistics script to produce a report of the views, APIs and test for each app.\n- Merge base64 filename patch from Cornelius Ludmann.\n- SearchModel retrun interface changed. The class no longer returns the result_set value. Use the queryset returned instead.\n- Update to Font Awesome 5.\n- Turn Mayan EDMS into a single page app.\n- Split base.js into mayan_app.js, mayan_image.js, partial_navigation.js.\n- Add a HOME_VIEW setting. Use it for the default view to be loaded.\n- Fix bug in document page view. Was storing the URL and the querystring as a single url variable.\n- Use history.back instead of history.go(-1).\n- Don't use the previous variable when canceling a form action. Form now use only javascript's history.back().\n- Add template and modal to display server side errors.\n- Remove the unused scrollable_content internal feature.\n- Remove unused animate.css package.\n- Add page loading indicator.\n- Add periodic AJAX workers to update the value of the notifications link.\n- Add notification count inside a badge on the notification link.\n- Add the MERC specifying javascript library usage.\n- Documents without at least a version are not scanned for duplicates.\n- Use a SHA256 hex digest of the secret key at the name of the lockfile. This makes the generation of the name repeatable while unique between installations.\n- Squashed apps migrations.\n- Convert document thumbnails, preview, image preview and staging files to template base widgets.\n- Unify all document widgets.\n- Display resolution settings are now specified as width and height and not a single resolution value.\n- Printed pages are now full width.\n- Move the invalid document markup to a separate HTML template.\n- Update to Fancybox 3.\n- Update to jQuery 3.3.1\n- Move transfomations to their own module.\n- Split documents.tests.test_views into base.py, test_deleted_document_views.py,\n  test_document_page_views.py, test_document_type_views.py, test_document_version_views.py,\n  test_document_views.py, test_duplicated_document_views.py\n- Sort smart links by label.\n- Rename the internal name of the document type permissions namespace. Existing permissions will need to be updated.\n- Add support for OR type searches. Use the \"OR\" string between the terms. Example: term1 OR term2.\n- Removed redundant permissions checks.\n- Move the page count display to the top of the image.\n- Unify the way to gather the project's metadata. Use mayan.__XX__ and a new common tag named {% project_information '' %}\n- Return to the same source view after uploading a document.\n- Add new WizardStep class to decouple the wizard step configuration.\n- Add support for deregister upload wizard steps.\n- Add wizard step to insert the document being uploaded to a cabinet.\n- Fix documentation formatting.\n- Add upload wizard step chapte.\n- Improve and add additional diagrams.\n- Change documenation theme to rtd.\n- Fix carousel item height issues.\n- Add the \"to=\" keyword argument to all ForeignKey, ManayToMany and OneToOne Fields.\n- Add Makefile target to check the format of the README.rst file.\n- Mark the feature to detect and fix the orientatin of PDF as experimental.\n- Don't show documents with 0 duplicates in the duplicated document list.\n- Clean up the duplicated document model after a document is deleted.\n- Add support for roles ACLs.\n- Add support for users ACLs.\n- Add support for groups ACLs.\n- Sort permission namespaces and permissions in the role permission views.\n- Invert the columns in the ACL detail view.\n- Fix issue #454. Thanks to Andrei Korostelev @kindkaktus for the issue and the\n  solution.\n- Update the role permission edit view require the permission grant or permission\n  revoke permissions for the selected role.\n- Only show the new document link if the user has access to create documents of\n  at least one document type. GitLab Issue #302. Thanks to kg @kgraves.\n- Support passing arguments to the document, document cache and document signatures\n  storage backends. New settings: DOCUMENTS_STORAGE_BACKEND_ARGUMENTS,\n  DOCUMENTS_CACHE_STORAGE_BACKEND_ARGUMENTS, SIGNATURES_STORAGE_BACKEND_ARGUMENTS\n- Remove the setting STORAGE_FILESTORAGE_LOCATION. Document storage\n  location for the storage.backend.filebasedstorage.FileBasedStorage\n  backdend must now passed via the DOCUMENTS_STORAGE_BACKEND_ARGUMENTS,\n  DOCUMENTS_CACHE_STORAGE_BACKEND_ARGUMENTS, or\n  SIGNATURES_STORAGE_BACKEND_ARGUMENTS if the backend is used to documents,\n  the document image cache and/or document signatures. Use\n  DOCUMENTS_STORAGE_BACKEND_ARGUMENTS = '{ location: <specific_path> }'\n  If no path is specified the backend will default to\n  'mayan/media/document_storage'.\n- Standardize the way storages are used. All apps that use storage now define\n  their storages in the .storages modules instead of the .runtime module.\n  The storage.backends.filebasedstorage.FileBasedStorage has been remove,\n  instead Django's default storage is used and each app is responsible\n  of specifying their default path.\n- Unify checkbox selection code for list items and table items.\n- Add smart checkbox manager.\n- Update Chart.js version.\n- Improve line chart appearance. Fix mouse hover label issue.\n- Add JavaScript dependency manager.\n- Add support for passing arguments to the OCR backend.\n- Fix issue when using workflows transitions with the new version\n  upload event as trigger. Thanks to Sema @Miggaten for the find and\n  the solution.\n- Removing running workflow instances in document of a specific type if\n  that document type is removed from the workflow.\n- Make error messages persistent and increase the timeout of warning to 10 seconds.\n- Improve rendering of the details form.\n- Update rendering of the readonly multiselect widget to conform to Django's updated field class interface.\n- Add warning when using SQLite as the database backend.\n- Use Mailgun's flanker library to process the email sources.\n- Add locking for interval sources. This reduces the chance of repeated documents from long running email downloads.\n- Add the option to enable or disable parsing when uploading a document for each document type.\n- Add a new setting option to enable automatic parsing for each new document type created.\n- Add support for HTML bodies to the user mailers.\n- Production ALLOWED_HOSTS settings now defaults to a safer ['127.0.0.1', 'localhost', '[::1]']\n- Capture menu resolution errors on invalid URLs. Closes GitLab issue #420.\n- New environment variables: MAYAN_SECRET_KEY, MAYAN_CELERY_ALWAYS_EAGER, MAYAN_CELERY_RESULT_BACKEND,\n  MAYAN_BROKER_URL, MAYAN_DATABASE_ENGINE, MAYAN_DATABASE_CONN_MAX_AGE, MAYAN_DATABASE_NAME,\n  MAYAN_DATABASE_USER, MAYAN_DATABASE_PASSWORD, MAYAN_DATABASE_HOST, MAYAN_DATABASE_PORT,\n  MAYAN_DEBUG.\n- Stricter defaults. CELERY_ALWAYS_EAGER to False, ALLOWED_HOSTS to ['127.0.0.1', 'localhost', '[::1]'].\n- New initialization command. Creates media/system and populates the SECRET_KEY and VERSION files.\n- Sane scanner source paper source now defaults to blank.\n- Merge Docker image creation back into the main repository.\n- Docker image now uses gunicorn and whitenoise instead of NGINX to server the app and\n  the static media.\n- All installation artifact are now created and read from the media folder.\n- Debian is now the Linux distribution used for the Docker image.\n- Most Docker Celery workers are now execute using a lower OS priority number.\n- Add COMMON_PRODUCTION_ERROR_LOGGING setting to control the logging of errors in production. Defaults to False.\n- Change the error log file handle class to RotatingFileHandle to avoid an indefinitely growing log file.\n- Disable embedded signatute verification during the perform upgrade command.\n- Replace the DOCUMENTS_LANGUAGE_CHOICES setting option. Replaced with the new DOCUMENTS_LANGUAGE_CODES.\n- Fix error when trying to upload a document from and email account with 'from' and 'subject' metadata.\n- Fix typo on message.header get from 'Suject' to 'Subject'.\n- On multi part emails keep the original From and Subject properties for all subsequent parts if the sub parts don't specify them. Fixes issue #481. Thanks to Robert Schöftner @robert.schoeftner for the report and debug information.\n- Don't provide a default for the scanner source adf_mode. Some scanners throw an error even when the selection\n  if supported.\n- Add a \"Quick Download\" action to reduce the number of steps to download a single document. GitLab issue #338.\n- Recalculate a document's indexes when attaching or removing a tag from or to it.\n- Recalculate all of a tag's documents when a tag is about to be deleted.\n\n\n",
    "description_content_type": "",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://gitlab.com/mayan-edms/mayan-edms",
    "keywords": "",
    "license": "Apache 2.0",
    "maintainer": "",
    "maintainer_email": "",
    "name": "mayan-edms",
    "package_url": "https://pypi.org/project/mayan-edms/",
    "platform": "any",
    "project_url": "https://pypi.org/project/mayan-edms/",
    "project_urls": {
      "Homepage": "https://gitlab.com/mayan-edms/mayan-edms"
    },
    "release_url": "https://pypi.org/project/mayan-edms/3.1.10/",
    "requires_dist": [
      "Django (==1.11.20)",
      "Pillow (==5.2.0)",
      "PyPDF2 (==1.26.0)",
      "PyYAML (==3.13)",
      "celery (==3.1.24)",
      "django-activity-stream (==0.6.5)",
      "django-autoadmin (==1.1.1)",
      "django-celery (==3.2.1)",
      "django-colorful (==1.2)",
      "django-cors-headers (==2.2.0)",
      "django-downloadview (==1.9)",
      "django-environ (==0.4.5)",
      "django-formtools (==2.1)",
      "django-mathfilters (==0.4.0)",
      "django-model-utils (==3.1.2)",
      "django-mptt (==0.9.1)",
      "django-pure-pagination (==0.3.0)",
      "django-qsstats-magic (==1.0.0)",
      "django-stronghold (==0.3.0)",
      "django-suit (==0.2.26)",
      "django-widget-tweaks (==1.4.2)",
      "djangorestframework-recursive (==0.1.2)",
      "djangorestframework (==3.7.7)",
      "drf-yasg (==1.5.0)",
      "flanker (==0.9.0)",
      "flex (==6.13.2)",
      "furl (==1.2)",
      "fusepy (==2.0.4)",
      "gevent (==1.3.5)",
      "graphviz (==0.8.4)",
      "gunicorn (==19.9.0)",
      "mock (==2.0.0)",
      "node-semver (==0.3.0)",
      "pathlib2 (==2.3.2)",
      "pycountry (==18.5.26)",
      "pyocr (==0.5.2)",
      "python-dateutil (==2.7.3)",
      "python-gnupg (==0.3.9)",
      "python-magic (==0.4.15)",
      "pytz (==2018.3)",
      "requests (==2.18.4)",
      "sh (==1.12.14)",
      "swagger-spec-validator (==2.1.0)",
      "whitenoise (==3.3.1)"
    ],
    "requires_python": "",
    "summary": "Free Open Source Electronic Document Management System",
    "version": "3.1.10",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17257337,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "70a1b4bbc21ab0d2f48def6b1f8d0910367b60610d4c24d42a519736bc13a921",
        "md5": "e6b59a65a478d51360d3eb7568d69396",
        "sha256": "cf7d7bc8fec184c62d38c647e7263f0149270b24b001ba3a280260519ffd51ce"
      },
      "downloads": -1,
      "filename": "mayan_edms-3.1.10-py2-none-any.whl",
      "has_sig": false,
      "md5_digest": "e6b59a65a478d51360d3eb7568d69396",
      "packagetype": "bdist_wheel",
      "python_version": "py2",
      "requires_python": null,
      "size": 11569933,
      "upload_time": "2019-04-05T03:04:43",
      "upload_time_iso_8601": "2019-04-05T03:04:43.180533Z",
      "url": "https://files.pythonhosted.org/packages/70/a1/b4bbc21ab0d2f48def6b1f8d0910367b60610d4c24d42a519736bc13a921/mayan_edms-3.1.10-py2-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "86e8d703732e2bed4223af8858ce3297c67308805dd847cc116989acbc2f778c",
        "md5": "7037f18ea6656505696d2ad75ac381bc",
        "sha256": "30bbebafadba41e974bb77faab50086477e43e745a6df914997a0e7c94d5b8bd"
      },
      "downloads": -1,
      "filename": "mayan-edms-3.1.10.tar.gz",
      "has_sig": false,
      "md5_digest": "7037f18ea6656505696d2ad75ac381bc",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 8434394,
      "upload_time": "2019-04-05T03:04:47",
      "upload_time_iso_8601": "2019-04-05T03:04:47.730992Z",
      "url": "https://files.pythonhosted.org/packages/86/e8/d703732e2bed4223af8858ce3297c67308805dd847cc116989acbc2f778c/mayan-edms-3.1.10.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}