{
  "info": {
    "author": "Nathan Fradet",
    "author_email": "",
    "bugtrack_url": null,
    "classifiers": [
      "Intended Audience :: Developers",
      "Intended Audience :: Science/Research",
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.7",
      "Topic :: Multimedia :: Sound/Audio :: MIDI",
      "Topic :: Scientific/Engineering :: Artificial Intelligence"
    ],
    "description": "# MidiTok\n\nPython package to tokenize MIDI music files, presented at the ISMIR 2021 LBD.\n\n[![PyPI version fury.io](https://badge.fury.io/py/miditok.svg)](https://pypi.python.org/pypi/miditok/)\n[![Python 3.7](https://img.shields.io/badge/python-3.7+-blue.svg)](https://www.python.org/downloads/release/)\n![GitHub CI](https://github.com/Natooz/MidiTok/actions/workflows/pytest.yml/badge.svg)\n[![Codecov](https://img.shields.io/codecov/c/github/Natooz/MidiTok)](https://codecov.io/gh/Natooz/MidiTok)\n[![GitHub license](https://img.shields.io/github/license/Natooz/MidiTok.svg)](https://github.com/Natooz/MidiTok/blob/main/LICENSE)\n[![GitHub license](https://pepy.tech/badge/MidiTok)](https://pepy.tech/project/MidiTok)\n\n![MidiTok Logo](https://github.com/Natooz/MidiTok/blob/assets/assets/logo.png?raw=true \"\")\n\n\nMidiTok converts MIDI music files into sequences of tokens, i.e. integers, ready to be fed to sequential neural networks like Transformers or RNNs.\nMidiTok features most known MIDI tokenization strategies, and is built around the idea that they all share common parameters and methods. It contains methods allowing to properly pre-process any MIDI file, and also supports Byte Pair Encoding (BPE).\n\n## Install\n\n```shell\npip install miditok\n```\nMidiTok uses [MIDIToolkit](https://github.com/YatingMusic/miditoolkit), which itself uses [Mido](https://github.com/mido/mido) to read and write MIDI files.\n\n## Examples\n\n### Tokenize a MIDI file\n\n```python\nfrom miditok import REMI\nfrom miditok.utils import get_midi_programs\nfrom miditoolkit import MidiFile\n\n# Our parameters\npitch_range = range(21, 109)\nbeat_res = {(0, 4): 8, (4, 12): 4}\nnb_velocities = 32\nadditional_tokens = {'Chord': True, 'Rest': True, 'Tempo': True, 'Program': False, 'TimeSignature': False,\n                     'rest_range': (2, 8),  # (half, 8 beats)\n                     'nb_tempos': 32,  # nb of tempo bins\n                     'tempo_range': (40, 250)}  # (min, max)\n\n# Creates the tokenizer and loads a MIDI\ntokenizer = REMI(pitch_range, beat_res, nb_velocities, additional_tokens, mask=True)\nmidi = MidiFile('path/to/your_midi.mid')\n\n# Converts MIDI to tokens, and back to a MIDI\ntokens = tokenizer(midi)  # automatically detects MIDIs and tokens before converting\nconverted_back_midi = tokenizer(tokens, get_midi_programs(midi))\n\n# Converts just a selected track\ntokenizer.current_midi_metadata = {'time_division': midi.ticks_per_beat, 'tempo_changes': midi.tempo_changes}\npiano_tokens = tokenizer.track_to_tokens(midi.instruments[0])\n\n# And convert it back (the last arg stands for (program number, is drum))\nconverted_back_track, tempo_changes = tokenizer.tokens_to_track(piano_tokens, midi.ticks_per_beat, (0, False))\n```\n\n### Tokenize a dataset, perform data augmentation and apply Byte Pair Encoding\n\nMidiTok will save your encoding parameters in a ```config.txt``` file to keep track of how they were converted.\n\n```python\nfrom miditok import REMI\nfrom pathlib import Path\n\n# Creates the tokenizer and list the file paths\ntokenizer = REMI(mask=True)  # using defaults parameters (constants.py)\nmidi_paths = list(Path('path', 'to', 'dataset').glob('**/*.mid'))\n\n# A validation method to discard MIDIs we do not want\n# It can also be used for custom pre-processing, for instance if you want to merge\n# some tracks before tokenizing a MIDI file\ndef midi_valid(midi) -> bool:\n    if any(ts.numerator != 4 for ts in midi.time_signature_changes):\n        return False  # time signature different from 4/*, 4 beats per bar\n    if midi.max_tick < 10 * midi.ticks_per_beat:\n        return False  # this MIDI is too short\n    return True\n\n# Converts MIDI files to tokens saved as JSON files\ndata_augmentation_offsets = [2, 2, 1]  # perform data augmentation on 2 pitch octaves, 2 velocity and 1 duration values\ntokenizer.tokenize_midi_dataset(midi_paths, Path('path', 'to', 'tokens_noBPE'), midi_valid, data_augmentation_offsets)\n\n# Constructs the vocabulary with BPE\ntokenizer.learn_bpe(tokens_path=Path('path', 'to', 'tokens_noBPE'), vocab_size=500,\n                    out_dir=Path('path', 'to', 'tokens_BPE'), files_lim=300)\n\n# Converts the tokenized musics into tokens with BPE\ntokenizer.apply_bpe_to_dataset(Path('path', 'to', 'tokens_noBPE'), Path('path', 'to', 'tokens_BPE'))\n```\n\n### Write a MIDI file from tokens\n\n```python\nfrom miditok import REMI\nimport torch\n\n# Creates the tokenizer\ntokenizer = REMI()  # using defaults parameters (constants.py)\n\n# The tokens, let's say produced by your Transformer, 4 tracks of 500 tokens\ntokens = torch.randint(low=0, high=len(tokenizer.vocab), size=(4, 500)).tolist()\n\n# The instruments, here piano, violin, french horn and drums\nprograms = [(0, False), (41, False), (61, False), (0, True)]\n\n# Convert to MIDI and save it\ngenerated_midi = tokenizer.tokens_to_midi(tokens, programs)\ngenerated_midi.dump('path/to/save/file.mid')  # could have been done above by giving the path argument\n```\n\n## Tokenizations\n\nThe figures represent the following music sheet as its corresponding token sequences.\n\n![Music sheet example](https://github.com/Natooz/MidiTok/blob/assets/assets/music_sheet.png?raw=true \"Music sheet example\")\n\n_Tokens are vertically stacked at index 0 from the bottom up to the top._\n\n### MIDI-Like\n\nStrategy used in the first symbolic music generative transformers and RNN / LSTM models. MIDI messages (Note On, Note Off, Velocity and Time Shift) are represented as tokens.\n\n\n![MIDI-Like figure](https://github.com/Natooz/MidiTok/blob/assets/assets/midi_like.png?raw=true \"MIDI-Like token sequence, with TimeShift and NoteOff tokens\")\n\n### TimeShift Duration (TSD)\n\nA strategy similar to MIDI-Like, but uses explicit `Duration` tokens to represent note durations, which have showed [better results](https://arxiv.org/abs/2002.00212), helping models to learn better.\n\n![MIDI-Like figure](https://github.com/Natooz/MidiTok/blob/assets/assets/tsd.png?raw=true \"MIDI-Like token sequence, with TimeShifts and NoteOff tokens\")\n\n### REMI\n\nProposed with the [Pop Music Transformer](https://arxiv.org/abs/2002.00212), it is a \"position-based\" representation. The time is represented with \"_Bar_\" and \"_Position_\" tokens that indicate respectively when a new bar is beginning, and the current position within a bar. A note is represented as a succession of a _Pitch_, _Velocity_ and _Duration_ tokens.\n\nNOTE:\n* In the original REMI paper, the tempo information are in fact the succession of two token types: a \"_Token Class_\" which indicate if the tempo is fast or slow, and a \"_Token Value_\" which represents its value with respect to the tempo class. In MidiTok we only encode one _Tempo_ token which encode its value, quantized in a number of bins set in parameters (as done for velocities).\n\n![REMI figure](https://github.com/Natooz/MidiTok/blob/assets/assets/remi.png?raw=true \"REMI sequence, time is tracked with Bar and position tokens\")\n\n### Compound Word\n\nIntroduced with the [Compound Word Transformer](https://arxiv.org/abs/2101.02402), this tokenization is similar to REMI but uses embedding pooling operations to reduce the overall sequence length: some tokens are first converted to embeddings by a model, them merged / pooled into a single one.\n_Pitch_, _Velocity_ and _Durations_ tokens of a same note will be combined. The **sequence length reduction** means less time and memory complexity.\n\nFor generation tasks, the decoding implies to project the last hidden states to several output layers, one for each token type, and samples from the multiple output distributions.\n\n![Compound Word figure](https://github.com/Natooz/MidiTok/blob/assets/assets/cp_word.png?raw=true \"CP Word sequence, tokens of the same family are grouped together\")\n\n### Structured\n\nPresented with the [Piano Inpainting Application](https://arxiv.org/abs/2107.05944), it is similar to MIDI-Like but with _Duration_ tokens instead NoteOff.\nIts main advantage is the consistent token type transitions it imposes, which can greatly speed up training. The structure is as: _Pitch_ -> _Velocity_ -> _Duration_ -> _Time Shift_ -> ... (pitch again)\nTo keep this property, no additional token can be inserted in MidiTok's implementation.\n\n![Structured figure](https://github.com/Natooz/MidiTok/blob/assets/assets/structured.png?raw=true \"Structured MIDI encoding, the token types always follow the same transition pattern\")\n\n### Octuple\n\nIntroduced with [Symbolic Music Understanding with Large-Scale Pre-Training](https://arxiv.org/abs/2106.05630). Each note of each track is the combination of multiple embeddings: _Pitch_, _Velocity_, _Duration_, _Track_, current _Bar_, current _Position_ and additional tokens.\nIts considerably reduces the sequence lengths, while handling multitrack. Generating with it requires however to sample from several distributions and can be delicate. This tokenization is best suited for MIR and classification tasks.\nThe Bar and Position embeddings can act as a positional encoding, but the authors of the original paper still applied a token-wise positional encoding afterward.\n\nNOTES:\n* In MidiTok, the tokens are first sorted by time, then track, then pitch values.\n* This implementation uses _Program_ tokens to distinguish tracks, on their MIDI program. Hence, two tracks with the same program will be treated as being the same.\n* Time signature and Tempo tokens are optional, you can choose to use them or not with the ```additional_tokens``` parameter.\n* [Octuple Mono](miditok/octuple_mono.py) is a modified version with no program embedding at each time step.\n\n![Octuple figure](https://github.com/Natooz/MidiTok/blob/assets/assets/octuple.png?raw=true \"Octuple sequence, with a bar and position embeddings\")\n\n### MuMIDI\n\nPresented with the [PopMAG](https://arxiv.org/abs/2008.07703) model, this tokenization made for multitrack tasks and uses embedding pooling. The time is based on _Position_ and _Bar_ tokens as REMI and Compound Word.\nThe key idea of MuMIDI is to represent every track in a single sequence. At each time step, \"_Track_\" tokens preceding note tokens indicate from which track they are. Generating with it requires however to sample from several distributions and can be delicate.\nMuMIDI also include a \"built-in\" positional encoding mechanism. As in the original paper, the pitches of drums are distinct from those of all other instruments.\n\nNOTES:\n* In MidiTok, the tokens are first sorted by time, then track, then pitch values.\n* This implementation uses _Program_ tokens to distinguish tracks, on their MIDI program. Hence, two tracks with the same program will be treated as being the same.\n\n![MuMIDI figure](https://github.com/Natooz/MidiTok/blob/assets/assets/mumidi.png?raw=true \"MuMIDI sequence, with a bar and position embeddings\")\n\n### Create your own\n\nYou can easily create your own tokenization and benefit from the MidiTok framework. Just create a class inheriting from the [MIDITokenizer](miditok/midi_tokenizer_base.py) base class, and override the ```track_to_tokens```, ```tokens_to_track```,  ```_create_vocabulary``` and ```_create_token_types_graph``` methods with your tokenization strategy.\n\nWe encourage you to read the docstring of the [Vocabulary class](miditok/vocabulary.py) to learn how to use it for your strategy.\n\n## Features\n\n### Common parameters\n\nEvery tokenization share some common parameters around which the tokenizers are built:\n\n* **Pitch range:** the MIDI norm can represent pitch values from 0 to 127, but the [GM2 specification](https://www.midi.org/specifications-old/item/general-midi-2) recommend from 21 to 108 for piano, which covers the recommended pitch values for all MIDI program. Notes with pitches under or above this range can be discarded or clipped to the limits.\n* **Beat resolution:** the number of samples within a beat. MidiTok handles this with a flexible way: a dictionary of the form `{(0, 4): 8, (3, 8): 4, ...}`. The keys are tuples indicating a range of beats, ex 0 to 4 for the first bar. The values are the resolutions, in samples per beat, of the given range, here 8 for the first. This way you can create a tokenizer with durations / time shifts of different lengths and resolutions.\n* **Number of velocities:** the number of velocity values to represent. For instance with 32, the velocities of the notes will be quantized into 32 velocity values from 0 to 127.\n* **Additional tokens:** specify which additional tokens should be included. Note that each encoding is compatible with different additional tokens.\n\nCheck [constants.py](miditok/constants.py) to see how these parameters are constructed.\n\n### Byte Pair Encoding (BPE)\n\n[BPE](https://www.derczynski.com/papers/archive/BPE_Gage.pdf) is a compression technique that originally combines the most recurrent byte pairs in a corpus.\nIn the context of tokens, it allows to combine the most recurrent token successions by replacing them with a new created symbol (token). This naturally increases the size of the vocabulary, while reducing the overall sequence length.\nToday BPE is used to build almost all tokenizations of natural language, as [it allows to encode rare words and segmenting unknown or composed words as sequences of sub-word units](https://aclanthology.org/P16-1162/).\nYou can apply it to symbolic music with MidiTok, by first learning the vocabulary (`tokenizer.learn_bpe()`), and then convert a dataset with BPE (`tokenizer.apply_bpe_to_dataset()`).\nAll tokenizations not based on embedding pooling are compatible!\n\n### Special tokens\n\nWhen creating a tokenizer, you can specify to include some special tokens in its vocabulary, by giving the arguments:\n\n* **`pad`** (default `True`) --> `PAD_None`: a padding token to use when training a model with batches of sequences of unequal lengths. The padding token will be at index 0 of the vocabulary.\n* **`sos_eos`** (default `False`) --> `SOS_None` and `EOS_None`: \"Start Of Sequence\" and \"End Of Sequence\" tokens, designed to be placed respectively at the beginning and end of a token sequence during training. At inference, the EOS token tells when to end the generation.\n* **`mask`** (default `False`) --> `MASK_None`: a masking token, to use when pre-training a (bidirectional) model with a self-supervised objective like [BERT](https://arxiv.org/abs/1810.04805).\n\n### Additional tokens\n\nMidiTok offers the possibility to insert additional tokens in the encodings.\nThese tokens bring additional information about the structure and content of MIDI tracks to explicitly use them to train a neural network.\n\n* **Chords:** indicates the presence of a chord at a certain time step. MidiTok uses a chord detection method based on onset times and duration. This allows MidiTok to detect precisely chords without ambiguity, whereas most chord detection methods in symbolic music based on chroma features can't.\n* **Rests:** includes \"Rest\" events whenever a segment of time is silent, i.e. no note is played within. This token type is decoded as a \"TimeShift\" event, meaning the time will be shifted according to its value. You can choose the minimum and maximum rests values to represent (default is 1/2 beat to 8 beats). Note that rests shorter than one beat are only divisible by the first beat resolution, e.g. a rest of 5/8th of a beat will be a succession of ```Rest_0.4``` and ```Rest_0.1```, where the first number indicate the rest duration in beats and the second in samples / positions.\n* **Tempos:** specifies the current tempo. This allows to train a model to predict tempo changes alongside with the notes, unless specified in the chart below. Tempo values are quantized on your specified range and number (default is 32 tempos from 40 to 250).\n* **Programs:** used to specify an instrument / MIDI program. MidiTok only offers the possibility to include these tokens in the vocabulary for you, but won't use them. If you need model multitrack symbolic music with other methods than Octuple / MuMIDI, MidiTok leaves you the choice / task to represent the track information the way you want. You can do it as in [LakhNES](https://github.com/chrisdonahue/LakhNES) or [MMM](https://metacreation.net/mmm-multi-track-music-machine/).\n* **Time Signature:** specifies the current time signature. Only implemented with Octuple in MidiTok a.t.w.\n\nAdditionally, MidiTok offers to include *Program* tokens in the vocabulary of MIDI-Like, REMI and CP Word.\nWe do not consider them additional tokens though as they are not used anywhere in MidiTok, but intended for you to insert them at the beginning of each sequence as *Start Of Sequence* tokens.\n\n| Token type     |   MIDI-Like   |      TSD      |     REMI      | Compound Word | Structured |    Octuple    |    MuMIDI     |\n|----------------|:-------------:|:-------------:|:-------------:|:-------------:|:----------:|:-------------:|:-------------:|\n| Chord          |       ✅       |       ✅       |       ✅       |       ✅       |     ❌      |       ❌       | ✅<sup>3</sup> |\n| Rest           |       ✅       |       ✅       | ✅<sup>2</sup> | ✅<sup>2</sup> |     ❌      |       ❌       |       ❌       |\n| Tempo          | ✅<sup>1</sup> | ✅<sup>1</sup> | ✅<sup>1</sup> | ✅<sup>1</sup> |     ❌      |       ✅       |       ✅       |\n| Program        |       ✅       |       ✅       |       ✅       |       ✅       |     ✅      | ✅<sup>5</sup> | ✅<sup>5</sup> |\n| Time signature |       ❌       |       ❌       |       ❌       |       ❌       |     ❌      |       ✅       |       ❌       |\n\n<sup>1</sup> Should not be used with multiple tracks. Otherwise, at decoding, only the events of the first track will be considered.\\\n<sup>2</sup> Position tokens are always following Rest tokens to make sure the position of the following notes are explicitly stated. Bar tokens can follow Rest tokens depending on their respective value and your parameters.\\\n<sup>3</sup> In the original MuMIDI paper, _Chord_ tokens are placed before Track tokens. We decided in MidiTok to put them after as chords are produced by one instrument, and several instruments can produce more than one chord at a time step.\\\n<sup>4</sup> Integrated by default.\n\n## Limitations\n\nTokenizations using Bar tokens (REMI, Compound Word and MuMIDI) **only considers a 4/x time signature** for now. This means that each bar is considered covering 4 beats.\n\n## Contributions\n\nContributions are gratefully welcomed, feel free to open an issue or send a PR if you want to add a tokenization or speed up the code. Just make sure to pass the [tests](tests).\n\n## Todo\n\n* Time Signature\n* Control Change messages\n* Data augmentation on duration values at the MIDI level\n* Documentation website\n\n## Citations\n\n### MidiTok:\n\n[**Paper**](https://archives.ismir.net/ismir2021/latebreaking/000005.pdf)\n```bibtex\n@inproceedings{miditok2021,\n    title={MidiTok: A Python package for MIDI file tokenization},\n    author={Nathan Fradet, Jean-Pierre Briot, Fabien Chhel, Amal El Fallah Seghrouchni, Nicolas Gutowski},\n    booktitle={Extended Abstracts for the Late-Breaking Demo Session of the 22nd International Society for Music Information Retrieval Conference},\n    year={2021}\n}\n```\n\n### Tokenizations:\n\n```bibtex\n@article{midilike2018,\n    title={This time with feeling: Learning expressive musical performance},\n    author={Oore, Sageev and Simon, Ian and Dieleman, Sander and Eck, Douglas and Simonyan, Karen},\n    journal={Neural Computing and Applications},\n    year={2018},\n    publisher={Springer}\n}\n```\n\n```bibtex\n@inproceedings{remi2020,\n    title={Pop Music Transformer: Beat-based modeling and generation of expressive Pop piano compositions},\n    author={Huang, Yu-Siang and Yang, Yi-Hsuan},\n    booktitle={Proceedings of the 28th ACM International Conference on Multimedia},\n    year={2020}\n}\n```\n\n```bibtex\n@inproceedings{cpword2021,\n    title={Compound Word Transformer: Learning to Compose Full-Song Music over Dynamic Directed Hypergraphs},\n    author={Hsiao, Wen-Yi and Liu, Jen-Yu and Yeh, Yin-Cheng and Yang, Yi-Hsuan},\n    booktitle={Proceedings of the AAAI Conference on Artificial Intelligence},\n    year={2021}\n}\n```\n\n```bibtex\n@misc{structured2021,\n    title={The Piano Inpainting Application},\n    author={Gaëtan Hadjeres and Léopold Crestel},\n    year={2021},\n    eprint={2107.05944},\n    archivePrefix={arXiv},\n    primaryClass={cs.SD}\n}\n```\n\n```bibtex\n@inproceedings{mumidi2020,\n    author = {Ren, Yi and He, Jinzheng and Tan, Xu and Qin, Tao and Zhao, Zhou and Liu, Tie-Yan},\n    title = {PopMAG: Pop Music Accompaniment Generation},\n    year = {2020},\n    publisher = {Association for Computing Machinery},\n    booktitle = {Proceedings of the 28th ACM International Conference on Multimedia}\n}\n```\n\n```bibtex\n@misc{octuple2021,\n    title={MusicBERT: Symbolic Music Understanding with Large-Scale Pre-Training}, \n    author={Mingliang Zeng and Xu Tan and Rui Wang and Zeqian Ju and Tao Qin and Tie-Yan Liu},\n    year={2021},\n    eprint={2106.05630},\n    archivePrefix={arXiv},\n    primaryClass={cs.SD}\n}\n```\n\n\n\n## Acknowledgments\n\nWe acknowledge [Aubay](https://blog.aubay.com/index.php/language/en/home/?lang=en), the [LIP6](https://www.lip6.fr/?LANG=en), [LERIA](http://blog.univ-angers.fr/leria/n) and [ESEO](https://eseo.fr/en) for the financing and support of this project.\nSpecial thanks to all the contributors.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/Natooz/MidiTok",
    "keywords": "artificial intelligence,deep learning,transformer,midi,tokenization,music,mir",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "miditok",
    "package_url": "https://pypi.org/project/miditok/",
    "platform": null,
    "project_url": "https://pypi.org/project/miditok/",
    "project_urls": {
      "Homepage": "https://github.com/Natooz/MidiTok"
    },
    "release_url": "https://pypi.org/project/miditok/1.4.0/",
    "requires_dist": [
      "numpy (<1.24,>=1.19)",
      "miditoolkit (>=0.1.16)",
      "tqdm"
    ],
    "requires_python": "",
    "summary": "A convenient MIDI tokenizer for Deep Learning networks, with multiple encoding strategies",
    "version": "1.4.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17376317,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "9e22a5f820f81070052048c6505e8d4f8c3164b45d43915b1f2063b45bc5bd4d",
        "md5": "1fec16e4175949a719960ee3696f0a29",
        "sha256": "c507c09a7ac0dbf9949f492f87f55e54ebb96930de2f8e7a38f1a042cc0b20f0"
      },
      "downloads": -1,
      "filename": "miditok-1.4.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "1fec16e4175949a719960ee3696f0a29",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 83806,
      "upload_time": "2023-01-13T16:47:17",
      "upload_time_iso_8601": "2023-01-13T16:47:17.858746Z",
      "url": "https://files.pythonhosted.org/packages/9e/22/a5f820f81070052048c6505e8d4f8c3164b45d43915b1f2063b45bc5bd4d/miditok-1.4.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "b2831a97406ccf64b6b0afdcbbd52c78cac7ad12e0e6fcc830c15722e193f523",
        "md5": "ae8428118afc7aa29613e08d73238a6f",
        "sha256": "67f91d2deeaea76ed213ab7826f3fd9ee2f1f8188c14f324e9f2bff0097bf38f"
      },
      "downloads": -1,
      "filename": "miditok-1.4.0.tar.gz",
      "has_sig": false,
      "md5_digest": "ae8428118afc7aa29613e08d73238a6f",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 69129,
      "upload_time": "2023-01-13T16:47:19",
      "upload_time_iso_8601": "2023-01-13T16:47:19.671775Z",
      "url": "https://files.pythonhosted.org/packages/b2/83/1a97406ccf64b6b0afdcbbd52c78cac7ad12e0e6fcc830c15722e193f523/miditok-1.4.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}