{
  "info": {
    "author": "Philippe Docourt",
    "author_email": "philippe@docourt.ch",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "Framework :: Django :: 2.2",
      "Framework :: Django :: 3.2",
      "Intended Audience :: Developers",
      "License :: OSI Approved :: BSD License",
      "Natural Language :: English",
      "Programming Language :: Python :: 3 :: Only",
      "Topic :: Internet :: WWW/HTTP",
      "Topic :: Software Development :: Libraries :: Python Modules"
    ],
    "description": "# Django QR Code\n[![Latest PyPI version](https://badge.fury.io/py/django-qr-code.svg)](https://badge.fury.io/py/django-qr-code)\n[![Downloads](https://img.shields.io/pypi/dm/django-qr-code.svg)](https://pypi.python.org/pypi/django-qr-code)\n[![Documentation Status](https://readthedocs.org/projects/django-qr-code/badge/?version=latest)](http://django-qr-code.readthedocs.io/en/latest/)\n[![Build Status](https://travis-ci.com/dprog-philippe-docourt/django-qr-code.svg?branch=master)](https://travis-ci.com/dprog-philippe-docourt/django-qr-code)\n[![Maintainability](https://api.codeclimate.com/v1/badges/c47e79bf51f6a2bb8264/maintainability)](https://codeclimate.com/github/dprog-philippe-docourt/django-qr-code/maintainability)\n[![Coverage Status](https://coveralls.io/repos/github/dprog-philippe-docourt/django-qr-code/badge.svg?branch=master)](https://coveralls.io/github/dprog-philippe-docourt/django-qr-code?branch=master)\n\nThis is an application that provides tools for displaying QR codes on your [Django](https://www.djangoproject.com/) site.\n\nThis application depends on the [Segno QR Code generator](https://pypi.org/project/segno/) library.\n\nThis app makes no usage of the Django models and therefore do not use any database.\n\nOnly Python >= 3.7 is supported.\n\n## Installation\n\n### Binary Package from PyPi\nIn order to use this app in a Django project, the simplest way is to install it from [PyPi](https://pypi.python.org/pypi/django-qr-code):\n```bash\npip install django-qr-code\n```\n\n### From the Source Code\nIn order to modify or test this app you may want to install it from the source code.\n\nClone the [GitHub repository](https://github.com/dprog-philippe-docourt/django-qr-code) and then run:\n```bash\npip install -r requirements.txt -r requirements-dev.txt\npython manage.py collectstatic --no-input\n```\n\n## Usage\nStart by adding `qr_code` to your `INSTALLED_APPS` setting like this:\n```python\nINSTALLED_APPS = (\n    # ...,\n    'qr_code',\n)\n```\n\nYou need to load the tags provided by this app in your template with:\n```djangotemplate\n{% load qr_code %}\n```\n\nThe source code on [GitHub](https://github.com/dprog-philippe-docourt/django-qr-code) contains a simple demo app. Please check out the [templates folder](https://github.com/dprog-philippe-docourt/django-qr-code/tree/master/qr_code_demo/templates/qr_code_demo) for an example of template, and the [setting](https://github.com/dprog-philippe-docourt/django-qr-code/tree/master/demo_site/settings.py) and [urls](https://github.com/dprog-philippe-docourt/django-qr-code/tree/master/demo_site/urls.py) files for an example of configuration and integration.\n\n### Generating Inline QR Code in your HTML (qr_from_text)\nThe tag **`qr_from_text`** generates an embedded `svg` or `img` tag within the HTML code produced by your template.\n\nThe following renders a tiny \"hello world\" QR code with a `svg` tag:\n```djangotemplate\n{% qr_from_text \"Hello World!\" size=\"T\" %}\n```\nHere is a medium \"hello world\" QR code with an `img` tag:\n```djangotemplate\n{% qr_from_text \"Hello World!\" size=\"m\" image_format=\"png\" error_correction=\"L\" %}\n```\n\n### QR Code Rendering Options\n\nThe `size` parameter gives the size of each module of the QR code matrix. It can be either a positive integer or one of the following letters:\n\n* t or T: tiny (value: 6)\n* s or S: small (value: 12)\n* m or M: medium (value: 18)\n* l or L: large (value: 30)\n* h or H: huge (value: 48)\n\nFor PNG image format the size unit is in pixels, while the unit is 1 mm for SVG format.\n\nHere is a \"hello world\" QR code using the version 12:\n```djangotemplate\n{% qr_from_text \"Hello World!\" size=8 version=12 %}\n```\nThe `version` parameter is an integer from 1 to 40 that controls the size of the QR code matrix. Set to None to determine this automatically. The smallest, version 1, is a 21 x 21 matrix. The biggest, version 40, is 177 x 177 matrix. The size grows by 4 modules/side.\n\nHere is a \"hello world\" QR code using a border of 6 modules:\n```djangotemplate\n{% qr_from_text \"Hello World!\" size=10 border=6 %}\n```\nThe `border` parameter controls how many modules thick the border should be (the default is 4, which is the minimum according to the specs).\n\nThere are 4 error correction levels used for QR codes, with each one adding different amounts of \"backup\" data\ndepending on how much damage the QR code is expected to suffer in its intended environment, and hence how much\nerror correction may be required. The correction level can be configured with the `error_correction` parameter as follows:\n* l or L: error correction level L – up to 7% damage\n* m or M: error correction level M – up to 15% damage\n* q or Q: error correction level Q – up to 25% damage\n* h or H: error correction level H – up to 30% damage\n\nYou may enforce the creation of a Micro QR Code with `micro=True`. The `micro` option defaults to `False`.\n\nThe `encoding` option controls the text encoding used in mode \"byte\" (used for any general text content). By default `encoding` is ``UTF-8``. When set to ``None``, the implementation (based on Segno) tries to use the standard conform ISO/IEC 8859-1 encoding and if it does not fit, it will use UTF-8. Note that no ECI mode indicator is inserted by default (see `eci` option). The `encoding` parameter is case-insensitive.\n\nThe `boost_error` indicates whether the QR code encoding engine (Segno) tries to increase the error correction level if it does not affect the version. Error correction level is not increased when it impacts the version of the code.\n\nThe `eci` option indicates if binary data which does not use the default encoding (ISO/IEC 8859-1) should enforce the ECI mode. Since a lot of QR code readers do not support the ECI mode, this feature is disabled by default and the data is encoded in the provided encoding using the usual “byte” mode. Set eci to `True` if an ECI header should be inserted into the QR Code. Note that the implementation may not know the ECI designator for the provided encoding and may raise an exception if the ECI designator cannot be found. The ECI mode is not supported by Micro QR Codes.\n\nAlternatively, you may use the `options` keyword argument with an instance of `QRCodeOptions` as value instead of listing every requested options. Here is an example of view: \n```python\nfrom django.shortcuts import render\nfrom qr_code.qrcode.utils import QRCodeOptions\n\ndef my_view(request):\n    # Build context for rendering QR codes.\n    context = dict(\n        my_options=QRCodeOptions(size='t', border=6, error_correction='L'),\n    )\n\n    # Render the view.\n    return render(request, 'my_app/my_view.html', context=context)\n```\n\nand an example of template for the view above:\n```djangotemplate\n{% qr_from_text \"Hello World!\" options=my_options %}\n```\n\n### Generating URLs to QR Code Images (qr_url_from_text)\nThe **`qr_url_from_text`** tag generates an url to an image representing the QR code. It comes with the same options as `qr_from_text` to customize the image format (SVG or PNG), the size, the border, and the matrix size. It also has an additional option **`cache_enabled`** to disable caching of served image.\n\nHere is a medium \"hello world\" QR code that uses an URL to serve the image in SVG format:\n\n```djangotemplate\n<img src=\"{% qr_url_from_text \"Hello World!\" %}\" alt=\"Hello World!\">\n```\n\nHere is a \"hello world\" QR code in version 10 that uses an URL to serve the image in PNG format:\n\n```djangotemplate\n<img src=\"{% qr_url_from_text \"Hello World!\" size=8 version=10 image_format='png' %}\" alt=\"Hello World!\">\n```\n\nThe image targeted by the generated URL is served by a view provided in `qr_code.urls`. Therefore, you need to include the URLs provided by `qr_code.urls` in your app in order to make this tag work. This can be achieved with something like this:\n\n```python\nfrom django.conf.urls import include\nfrom django.urls import path\n\nurlpatterns = [\n    path('qr_code/', include('qr_code.urls', namespace=\"qr_code\")),\n]\n```\n\nThe QR code images are served via a URL named **`qr_code:serve_qr_code_image`**. You can customize the path under which the images are served (i.e. the path bound to the URL named `qr_code:serve_qr_code_image`) with the optionnal setting **`SERVE_QR_CODE_IMAGE_PATH`** which defaults to `images/serve-qr-code-image/`. Note that the trailing slash is mandatory and that defining this setting to an empty string leads to using the default value. The example below will serve any QR code image from `<base URL or your application>/qr-code-image/`:\n\n```python\n# In urls.py\nfrom django.conf.urls import include\nfrom django.urls import path\n\nurlpatterns = [\n    path('', include('qr_code.urls', namespace='qr_code')),\n]\n\n# In your settings\nSERVE_QR_CODE_IMAGE_PATH = 'qr-code-image/'\n```\n\n### Special encoding modes with qr_from_data and qr_url_from_data\nThe tags **`qr_from_data`** and  **`qr_url_from_data`** produce results similar to those of `qr_from_text` and `qr_url_from_text`, but they avoid converting everything to text (UTF-8 encoded by default, or any supported charset depending on `encoding` option).\n\nThe ISO/IEC 18004 standard defines four modes in order to encode the data as efficiently as possible.\n\n#### Numeric mode\nThe numeric mode is the most efficient way to encode digits. This mode does not cover negative numbers because it does not support the minus sign (or plus sign).\n\nThe numeric mode is supported by QR Codes and Micro QR Codes. The encoding engine detects (Segno) the numeric mode if the data is provided as string (e.g. '54') or integer (e.g. 54) to `qr_from_data` or `qr_url_from_data`.\n\n#### Alphanumeric mode\nThe alphanumeric mode extends the numeric mode by various characters. Namely, about the upper case letters ABCDEFGHIJKLMNOPQRSTUVWXYZ, a space character \" \" and other letters $%*+-./:.\n\n#### Kanji mode\nKanji can be encoded compactly and efficiently and requires significantly less space than encoding the characters in UTF-8.\n\n#### Byte mode\nThe byte mode covers all data which cannot be represented by the other modes. When the `encoding` option is set to `None`, the encoding engine (Segno) detects, according to ISO/IEC 18004, to encode the data with ISO 8859-1. In case the data cannot be represented by ISO 8859-1, UTF-8 is used as fallback.\n\nNOTE: When using `qr_from_text` or `qr_url_from_text`, the byte mode with UTF-8 encoding is forced by default . You may use the `encoding` option to change this behavior. It appears to be one of the most portable way of encoding text for proper decoding among the readers.\n\n#### Examples\nThe following renders a tiny numeric QR code containing the value `2021` with a `svg` tag:\n```djangotemplate\n{% qr_from_data 2021 size=\"T\" %}\n```\n\nHere is a micro QR code with an `img` tag containing the value `2021`:\n```djangotemplate\n{% qr_from_data 2021 micro=True image_format=\"png\" %}\n```\n\n### Caching Served Images\n\nA large QR code (version 40) requires 0.2 second to be generated on a powerful machine (in 2018), and probably more than half a second on a really cheap hosting.\n\nThe image served by the *qr_code* app can be cached to improve performances and reduce CPU usage required to generate the QR codes. In order to activate caching, you simply need to declare a cache alias with the setting **`QR_CODE_CACHE_ALIAS`** to indicate in which cache to store the generated QR codes.\n\nFor instance, you may declare an additional cache for your QR codes like this in your Django settings:\n```python\nCACHES = {\n    'default': {\n        'BACKEND': 'django.core.cache.backends.locmem.LocMemCache',\n    },\n    'qr-code': {\n        'BACKEND': 'django.core.cache.backends.locmem.LocMemCache',\n        'LOCATION': 'qr-code-cache',\n        'TIMEOUT': 3600\n    }\n}\n\nQR_CODE_CACHE_ALIAS = 'qr-code'\n```\n\nThe `QR_CODE_CACHE_ALIAS = 'qr-code'` tells the *qr_code* app to use that cache for storing the generated QR codes. All QR codes will be cached with the specified *TIMEOUT* when a non-empty value is set to `QR_CODE_CACHE_ALIAS`.\n\nIf you want to activate the cache for QR codes, but skip the caching for some specific codes, you can use the keyword argument `cache_enabled=False` when using `qr_url_from_text`.\n\nHere is a \"hello world\" QR code in version 20 with an error correction level Q (25% of redundant data) that uses a URL to serve the image in SVG format, and disable caching for served image:\n```djangotemplate\n<img src=\"{% qr_url_from_text \"Hello World!\" size=8 version=20 error_correction=\"Q\" cache_enabled=False %}\" alt=\"Hello World!\">\n```\n\n### Protecting Access to QR Code Images\n\nThe default settings protect the URLs that serve QR code images against external requests, and thus against possibly easy (D)DoS attacks.\n\nHere are the available settings to manage the protection for served images:\n```python\nfrom qr_code.qrcode import constants\n\nQR_CODE_URL_PROTECTION = {\n    constants.TOKEN_LENGTH: 30,                         # Optional random token length for URL protection. Defaults to 20.\n    constants.SIGNING_KEY: 'my-secret-signing-key',     # Optional signing key for URL token. Uses SECRET_KEY if not defined.\n    constants.SIGNING_SALT: 'my-signing-salt',          # Optional signing salt for URL token.\n    constants.ALLOWS_EXTERNAL_REQUESTS_FOR_REGISTERED_USER: True  # Tells whether a registered user can request the QR code URLs from outside a site that uses this app. It can be a boolean value used for any user or a callable that takes a user as parameter. Defaults to False (nobody can access the URL without the signature token).\n}\n```\n\n#### Signing Request URLs\n\nBy default, the application only serves QR code images for authenticated URLs (requests generated from your application and addressed to your application). The authentication uses a HMAC to sign the request query arguments. The authentication code is passed as a query argument named **`token`** which is automatically generated by `qr_url_from_text`  or `qr_url_from_data`. Whenever the signature is invalid, the application returns a *HTTP 403 Permission denied* response when processing the request for serving a QR code image.\n\nThis mechanism ensures that, by default, nobody can send external requests to your application to obtain custom QR codes for free. This is especially useful if you display QR code URLs on public pages (no user authentication).\n\nThe `token` query argument is not mandatory and, when a request reaches the `qr_code:serve_qr_code_image` URL without that token, the protection mechanism falls back to the user authentication mechanism (see chapter below).\n\nIt is possible to explicitly remove the  signature token that protects a specific URL with the parameter **`url_signature_enabled=False`**. Here is a \"hello world\" QR code that uses a URL to serve the image in SVG format without the `token` query argument :\n\n```djangotemplate\n<img src=\"{% qr_url_from_text \"Hello World!\" url_signature_enabled=False %}\" alt=\"Hello World!\">\n```\n\nThe `token` parameter will not be part of the query string of the generated URL, making possible to build a simpler, predictable URL. However, this will trigger the user authentication mechanism (see chapter below).\n\n#### Handling User Authentication when Serving QR Code Images\n\nIf you are interested in providing the QR code images as a service, there is a setting named **`ALLOWS_EXTERNAL_REQUESTS_FOR_REGISTERED_USER`** to grant access to some controlled users. This setting tells who can bypass the url signature token (see chapter above). It can be a boolean value used for any authenticated user, or a callable that takes a user as only parameter.\n\nSetting the `ALLOWS_EXTERNAL_REQUESTS_FOR_REGISTERED_USER` option to `True` tells the application to serve QR code images to authenticated users only. Hence, to grant access to any authenticated user to generated images, you can use this in your settings:\n\n```python\nfrom qr_code.qrcode import constants\n\nQR_CODE_URL_PROTECTION = {\n    constants.ALLOWS_EXTERNAL_REQUESTS_FOR_REGISTERED_USER: True\n}\n```\n\nSetting the option `ALLOWS_EXTERNAL_REQUESTS_FOR_REGISTERED_USER` to a callable that always returns `True` (even for anonymous users) will allow anyone to access QR code image generation from outside your Django app. The following settings will grant access to anonymous users to generated images:\n\n```python\nfrom qr_code.qrcode import constants\n\nQR_CODE_URL_PROTECTION = {\n    constants.ALLOWS_EXTERNAL_REQUESTS_FOR_REGISTERED_USER: lambda u: True\n}\n```\n\nPlease note that, if your service is available on the Internet, allowing anyone to generate any kind of QR code via your Django application - as shown above - might generate a very heavy load on your server.\n\n### QR Codes for Apps\n\nAside from generating a QR code from a given text, you can also generate codes for specific application purposes, that a reader can interpret as an action to take: open a mail client to send an e-mail to a given address, add a contact to your phone book, connect to a Wi-Fi, start a SMS, etc.  See [this documentation](https://github.com/zxing/zxing/wiki/Barcode-Contents) about what a QR code can encode.\n\nDjango QR Code proposes several utility tags to ease the generation of such codes, without having to build the appropriate text representation for each action you need. This remove the hassle of reading the specifications and handling all the required escaping for reserved chars.\n\nPlease note that some commands are common patterns, rather than formal specifications. Therefore, there is no guarantee that all QR code readers will handle them properly.\n\nThe following tags targeting apps are available:\n* `qr_for_email` and `qr_url_for_email`\n* `qr_for_tel` and `qr_url_for_tel`\n* `qr_for_sms` and `qr_url_for_sms`\n* `qr_for_geolocation` and `qr_url_for_geolocation`\n* `qr_for_google_maps` and `qr_url_for_google_maps`\n* `qr_for_youtube` and `qr_url_for_youtube`\n* `qr_for_google_play` and `qr_url_for_google_play`\n* `qr_for_mecard` and `qr_url_for_mecard`\n* `qr_for_vcard` and `qr_url_for_vcard`\n* `qr_for_wifi` and `qr_url_for_wifi`\n* `qr_for_epc` and `qr_url_for_epc`\n* `qr_for_contact` and `qr_url_for_contact` (legacy, do not use in new projects)\n\nYou could write a view like this:\n\n```python\nfrom datetime import date\nfrom django.shortcuts import render\nfrom qr_code.qrcode.utils import MeCard, VCard, EpcData, WifiConfig, Coordinates, QRCodeOptions\n\n\ndef application_qr_code_demo(request):\n    # Use a MeCard instance to encapsulate the detail of the contact.\n    mecard_contact = MeCard(\n        name='Doe, John',\n        phone='+41769998877',\n        email='j.doe@company.com',\n        url='http://www.company.com',\n        birthday=date(year=1985, month=10, day=2),\n        memo='Development Manager',\n        org='Company Ltd'\n    )\n\n    # Use a VCard instance to encapsulate the detail of the contact.\n    vcard_contact = VCard(\n        name='Doe; John',\n        phone='+41769998877',\n        email='j.doe@company.com',\n        url='http://www.company.com',\n        birthday=date(year=1985, month=10, day=2),\n        street='Cras des Fourches 987',\n        city='Delémont',\n        zipcode=2800,\n        region='Jura',\n        country='Switzerland',\n        memo='Development Manager',\n        org='Company Ltd'\n    )\n\n    # Use a WifiConfig instance to encapsulate the configuration of the connexion.\n    wifi_config = WifiConfig(\n        ssid='my-wifi',\n        authentication=WifiConfig.AUTHENTICATION.WPA,\n        password='wifi-password'\n    )\n\n    # Use a EpcData instance to encapsulate the data of the European Payments Council Quick Response Code.\n    epc_data = EpcData(\n        name='Wikimedia Foerdergesellschaft',\n        iban='DE33100205000001194700',\n        amount=50.0,\n        text='To Wikipedia'\n    )\n\n    # Build coordinates instances.\n    google_maps_coordinates = Coordinates(latitude=586000.32, longitude=250954.19)\n    geolocation_coordinates = Coordinates(latitude=586000.32, longitude=250954.19, altitude=500)\n\n    # Build context for rendering QR codes.\n    context = dict(\n        mecard_contact=mecard_contact,\n        vcard_contact=vcard_contact,\n        wifi_config=wifi_config,\n        epc_data=epc_data,\n        video_id='J9go2nj6b3M',\n        google_maps_coordinates=google_maps_coordinates,\n        geolocation_coordinates=geolocation_coordinates,\n        options_example=QRCodeOptions(size='t', border=6, error_correction='L'),\n    )\n\n    # Render the index page.\n    return render(request, 'my_app/application_qr_code_demo.html', context=context)\n```\n\nThen, in your template, you can render the appropriate QR codes for the given context:\n```djangotemplate\n<h3>Add contact '{{ mecard_contact.name }}' to phone book</h3>\n{% qr_for_mecard mecard=mecard_contact size='S' %}\n<p>or:</p>\n{% qr_for_contact mecard_contact size='S' %}\n<p>or:</p>\n{% qr_for_contact mecard_contact options=options_example %}\n\n<h3>Add contact '{{ vcard_contact.name }}' to phone book</h3>\n{% qr_for_vcard vcard=vcard_contact size='S' %}\n<p>or:</p>\n{% qr_for_contact vcard_contact size='S' %}\n<p>or:</p>\n{% qr_for_contact vcard_contact options=options_example %}\n\n<h3>Configure Wi-Fi connexion to '{{ wifi_config.ssid }}'</h3>\n<img src=\"{% qr_url_for_wifi wifi_config=wifi_config size='T' error_correction='Q' %}\">\n<p>or:</p>\n<img src=\"{% qr_url_for_wifi wifi_config size='T' error_correction='Q' %}\">\n<p>or:</p>\n<img src=\"{% qr_url_for_wifi wifi_config options=options_example %}\">\n\n<h3>EPC QR Code'</h3>\n<img src=\"{% qr_url_for_epc epc_data=epc_data %}\">\n<p>or:</p>\n<img src=\"{% qr_url_for_epc epc_data size='H' %}\">\n\n<h3>Watch YouTube video '{{ video_id }}'</h3>\n{% qr_for_youtube video_id image_format='png' size='T' %}\n<p>or:</p>\n{% qr_for_youtube video_id options=options_example %}\n\n<h3>Open map at location: ({{ geolocation_coordinates }})</h3>\n<img src=\"{% qr_url_for_geolocation coordinates=geolocation_coordinates %}\">\n<p>or:</p>\n<img src=\"{% qr_url_for_geolocation latitude=geolocation_coordinates.latitude longitude=geolocation_coordinates.longitude altitude=geolocation_coordinates.altitude %}\">\n<p>or:</p>\n<img src=\"{% qr_url_for_geolocation latitude=geolocation_coordinates.latitude longitude=geolocation_coordinates.longitude altitude=geolocation_coordinates.altitude options=options_example %}\">\n\n<h3>Open Google Maps App at location: ({{ google_maps_coordinates }})</h3>\n{% qr_for_google_maps coordinates=google_maps_coordinates %}\n<p>or:</p>\n{% qr_for_google_maps latitude=google_maps_coordinates.latitude longitude=google_maps_coordinates.longitude %}\n<p>or:</p>\n{% qr_for_google_maps latitude=google_maps_coordinates.latitude longitude=google_maps_coordinates.longitude options=options_example %}\n```\n\nPlease check out the [demo application](#demo-application) to see more examples.\n\n## Notes\n\n### Image Formats\nThe SVG is the default image format. It is a vector image format so it can be scaled up and down without quality loss. However, it has two drawbacks. The size is not given in pixel, which can be problematic if the design of your website relies on a fixed width (in pixels). The format is less compact than PNG and results in a larger HTML content. Note that a base64 PNG is less compressible than a SVG tag, so it might not matter that much of you use HTML compression on your web server.\n\nSVG has [broad support](http://caniuse.com/#feat=svg) now, and it will work properly on any modern web browser.\n\n### qr_from_text vs qr_url_from_text\nThe tag `qr_url_from_text` has several advantages over `qr_from_text`, despite the fact that it requires a bit more of writing:\n* the generated HTML code does not contain heavy inline image data (lighter and cleaner content)\n* the generated images can be cached (served with a separate HTML request)\n* the HTML tag used to render the QR code is always an `<img>` tag, which may simplify CSS handling\n* the HTML tag embedding the image is not generated for you, which allows for customization of attributes (*height*, *width*, *alt*)\n* the page can be loaded asynchronously, which improves responsiveness\n* you can provide links to QR codes instead of displaying them, which is not possible with `qr_from_text`\n\nOne disadvantage of `qr_url_from_text` is that it increases the number of requests to the server: one request to serve the page containing the URL and another to request the image.\n\nBe aware that serving image files (which are generated on the fly) from a URL can be abused and lead to (D)DoS attack pretty easily, for instance by requesting very large QR codes from outside your application. This is the reason why the associated setting `ALLOWS_EXTERNAL_REQUESTS_FOR_REGISTERED_USER` in `QR_CODE_URL_PROTECTION` defaults to completely forbid external access to the API. Be careful when opening external access.\n\n### QR Codes Caching\nCaching QR codes reduces CPU usage, but the usage of `qr_url_from_text` (which caching depends on) increases the number of requests to the server (one request to serve the page containing the URL and another to request the image).\n\nMoreover, be aware that the largest QR codes, in version 40 with a border of 4 modules and rendered in SVG format, have a size of ~800 KB.\nBe sure that your cache options are reasonable and can be supported by your server(s), especially for in-memory caching.\n\nNote that even without caching the generated QR codes, the app will return a *HTTP 304 Not Modified* status code whenever the same QR code is requested again. The URL named **`qr_code:serve_qr_code_image`** adds the `ETag` and `Last-Modified` headers to the response if the headers aren't already set, enabling  *HTTP 304 Not Modified* response upon following requests.\n\n## Demo Application\nIf you want to try this app, you may want to use the demo application shipped alongside the source code.\n\nGet the source code from [GitHub](https://github.com/dprog-philippe-docourt/django-qr-code), follow the [installation instructions](#from-the-source-code) above, and run the `runserver` command of Django:\n```bash\npython manage.py runserver\n```\nThe demo application should be running at <http://127.0.0.1:8000/qr-code-demo/>.\n\nIf you have [Docker Compose](https://docs.docker.com/compose/) installed, you can simply run the following from a terminal (this will save you the burden of setting up a proper python environment):\n```bash\ncd scripts\n./run-demo-app.sh\n```\nThe demo application should be running at <http://127.0.0.1:8910/qr-code-demo/>.\n\n## Testing\nGet the source code from [GitHub](https://github.com/dprog-philippe-docourt/django-qr-code), follow the [installation instructions](#from-the-source-code) above, and run the `test` command of Django:\n```bash\npython manage.py test\n```\nThis will run the test suite with the locally installed version of Python and Django.\n\nIf you have [Docker Compose](https://docs.docker.com/compose/) installed, you can simply run the following from a terminal (this will save you the burden of setting up a proper python environment):\n```bash\ncd scripts\n./run-tests.sh\n```\nThis will run the test suite with all supported versions of Python and Django. The test results are stored within `tests_result` folder.\n\n## Projects Using this App\n\nThis app is used in the following projects:\n* [MyGym Web](https://mygym-web.ch/): a web platform for managing sports clubs. The QR codes are used for importing members' contact information in a phone book.\n* [Gymna-Score](https://gymna-score.acjg.ch/): a web platform for entering scores during gymnastics competitions organized by the Association Cantonale Jurassienne de Gymnastique (ACJG). The QR codes are used to provide an easy way for the public to follow an ongoing competition. They are also used to authenticate judges that need to enter scores.\n* [AC-Ju](https://www.ac-ju.ch/): a website that generates digital vouchers that can be redeemed at affiliate merchants.\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/dprog-philippe-docourt/django-qr-code",
    "keywords": "qr code django",
    "license": "BSD 3-clause",
    "maintainer": "Philippe Docourt",
    "maintainer_email": "",
    "name": "django-qr-code",
    "package_url": "https://pypi.org/project/django-qr-code/",
    "platform": "",
    "project_url": "https://pypi.org/project/django-qr-code/",
    "project_urls": {
      "Homepage": "https://github.com/dprog-philippe-docourt/django-qr-code"
    },
    "release_url": "https://pypi.org/project/django-qr-code/3.0.0/",
    "requires_dist": [
      "segno",
      "django (>=2.2)"
    ],
    "requires_python": ">=3.7",
    "summary": "An application that provides tools for displaying QR codes on your Django site.",
    "version": "3.0.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 14579677,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "a15e533bc9d3ad967752e9c498b5b4bd0928e8ec0c2884f7c1a41f102d9d408c",
        "md5": "6e6fba383624e047dc9c232eb92c05a3",
        "sha256": "61c589ed3d48c1ac7b11997d3a3b3e4418d786406171dea87d891934cd56d80a"
      },
      "downloads": -1,
      "filename": "django_qr_code-3.0.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "6e6fba383624e047dc9c232eb92c05a3",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.7",
      "size": 28540,
      "upload_time": "2021-11-27T17:40:53",
      "upload_time_iso_8601": "2021-11-27T17:40:53.072299Z",
      "url": "https://files.pythonhosted.org/packages/a1/5e/533bc9d3ad967752e9c498b5b4bd0928e8ec0c2884f7c1a41f102d9d408c/django_qr_code-3.0.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "707a0165e186f24c0745b6bc005592531b56abe86ebc1096d4a2a5e8719e54c7",
        "md5": "73ab36d9dc8b5c2dbee2acefdd9b6d20",
        "sha256": "58c8a46b91086cd7eaed3e29298c7e0f499ace0c0329dd97b02243a0afa475a4"
      },
      "downloads": -1,
      "filename": "django-qr-code-3.0.0.tar.gz",
      "has_sig": false,
      "md5_digest": "73ab36d9dc8b5c2dbee2acefdd9b6d20",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7",
      "size": 29569,
      "upload_time": "2021-11-27T17:40:55",
      "upload_time_iso_8601": "2021-11-27T17:40:55.327836Z",
      "url": "https://files.pythonhosted.org/packages/70/7a/0165e186f24c0745b6bc005592531b56abe86ebc1096d4a2a5e8719e54c7/django-qr-code-3.0.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}