{
  "info": {
    "author": "George Pantelopulos, Aaron Liberatore",
    "author_email": "",
    "bugtrack_url": null,
    "classifiers": [
      "Intended Audience :: Science/Research",
      "License :: OSI Approved :: MIT License",
      "Topic :: Scientific/Engineering :: Bio-Informatics",
      "Topic :: Scientific/Engineering :: Chemistry"
    ],
    "description": "# MolPainter\n\n## Table of Contents\n- [Introducing MolPainter and MolSolvator](#introducing-molpainter-and-molsolvator)\n- [Installation](#installation)\n- [MolPainter Usage](#molpainter-usage)\n  * [Buttons](#buttons)\n  * [Molecule palette](#molecule-palette)\n  * [Layers](#layers)\n  * [PDB files for molecules](#pdb-files-for-molecules)\n- [MolSolvator Usage](#molsolvator-usage)\n- [Give it a try!](#give-it-a-try)\n\n## Introducing MolPainter and MolSolvator\n#### Tools for building and solvating complex, planar molecular systems of arbitrary molecular composition and placement via painting.\n\n![Screenshot](https://raw.githubusercontent.com/gpantel/MolPainter/master/tutorial/images/TutorialFigure.png)\n\nMolPainter is a novel graphical tool that enables users to specifically define the location of molecules in multi-layered, planar molecular systems. MolPainter achieves this by treating each plane of a hypothetical molecular system, defined by a z-axial position, as a two dimensional grids which serve as canvases. By associating molecular structures (in PDB format) to colors, these canvases can be painted to precisely define molecular environments.\n\nMolSolvator, the sister program of MolPainter, is a command line tool that can rapidly solvate such planar systems within the context of the lattices of the \"solute\" systems produced by MolPainter.\n\n## Installation\n\nInstall through pip:\n```\npip install MolPainter\n```\n\nRun from the command line:\n```\nmolpainter\n```\n\n```\nmolsolvator -i input.toml\n```\n\n## MolPainter Usage\n### Buttons\n* Topbar buttons\n    - **New** resets everything in MolPainter.\n    - **Open Painting** loads a saved MolPainter state so you can continue changing your painting.\n    - **Save Painting** saves a MolPainter state for later! This is a JSON-format file.\n    - **Export System** constructes your painted system in PDB format. You can construct your system on square lattices or hexagonal lattices.\n    - **Import Solute** *NEW IN 1.1!!* inserts a solute (PDBfile) to the MolPainter canvases, obstructing cells occupied by the solute coordinates and outputting the solute with the painting when exported.\n    - **New Molecule** loads a PDB file corresponding to a molecule you wish to paint with. You can also set all painted copies of the molecule to be randomly rotated around the z-axis or be flipped 180˚ over the x-axis (like for lipid bilayers).\n    - **New Blend** makes a \"blend\" of molecules. Blends draw molecules onto layer canvases with a weighted probability, running a RNG to determine which of the molecules that compose the blend are painted given their weighted probability.\n    - **New Layer** makes new layers to paint on, defined by a z-axial position.\n    - **Grid Size** sets the lattice width - the number of cells in each layer along the x-axis, the lattice height - the number of cells in each layer along the y-axis, the lattice spacing - the length of *each* cell, and the major gridline spacing, used for visual guidance when painting. \n\n* Toolbox buttons\n    - **Magnifying glass -** zooms out from the lattice view.\n    - **Magnifying glass +** zooms in on the lattice view.\n    - **Pencil** enables the pencil drawing tool. Click and hold to draw selected molecule/blend.\n    - **Square** enables the square selection tool. Click position to start drawing a rectilinear shape, hold, move, and release at position to fill selected molecule/blend into the rectilinear shape. *Can also be used via a ctrl+click shortcut*\n    - **Spray can** sprays selected molecule/blend into an area. *Can also be used via a shift+click shortcut*\n    - **Spray radius** adjust the radius of the spray can.\n\n### Molecule palette\nThe molecule palette, located to the lower left of MolPainter, contains a list of all molecules and blends loaded via the *New Molecule* and *New Blend* buttons, in order. The *Empty* molecule is always present, and is essentially an \"eraser\".\n\nWhen you want to paint with a molecule or blend in the palette, click on the radio button. You can *edit*, *copy*, or *delete* any molecule via a drop-down menu that appears when right-clicked.\n\n### Layers\nThe canvas layers to which molecules and blends are painted, created using *New Layer*, can be selected for painting by clicking on the corresponding layer button, which can be named. Layer names and z-axial positions can also be edited via a drop-down menu that appears when the layer button is right-clicked.\n\n### PDB files for molecules\nThe conformation of the molecule in PDB files loaded to MolPainter are only translated or translated + rotated. Typically you would want to orient an input PDB file along the z-axis. The position that defines where the molecule will be translated into the layer grid (e.g. atoms defining the hydrophilic plane of a lipid bilayer) is defined by the tempfactor/b-factors column. Typically temperature/b-factors are set to 0, but if set to 1, MolPainter will use the center of geometry of all atoms set to 1 to define where the molecule will be placed once the painting is exported.\n\nFor example, in a lipid bilayer, a user might select lipid ester oxygen atoms and cholesterol hydroxyl atoms to define a lipid leaflet, as these atom groups should be at approximatly the same z-axial position in a lipid bilayer.\n\n## MolSolvator Usage\nMolSolvator is a simple tool which adds solvent molecules, also defined by PDB files, to 3D lattices whose bounds are defined *in terms* of the grids used to generate systems in MolPainter.\n\nMolSolvator takes an *input* solute system (intended to be systems produced by MolPainter) defined within the approximate lower bounds of min(*x*), min(*y*) = 0, 0. It is to this solute system that solvent is *added*, such that no inserted solvent overlaps with with the solute or other solvent molecules.\n\nMolSolvator inserts solvent molecules into a grid which has a separate lattice spacing from the solute system. This *solvent lattice spacing* would typically be chosen as something slightly larger than the typical Lennard-Jones interaction minimum energy distance of the model. Each solvent molecule is inserted to the lattice centered on its center of geometry. The minimum and maximum x, y, and z-dimensions of the molecule will mark neighboring cells as \"occupied\" if touching the center of other neighboring cells. This typically would not prevent enough space between solvent molecules, so in addition to this a *buffer* length is added to the solvent dimensions to make sure there is enough space for the solvent molecules. Typically, the *bufffer* length should be shorter than the *solvent lattice spacing*.\n\nThe input file that controls the i/o for MolSolvator is a TOML-format file. Each entry is explained here.\n\n* Input/output files\n    - solute = *string*, the path to the input solute system.\n    - output = *string*, the path for the output solvated system.\n* Solute lattice\n    - shape = *string*, input solute is a \"hex\" or \"square\" lattice.\n    - width = *integer*, solute lattice width\n    - height = *integer*, solute lattice height\n    - spacing = *float*, solute lattice cell spacing, in angstroms\n* Solvent lattice\n    - spacing = *float*, solvent lattice cell spacing, in angstroms\n    - buffer = *float*, solvent buffer length, in angstroms\n    - lower_z_position = *float*, lower bonds of the solvent grid\n    - upper_z_position = *float*, upper bounds of the solvent grid\n* Solvent molecules\n    - paths = [*string*, ..., *string*], list of paths to files defining structure of solvents\n    - numbers = [*integer*, ..., *integer*], list of numbers of each solvent molecule to be inserted. Must be of the same length as *paths*.\n    - max_iterations = *integer*, maximum number of attempts to insert a solvent molecule to the lattice before aborting.\n    - rotate = *lower case boolean*, boolean to enable random 3D rotations of solvent molecules. (\"true\", not \"True\". \"false\", not \"False\")\n\nIn addition to the i/o file, MolSolvator has additional command line actions\n\n* Command line actions\n    - *-zeroz*, translates the system such that min(*z*) = solvent lattice spacing / 2, following solvation.\n    - *-centerc*, translates the system such that <x,y,z> = 0,0,0, following solvation.\n\n## What's new in 1.1?\n\n**Solute** systems can now be added during a MolPainter session! These are systems in PDB format to which you want to *paint* using MolPainter while avoiding clashes.\n\nLet's say for example you wish to use MolPainter to paint lipids around one or multiple proteins. In 1.0 you would have to do this by *guessing* where the protein will be located and paint the system to try to avoid clasing with the protein. Not very convenient...\n\nNow you can *Insert a Solute* into MolPainter canvases. A solute will \"obstruct\" cells in the layers of MolPainter,  making them unavailable for painting, based on the real coordinates of the Solute system described in the input PDB file. Just how far these obstructed cells extend from the coordinates of the Solute can be tweaked by adjusting the *Buffer space*. This is the same kind of \"buffer\" used in MolSolvator to avoid clashes when solvating.\n\nWhen the system is ultimately exported, the solute will be written first, followed by the molecules that have been painted using MolPainter.\n\n\nThe new *Insert Solutes* button has the following fields\n\n* **Path** path to a PDB file of the solute you want to add. There can only be one solute in the system at a time!\n* **Buffer space (Å)** the length of the buffer added to obstruct more cells neighboring coordinates of the solute.\n* **Center solute at z (Å)** centers the (x,y,z) coordinates of the solute to the center of the MolPainter grid at a particular plane in the z-dimension.\n* **Expand grid to fit solute** expands the MolPainter grid to fit the (x,y,z) coordinates of the solute system. If the solute system has negative coordinates, these coordinates will still lay outside of the MolPainter canvases!\n\n\n\n## Give it a try!\n\nA complete tutorial showing how to use MolPainter and MolSolvator to construct a system and perform a simulation using GROMACS is available in the GitHub repo at: https://github.com/gpantel/MolPainter/tree/master/tutorial\n\n\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/gpantel/MolPainter",
    "keywords": "",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "MolPainter",
    "package_url": "https://pypi.org/project/MolPainter/",
    "platform": "",
    "project_url": "https://pypi.org/project/MolPainter/",
    "project_urls": {
      "Homepage": "https://github.com/gpantel/MolPainter"
    },
    "release_url": "https://pypi.org/project/MolPainter/1.1.2/",
    "requires_dist": [
      "numpy",
      "scipy",
      "toml",
      "MDAnalysis"
    ],
    "requires_python": "",
    "summary": "Tool for drawing complex planar molecular systems of arbitrary composition and molecule placement",
    "version": "1.1.2",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17373985,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "a4a83184fdd903944d79368088d02b87ecef4ace44d4439e572f6225c578817e",
        "md5": "2f5c62a1da138ff97028e9149a574024",
        "sha256": "40f8bcd93b843d6c4a4e48556fde9c7dd082fffa21b27bb4730f46f85cc8d20f"
      },
      "downloads": -1,
      "filename": "MolPainter-1.1.2-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "2f5c62a1da138ff97028e9149a574024",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 52305,
      "upload_time": "2020-11-19T02:11:10",
      "upload_time_iso_8601": "2020-11-19T02:11:10.446629Z",
      "url": "https://files.pythonhosted.org/packages/a4/a8/3184fdd903944d79368088d02b87ecef4ace44d4439e572f6225c578817e/MolPainter-1.1.2-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "96385771d89243f901375f5819fa22e53ef3bbe20c759886d8662db27eb0481a",
        "md5": "cffe9c1a8103ff7a9b3b6063c3207e2f",
        "sha256": "61a90a77a8326e910e1c1cde8aab4188edf688620ad5a9b10cb9e0f747723d50"
      },
      "downloads": -1,
      "filename": "MolPainter-1.1.2.tar.gz",
      "has_sig": false,
      "md5_digest": "cffe9c1a8103ff7a9b3b6063c3207e2f",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 36506,
      "upload_time": "2020-11-19T02:11:12",
      "upload_time_iso_8601": "2020-11-19T02:11:12.469110Z",
      "url": "https://files.pythonhosted.org/packages/96/38/5771d89243f901375f5819fa22e53ef3bbe20c759886d8662db27eb0481a/MolPainter-1.1.2.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}