{
  "info": {
    "author": "Ilter Canberk, Naman Seth",
    "author_email": "iltercanberk@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 4 - Beta",
      "Environment :: Web Environment",
      "Framework :: Django",
      "Intended Audience :: Developers",
      "Operating System :: OS Independent",
      "Programming Language :: Python"
    ],
    "description": "#django-interactive\n\nDjango library for creating view hierarchies and auto-generating corresponding client-side methods in your project.\n\n## Overview\n\nIn its current state, it is immensly difficult to create and maintain the connection between the server-side and the client-side functionality in a Django app. Once the django action calls 'render' with some context, it is clueless about the rest of the process.\n\nDjango-interactive aims to solve this problem by letting the application developer define `subview`s and auto-generating client-side JavaScript stubs that are capable of dynamically rendering these partial views.\n\n## Design Goals\n\nThis library should make simple things easy, and complex things still possible. As with any abstraction, it will involve some biased decisions but the application developer should be able to choose not to use some of these decisions and customize parts.\n\n* The application programmer should not be forced to switch all the django.\n* The JS stubs can play well with application's usual JavaScript.\n\n\n## Use\n\nThere are currently two types of views. These views are just like usual django action methods, but defined with decorators.\n\n* `page_view`\n* `sub_view`\n\nFor each subview, there are three JS methods generated. If the sub_view method is called `render_list`, the library generates:\n\n* `reload_render_list`: Rerenders the up-to-date html dynamically and replaced the view on the page.\n* `html_render_list`: Returns the up-to-date html as a parameter to the callback function. (async function)\n* `json_render_list`: Returns the up-to-date json from the view as a parameter to the callback function(async function)\n\n\n## Examples\n\nWe have provided a sample Todo application implemented using this library in the `example/` directory. \n\nPlease especially look at `todo.js` for implementations.\n\nWe were able to implement lots of AJAX capability with couple lines.\n\n## Installing for Development\n\nCreate a virtual environment and activate it by doing \n\n```\n  virtualenv venv\n  source venv/bin/activate\n```\n\nInstall requirements.txt in `/example` directory or install the package using pip if you are working on a different project.\n\n```\n  pip install git+ssh://git@github.com/CMU-Web-Application-Development/Team71.git\n```\n\n## Installing\n\n\n```\n\tpip install django-interactive\n```\n\n\nIn `settings.py`, add `django-interactive` to your installed apps.\n\n```\nINSTALLED_APPS = (\n    ...\n    'django-interactive',\n    ...\n)\n```\n\n## Building for Distribution\n\nThe distribution information is in `setup.py`. Running \n\n```\n  python setup.py sdist\n```\n\nwill generate the necessary files in `dist` directory.\n\n## Product Backlog\n\n* **Making an empty module that is installable by Django**\n\n   This feature will enable easy installation of the feature into the django framework so  users can use our library from inside the Django applications. Once the user installs library, they can easily import the modules and start using the features of our in the application they are working. Because the installation is easy it decreases the effort required from the users end in setup and precious time and energy can be used to actually developing applications.\n   \n   After creating this, we should also find an easy way to use this module in \"Development mode\" so that we don't need to re-install the package everytime we change something. It would drop the productivity a lot.\n   \n   \t\tExpected time: 2 hours\n\n* **Creating the `@page_view` decorator**\n\n   This decorator identifies the method that is subsequently written as the one that renders an entire page. With this decorator in place, our framework can insert the necessary JavaScript stubs and necessary libraries. This also makes sure that similar stubs or same libraries are only injected in the page once.\n   \n   \t\tExpected time: 2 hours\n\n\n* **Creating the `@sub_view` decorator**\n\n   This decorator should take the name of the template and the context, and return the representation for sub_view so that the page views can render it, or helper methods(eg.json generator) can use it.For each subview, there are three JS methods generated.\n   \n   \t\tExpected time: 3 hours\n\n* **Creating the ability to render subviews inside other templates**\n\n   This will allow developers to render subviews in different templates. It will give developers the flexibility to render swift views in different templates. We will be using \"template_tags\" to enable this feature. We really would like to refrain from forcing user to write `{% load ... %}` on top of every template, but it might not be technically possible.\n   \n   \t\tExpected time: 1 hour\n\n* **Creating a URL and action for `html_...` method**\n\n   `html_..` is supposed to return the up-to-date html string. Since our goal is to prevent user from manually doing this, we will need to dynamically create a url, and action methods that are mapped to these urls.\n   \n\t\tExpected time: 1 hour\n\n* **Creating a URL and action for `json_...` method**\n\n   `json_render_list` is supposed to return JSON representation of the context values. This will be hard because we have no idea about the type of the variables. They might be plain dictionaries or query sets. We need to write a robust checker that recursively goes through the variables and decide how to serialize them. \n   \n   \t\tExpected time: 2 hours\n\n* **Creating a JS Stub generator**\n\n   This is so that the framework auto generates the stubs for the necessary javascript functions as and when required. The stub generator will be in Python and it will generate JavaScript code. We need to come up with a good architecture for generating methods in general and then move on to implementing individual methods.\n\n\t\tExpected time: 2 hours\n\n* **Implementing the stub generator for `html_...` method**\n\n   `html_..` method will send an AJAX request to the Django application and get back the HTML string. It is not supposed to do anything other than passing the string as a callback.\n\t\n\t\tExpected time: 2 hours\n\n* **Implementing the stub generator for `reload_...` method**\n\n   `reload_...` method is similar to `html_...` but instead of only passing the string, it will actually find the parent view of the element and replace the html string inside it.\n   \n   \t\tExpected time: 3 hours\n\n* **Implementing the stub generator `json_...` method**\n\n   `json_...` method is again similar to `html_...` but instead of a string it will get the JSON representation and pass it as a callback.\n    \n    \tExpected time: 1 hour\n\n\n* **Debugging and creating a sample application**\n\n   The sample application will help the users to understand how to use the various features of the framework within Django. The application will exercise all features of the framework to help the users understand the power behind the framework.\n      \n    \tExpected time: 1 hour writing the application (because the whole thing is about speed) + 5 hours of debugging\n\n* **Registering the package with PIP registry**\n\n\tWe would like other developers to use it, so we will register the library to PIP registery. This way people can do `pip install django-interactive` and start using it in their applications.\n\t\n\t\tExpected time: 1.5 hour\n\t\n* **(Optional) Integrating the JS stubs with a BackboneJS framework**\n\n\tBackbone views already have methods called \"render:\" that is supposed to render that view. We can try extending the backbone library to use our `html...` method by default.\n\t \t\t\n\t \tExpected time: 4 hours\n\n\n## Roadmap\n\n### Sprint 1 - 10 November (Product owner: Naman Seth)\n\n* **Making an empty module that is installable by Django** (Ilter)\n\n* **Creating the `@page_view` decorator** (Naman)\n\n* **Creating the `@sub_view` decorator** (Ilter)\n\n* **Creating the ability to render subviews inside other templates**(Naman)\n\n### Sprint 2 - 17 November (Product owner: Ilter Canberk)\n\n* **Creating a URL and action for html_... method (Ilter)\n\n* **Creating a URL and action for json_... method (Ilter)\n\n* **Creating a JS Stub generator (Naman)\n\n* **Implementing the stub generator for html_... method (Naman)\n\n## Contributors\n\n* Ilter Canberk\n* Naman Seth\n\n## License\n\nThe project is released under the [MIT License](http://opensource.org/licenses/mit-license.php).",
    "description_content_type": null,
    "docs_url": null,
    "download_url": "UNKNOWN",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/CMU-Web-Application-Development/Team71",
    "keywords": null,
    "license": "MIT",
    "maintainer": null,
    "maintainer_email": null,
    "name": "django-interactive",
    "package_url": "https://pypi.org/project/django-interactive/",
    "platform": "UNKNOWN",
    "project_url": "https://pypi.org/project/django-interactive/",
    "project_urls": {
      "Download": "UNKNOWN",
      "Homepage": "https://github.com/CMU-Web-Application-Development/Team71"
    },
    "release_url": "https://pypi.org/project/django-interactive/1.0.4/",
    "requires_dist": null,
    "requires_python": null,
    "summary": "Building easier client-side connections",
    "version": "1.0.4",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 1328454,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "6138b0f65768df16c6bd0dc391017171896dc24addacf9663c946df06ea63c94",
        "md5": "fd33c51f2cd79782f018c59e5f891fe9",
        "sha256": "259598ed6e2a197705100392f935c335dfe7f2ebe810a4f58484b226666db7c2"
      },
      "downloads": -1,
      "filename": "django-interactive-1.0.4.tar.gz",
      "has_sig": false,
      "md5_digest": "fd33c51f2cd79782f018c59e5f891fe9",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 11176,
      "upload_time": "2014-12-02T16:30:49",
      "upload_time_iso_8601": "2014-12-02T16:30:49.755919Z",
      "url": "https://files.pythonhosted.org/packages/61/38/b0f65768df16c6bd0dc391017171896dc24addacf9663c946df06ea63c94/django-interactive-1.0.4.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}