{
  "info": {
    "author": "mimseyedi",
    "author_email": "mim.seyedi@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3.6",
      "Programming Language :: Python :: 3.8"
    ],
    "description": "# mazex\n[![pypi](https://img.shields.io/pypi/v/mazex.svg)](https://pypi.org/project/mazex/) [![license](https://img.shields.io/github/license/mimseyedi/mazex.svg)](https://github.com/mimseyedi/mazex/blob/master/LICENSE)\n\n![img1](https://raw.githubusercontent.com/mimseyedi/mazex/master/docs/images/mazex_poster.png)\n\nmazex is a simple game under the terminal where you have to find the way to the goal in the maze with the most optimal path and solve the challenges.\n\n## Table of Contents: <a class=\"anchor\" id=\"contents\"></a>\n* [What is mazex?](#what_is)\n* [How to install?](#install)\n* [Gameplay](#gameplay)\n\n  * [run command](#run_cmd)\n  * [Objects](#obj)\n    * [The player, the confused and greedy hero](#player)\n    * [The walls, cruel and impenetrable](#wall)\n    * [The key, to open a door that pretends to be a wall](#key)\n    * [The goal, the only way to success and exit](#goal)\n    * [Points, tempting and cunning](#points)\n    * [Riddles, challenges that are strong obstacles](#riddles)\n  * [info command](#info_cmd)\n  \n* [Making maze](#mkmaze)\n  * [Maze map](#maze_map)\n  * [Maze data](#maze_data)\n  * [make command](#make_cmd)\n\n* [Proof of play](#proof)\n  * [Replay file](#replay_file)\n  * [Saving The Replay file](#save_replay_file)\n  * [replay command](#replay_cmd)\n  * [Working in a replay environment](#replay_env)\n\n* [Contribute](#cont)\n* [Resources](#res)\n\n\n## What is mazex? <a class=\"anchor\" id=\"what_is\"></a>\nmazex is a simple cooperative game whose goal is to reach the goal after getting the key and facing the obstacles and challenges! You have to choose the most optimal path to reach the goal and also collect as many points as possible. But be aware that sometimes the points will take you away from the goal and of course it depends on the designer of the maze!\n\nAlso, you can easily design the mazes you like for your friends and send them to challenge them and see how they play!\n\n## How to install? <a class=\"anchor\" id=\"install\"></a>\nmazex is a terminal game that must be run in a shell environment. This game uses the Python interpreter to run, and you can use pip to install and use it:\n```\npython3 -m pip install mazex\n```\n\nAfter installation, type the following command in the shell environment and follow the instructions:\n```\nmazex --help\n```\n\n\n## Gameplay <a class=\"anchor\" id=\"gameplay\"></a>\nMazex has a simple gameplay. You only use your keyboard and use the `up`, `down`, `left` and `right` arrow keys to move in the direction you want, and if you want to `exit` the game, you can use the `control+c` key.\n\n## run command <a class=\"anchor\" id=\"run_cmd\"></a>\nTo run the game, you must use the run command.\nThe run command asks you for an argument that is the path of the Maze file you want to play and the extension of this file must be `.mzx`.\n\n```\nmazex run maze_file.mzx\n```\n\n## Objects <a class=\"anchor\" id=\"obj\"></a>\nWhen you start the game, you will see symbols on the screen that are part of your maze and adventure. Knowing these signs will help you get closer to winning the game.\n\n### The player, the confused and greedy hero <a class=\"anchor\" id=\"player\"></a>\nThe player is the only sign in the game that you can move. Actually, the player is you in the 2D space of the maze in which you are stuck and you have to reach the goal to win the game. Pay attention to the number of remaining moves that are shown at the top of the screen. If you can't reach your goal before you run out of moves, you lose the game!\n\n### The walls, cruel and impenetrable <a class=\"anchor\" id=\"wall\"></a>\nWalls are signs in different corners and places of the maze that do not allow you to pass. Watch out for the walls and cross the right paths to win the game.\n\n### The key, to open a door that pretends to be a wall <a class=\"anchor\" id=\"key\"></a>\nThe key is the only way to reach your goal.\nThere is only one key in the maze, and when you reach it, a door will open for you that you thought was a wall before!\n\nHint: doors are usually located near the goal and open the way to reach the goal.\n\n### The goal, the only way to success and exit <a class=\"anchor\" id=\"goal\"></a>\nGoal! What is the meaning of life without it? Even if you are stuck in a confusing maze!\nThe goal is not so easy to reach and it is the last thing you will reach in the maze. Of course, if you haven't lost the game before! Move carefully and always think about your goal and move forward. But don't forget not to lose yourself!\n\n### Points, tempting and cunning <a class=\"anchor\" id=\"points\"></a>\nPoints increase your position after winning.\nBut be careful that if you lose, they won't have any value! Be happy with the points you get, but don't be greedy and think about reaching the goal! Unless you're in a ridiculous game like this!\n\n### Riddles, challenges that are strong obstacles <a class=\"anchor\" id=\"riddles\"></a>\nWhen is a door no longer a door?\n\nWhen it's ajar!\n\nThere may be many such riddles on your way and they will be your obstacle until you have answered them correctly.\nThink carefully and enjoy reading them and solve them to get closer to victory!\n\n## info command <a class=\"anchor\" id=\"info_cmd\"></a>\nThe info command will help you get ready for the game! This command will show you information about any maze you select. Like signs and the number of riddles and allowed moves.\nBefore starting the game, it is recommended to know more about the game you want to play with the help of the info command.\n\n```\nmazex info maze_file.mzx\n```\n\nAn example of the output:\n```\nPlayer sign: X\nWall sign: #\nKey sign: K\nGoal sign: *\nPoint sign: $\nNumber of moves: 329\nNumber of riddles: 2\nNumber of points: 7\n```\n\n\n## Making maze <a class=\"anchor\" id=\"mkmaze\"></a>\nThe exciting and interesting part of mazex is right here!\nYou can make your own mazes. Just as you like and send it to your friends to challenge them and enjoy together. Or if you are a forgetful person like me, you can design mazes for yourself and get involved with them every once in a while. Just follow some simple rules and then easily make your own maze.\n\n## Maze map <a class=\"anchor\" id=\"maze_map\"></a>\nThe first step to making a maze is to map it.\nIt's very simple! Just create a file in .txt format and then design your maze as you want in the file.\n\nEssential rules to follow:\n - All around your maze must be walled.\n - Use only one symbol for each object in the maze.\n - You must use all the objects in your maze except the riddles.\n - Never use tab instead of space!\n\nMy suggestion to you is to spend enough time on your maze and design it fair and attractive so that your friends will trust you and enjoy playing your mazes.\n\nAn example of a maze map in a text file:\n```\noooooooooooooooooooooooooooooooooooooo\no     ooooo  o$       o   o o        o\no  o         o            o o    o   o\no  o ooooooo o   oooooo   o o   ooo  o\no  o o   o o o    oKo       o   o*o  o\no  o o o o o o oooo o     o o   ooo  o\no  o o o o o o?o    o     o o    o   o\no$$o o o o o o      ooooooo ooooooo?oo\noooo o o o o oooooooo            o   o\no$     o o o         o ooooooooo ooo o\noooooooo oooooooooo  o         o  $o o\no                 o  o ooooooo o ooo o\noooooooooooooooo  o  o o$    o o o o o\no                 o  o       o o o o o\no ooooooooooooooooo  ooooooooo o ooo o\no                 o            o     o\nooooooooooooooooo oooooooooooooooooooo\noX                                  $o\noooooooooooooooooooooooooooooooooooooo\n```\n\n## Maze data <a class=\"anchor\" id=\"maze_data\"></a>\nThe next step is to create a json file containing your maze information. (You can do this before designing the maze map)\n\nIf you are not familiar with Jason files, see this link:\n\nCreate a json format file and enter your maze information in the following pattern:\n\n- Create a key named `player` that contains a single character sign.\n- Do this for `wall`, `key`, `goal` and `point` keys as well.\n- Create a key named `moves` and write the number of allowed moves you want to choose for your maze. (To consider the number of movements in a fair way, you can first set its value to a large number and calculate the number of movements after playing the maze yourself)\n- Create a key named `door` and write a list containing the position of the door you want to open after receiving the key. The first element of this list is the position of the y vector and the next is the position of the x vector. (To get this position, you can use conventional editors. Just note that the index of lists in programming languages starts from zero, so you must reduce the y and x positions by one of them)\n- If you want to use a riddle in your maze, you must define a key named `riddles`.\nThe value of this key is equal to a two-dimensional list that contains lists containing riddle information. The first index of each riddle is equal to the question or the riddle itself. The second index is equal to the correct answer of the riddle, which is case-sensitive. And finally, the third index of each riddle contains the position of the riddle, which is defined exactly like the position of the door key mentioned above. (The mark of each riddle is equal to the question mark `?` and cannot be changed. Be sure to note that you must place the question mark as a riddle mark in the selected position)\n\nAn example of a json file that contains maze information:\n```json\n{\n  \"player\": \"X\",\n  \"key\": \"K\",\n  \"goal\": \"*\",\n  \"wall\": \"o\",\n  \"point\": \"$\",\n  \"moves\": 329,\n  \"door\": [4, 32],\n  \"riddles\": [[\"What building has the most stories?\", \"a library\", [6, 14]],\n             [\"What can you put in a bucket to make it weigh less? \", \"a hole\", [7, 35]]]\n}\n```\n\n## make command <a class=\"anchor\" id=\"make_cmd\"></a>\nAfter completing these two steps, it's time to create your maze file with the help of the make command.\nThis command requires three arguments from you. The first argument is the path of the text file that contains the map of the maze. The second argument is the path of the json file that contains the maze information. And the third argument is related to the path of the output file or the final file of your maze that is supposed to be created by this command, which must be in .mzx format.\n\n```\nmazex make maze_map.txt maze_data.json maze_file.mzx\n```\n\nIf a problem occurs, you can use the --help option for this command to get guidance. (This option can be used for any command)\n\n```\nmazex make --help\n```\n\n`Important note:` The final file created by the make command, which is in .mzx format, is an encrypted file so that your friends cannot easily cheat and get more information from the maze or change it. But this encryption is very simple and if your friends are programmers, they can easily decode it. Please do not be strict. This is a completely free project that I started and wrote when I was bored at my mom's house :)\nSo if you want to develop this project and use a stronger encryption, roll up your sleeves and get to work. I will also be very happy.\n\n## Proof of play <a class=\"anchor\" id=\"proof\"></a>\nAn interesting system built into mazex is a `proof-of-play system`. Through this system, you can send a file executable by the `replay` command, which records your movements, to the person who designed the maze, to prove that you finished the maze and won the game. Or if the designed maze is not fair and has defects, you can prove it.\n\n## Replay file <a class=\"anchor\" id=\"replay_file\"></a>\nThe replay file is an encrypted file that contains information about how to play and the moves you have made. When you win or lose the game, you can choose whether or not to create this file.\n\n## Saving the replay file <a class=\"anchor\" id=\"save_replay_file\"></a>\nTo save the replay file of the game you played, you need to specify at the end of the game that you want this file to be created and then write the path where you want this file to be created. Note that replay files must be saved in .rmzx format!\n\nRequest to save the replay file at the end of the game:\n![img1](https://raw.githubusercontent.com/mimseyedi/mazex/master/docs/images/mazex_game_over.png)\n\nSave the replay file in the selected path:\n![img1](https://raw.githubusercontent.com/mimseyedi/mazex/master/docs/images/mazex_saving_replay.png)\n\n## replay command <a class=\"anchor\" id=\"replay_cmd\"></a>\nWith the help of the replay command, you can run replay files in .rmzx format. This command accepts only one argument from you, which is the path of the replay file that you want to view.\n\n```\nmazex replay replay_file.rmzx\n```\n\n## Working in a replay environment <a class=\"anchor\" id=\"replay_env\"></a>\nThe execution environment of the replay file is exactly similar to the game environment. With the difference that you can only watch the recorded movements of the player by using the `left` and `right` arrow keys.\n\nThe next move of the player is displayed by the `right` arrow key and the previous move of the player is displayed by the `left` arrow key. You can also exit the replay environment by pressing `control+c`.\n\nAt the bottom of the screen, information about each move will be displayed to you and you can follow the moves in detail.\n\n## Contribute <a class=\"anchor\" id=\"cont\"></a>\nI welcome your participation in this fun and free project and I have ideas for Mazex development in the future:\n- Creating an easier system for making maze files\n- Improving the encryption system for executable files by commands\n- Writing tests for project functions. (I tested the program manually and very stupidly because I was bored)\n- Writing a validator function for replay files in order to prevent fraud.\n- Adding a portal to the maze to move and jump to another point.\n\n## Resources <a class=\"anchor\" id=\"res\"></a>\nSources I used to make this project:\n- click module\n```\npython3 -m pip install click\n```\n- prompt_toolkit module\n```\npython3 -m pip install prompt-toolkit==3.0.16\n```\n- canva website for poster design README file: https://www.canva.com/\n\nThank you for reading.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/mimseyedi/mazex",
    "keywords": "",
    "license": "MIT",
    "maintainer": "",
    "maintainer_email": "",
    "name": "mazex",
    "package_url": "https://pypi.org/project/mazex/",
    "platform": null,
    "project_url": "https://pypi.org/project/mazex/",
    "project_urls": {
      "Homepage": "https://github.com/mimseyedi/mazex"
    },
    "release_url": "https://pypi.org/project/mazex/1.0.0/",
    "requires_dist": [
      "click"
    ],
    "requires_python": ">=3.6",
    "summary": "mazex is a simple game under the terminal where you have to find the way to the goal in the maze with the most optimal path and solve the challenges.",
    "version": "1.0.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17096184,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "288148b6802515568c9dc99180830d1a9c8adddf69f5f4c5a47d73dd31966acf",
        "md5": "b300e1c0b7fa04cf0d2f3cd378beaa17",
        "sha256": "3fcb3938a7ef3b5ecabcd1c1f38a961fe6563a7d7595b5b7b8e9d103f107d092"
      },
      "downloads": -1,
      "filename": "mazex-1.0.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "b300e1c0b7fa04cf0d2f3cd378beaa17",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.6",
      "size": 14652,
      "upload_time": "2023-02-28T14:05:31",
      "upload_time_iso_8601": "2023-02-28T14:05:31.166881Z",
      "url": "https://files.pythonhosted.org/packages/28/81/48b6802515568c9dc99180830d1a9c8adddf69f5f4c5a47d73dd31966acf/mazex-1.0.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}