{
  "info": {
    "author": "Evan Pratten",
    "author_email": "ewpratten@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# Installation\nHere are the various installation methods for dr:\n\n## Supported OSes\n - ChromeOS (Fully Supported) \n - Linux (Fully Supported)\n - OSX (Supported By Contributor, No known problems)\n\n## Installing with PIP\ndr can be installed on any computer with `python3.7` and `python3-pip` installed:\n```sh\n# Install dr\npip3 install dr\n\n# Run dr\ndr\n```\n\n## Installing From AUR\nFor arch users, a non-waterfall version is avalible through AUR. just get the package called [dr](https://aur.archlinux.org/packages/dr) (thanks to @Electrux)\n\n# How to run\nJust type `dr` in your terminal and you will be sent straight in to the dr prompt.\n\n# How to log in\nOnce in the dr prompt, use the command `l`. You will be asked for a username and password. Just follow the prompts.\n\n# How to make a post\nFirst, you should be logged in (see above)\n\nIn dr, post creation is done in these steps:\n - Create a new rant\n - Add tags to the rant\n - Post the rant\nHere is how to do that:\n\n## Create a new rant\nTo create a new rant, use the command `r`. You will notice that the prompt changes. (The `|` prompt means that you are in rant mode and the `>` prompt means you are in command mode.) You can now type out your rant. But be careful! Once you move to the next line, you can not go back to an old line and fix a mistake. You will have to rewrite the rant (TODO: Fix this). Once you are done, move to a new line, and type `.` then press enter.\n\n## Add tags\nTo add tags to your rant, use the command `t`. The prompt will go back to the rant prompt and ask you for tags. Type out your tags, then press enter.\n\n## Post the rant\nMake sure you have logged in before continuing with this step.\nTo post the rant you have just created, use the `p` command. You will be asked for verification. That's it! You have posted your first rant using the dr client!\n\n# Viewing a rant\nTo view a rant, use the command `v`. To view the next rant, use the command `v+`. To view the previous rant, use the command `v-`.\n\nTo change the rant feed you are reading from, use the `s` command followed by the code for the feed you want.\n\nFeed list\n - t = top\n - a = algo\n - r = recent\n\nSo. to view the top rants, use the command `st` and to view the algo, use `sa`\n\n# Check Your Notifs\nTo see your notifications, use the command `n`. They will all show up on your screen. In each notif, there is a rantCode. This will be important for later.\n\nYou can also clear your notifs with the command `n!`\n\n# Viewing a Rant From It's rantCode\nTo view a specific rant in dr, you must know it's rantCode. These codes are displayed in your notifications feed and will soon be displayed on all rants.\n\nA rantCode is a stripped down hexadecimal representation of the rant it refers to. It was created because the normal devRant rant ids are getting too long to remember. The current method of creating rantCodes is quite flawed and will soon be   replaced.\n\nTo view a rant from its rantCode, use the command `vi`. You will then be prompted for a rantCode. After entering the code, the rant you wanted to see will be shown.\n\n# Commenting on a Rant\nTo comment on a rant, you must first view it. The comment will be posted on the most recent rant that you have looked at.\n\nMake sure to use the `vi` command before replying to a notif. (See above)\n\n## Create the Comment\nTo comment, use the `c` command. The prompt will change to the rant prompt. Remember, once you move to a new line, you can not edit the previous lines without re-running the command. When you are done typing your comment, move to a new line and type `.`\n\n## Posting Your Comment\nTo post the comment you just wrote, use the `pc` (post comment) command. You will then be asked to confirm.\n\n# Voting\nVoting has been made as easy as possible. To upvote, use the  `+` command and to downvote, use the `-` command.\n\n# View Comments\nTo view all comments on the current rant, use the `vc` command.\n\nIf you have just loaded a new rant, this command might tell you to wait. This is because a large amount of data parseing must happen in order to display the comment list. After waiting a few seconds, run the command again.\n\n# Known Bugs\n - posting a comment, then viewing all comments will crash.\n - trying to view a rant with an invalid rantCode will crash\n - unplugging your desktop computer while running dr will cause dr to stop running and your computer will loose power\n - hitting your computer with a hammer will break it\n - lighting your computer on fire may have serious consequences",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/Ewpratten/dr",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "dr",
    "package_url": "https://pypi.org/project/dr/",
    "platform": "",
    "project_url": "https://pypi.org/project/dr/",
    "project_urls": {
      "Homepage": "https://github.com/Ewpratten/dr"
    },
    "release_url": "https://pypi.org/project/dr/1.9.3/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "An ed-like devRant client",
    "version": "1.9.3",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 5773119,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "dfd231eb436e87d24cadf8faa00e156b82be7c4a6a2fcbb3d01fe02d371cead4",
        "md5": "50ac259ffc7f6f51c5118d04e7368556",
        "sha256": "70315db3dea7e8a9eba0adf57cbef95af1df30caf411a5b1928bde41d7177fd8"
      },
      "downloads": -1,
      "filename": "dr-1.9.3.tar.gz",
      "has_sig": false,
      "md5_digest": "50ac259ffc7f6f51c5118d04e7368556",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 6514,
      "upload_time": "2019-09-02T23:45:31",
      "upload_time_iso_8601": "2019-09-02T23:45:31.545870Z",
      "url": "https://files.pythonhosted.org/packages/df/d2/31eb436e87d24cadf8faa00e156b82be7c4a6a2fcbb3d01fe02d371cead4/dr-1.9.3.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}