{
  "info": {
    "author": "Scot Hacker",
    "author_email": "",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "Environment :: Web Environment",
      "Framework :: Django",
      "Intended Audience :: Developers",
      "License :: OSI Approved :: BSD License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3.6",
      "Programming Language :: Python :: 3.7",
      "Topic :: Office/Business :: Groupware",
      "Topic :: Software Development :: Bug Tracking"
    ],
    "description": "# django-todo\n\ndjango-todo is a pluggable, multi-user, multi-group task management and\nassignment application for Django, designed to be dropped into an existing site as a reusable app. django-todo can be used as a personal to-do tracker, or a group task management system, or a ticketing system for organizations (or all of these at once!)\n\n**The best way to learn how django-todo works is to visit the live demo site at [django-todo.org](http://django-todo.org)!**\n\n## Features\n\n* Drag and drop task prioritization\n* Email task notification\n* Search\n* Comments on tasks\n* Public-facing submission form for tickets\n* Mobile-friendly (work in progress)\n* Separate view for My Tasks (across lists)\n* Batch-import tasks via CSV\n* Multiple file attachments per task (see settings)\n* Integrated mail tracking (unify a task list with an email box)\n\n\n## Requirements\n\n* Django 2.0+\n* Python 3.6+\n* jQuery (full version, not \"slim\", for drag/drop prioritization)\n* Bootstrap (to work with provided templates, though you can override them)\n* bleach (`pip install bleach`)\n* django-autocomplete-light (optional, required for task merging)\n\n## Overview\n\nWe assume that your organization has multiple groups of employees, each with multiple users (where actual users and groups map to Django Users and Groups). Users may belong to multiple groups, and each group can have multiple todo lists.\n\nYou must have at least one Group set up in Django admin, and that group must have at least one User as a member. This is true even if you're the sole user of django-todo.\n\nUsers can view and modify all to-do lists belonging to their group(s). Only users with `is_staff` can add or delete lists.\n\nIdentical list names can exist in different groups, but not in the same group.\n\nEmails are generated to the assigned-to person when new tasks are created.\n\nFile attachments of a few types are allowed on tasks by default. See settings to disable or to limit filetypes. If you are concerned about file sizes, limit them in your web server configuration (not currently handled separately by django-todo).\n\nComment threads can be added to tasks. Each participant in a thread receives email when new comments are added.\n\ndjango-todo is auth-only. You must set up a login system and at least one group before deploying.\n\nAll tasks are \"created by\" the current user and can optionally be \"assigned to\" a specific user. Unassigned tickets appear as belonging to \"anyone\" in the UI.\n\ndjango-todo v2 makes use of features only available in Django 2.0. It will not work in previous versions. v2 is only tested against Python 3.x -- no guarantees if running it against older versions.\n\n## Installation\n\ndjango-todo is a Django app, not a project site. It needs a site to live in. You can either install it into an existing Django project site, or clone the django-todo [demo site (GTD)](https://github.com/shacker/gtd).\n\nIf using your own site, be sure you have jQuery and Bootstrap wired up and working.\n\ndjango-todo views that require it will insert additional CSS/JavaScript into page heads, so your project's base templates must include:\n\n```jinja\n{% block extrahead %}{% endblock extrahead %}\n{% block extra_js %}{% endblock extra_js %}\n```\n\ndjango-todo comes with its own `todo/base.html`, which extends your master `base.html`. All content lives inside of:\n\n`{% block content %}{% endblock %}`\n\nIf you use some other name for your main content area, you'll need to override and alter the provided templates.\n\nAll views are login-required. Therefore, you must have a working user authentication system.\n\nFor email notifications to work, make sure your site/project is [set up to send email](https://docs.djangoproject.com/en/2.0/topics/email/).\n\nMake sure you've installed the Django \"sites\" framework and have specified the default site in settings, e.g. `SITE_ID = 1`\n\nPut django-todo/todo somewhere on your Python path, or install via pip:\n\n    pip install django-todo\n\n\nAdd to your settings:\n\n```\nINSTALLED_APPS = (\n    ...\n    'todo',\n)\n```\n\nMigrate in database tables:\n\n`python manage.py migrate todo`\n\nAdd to your URL conf:\n\n`path('todo/', include('todo.urls', namespace=\"todo\")),`\n\nAdd links to your site's navigation system:\n\n```\n<a href=\"{% url 'todo:lists' %}\">Todo Lists</a>\n<a href=\"{% url 'todo:mine' %}\">My Tasks</a>\n```\n\ndjango-todo makes use of the Django `messages` system. Make sure you have something like [this](https://docs.djangoproject.com/en/2.1/ref/contrib/messages/#displaying-messages) (link) in your `base.html`.\n\nLog in and access `/todo`!\n\n### Customizing Templates\n\nThe provided templates are fairly bare-bones, and are meant as starting points only. Unlike previous versions of django-todo, they now ship as Bootstrap examples, but feel free to override them - there is no hard dependency on Bootstrap. To override a template, create a `todo` folder in your project's `templates` dir, then copy the template you want to override from django-todo source and into that dir.\n\n### Filing Public Tickets\n\nIf you wish to use the public ticket-filing system, first create the list into which those tickets should be filed, then add its slug to `TODO_DEFAULT_LIST_SLUG` in settings (more on settings below).\n\n## Settings\n\nOptional configuration params, which can be added to your project settings:\n\n```python\n# Restrict access to ALL todo lists/views to `is_staff` users.\n# If False or unset, all users can see all views (but more granular permissions are still enforced\n# within views, such as requiring staff for adding and deleting lists).\nTODO_STAFF_ONLY = True\n\n# If you use the \"public\" ticket filing option, to whom should these tickets be assigned?\n# Must be a valid username in your system. If unset, unassigned tickets go to \"Anyone.\"\nTODO_DEFAULT_ASSIGNEE = 'johndoe'\n\n# If you use the \"public\" ticket filing option, to which list should these tickets be saved?\n# Defaults to first list found, which is probably not what you want!\nTODO_DEFAULT_LIST_SLUG = 'tickets'\n\n# If you use the \"public\" ticket filing option, to which *named URL* should the user be\n# redirected after submitting? (since they can't see the rest of the ticket system).\n# Defaults to \"/\"\nTODO_PUBLIC_SUBMIT_REDIRECT = 'dashboard'\n\n# Enable or disable file attachments on Tasks\n# Optionally limit list of allowed filetypes\nTODO_ALLOW_FILE_ATTACHMENTS = True\nTODO_ALLOWED_FILE_ATTACHMENTS = [\".jpg\", \".gif\", \".csv\", \".pdf\", \".zip\"]\n\n# additionnal classes the comment body should hold\n# adding \"text-monospace\" makes comment monospace\nTODO_COMMENT_CLASSES = []\n\n# The following two settings are relevant only if you want todo to track a support mailbox -\n# see Mail Tracking below.\nTODO_MAIL_BACKENDS\nTODO_MAIL_TRACKERS\n```\n\nThe current django-todo version number is available from the [todo package](https://github.com/shacker/django-todo/blob/master/todo/__init__.py):\n\n    python -c \"import todo; print(todo.__version__)\"\n\n## Importing Tasks via CSV\n\ndjango-todo has the ability to batch-import (\"upsert\") tasks from a specifically formatted CSV spreadsheet. This ability is provided through both a management command and a web interface.\n\n**Management Command**\n\n`./manage.py import_csv -f /path/to/file.csv`\n\n**Web Importer**\n\nLink from your navigation to `{url \"todo:import_csv\"}`. Follow the resulting link for the CSV web upload view.\n\n\n### CSV Formatting\n\nCopy `todo/data/import_example.csv` to another location on your system and edit in a spreadsheet or directly.\n\n**Do not edit the header row!**\n\nThe first four columns: `'Title', 'Group', 'Task List', 'Created By'` are required -- all others are optional and should work pretty much exactly like manual task entry via the web UI.\n\nNote: Internally, Tasks are keyed to TaskLists, not to Groups (TaskLists are in Gruops). However, we request the Group in the CSV\nbecause it's possible to have multiple TaskLists with the same name in different groups; i.e. we need it for namespacing and permissions.\n\n\n### Import Rules\n\nBecause data entered via CSV is not going through the same view permissions enforced in the rest of django-todo, and to simplify data dependency logic, and to pre-empt disagreements between django-todo users, the importer will *not* create new users, groups, or task lists. All users, groups, and task lists referenced in your CSV must already exist, and group memberships must be correct.\n\nAny validation error (e.g. unparse-able dates, incorrect group memberships) **will result in that row being skipped.**\n\nA report of rows upserted and rows skipped (with line numbers and reasons) is provided at the end of the run.\n\n### Upsert Logic\n\nFor each valid row, we need to decide whether to create a new task or update an existing one. django-todo matches on the unique combination of the four required columns. If we find a task that matches those, we *update* the rest of the columns. In other words, if you import a CSV once, then edit the Assigned To for a task and import it again, the original task will be updated with a new assignee (and same for the other columns).\n\nOtherwise we create a new task.\n\n\n## Mail Tracking\n\nWhat if you could turn django-todo into a shared mailbox? Django-todo includes an optional feature that allows emails\nsent to a dedicated mailbox to be pushed into todo as new tasks, and responses to be added as comments on those tasks.\nThis allows support teams to work with a fully unified email + bug tracking system to avoid confusion over who's seen or\nresponded to what.\n\nTo enable mail tracking, you need to:\n\n - Define an email backend for outgoing emails\n - Define an email backend for incoming emails\n - Start a worker, which will wait for new emails\n\nIn settings:\n\n```python\nfrom todo.mail.producers import imap_producer\nfrom todo.mail.consumers import tracker_consumer\nfrom todo.mail.delivery import smtp_backend, console_backend\n\n# email notifications configuration\n# each task list can get its own delivery method\nTODO_MAIL_BACKENDS = {\n    # mail-queue is the name of the task list, not the worker name\n    \"mail-queue\": smtp_backend(\n        host=\"smtp.example.com\",\n        port=465,\n        use_ssl=True,\n        username=\"test@example.com\",\n        password=\"foobar\",\n        # used as the From field when sending notifications.\n        # a username might be prepended later on\n        from_address=\"test@example.com\",\n        # additionnal headers\n        headers={}\n    ),\n}\n\n# incoming mail worker configuration\nTODO_MAIL_TRACKERS = {\n    # configuration for worker \"test_tracker\"\n    \"test_tracker\": {\n        \"producer\": imap_producer(\n            host=\"imap.example.com\",\n            username=\"text@example.com\",\n            password=\"foobar\",\n            # process_all=False, # by default, only unseen emails are processed\n            # preserve=False, # delete emails if False\n            # nap_duration=1, # duration of the pause between polling rounds\n            # input_folder=\"INBOX\", # where to read emails from\n        ),\n        \"consumer\": tracker_consumer(\n            group=\"Mail Queuers\",\n            task_list_slug=\"mail-queue\",\n            priority=1,\n            task_title_format=\"[TEST_MAIL] {subject}\",\n        )\n    }\n}\n```\n\nA mail worker can be started with:\n\n```sh\n./manage.py mail_worker test_tracker\n```\n\nSome views and URLs were renamed in 2.0 for logical consistency. If this affects you, see source code and the demo GTD site for reference to the new URL names.\n\nIf you want to log mail events, make sure to properly configure django logging:\n\n```python\nLOGGING = {\n    'version': 1,\n    'disable_existing_loggers': False,\n    'handlers': {\n        'console': {\n            'class': 'logging.StreamHandler',\n        },\n    },\n    'loggers': {\n        '': {\n            'handlers': ['console'],\n            'level': 'DEBUG',\n            'propagate': True,\n        },\n    },\n}\n```\n\n\n## Running Tests\n\ndjango-todo uses pytest exclusively for testing. The best way to run the suite is to clone django-todo into its own directory, install pytest, then:\n\n\tpip install pytest pytest-django\n\tpip install --editable .\n\tpytest -x -v\n\n## Version History\n\n**2.4.5** Re-enable \"notify\" feature during task edit\n\n**2.4.4** Fix issues with setup.py / installation\n\n**2.4.0** Implement optional file attachments on tasks\n\n**2.3.2** Update setup.py metadata\n\n**2.3.1** Improve error handling for badly formatted or non-existent CSV uploads.\n\n**2.3.0** Implement mail tracking system. Added ability to batch-import tasks via CSV. Fixed task re-ordering if task deleted behind the scenes.\n\n**2.2.2** Update dependencies\n\n**2.2.1** Convert task delete and toggle_done views to POST only\n\n**2.2.0** Re-instate enforcement of TODO_STAFF_ONLY setting\n\n**2.1.1** Correct Python version requirement in documentation to Python 3.6\n\n**2.1.1** Split up views into separate modules.\n\n**2.1.0** December 2018: No longer allowing Javascript in task or comment bodies. Misc bug fixes.\n\n**2.0.3** April 2018: Bump production status in setup.py\n\n**2.0.2** April 2018: Improve notification email subjects and bodies\n\n**2.0.1** April 2018: Refactored \"toggle done\" and \"delete\" actions from list view.\n\n**2.0** April 2018: Major project refactor, with almost completely rewritten views, templates, and todo's first real test suite.\n\n**1.6.2** Added support for unicode characters in list name/slugs.\n\n**1.6.1** Minor bug fixes.\n\n**1.6** Allow unassigned (\"Anyone\") tasks. Clean-up / modernize templates and views. Testing infrastructure in place.\n\n**1.5** flake8 support, Item note no longer a required field, fix warnings for Django 1.8, Python 2/3-compatible unicode strings, simple search for tasks, get_absolute_url() for items.\n\n**1.4** - Removed styling from default templates. Added excludes fields from Form definitions to prevent warnings. Removed deprecated 'cycle' tags from templates. Added settings for various elements for public ticket submissions.\n\n**1.3** - Removed stray direct_to_template reference. Quoted all named URL references for Django 1.5 compatibility.\n\n**1.2** - Added CSRF protection to all sample templates. Added integrated search function. Now showing the ratio of completed/total items for each\nlist. Better separation of media and templates. Cleaned up Item editing form (removed extraneous fields). Re-assigning tasks now properly limits\nthe list of assignees. Moved project to github.\n\n**1.1** - Completion date was set properly when checking items off a list, but not when saving from an Item detail page. Added a save method on Item to\nfix. Fixed documentation bug re: context_processors. Newly added comments are now emailed to everyone who has participated in a thread on a task.\n\n**1.0.1** - When viewing a single task that you want to close, it's useful to be able to comment on and close a task at the same time. We were using\ndjango-comments so these were different models in different views. Solution was to stop using django-comments and roll our own, then rewire the\nview. Apologies if you were using a previous version - you may need to port over your comments to the new system.\n\n**1.0.0** - Major upgrade to release version. Drag and drop task prioritization. E-mail notifications (now works more like a ticket system). More\nattractive date picker. Bug fixes.\n\n**0.9.5** - Fixed jquery bug when editing existing events - datepicker now shows correct date. Removed that damned Django pony from base template.\n\n**0.9.4** - Replaced str with unicode in models. Fixed links back to lists in \"My Tasks\" view.\n\n**0.9.3** - Missing link to the individual task editing view\n\n**0.9.2** - Now fails gracefully when trying to add a 2nd list with the same name to the same group. - Due dates for tasks are now truly optional. -\nCorrected datetime editing conflict when editing tasks - Max length of a task name has been raised from 60 to 140 chars. If upgrading, please\nmodify your database accordingly (field todo_item.name = maxlength 140). - Security: Users supplied with direct task URLs can no longer view/edit\ntasks outside their group scope Same for list views - authorized views only. - Correct item and group counts on homepage (note - admin users see\nALL groups, not just the groups they \"belong\" to)\n\n**0.9.1** - Removed context_processors.py - leftover turdlet\n\n**0.9** - First release\n\n## Todo 2.0 Upgrade Notes\n\ndjango-todo 2.0 was rebuilt almost from the ground up, and included some radical changes, including model name changes. As a result, it is *not compatible* with data from django-todo 1.x. If you would like to upgrade an existing installation, try this:\n\n*  Use `./manage.py dumpdata todo --indent 4 > todo.json` to export your old todo data\n*  Edit the dump file, replacing the old model names `Item` and `List` with the new model names (`Task` and `TaskList`)\n*  Delete your existing todo data\n*  Uninstall the old todo app and reinstall\n*  Migrate, then use `./manage.py loaddata todo.json` to import the edited data\n\n### Why not provide migrations?\n\nThat was the plan, but unfortunately, `makemigrations` created new tables and dropped the old ones, making this a destructive update. Renaming models is unfortunately not something `makemigrations` can do, and I really didn't want to keep the badly named original models. Sorry!\n\n### Datepicker\n\ndjango-todo no longer references a jQuery datepicker, but defaults to native html5 browser datepicker (not supported by Safari, unforunately). Feel free to implement one of your choosing.\n\n### URLs\n\nSome views and URLs were renamed for logical consistency. If this affects you, see source code and the demo GTD site for reference to the new URL names.",
    "description_content_type": "",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/shacker/django-todo",
    "keywords": "lists todo bug bugs tracking",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "django-todo",
    "package_url": "https://pypi.org/project/django-todo/",
    "platform": "",
    "project_url": "https://pypi.org/project/django-todo/",
    "project_urls": {
      "Homepage": "https://github.com/shacker/django-todo"
    },
    "release_url": "https://pypi.org/project/django-todo/2.4.5/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "A multi-user, multi-group task management and assignment system for Django.",
    "version": "2.4.5",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 15637038,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "abb5de43091a7c9e11ab3636ef41725c07e4a1cd2e87386edc5308fa23a655b2",
        "md5": "4954708c9389c4edf4650803dda70877",
        "sha256": "6ff1defcf63c86d7f7ddd748407e3a70cb9c75d2580d35e90ee4cf23fba12f4d"
      },
      "downloads": -1,
      "filename": "django-todo-2.4.5.tar.gz",
      "has_sig": false,
      "md5_digest": "4954708c9389c4edf4650803dda70877",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 55260,
      "upload_time": "2019-04-11T07:13:18",
      "upload_time_iso_8601": "2019-04-11T07:13:18.202168Z",
      "url": "https://files.pythonhosted.org/packages/ab/b5/de43091a7c9e11ab3636ef41725c07e4a1cd2e87386edc5308fa23a655b2/django-todo-2.4.5.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}