{
  "info": {
    "author": "Eduardo Santamaría-Vázquez, Víctor Martínez-Cagigal, Víctor Rodríguez-González, Diego Marcos-Martínez, Sergio Pérez-Velasco",
    "author_email": "support@medusabci.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 4 - Beta",
      "Intended Audience :: Developers",
      "Programming Language :: Python",
      "Programming Language :: Python :: 3 :: Only",
      "Programming Language :: Python :: 3.10",
      "Programming Language :: Python :: 3.8",
      "Programming Language :: Python :: 3.9",
      "Topic :: Scientific/Engineering",
      "Topic :: Software Development"
    ],
    "description": "# MEDUSA© Kernel\n\nMEDUSA© is a software ecosystem for the development of BCIs and neuroscience experiments. It has two independent components with dfferent goals: MEDUSA© Kernel and MEDUSA© Platform. \n\nMEDUSA© Kernel is a Python package that contains readyto- use methods to analyze brain signals, including advanced signal processing, machine learning, deep learning, and miscellaneous high-level analyses. It also includes logical functions and classes to handle different biosignals, such as electroencephalography (EEG) and magnetoencephalography (MEG), save experimental data or implement standalone processing pipelines.\n\n## Information\n\nCheck the following links to know more about the MEDUSA environment for neurotechnology and brain-computer interface (BCI) experiments:\n\n- Website: [https://www.medusabci.com/](https://www.medusabci.com/)\n- Documentation: [https://docs.medusabci.com/kernel/](https://docs.medusabci.com/kernel/)\n\nImportant: MEDUSA Kernel is under heavy development! It may change significantly in following versions\n\n## Overview\nMEDUSA Kernel is a Python library, available in the Python Package Index (PyPI) repository, with a complete suite of functions for signal processing. The included functions can be categorized according to their different levels of abstraction. The first level is composed of low-level functions to process signals and calculate basic parameters, including the following:\n\n- Temporal filters: online and offline infinite impulse response filters (IIR) and offline finite impulse response filters (FIR).\n- Spatial filters: common average reference (CAR), laplacian filter, multi-class common spatial patterns (CSP) and canonical correlation analysis (CCA).\n- Local activation: including spectral metrics, such as band power, median frequency, Shannon entropy , and complexity metrics, such as central tendency measure, sample entropy, multiscale entropy, Lempel-Ziv's complexity and Multiscale Lempel-Ziv's complexity.\n- Connectivity: amplitude metrics, such as amplitude correlation envelope (AEC) and instantaneous amplitude correlation (IAC), and phase metrics, such as phase locking value (PLV), phase lag index (PLI) and weighted PLI (wPLI).\n\nIn a higher level of abstraction there are functions that apply a processing pipeline to the input data to analyze certain features. MEDUSA does not assume the nature of the input data in low-level functions, but most of the high-level analysis that are currently implemented are designed to work with electroencephalography (EEG) and magnetoencephalography (MEG) recordings. These functions include:\n\n- Signal processing for BCIs based on event related potentials (ERP): complete classification pipelines including regularized linear discriminant analysis (rLDA), EEGNet and EEG-Inception that can be applied in offline and online modes; ERP analysis with advanced charts.  \n- Signal processing for BCIs based on motor imagery (MI): complete classification pipelines including CSP combined with rLDA, EEGNet, EEG-Inception and EEGSym that can be applied in offline and online modes; MI analysis with advanced charts.  \n- Signal processing for BCIs based on code-modulated visual evoked potentials (cVEP): complete classification pipeline based on CCA; cVEP analysis with advanced charts. \n- Signal processing for neurofeedback (NF): battery of high-level models based on spectral and connectivity metrics ready to be applied in online and offline applications.\n\nAdditionally, the package includes classes and functions to import data from other toolboxes (e.g., MATLAB, MNE), define the data format of signals and experiments, save recordings to several file types (e.g., bson, json, mat) and implement custom real-time signal processing pipelines. Furthermore, some of the functions, including the BCI models, can be applied in both online and offine experiments. Therefore, MEDUSA©  Kernel can be used for offine analysis of previously recorded data, such as public databases, or in real-time tasks. In fact, MEDUSA© Platform relies on this package for signal processing. This is an interesting feature that allows to reproduce the exact same results achieved in an online experiment during subsequent offine analyses, facilitating experimental reproducibility.\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://medusabci.com/",
    "keywords": "Signal,Biosignal,EEG,BCI",
    "license": "CC Attribution-NonCommercial-NoDerivs 2.0",
    "maintainer": "",
    "maintainer_email": "",
    "name": "medusa-kernel",
    "package_url": "https://pypi.org/project/medusa-kernel/",
    "platform": null,
    "project_url": "https://pypi.org/project/medusa-kernel/",
    "project_urls": {
      "Homepage": "https://medusabci.com/"
    },
    "release_url": "https://pypi.org/project/medusa-kernel/1.0.0/",
    "requires_dist": [
      "numpy",
      "scipy",
      "matplotlib",
      "numba",
      "sklearn",
      "statsmodels",
      "bson",
      "h5py",
      "dill",
      "tqdm",
      "tensorflow"
    ],
    "requires_python": "",
    "summary": "Advanced biosignal processing toolbox",
    "version": "1.0.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16047831,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "9d9aa6abd8611dc82982986813d9802f776fd92556cadd4fedf0959e11785df8",
        "md5": "95d2eb08f19f4d5211a5c4f851aae995",
        "sha256": "4aaeabd4f1100216ed53cc1bfdd8bdb5037765588a698f506857f7e06707bec3"
      },
      "downloads": -1,
      "filename": "medusa_kernel-1.0.0-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "95d2eb08f19f4d5211a5c4f851aae995",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": null,
      "size": 257645,
      "upload_time": "2022-10-29T10:42:52",
      "upload_time_iso_8601": "2022-10-29T10:42:52.098530Z",
      "url": "https://files.pythonhosted.org/packages/9d/9a/a6abd8611dc82982986813d9802f776fd92556cadd4fedf0959e11785df8/medusa_kernel-1.0.0-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "de302f0e6f5aa56d73c14f7d0143f7ba65ee67a39a2cd0f3e9549b3ce627417d",
        "md5": "7186dea59acffe31215fe7959d9d74b5",
        "sha256": "cf7e4f5cd13e0ea90603e8e66af02d7ad0ab1620496ac480fd503cd18fb0176c"
      },
      "downloads": -1,
      "filename": "medusa-kernel-1.0.0.tar.gz",
      "has_sig": false,
      "md5_digest": "7186dea59acffe31215fe7959d9d74b5",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 236078,
      "upload_time": "2022-10-29T10:42:53",
      "upload_time_iso_8601": "2022-10-29T10:42:53.603880Z",
      "url": "https://files.pythonhosted.org/packages/de/30/2f0e6f5aa56d73c14f7d0143f7ba65ee67a39a2cd0f3e9549b3ce627417d/medusa-kernel-1.0.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}