{
  "info": {
    "author": "OpenStack",
    "author_email": "openstack-dev@lists.openstack.org",
    "bugtrack_url": null,
    "classifiers": [
      "Environment :: OpenStack",
      "Intended Audience :: Information Technology",
      "Intended Audience :: System Administrators",
      "License :: OSI Approved :: Apache Software License",
      "Operating System :: POSIX :: Linux",
      "Programming Language :: Python",
      "Programming Language :: Python :: 2",
      "Programming Language :: Python :: 2.7"
    ],
    "description": "Team and repository tags\n========================\n\n[![Team and repository tags](http://governance.openstack.org/badges/monasca-api.svg)](http://governance.openstack.org/reference/tags/index.html)\n\n<!-- Change things from this point on -->\n\n# Overview\n\n`monasca-api` is a RESTful API server that is designed with a layered architecture [layered architecture](http://en.wikipedia.org/wiki/Multilayered_architecture).\n\nThe full API Specification can be found in [docs/monasca-api-spec.md](docs/monasca-api-spec.md)\n\n## Java Build\n\nRequires monasca-common from https://git.openstack.org/openstack/monasca-common. First clone this repository and then do mvn install. Then return to monasca-api and:\n\n    $ cd java\n    $ mvn clean package\n\n# StackForge Java Build\n\nThere is a pom.xml in the base directory that should only be used for the StackForge build. The StackForge build is a rather strange build because of the limitations of the current StackForge java jobs and infrastructure. We have found that the API runs faster if built with maven 3 but the StackForge nodes only have maven 2. This build checks the version of maven and if not maven 3, it downloads a version of maven 3 and uses it. This build depends on jars that are from monasca-common. That StrackForge build uploads the completed jars to http://tarballs.openstack.org/ci/monasca-common, but they are just regular jars, and not in a maven repository and sometimes zuul takes a long time to do the upload. Hence, the first thing the maven build from the base project does is invoke build_common.sh in the common directory. This script clones monasca-common and then invokes maven 3 to build monasca-common in the common directory and install the jars in the local maven repository.\n\nSince this is all rather complex, that part of the build only works on StackForge so follow the simple instruction above if you are building your own monasca-api.\n\nCurrently this build is executed on the bare-precise nodes in StackForge and they only have maven 2. So, this build must be kept compatible with Maven 2. If another monasca-common jar is added as a dependency to java/pom.xml, it must also be added to download/download.sh.\n\nCombining monasca-common, monasca-thresh, monasca-api and monasca-persister into one build would vastly simplify the builds but that is a future task.`\n\n## Usage\n\n    $ java -jar target/monasca-api.jar server config-file.yml\n\n## Keystone Configuration\n\nFor secure operation of the Monasca API, the API must be configured to use Keystone in the configuration file under the middleware section. Monasca only works with a Keystone v3 server. The important parts of the configuration are explained below:\n\n* serverVIP - This is the hostname or IP Address of the Keystone server\n* serverPort - The port for the Keystone server\n* useHttps - Whether to use https when making requests of the Keystone API\n* truststore - If useHttps is true and the Keystone server is not using a certificate signed by a public CA recognized by Java, the CA certificate can be placed in a truststore so the Monasca API will trust it, otherwise it will reject the https connection. This must be a JKS truststore\n* truststorePassword - The password for the above truststore\n* connSSLClientAuth - If the Keystone server requires the SSL client used by the Monasca server to have a specific client certificate, this should be true, false otherwise\n* keystore - The keystore holding the SSL Client certificate if connSSLClientAuth is true\n* keystorePassword - The password for the keystore\n* defaultAuthorizedRoles - An array of roles that authorize a user to access the complete Monasca API. User must have at least one of these roles. See below\n* readOnlyAuthorizedRoles - An array of roles that authorize a user to only GET (but not POST, PUT...) metrics.  See Keystone Roles below\n* agentAuthorizedRoles - An array of roles that authorize only the posting of metrics.  See Keystone Roles below\n* adminAuthMethod - \"password\" if the Monasca API should adminUser and adminPassword to login to the Keystone server to check the user's token, \"token\" if the Monasca API should use adminToken\n* adminUser - Admin user name\n* adminPassword - Admin user password\n* adminProjectId - Specify the project ID the api should use to request an admin token. Defaults to the admin user's default project. The adminProjectId option takes precedence over adminProjectName.\n* adminProjectName - Specify the project name the api should use to request an admin token. Defaults to the admin user's default project. The adminProjectId option takes precedence over adminProjectName.\n* adminToken - A valid admin user token if adminAuthMethod is token\n* timeToCacheToken - How long the Monasca API should cache the user's token before checking it again\n\n### Keystone Roles\n\nThe Monasca API has two levels of access:\n# Full access - user can read/write metrics and Alarm Definitions and Alarms\n# Agent access - user can only write metrics\n\nThe reason for the \"Agent access\" level is because the Monasca Agent must be configured to use a Keystone user. Since the user and password are configured onto the all of the systems running the Monasca Agent, this user is most in danger of being compromised. If this user is limited to only writing metrics, then the damage can be limited.\n\nTo configure the user to have full access, the user must have a role that is listed in defaultAuthorizedRoles. To configure a user to have only \"Agent access\", the user must have a role in agentAuthorizedRoles and none of the roles in defaultAuthorizedRoles.\n\nIf you want to give users the ability to only view data, configure one or more roles in the readOnlyAuthorizedRoles list.\n\n## Design Overview\n\n### Architectural layers\n\nRequests flow through the following architectural layers from top to bottom:\n\n* Resource\n  * Serves as the entrypoint into the service.\n  * Responsible for handling web service requests, and performing structural request validation.\n* Application\n  * Responsible for providing application level implementations for specific use cases.\n* Domain\n  * Contains the technology agnostic core domain model and domain service definitions.\n  * Responsible for upholding invariants and defining state transitions.\n* Infrastructure\n  * Contains technology specific implementations of domain services.\n\n## Documentation\n\n* API Specification: [/docs/monasca-api-spec.md](/docs/monasca-api-spec.md).\n\n\npython monasca api implementation\n=================================\n\nTo install the python api implementation, git clone the source and run the\nfollowing command::\n\n    $ sudo python setup.py install\n\nIf it installs successfully, you will need to make changes to the following\ntwo files to reflect your system settings, especially where kafka server is\nlocated::\n\n    /etc/monasca/api-config.ini\n    /etc/monasca/api-config.conf\n\nOnce the configurations are modified to match your environment, you can start\nup the server by following the following instructions.\n\nTo start the server, run the following command:\n\n    Running the server in foreground mode\n    $ gunicorn -k eventlet --worker-connections=2000 --backlog=1000 --paste /etc/monasca/api-config.ini\n\n    Running the server as daemons\n    $ gunicorn -k eventlet --worker-connections=2000 --backlog=1000 --paste /etc/monasca/api-config.ini -D\n\nTo check if the code follows python coding style, run the following command\nfrom the root directory of this project\n\n    $ tox -e pep8\n\nTo run all the unit test cases, run the following command from the root\ndirectory of this project\n\n    $ tox -e py27   (or -e py26, -e py33)\n\n\n# License\n\nCopyright (c) 2014 Hewlett-Packard Development Company, L.P.\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\nimplied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n\n\n\n",
    "description_content_type": null,
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/openstack/monasca-api",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "monasca-api",
    "package_url": "https://pypi.org/project/monasca-api/",
    "platform": "",
    "project_url": "https://pypi.org/project/monasca-api/",
    "project_urls": {
      "Homepage": "https://github.com/openstack/monasca-api"
    },
    "release_url": "https://pypi.org/project/monasca-api/1.6.0/",
    "requires_dist": [
      "PasteDeploy (>=1.5.0)",
      "SQLAlchemy (<1.1.0,>=1.0.10)",
      "eventlet (>=0.18.2,!=0.18.3)",
      "falcon (>=0.1.6)",
      "keystonemiddleware (>=4.12.0)",
      "monasca-common (>=1.4.0)",
      "oslo.config (>=3.14.0,!=3.18.0)",
      "oslo.context (>=2.9.0)",
      "oslo.log (>=3.11.0)",
      "oslo.middleware (>=3.0.0)",
      "oslo.serialization (>=1.10.0)",
      "oslo.utils (>=3.18.0)",
      "pbr (>=1.8)",
      "pyparsing (>=2.1.0)",
      "python-keystoneclient (>=3.8.0)",
      "simplejson (>=2.2.0)",
      "six (>=1.9.0)",
      "voluptuous (>=0.8.9)"
    ],
    "requires_python": "",
    "summary": "OpenStack Monitoring as a Service",
    "version": "1.6.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17397513,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "ed42c1954397198e93c90009caee2ec8c3ec595b85258aa2688ec8f79e1f2528",
        "md5": "261b7a27a7dacc7c280788c71453b42c",
        "sha256": "b52e639fcff256e05951a28e2d71b75a825fcfe5057781a1f651c37b24539a41"
      },
      "downloads": -1,
      "filename": "monasca_api-1.6.0-py2-none-any.whl",
      "has_sig": false,
      "md5_digest": "261b7a27a7dacc7c280788c71453b42c",
      "packagetype": "bdist_wheel",
      "python_version": "py2",
      "requires_python": null,
      "size": 197763,
      "upload_time": "2017-02-16T13:25:26",
      "upload_time_iso_8601": "2017-02-16T13:25:26.525324Z",
      "url": "https://files.pythonhosted.org/packages/ed/42/c1954397198e93c90009caee2ec8c3ec595b85258aa2688ec8f79e1f2528/monasca_api-1.6.0-py2-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "5adb015e0da33f73a9a931d87f2bb25dab13be344915bf081b7c3841d7230b93",
        "md5": "e9256042e3abb083b6a37ac30ea2deae",
        "sha256": "e7835e601c3711ec105ebfddfad71f9c92af85ab05abc5b49569c2353b3849e8"
      },
      "downloads": -1,
      "filename": "monasca-api-1.6.0.tar.gz",
      "has_sig": false,
      "md5_digest": "e9256042e3abb083b6a37ac30ea2deae",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 355808,
      "upload_time": "2017-02-16T13:25:28",
      "upload_time_iso_8601": "2017-02-16T13:25:28.794702Z",
      "url": "https://files.pythonhosted.org/packages/5a/db/015e0da33f73a9a931d87f2bb25dab13be344915bf081b7c3841d7230b93/monasca-api-1.6.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}