{
  "info": {
    "author": "MapAction",
    "author_email": "github@mapaction.org",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "Environment :: Win32 (MS Windows)",
      "License :: OSI Approved :: GNU General Public License v3 (GPLv3)",
      "Operating System :: Microsoft :: Windows",
      "Programming Language :: Python :: 3"
    ],
    "description": "# mapactionpy_controller_dependencies\n This is a pseudo package to force the install of dependencies for [`mapaction_controller`](https://github.com/mapaction/mapactionpy_controller) via pip on Windows, even for those which don't support pip.\n\nThere are a number of third party packages which are bundled here. These are stored in the\nfolder `dependency_wheels` and are included purely to simplify the experience of those installing `mapactionpy_controller` via `pip`. We are grateful for the excellent of these projects and do not claim either copyright or credit for their work. \n\nNor do we claim any endorsement from their authors for `mapactionpy_controller`.\n\nThe wheel files used are sourced from Christoph Gohlke's excellent [\"Unofficial Windows Binaries for Python Extension Packages\"](https://www.lfd.uci.edu/~gohlke/pythonlibs/). They come with the following disclaimer:\n> \"The files are provided \"as is\" without warranty or support of any kind. The entire risk as to the quality and performance is with you.\"\n\nIncluded packages\n=====\n\n* [Fiona](https://github.com/Toblerity/Fiona)\n* [GDAL](https://gdal.org/)\n* [geopandas](https://pypi.org/project/geopandas/)\n* [pyproj](https://github.com/pyproj4/pyproj)\n* [RTree](https://pypi.org/project/Rtree/)\n* [Shapely](https://github.com/Toblerity/Shapely)\n\nThird party licences\n=====\nCopyright notices and licence terms for each of the third party packages are given below.\n\nGDAL\n----\nCopyright 1998-2020 [Frank Warmerdam](https://github.com/warmerdam), [Even Rouault](https://github.com/rouault), and [others](https://github.com/OSGeo/gdal/graphs/contributors)\n\n* https://gdal.org/license.html\n* https://raw.githubusercontent.com/OSGeo/gdal/master/gdal/LICENSE.TXT\n\n> THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nGeoPandas\n----\n\n* https://geopandas.org/\n* https://github.com/geopandas/geopandas/blob/master/LICENSE.txt\n  \n> Copyright (c) 2013-2016, GeoPandas developers.\n> All rights reserved.\n> \n> Redistribution and use in source and binary forms, with or without\n> modification, are permitted provided that the following conditions are met:\n> \n> * Redistributions of source code must retain the above copyright notice, this\n>   list of conditions and the following disclaimer.\n> * Redistributions in binary form must reproduce the above copyright notice,\n>   this list of conditions and the following disclaimer in the documentation\n>   and/or other materials provided with the distribution.\n> * Neither the name of Enthought, Inc. nor the names of its contributors may\n>   be used to endorse or promote products derived from this software without\n>   specific prior written permission.\n> \n> THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\n> ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\n> WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n> DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR\n> ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n> (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\n> LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\n> ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n> (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\n> SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n\npyproj \n----\nhttps://github.com/pyproj4/pyproj\n\nAuthor's copyright notice:\n> Copyright (c) 2006-2018, Jeffrey Whitaker.\n> Copyright (c) 2019-2020, Open source contributors.\n> \n> Permission is hereby granted, free of charge, to any person obtaining a copy of\n> this software and associated documentation files (the \"Software\"), to deal in\n> the Software without restriction, including without limitation the rights to use,\n> copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the\n> Software, and to permit persons to whom the Software is furnished to do so,\n> subject to the following conditions:\n> \n> The above copyright notice and this permission notice shall be included in all\n> copies or substantial portions of the Software.\n> \n> THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,\n> INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A\n> PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT\n> HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION\n> OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE\n> SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nRTree\n---\nhttps://pypi.org/project/Rtree\n\n> Copyright (c) 2018: Sean C. Gillies, Howard Butler and contributors \n> \n> Permission is hereby granted, free of charge, to any person obtaining a copy\n> of this software and associated documentation files (the \"Software\"), to deal\n> in the Software without restriction, including without limitation the rights\n> to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n> copies of the Software, and to permit persons to whom the Software is\n> furnished to do so, subject to the following conditions:\n> \n> The above copyright notice and this permission notice shall be included in all\n> copies or substantial portions of the Software.\n> \n> THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\n> EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n> MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\n> IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,\n> DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR\n> OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE\n> OR OTHER DEALINGS IN THE SOFTWARE.\n\nFiona and Shapely\n----\nhttps://github.com/Toblerity/Fiona\nhttps://github.com/Toblerity/Shapely\n\nAuthor's copyright notice:\n> Copyright (c) 2007, Sean C. Gillies\n> All rights reserved.\n> \n> Redistribution and use in source and binary forms, with or without\n> modification, are permitted provided that the following conditions are met:\n> \n> * Redistributions of source code must retain the above copyright\n>   notice, this list of conditions and the following disclaimer.\n> * Redistributions in binary form must reproduce the above copyright\n>   notice, this list of conditions and the following disclaimer in the\n>   documentation and/or other materials provided with the distribution.\n> * Neither the name of Sean C. Gillies nor the names of\n>   its contributors may be used to endorse or promote products derived from\n>   this software without specific prior written permission.\n> \n> THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\n> AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n> IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n> ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE\n> LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n> CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\n> SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\n> INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\n> CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n> ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE\n> POSSIBILITY OF SUCH DAMAGE.",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "http://github.com/mapaction/mapy_dependancies_deploy",
    "keywords": "",
    "license": "GPL3",
    "maintainer": "",
    "maintainer_email": "",
    "name": "mapy-dependencies-py36",
    "package_url": "https://pypi.org/project/mapy-dependencies-py36/",
    "platform": "",
    "project_url": "https://pypi.org/project/mapy-dependencies-py36/",
    "project_urls": {
      "Homepage": "http://github.com/mapaction/mapy_dependancies_deploy"
    },
    "release_url": "https://pypi.org/project/mapy-dependencies-py36/1.1.1/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "Controls the workflow of map and infographic production",
    "version": "1.1.1",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 12082082,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "a2f0d9571ad00938c9511a7aca8e02d4aabbbdbf9b4e5b88c3691caeae91f4ed",
        "md5": "35417967d14e977fc904cec3589d2f78",
        "sha256": "5978869618a65c0dd9ae510d5fa1971e523ca4379188268035102416dca27006"
      },
      "downloads": -1,
      "filename": "mapy-dependencies-py36-1.1.1.tar.gz",
      "has_sig": false,
      "md5_digest": "35417967d14e977fc904cec3589d2f78",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 45573004,
      "upload_time": "2021-02-26T19:32:23",
      "upload_time_iso_8601": "2021-02-26T19:32:23.531793Z",
      "url": "https://files.pythonhosted.org/packages/a2/f0/d9571ad00938c9511a7aca8e02d4aabbbdbf9b4e5b88c3691caeae91f4ed/mapy-dependencies-py36-1.1.1.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}