{
  "info": {
    "author": "Pavlo O. Dral",
    "author_email": "admin@mlatom.com",
    "bugtrack_url": null,
    "classifiers": [
      "Environment :: Console",
      "Operating System :: POSIX :: Linux",
      "Programming Language :: Fortran",
      "Programming Language :: Python :: 3",
      "Topic :: Scientific/Engineering :: Chemistry"
    ],
    "description": "# Brief Introduction\nA Package for Atomistic Simulations with Machine Learning\n\n**manual**: http://mlatom.com/manual/  \n**tutorial**: http://mlatom.com/tutorial/ \n\n\n#  Tasks Performed by MLatom\nA brief overview of MLatom capabilities. See sections below for more details.\n\n## Tasks\n- Estimating accuracy of ML models.\n- Creating ML model and saving it to a file.\n- Loading existing ML model from a file and performing ML calculations with this model.\n- ML-cross-section to boost the calculation of ML-NEA\n\n## Data Set Operations\n- Converting XYZ coordinates into an input vector (molecular descriptor) for ML.\n- Sampling subsets from a data set.\n\n\n# Sampling\n- none: simply splitting the data set into the training, test, and, if necessary, training set into the subtraining and validation sets (in this order) without changing the order of indices.\n- random sampling.\n- user-defined: requests MLatom to read indices for the training, test, and, if necessary, for the subtraining and validation sets from files.\n- [ structure-based sampling ](http://mlatom.com/self-correcting-machine-learning-and-structure-based-sampling/)\n  - from unsliced and sliced data\n- [ farthest-point traversal iterative procedure ](https://en.wikipedia.org/wiki/Farthest-first_traversal), which starts from two points farthest apart.\n\n\n# ML Algorithm\n[ Kernel ridge regression](https://web.stanford.edu/~hastie/ElemStatLearn/) with the following kernels:\n- [ Gaussian ](https://doi.org/10.1103/PhysRevLett.108.058301).\n- [ Laplacian ](https://doi.org/10.1103/PhysRevLett.108.058301).\n- exponential.\n- [ Matérn ](http://dx.doi.org/10.1198/jasa.2010.tm09420) ([ details of implementation ](http://dx.doi.org/10.1021/acs.jpclett.8b02469)).\nPermutationally invariant kernel and self-correction are also supported.\n\n\n# Hybrid QM/ML Approaches\n[ Δ-machine learning ](http://dx.doi.org/10.1021/acs.jctc.5b00099).\n\n\n# Molecular Descriptors\n- [ Coulomb matrix ](https://doi.org/10.1103/PhysRevLett.108.058301)\n  - [ sorted by norms of its rows ](http://dx.doi.org/10.1021/ct400195d);\n  - unsorted;\n  - permuted.\n- [ Normalized inverted internuclear distances ](http://mlatom.com/self-correcting-machine-learning-and-structure-based-sampling/)\n  - sorted for user-defined atoms by the sum of their nuclear repulsions to all other atoms;\n  - unsorted;\n  - permuted.\n\n\n# The KREG model\nNow we set [ KREG (Kernel-ridge-regression using RE descriptor and the Gaussian kernel function )](http://dx.doi.org/10.1021/acs.jpclett.8b02469) as default ML method. Default hyperparameter optimization options were updated to speed up the hyperparameter search for KREG.\n\n\n# Model Validation\n[ ML model can be validated (generalization error can be estimated) in several ways: ](https://web.stanford.edu/~hastie/ElemStatLearn/)\n\n- on a hold-out test set not used for training. Both training and test sets can be sampled in one of the ways described above;\n- by performing N-fold cross-validation. User can define the number of folds N. If N is equal to the number of data points, leave-one-out cross-validation is performed. Only random or no sampling can be used for cross-validation.\n- by performing leave-one-out cross-validation (special case of N-fold cross-validation).\nMLatom prints out mean absolute error (MAE), mean signed error (MSE), root-mean-squared error (RMSE), mean values of reference and estimated values, largest positive and negative outliers, correlation coefficient and its squared value R2 as well as coefficients of linear regression and corresponding standard deviations.\n\n\n# Hyperparameter Tuning\nGaussian, Laplacian, and Matérn kernels have σ and λ tunable hyperparameters. MLatom can determine them by performing user-defined number of iterations of hyperparameter optimization on a logarithmic grid. User can adjust number of grid points, starting and finishing points on the grid. Hyperparameter are tuned to minimize either mean absolute error or root-mean-square error as defined by the user. [ Hyperparameters can be tuned to minimize ](https://web.stanford.edu/~hastie/ElemStatLearn/)\n\n- the error of the ML model trained on the subtraining set in a hold-out validation set. Both subtraining and validation sets are parts of the training set, which can be used at the end with optimal parameters for training the final ML model. These sets ideally should not overlap and can be [ sampled ](http://mlatom.com/features/#Sampling) from the training set in one of the ways described above;\n- N-fold cross-validation error. User can define the number of folds N. If N is equal to the number of data points, leave-one-out cross-validation is performed. Only random or no sampling can be used for cross-validation.\n\nNote that hyperparameter tuning can be performed together with model validation. This means that for example one can perform outer loop of the cross-validation for model validation and tune hyperparameters via inner loop of the cross-validation.\n\n\n# First Derivatives\nMLatom can be also used to estimate first derivatives from an ML model. It can be useful, if an ML model has been created for energies, and one wants to estimate forces. Two scenarios are possible:\n\n- partial derivatives are calculated for each dimension of given input vectors (analytical derivatives for Gaussian kernel, numerical derivatives for other kernels);\n- first derivatives are calculated in XYZ coordinates for input files containing molecular XYZ coordinates (only numerical derivatives).\n\n\n# Cross Section\nMLatom can significantly accelerate the calculation of cross-section with the Nuclear Ensemble Approach (NEA).\n\nIn brief, this feature uses fewer QC calculation to achieve higher precision and reduce computational cost. You can find more detail on this paper (please cite it when using this feature:\n\n> Bao-Xin Xue, Mario Barbatti*, Pavlo O. Dral*, [ Machine Learning for Absorption Cross Sections ](https://doi.org/10.1021/acs.jpca.0c05310), J. Phys. Chem. A 2020, 124, 7199–7210. DOI: 10.1021/acs.jpca.0c05310.\n> [ Preprint on ChemRxiv ](https://doi.org/10.26434/chemrxiv.12594191), DOI: 10.26434/chemrxiv.12594191.\n\n# About Program\nMLatom: a Package for Atomistic Simulations with Machine Learning    \nVersion 1.2  \nhttp://mlatom.com/                             \n                                                                           \nCopyright (c) 2013-2020 Pavlo O. Dral                   \nhttp://dr-dral.com/                            \n                                                                           \nAll rights reserved. No part of MLatom may be used, published or redistributed without written permission by Pavlo Dral.  \nThe above copyright notice and this permission notice shall be included  in all copies or substantial portions of the Software.           \nThe software is provided \"as is\", without warranty of any kind, express  or implied, including but not limited to the warranties of merchantability, fitness for a particular purpose and noninfringement. In no event shall the authors or copyright holders be liable for any claim, damages or other liability, whether in an action of contract, tort or otherwise, arising from, out of or in connection with the software or the use or other dealings in the software.                                   \n                                                                           \nCite as: \n1. Pavlo O. Dral, J. Comput. Chem. 2019, 40, 2339-2347             \n2. Pavlo O. Dral, Bao-Xin Xue, Fuchun Ge, Yi-Fan Hou, MLatom: A Package for Atomistic Simulations with Machine Learning, version 1.2, Xiamen University, Xiamen, China, 2013-2020.               \n\n\n# License\n\nThis work is licensed under the [Attribution-NonCommercial-NoDerivatives 4.0 International](http://creativecommons.org/licenses/by-nc-nd/4.0/) license. See LICENSE.CC-BY-NC-ND-4.0.\n\n<a rel=\"license\" href=\"http://creativecommons.org/licenses/by-nc-nd/4.0/\"><img alt=\"Creative Commons License\" style=\"border-width:0\" src=\"https://i.creativecommons.org/l/by-nc-nd/4.0/88x31.png\" /></a>",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "http://mlatom.com",
    "keywords": "",
    "license": "CC BY-NC-ND 4.0",
    "maintainer": "",
    "maintainer_email": "",
    "name": "MLatom",
    "package_url": "https://pypi.org/project/MLatom/",
    "platform": "",
    "project_url": "https://pypi.org/project/MLatom/",
    "project_urls": {
      "Homepage": "http://mlatom.com"
    },
    "release_url": "https://pypi.org/project/MLatom/1.2.3/",
    "requires_dist": null,
    "requires_python": ">=3.7",
    "summary": "A Package for Atomistic Simulations with Machine Learning",
    "version": "1.2.3",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16111429,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "bbd5dd92e9829debcb02f50abfbd806b5f7882dc72a82d675ac5cd9b570833c8",
        "md5": "7d53e7dea87db84997ef392822f0aeb0",
        "sha256": "52f9f7ba15309f30eaf1342ae535e5734b72ee3b01b5c16751ffd3c25bea61ac"
      },
      "downloads": -1,
      "filename": "MLatom-1.2.3.tar.gz",
      "has_sig": false,
      "md5_digest": "7d53e7dea87db84997ef392822f0aeb0",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.7",
      "size": 5429806,
      "upload_time": "2021-03-01T02:36:52",
      "upload_time_iso_8601": "2021-03-01T02:36:52.066116Z",
      "url": "https://files.pythonhosted.org/packages/bb/d5/dd92e9829debcb02f50abfbd806b5f7882dc72a82d675ac5cd9b570833c8/MLatom-1.2.3.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}