{
  "info": {
    "author": "Blake Bullwinkel, Aditya Kumar, Carlos Robles",
    "author_email": "jbullwinkel@fas.harvard.edu, adityakumar@g.harvard.edu, carlosrobles@college.harvard.edu",
    "bugtrack_url": null,
    "classifiers": [
      "License :: OSI Approved :: MIT License",
      "Operating System :: OS Independent",
      "Programming Language :: Python :: 3"
    ],
    "description": "# cs107-FinalProject\n\n## Group #32\nAditya Kumar, Carlos Robles, Blake Bullwinkel\n\nTravis Build Badge:\n[![Build Status](https://travis-ci.org/autodiffdreamteam/cs107-FinalProject.svg?branch=master)](https://travis-ci.org/autodiffdreamteam/cs107-FinalProject)\n\nCodecoverage Badge:\n[![codecov](https://codecov.io/gh/autodiffdreamteam/cs107-FinalProject/branch/master/graph/badge.svg?token=7VF8CR2OBS)](https://codecov.io/gh/autodiffdreamteam/cs107-FinalProject)\n\nDreamDiff is a Python package for automatic differentiation, root-finding, optimization, and interpolation.\n\nOur goal for DreamDiff is for it to live well beyond the confines of a computer science course, as all good software should. While we believe it has potential to be used in a wide range of exciting applications, it is important to also consider the broader implications of our software.\n\nOur package implements forward-mode automatic differentiation, gradient descent, Nesterov's accelerated gradient descent, Newton’s method and quadratic splines. All these tools have distinct usages, but we hope the convenience of a centralized optimization package provides some extra utility to users working on various optimization tasks in machine learning, minimization and maximization problems, and interpolation using quadratic splines.\n\nFurther, we hope that the visualization and animation functionality built into our optimization functions serve as a useful educational tool, providing a more intuitive understanding of how these methods work and encouraging math and computer science education more broadly. Perhaps most importantly, we hope that by open-sourcing our software, it will be accessible to as many people as possible. We believe that open-source platforms like GitHub have inherent advantages for inclusivity, providing open access to people around the world who may want to utilize or build upon its core functionality. Nonetheless, it is important to address the more subtle yet persistent inequities in software development and the broader field of computer science.\n\nFor example, open source still requires an internet connection, which automatically excludes the 3.6 billion people across the globe (around 47% of the world's population) who do not use the internet, let alone have a computer or access to the educational resources required to learn basic STEM skills. But even in regions of the world where internet access is not an issue, historical gender imbalances have created barriers for women and people of color in computer science. Regardless of your own background, we ask that you keep these inequities in mind and consider how your own work environment can be made more inclusive, particularly for groups that face historical barriers in STEM fields.",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/autodiffdreamteam/cs107-FinalProject",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "DreamDiff",
    "package_url": "https://pypi.org/project/DreamDiff/",
    "platform": "",
    "project_url": "https://pypi.org/project/DreamDiff/",
    "project_urls": {
      "Homepage": "https://github.com/autodiffdreamteam/cs107-FinalProject"
    },
    "release_url": "https://pypi.org/project/DreamDiff/1.0.0/",
    "requires_dist": null,
    "requires_python": ">=3.6",
    "summary": "A Python package for automatic differentiation, root-finding, optimization, and interpolation",
    "version": "1.0.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 8885400,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "28b81ee4e9c556f292d36433f45759d939f5290704071e8ff292ba9232a97774",
        "md5": "af45572f92e89c3a6b13b9590b3c37a7",
        "sha256": "2d0199c64cf9fbfa3af55f1f2700088ecf54329ee6598f318fbc43d7fae434ac"
      },
      "downloads": -1,
      "filename": "DreamDiff-1.0.0.tar.gz",
      "has_sig": false,
      "md5_digest": "af45572f92e89c3a6b13b9590b3c37a7",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.6",
      "size": 11725,
      "upload_time": "2020-12-12T17:00:58",
      "upload_time_iso_8601": "2020-12-12T17:00:58.505470Z",
      "url": "https://files.pythonhosted.org/packages/28/b8/1ee4e9c556f292d36433f45759d939f5290704071e8ff292ba9232a97774/DreamDiff-1.0.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}