{
  "info": {
    "author": "Yaco Sistemas and independent contributors",
    "author_email": "lgs@yaco.es",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "Environment :: Web Environment",
      "Framework :: Django",
      "Framework :: Django :: 3.0",
      "Intended Audience :: Developers",
      "License :: OSI Approved :: Apache Software License",
      "Operating System :: OS Independent",
      "Programming Language :: Python",
      "Programming Language :: Python :: 3.6",
      "Programming Language :: Python :: 3.7",
      "Programming Language :: Python :: 3.8",
      "Topic :: Internet :: WWW/HTTP",
      "Topic :: Internet :: WWW/HTTP :: WSGI",
      "Topic :: Security",
      "Topic :: Software Development :: Libraries :: Application Frameworks"
    ],
    "description": "===========\ndjangosaml2\n===========\n\n.. image:: https://github.com/knaperek/djangosaml2/workflows/djangosaml2/badge.svg\n    :target: https://github.com/knaperek/djangosaml2/workflows/djangosaml2/badge.svg\n\n\nA Django application that builds a Fully Compliant SAML2 Service Provider on top of PySAML2 library.\nThis mean that you can protect your Django based project\nwith a SAML2 SSO Authentication. This way it will talk SAML2 with\nyour Identity Provider allowing you to use this authentication mechanism.\nThis document will guide you through a few simple steps to accomplish\nsuch goal.\n\n.. contents::\n\nInstallation\n============\n\nPySAML2 uses xmlsec1_ binary to sign SAML assertions so you need to install\nit either through your operating system package or by compiling the source\ncode. It doesn't matter where the final executable is installed because\nyou will need to set the full path to it in the configuration stage.\n\n.. _xmlsec1: http://www.aleksey.com/xmlsec/\n\nNow you can install the djangosaml2 package using easy_install or pip. This\nwill also install PySAML2 and its dependencies automatically.\n\n\nConfiguration\n=============\n\nThere are three things you need to setup to make djangosaml2 work in your\nDjango project:\n\n1. **settings.py** as you may already know, it is the main Django\n   configuration file.\n2. **urls.py** is the file where you will include djangosaml2 urls.\n3. **pysaml2** specific files such as an attribute map directory and a\n   certificate.\n\n\nChanges in the settings.py file\n-------------------------------\nThe first thing you need to do is add ``djangosaml2`` to the list of\ninstalled apps::\n\n  INSTALLED_APPS = (\n      'django.contrib.auth',\n      'django.contrib.contenttypes',\n      'django.contrib.sessions',\n      'django.contrib.sites',\n      'django.contrib.messages',\n      'django.contrib.admin',\n      'djangosaml2',  # new application\n  )\n\nActually this is not really required since djangosaml2 does not include\nany data model. The only reason we include it is to be able to run\ndjangosaml2 test suite from our project, something you should always\ndo to make sure it is compatible with your Django version and environment.\n\n.. Note::\n\n  When you finish the configuration you can run the djangosaml2 test suite as\n  you run any other Django application test suite. Just type ``python manage.py\n  test djangosaml2``.\n\n  Python users need to ``pip install djangosaml2[test]`` in order to run the\n  tests.\n\nAdd the SAML Session Middleware as follow, this is needed for SameSite Cookies::\n\n  MIDDLEWARE.append('djangosaml2.middleware.SamlSessionMiddleware')\n\nThen you have to add the ``djangosaml2.backends.Saml2Backend``\nauthentication backend to the list of authentications backends.\nBy default only the ModelBackend included in Django is configured.\nA typical configuration would look like this::\n\n  AUTHENTICATION_BACKENDS = (\n      'django.contrib.auth.backends.ModelBackend',\n      'djangosaml2.backends.Saml2Backend',\n  )\n\nIt is possible to subclass the provided Saml2Backend and customize the behaviour\nby overriding some methods. This way you can perform your custom cleaning or authorization\npolicy, and modify the way users are looked up and created.\n\nFinally we have to tell Django what the new login url we want to use is::\n\n  LOGIN_URL = '/saml2/login/'\n  SESSION_EXPIRE_AT_BROWSER_CLOSE = True\n\nHere we are telling Django that any view that requires an authenticated\nuser should redirect the user browser to that url if the user has not\nbeen authenticated before. We are also telling that when the user closes\nhis browser, the session should be terminated. This is useful in SAML2\nfederations where the logout protocol is not always available.\n\n.. Note::\n\n  The login url starts with ``/saml2/`` as an example but you can change that\n  if you want. Check the section about changes in the ``urls.py``\n  file for more information.\n\nIf you want to allow several authentication mechanisms in your project\nyou should set the LOGIN_URL option to another view and put a link in such\nview to the ``/saml2/login/`` view.\n\n\nHandling Post-Login Redirects\n-----------------------------\nIt is often desireable for the client to maintain the URL state (or at least manage it) so that\nthe URL once authentication has completed is consistent with the desired application state (such\nas retaining query parameters, etc.)  By default, the HttpRequest objects get_host() method is used\nto determine the hostname of the server, and redirect URL's are allowed so long as the destination\nhost matches the output of get_host().  However, in some cases it becomes desireable for additional\nhostnames to be used for the post-login redirect.  In such cases, the setting::\n\n  SAML_ALLOWED_HOSTS = []\n\nMay be set to a list of allowed post-login redirect hostnames (note, the URL components beyond the hostname\nmay be specified by the client - typically with the ?next= parameter.)\n\nIn the absence of a ?next= parameter, the LOGIN_REDIRECT_URL setting will be used (assuming the destination hostname\neither matches the output of get_host() or is included in the SAML_ALLOWED_HOSTS setting)\n\n\nPreferred Logout binding\n------------------------\nUse the following setting to choose your preferred binding for SP initiated logout requests::\n\n  SAML_LOGOUT_REQUEST_PREFERRED_BINDING\n\nFor example::\n\n  import saml2\n  SAML_LOGOUT_REQUEST_PREFERRED_BINDING = saml2.BINDING_HTTP_POST\n\nIgnore Logout errors\n--------------------\nWhen logging out, a SAML IDP will return an error on invalid conditions, such as the IDP-side session being expired.\nUse the following setting to ignore these errors and perform a local Django logout nonetheless::\n\n  SAML_IGNORE_LOGOUT_ERRORS = True\n\nSigned Logout Request\n------------------------\nIdp's like Okta require a signed logout response to validate and logout a user. Here's a sample config with all required SP/IDP settings::\n\n   \"logout_requests_signed\": True,\n\nDiscovery Service\n-----------------\nIf you want to use a SAML Discovery Service, all you need is adding:\n\n  SAML2_DISCO_URL = 'https://your.ds.example.net/'\n\nOf course, with the real URL of your preferred Discovery Service.\n\n\nChanges in the urls.py file\n---------------------------\n\nThe next thing you need to do is to include ``djangosaml2.urls`` module in your\nmain ``urls.py`` module::\n\n  urlpatterns = patterns(\n      '',\n      #  lots of url definitions here\n\n      (r'^saml2/', include('djangosaml2.urls')),\n\n      #  more url definitions\n  )\n\nAs you can see we are including ``djangosaml2.urls`` under the *saml2*\nprefix. Feel free to use your own prefix but be consistent with what\nyou have put in the ``settings.py`` file in the LOGIN_URL parameter.\n\n\nPySAML2 specific files and configuration\n----------------------------------------\nOnce you have finished configuring your Django project you have to\nstart configuring PySAML. If you use just that library you have to\nput your configuration options in a file and initialize PySAML2 with\nthe path to that file.\n\nIn djangosaml2 you just put the same information in the Django\nsettings.py file under the SAML_CONFIG option.\n\nWe will see a typical configuration for protecting a Django project::\n\n  from os import path\n  import saml2\n  import saml2.saml\n  BASEDIR = path.dirname(path.abspath(__file__))\n  SAML_CONFIG = {\n    # full path to the xmlsec1 binary programm\n    'xmlsec_binary': '/usr/bin/xmlsec1',\n\n    # your entity id, usually your subdomain plus the url to the metadata view\n    'entityid': 'http://localhost:8000/saml2/metadata/',\n\n    # directory with attribute mapping\n    'attribute_map_dir': path.join(BASEDIR, 'attribute-maps'),\n\n    # this block states what services we provide\n    'service': {\n        # we are just a lonely SP\n        'sp' : {\n            'name': 'Federated Django sample SP',\n            'name_id_format': saml2.saml.NAMEID_FORMAT_PERSISTENT,\n\n            # For Okta add signed logout requets. Enable this:\n            # \"logout_requests_signed\": True,\n\n            'endpoints': {\n                # url and binding to the assetion consumer service view\n                # do not change the binding or service name\n                'assertion_consumer_service': [\n                    ('http://localhost:8000/saml2/acs/',\n                     saml2.BINDING_HTTP_POST),\n                    ],\n                # url and binding to the single logout service view\n                # do not change the binding or service name\n                'single_logout_service': [\n                    # Disable next two lines for HTTP_REDIRECT for IDP's that only support HTTP_POST. Ex. Okta:\n                    ('http://localhost:8000/saml2/ls/',\n                     saml2.BINDING_HTTP_REDIRECT),\n                    ('http://localhost:8000/saml2/ls/post',\n                     saml2.BINDING_HTTP_POST),\n                    ],\n                },\n             # Mandates that the identity provider MUST authenticate the\n             # presenter directly rather than rely on a previous security context.\n            'force_authn': False,\n\n             # Enable AllowCreate in NameIDPolicy.\n            'name_id_format_allow_create': False,\n\n             # attributes that this project need to identify a user\n            'required_attributes': ['uid'],\n\n             # attributes that may be useful to have but not required\n            'optional_attributes': ['eduPersonAffiliation'],\n\n            # in this section the list of IdPs we talk to are defined\n            # This is not mandatory! All the IdP available in the metadata will be considered.\n            'idp': {\n                # we do not need a WAYF service since there is\n                # only an IdP defined here. This IdP should be\n                # present in our metadata\n\n                # the keys of this dictionary are entity ids\n                'https://localhost/simplesaml/saml2/idp/metadata.php': {\n                    'single_sign_on_service': {\n                        saml2.BINDING_HTTP_REDIRECT: 'https://localhost/simplesaml/saml2/idp/SSOService.php',\n                        },\n                    'single_logout_service': {\n                        saml2.BINDING_HTTP_REDIRECT: 'https://localhost/simplesaml/saml2/idp/SingleLogoutService.php',\n                        },\n                    },\n                },\n            },\n        },\n\n    # where the remote metadata is stored, local, remote or mdq server.\n    # One metadatastore or many ...\n    'metadata': {\n        'local': [path.join(BASEDIR, 'remote_metadata.xml')],\n        'remote': [{\"url\": \"https://idp.testunical.it/idp/shibboleth\",\n                    \"disable_ssl_certificate_validation\": True},],\n        'mdq': [{\"url\": \"https://ds.testunical.it\",\n                 \"cert\": \"certficates/others/ds.testunical.it.cert\",\n                 \"disable_ssl_certificate_validation\": True}]\n        },\n\n    # set to 1 to output debugging information\n    'debug': 1,\n\n    # Signing\n    'key_file': path.join(BASEDIR, 'private.key'),  # private part\n    'cert_file': path.join(BASEDIR, 'public.pem'),  # public part\n\n    # Encryption\n    'encryption_keypairs': [{\n        'key_file': path.join(BASEDIR, 'private.key'),  # private part\n        'cert_file': path.join(BASEDIR, 'public.pem'),  # public part\n    }],\n\n    # own metadata settings\n    'contact_person': [\n        {'given_name': 'Lorenzo',\n         'sur_name': 'Gil',\n         'company': 'Yaco Sistemas',\n         'email_address': 'lgs@yaco.es',\n         'contact_type': 'technical'},\n        {'given_name': 'Angel',\n         'sur_name': 'Fernandez',\n         'company': 'Yaco Sistemas',\n         'email_address': 'angel@yaco.es',\n         'contact_type': 'administrative'},\n        ],\n    # you can set multilanguage information here\n    'organization': {\n        'name': [('Yaco Sistemas', 'es'), ('Yaco Systems', 'en')],\n        'display_name': [('Yaco', 'es'), ('Yaco', 'en')],\n        'url': [('http://www.yaco.es', 'es'), ('http://www.yaco.com', 'en')],\n        },\n    }\n\n.. note::\n\n  Please check the `PySAML2 documentation`_ for more information about\n  these and other configuration options.\n\n.. _`PySAML2 documentation`: http://pysaml2.readthedocs.io/en/latest/\n\nThere are several external files and directories you have to create according\nto this configuration.\n\nThe xmlsec1 binary was mentioned in the installation section. Here, in the\nconfiguration part you just need to put the full path to xmlsec1 so PySAML2\ncan call it as it needs.\n\nThe ``attribute_map_dir`` points to a directory with attribute mappings that\nare used to translate user attribute names from several standards. It's usually\nsafe to just copy the default PySAML2 attribute maps that you can find in the\n``tests/attributemaps`` directory of the source distribution.\n\nThe ``metadata`` option is a dictionary where you can define several types of\nmetadata for remote entities. Usually the easiest type is the ``local`` where\nyou just put the name of a local XML file with the contents of the remote\nentities metadata. This XML file should be in the SAML2 metadata format.\n\nThe ``key_file`` and ``cert_file`` options reference the two parts of a\nstandard x509 certificate. You need it to sign your metadata. For assertion\nencryption/decryption support please configure another set of ``key_file`` and\n``cert_file``, but as inner attributes of ``encryption_keypairs`` option.\n\n.. Note::\n\n  Check your openssl documentation to generate a test certificate but don't\n  forget to order a real one when you go into production.\n\n..\n  openssl req -nodes -new -x509 -days 3650 -keyout private.key -out public.cert\n\nCustom and dynamic configuration loading\n........................................\n\nBy default, djangosaml2 reads the pysaml2 configuration options from the\nSAML_CONFIG setting but sometimes you want to read this information from\nanother place, like a file or a database. Sometimes you even want this\nconfiguration to be different depending on the request.\n\nStarting from djangosaml2 0.5.0 you can define your own configuration\nloader which is a callable that accepts a request parameter and returns\na saml2.config.SPConfig object. In order to do so you set the following\nsetting::\n\n  SAML_CONFIG_LOADER = 'python.path.to.your.callable'\n\n\nSameSite cookie\n...............\n\nBy default, djangosaml2 handle the saml2 session in a separate cookie.\nThe storage linked to it is accessible by default at `request.saml_session`.\nYou can even configure the SAML cookie name as follows::\n\n  SAML_SESSION_COOKIE_NAME = 'saml_session'\n\nCustom error handler\n....................\n\nWhen an error occurs during the authentication flow, djangosaml2 will render\na simple error page with an error message and status code. You can customize\nthis behaviour by specifying the path to your own error handler in the settings::\n\n  SAML_ACS_FAILURE_RESPONSE_FUNCTION = 'python.path.to.your.view'\n\nThis should be a view which takes a request, optional exception which occured\nand status code, and returns a response to serve the user. E.g. The default\nimplementation looks like this::\n\n  def template_failure(request, exception=None, **kwargs):\n      \"\"\" Renders a simple template with an error message. \"\"\"\n      return render(request, 'djangosaml2/login_error.html', {'exception': exception}, status=kwargs.get('status', 403))\n\n\nUser attributes\n---------------\n\nIn the SAML 2.0 authentication process the Identity Provider (IdP) will\nsend a security assertion to the Service Provider (SP) upon a successful\nauthentication. This assertion contains attributes about the user that\nwas authenticated. It depends on the IdP configuration what exact\nattributes are sent to each SP it can talk to.\n\nWhen such assertion is received on the Django side it is used to find a Django\nuser and create a session for it. By default djangosaml2 will do a query on the\nUser model with the USERNAME_FIELD_ attribute but you can change it to any\nother attribute of the User model. For example, you can do this lookup using\nthe 'email' attribute. In order to do so you should set the following setting::\n\n  SAML_DJANGO_USER_MAIN_ATTRIBUTE = 'email'\n\n.. _USERNAME_FIELD: https://docs.djangoproject.com/en/dev/topics/auth/customizing/#django.contrib.auth.models.CustomUser.USERNAME_FIELD\n\nPlease, use an unique attribute when setting this option. Otherwise\nthe authentication process may fail because djangosaml2 will not know\nwhich Django user it should pick.\n\nIf your main attribute is something inherently case-insensitive (such as\nan email address), you may set::\n\n  SAML_DJANGO_USER_MAIN_ATTRIBUTE_LOOKUP = '__iexact'\n\n(This is simply appended to the main attribute name to form a Django\nquery. Your main attribute must be unique even given this lookup.)\n\nAnother option is to use the SAML2 name id as the username by setting::\n\n  SAML_USE_NAME_ID_AS_USERNAME = True\n\nYou can configure djangosaml2 to create such user if it is not already in\nthe Django database or maybe you don't want to allow users that are not\nin your database already. For this purpose there is another option you\ncan set in the settings.py file::\n\n  SAML_CREATE_UNKNOWN_USER = True\n\nThis setting is True by default.\n\nThe following setting lets you specify a URL for redirection after a successful\nauthentication::\n\n  ACS_DEFAULT_REDIRECT_URL = reverse_lazy('some_url_name')\n\nParticularly useful when you only plan to use\nIdP initiated login and the IdP does not have a configured RelayState\nparameter. The default is ``/``.\n\nThe other thing you will probably want to configure is the mapping of\nSAML2 user attributes to Django user attributes. By default only the\nUser.username attribute is mapped but you can add more attributes or\nchange that one. In order to do so you need to change the\nSAML_ATTRIBUTE_MAPPING option in your settings.py::\n\n  SAML_ATTRIBUTE_MAPPING = {\n      'uid': ('username', ),\n      'mail': ('email', ),\n      'cn': ('first_name', ),\n      'sn': ('last_name', ),\n  }\n\nwhere the keys of this dictionary are SAML user attributes and the values\nare Django User attributes.\n\nIf you are using Django user profile objects to store extra attributes\nabout your user you can add those attributes to the SAML_ATTRIBUTE_MAPPING\ndictionary. For each (key, value) pair, djangosaml2 will try to store the\nattribute in the User model if there is a matching field in that model.\nOtherwise it will try to do the same with your profile custom model. For\nmulti-valued attributes only the first value is assigned to the destination field.\n\nAlternatively, custom processing of attributes can be achieved by setting the\nvalue(s) in the SAML_ATTRIBUTE_MAPPING, to name(s) of method(s) defined on a\ncustom django User object. In this case, each method is called by djangosaml2,\npassing the full list of attribute values extracted from the <saml:AttributeValue>\nelements of the <saml:Attribute>. Among other uses, this is a useful way to process\nmulti-valued attributes such as lists of user group names.\n\nFor example:\n\nSaml assertion snippet::\n\n  <saml:Attribute Name=\"groups\" NameFormat=\"urn:oasis:names:tc:SAML:2.0:attrname-format:basic\">\n        <saml:AttributeValue>group1</saml:AttributeValue>\n        <saml:AttributeValue>group2</saml:AttributeValue>\n        <saml:AttributeValue>group3</saml:AttributeValue>\n  </saml:Attribute>\n\nCustom User object::\n\n  from django.contrib.auth.models import AbstractUser\n\n  class User(AbstractUser):\n\n    def process_groups(self, groups):\n      // process list of group names in argument 'groups'\n      pass;\n\nsettings.py::\n\n  SAML_ATTRIBUTE_MAPPING = {\n      'groups': ('process_groups', ),\n  }\n\n\nLearn more about Django profile models at:\n\nhttps://docs.djangoproject.com/en/dev/topics/auth/customizing/#substituting-a-custom-user-model\n\n\nSometimes you need to use special logic to update the user object\ndepending on the SAML2 attributes and the mapping described above\nis simply not enough. For these cases djangosaml2 provides a Django\nsignal that you can listen to. In order to do so you can add the\nfollowing code to your app::\n\n  from djangosaml2.signals import pre_user_save\n\n  def custom_update_user(sender=User, instance, attributes, user_modified, **kargs)\n     ...\n     return True  # I modified the user object\n\n\nYour handler will receive the user object, the list of SAML attributes\nand a flag telling you if the user is already modified and need\nto be saved after your handler is executed. If your handler\nmodifies the user object it should return True. Otherwise it should\nreturn False. This way djangosaml2 will know if it should save\nthe user object so you don't need to do it and no more calls to\nthe save method are issued.\n\n\nIdP setup\n=========\nCongratulations, you have finished configuring the SP side of the federation.\nNow you need to send the entity id and the metadata of this new SP to the\nIdP administrators so they can add it to their list of trusted services.\n\nYou can get this information starting your Django development server and\ngoing to the http://localhost:8000/saml2/metadata url. If you have included\nthe djangosaml2 urls under a different url prefix you need to correct this\nurl.\n\nSimpleSAMLphp issues\n--------------------\nAs of SimpleSAMLphp 1.8.2 there is a problem if you specify attributes in\nthe SP configuration. When the SimpleSAMLphp metadata parser converts the\nXML into its custom php format it puts the following option::\n\n  'attributes.NameFormat' => 'urn:oasis:names:tc:SAML:2.0:attrname-format:uri'\n\nBut it need to be replaced by this one::\n\n  'AttributeNameFormat' => 'urn:oasis:names:tc:SAML:2.0:attrname-format:uri'\n\nOtherwise the Assertions sent from the IdP to the SP will have a wrong\nAttribute Name Format and pysaml2 will be confused.\n\nFurthermore if you have a AttributeLimit filter in your SimpleSAMLphp\nconfiguration  you will need to enable another attribute filter just\nbefore to make sure that the AttributeLimit does not remove the attributes\nfrom the authentication source. The filter you need to add is an AttributeMap\nfilter like this::\n\n  10 => array(\n             'class' => 'core:AttributeMap', 'name2oid'\n        ),\n\nOkta federation\n===============\n\nOkta settings to configure on your Idp's SAML app advanced settings::\n\n    Single Logout URL: http://localhost:8000/saml2/ls/post/\n    SP Issuer : http://localhost:8000/saml2/metadata/\n\nOkta sample configuration for setting up an Okta SSO with Django::\n\n        'service': {\n        # we are just a lonely SP\n        'sp': {\n            'name': 'XXX',\n            'allow_unsolicited': True,\n            'want_assertions_signed': True,  # assertion signing (default=True)\n            'want_response_signed': True,\n            \"want_assertions_or_response_signed\": True,  # is response signing required\n            'name_id_format': NAMEID_FORMAT_UNSPECIFIED,\n\n            # Must for signed logout requests\n            \"logout_requests_signed\": True,\n            'endpoints': {\n                # url and binding to the assetion consumer service view\n                # do not change the binding or service name\n                'assertion_consumer_service': [\n                    ('http://localhost:8000/saml2/acs/',\n                     saml2.BINDING_HTTP_POST),\n                ],\n                # url and binding to the single logout service view\n                # do not change the binding or service name\n                'single_logout_service': [\n                    # ('http://localhost:8000/saml2/ls/',\n                    #  saml2.BINDING_HTTP_REDIRECT),\n                    ('http://localhost:8000/saml2/ls/post/',\n                     saml2.BINDING_HTTP_POST),\n                ],\n            },\n            # Mandates that the identity provider MUST authenticate the\n            # presenter directly rather than rely on a previous security context.\n            'force_authn': False,\n\n            \"allow_unsolicited\": True,\n\n            # Enable AllowCreate in NameIDPolicy.\n            'name_id_format_allow_create': False,\n\n            # attributes that this project need to identify a user\n            'required_attributes': ['email'],\n\n            # in this section the list of IdPs we talk to are defined\n            'idp': {\n                # we do not need a WAYF service since there is\n                # only an IdP defined here. This IdP should be\n                # present in our metadata\n\n                # the keys of this dictionary are entity ids\n                'https://xxx.okta.com/app/XXXXXXXXXX/sso/saml/metadata': {\n                    # Okta only uses HTTP_POST disable this\n                    # 'single_sign_on_service': {\n                    #     saml2.BINDING_HTTP_REDIRECT: 'https://xxx.okta.com/app/APPNAME/xxxxxxxxx/sso/saml',\n                    # },\n                    'single_logout_service': {\n                        saml2.BINDING_HTTP_POST: 'https://xxx.okta.com/app/APPNAME/xxxxxxxxxx/slo/saml',\n                    },\n                },\n            },\n\n        },\n       },\n\n\nTesting\n=======\n\nOne way to check if everything is working as expected is to enable the\nfollowing url::\n\n  urlpatterns = patterns(\n      '',\n      #  lots of url definitions here\n\n      (r'^saml2/', include('djangosaml2.urls')),\n      (r'^test/', 'djangosaml2.views.EchoAttributesView.as_view()'),\n\n      #  more url definitions\n  )\n\n\nNow if you go to the /test/ url you will see your SAML attributes and also\na link to do a global logout.\n\nUnit tests\n==========\n\nYou can also run the unit tests as follows::\n\n  pip install -r requirements-dev.txt\n  # or\n  pip install djangosaml2[test]\n  python3 tests/manage.py migrate\n\nthen::\n\n  python tests/run_tests.py\n\nor::\n\n  cd tests/\n  ./manage.py test djangosaml2\n\n\nIf you have `tox`_ installed you can simply call tox inside the root directory\nand it will run the tests in multiple versions of Python.\n\n.. _`tox`: http://pypi.python.org/pypi/tox\n\n\nCode Coverage\n=============\n\nexample::\n\n  cd tests/\n  coverage erase\n  coverage run ./manage.py test djangosaml2 testprofiles\n  coverage report -m\n\n\nContributing\n============\n\nPlease open Issues to start debate regarding the requested\nfeatures, or the patch that you would apply. We do not use\na strict submission format, please try to be more concise as possibile.\n\nThe Pull Request MUST be done on the dev branch, please don't\npush code directly on the master branch.\n\n\nFAQ\n===\n\n**Why can't SAML be implemented as an Django Authentication Backend?**\n\nwell SAML authentication is not that simple as a set of credentials you can\nput on a login form and get a response back. Actually the user password is\nnot given to the service provider at all. This is by design. You have to\ndelegate the task of authentication to the IdP and then get an asynchronous\nresponse from it.\n\nGiven said that, djangosaml2 does use a Django Authentication Backend to\ntransform the SAML assertion about the user into a Django user object.\n\n**Why not put everything in a Django middleware class and make our lifes\neasier?**\n\nYes, that was an option I did evaluate but at the end the current design\nwon. In my opinion putting this logic into a middleware has the advantage\nof making it easier to configure but has a couple of disadvantages: first,\nthe middleware would need to check if the request path is one of the\nSAML endpoints for every request. Second, it would be too magical and in\ncase of a problem, much harder to debug.\n\n**Why not call this package django-saml as many other Django applications?**\n\nFollowing that pattern then I should import the application with\nimport saml but unfortunately that module name is already used in pysaml2.",
    "description_content_type": "",
    "docs_url": null,
    "download_url": "https://pypi.org/project/djangosaml2/",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://github.com/knaperek/djangosaml2",
    "keywords": "django,pysaml2,sso,saml2,federated authentication,authentication",
    "license": "Apache 2.0",
    "maintainer": "Jozef Knaperek",
    "maintainer_email": "",
    "name": "djangosaml2",
    "package_url": "https://pypi.org/project/djangosaml2/",
    "platform": "",
    "project_url": "https://pypi.org/project/djangosaml2/",
    "project_urls": {
      "Download": "https://pypi.org/project/djangosaml2/",
      "Homepage": "https://github.com/knaperek/djangosaml2"
    },
    "release_url": "https://pypi.org/project/djangosaml2/1.0.0/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "pysaml2 integration for Django",
    "version": "1.0.0",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 16173986,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "dcae16481cbe0853e1b1d0eb56bc8f9cd9e2b9e526c55ea970cd96a2d9db2317",
        "md5": "c6cab4a3a079c513e155443a6a22f089",
        "sha256": "5ae3acd0442f5fab74c6ec5f3c409371d5e34e12c5fc1167ba45057cc3d9598a"
      },
      "downloads": -1,
      "filename": "djangosaml2-1.0.0.tar.gz",
      "has_sig": false,
      "md5_digest": "c6cab4a3a079c513e155443a6a22f089",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 72455,
      "upload_time": "2020-12-26T15:22:52",
      "upload_time_iso_8601": "2020-12-26T15:22:52.640207Z",
      "url": "https://files.pythonhosted.org/packages/dc/ae/16481cbe0853e1b1d0eb56bc8f9cd9e2b9e526c55ea970cd96a2d9db2317/djangosaml2-1.0.0.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}