{
  "info": {
    "author": "Scott Kitterman",
    "author_email": "scott@kitterman.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "Environment :: No Input/Output (Daemon)",
      "Intended Audience :: System Administrators",
      "License :: OSI Approved :: GNU General Public License (GPL)",
      "Natural Language :: English",
      "Operating System :: POSIX",
      "Programming Language :: Python :: 3 :: Only",
      "Topic :: Communications :: Email :: Filters",
      "Topic :: Communications :: Email :: Mail Transport Agents",
      "Topic :: Security"
    ],
    "description": "# OVERVIEW\n\nThis is a DKIM signing and verification milter.  It has been tested with both\nPostfix and Sendmail.\n\nThe configuration file is designed to be compatible with OpenDKIM, but only\na subset of OpenDKIM options are supported.  If an unsupported option is\nspecified, an error will be raised.\n\n\n# INSTALLATION\n\nThis package includes a default configuration file and man pages.  For those\nto be installed when installing using setup.py, the following incantation is\nrequired because setuptools developers decided not being able to do this by\ndefault is a feature:\n\n[sudo] python3 setup.py install --single-version-externally-managed --record=/dev/null\n\nFor users of Debian Stable (Debian 9, Codename Squeeze), all dependencies are\navailable in either the main or backports repositories:\n\n[sudo] apt install python3-milter python3-nacl python3-dnspython\n[sudo] apt install -t stretch-backports python3-authres python3-dkim\n\nIt is also available in the Debian package archive:\n\n[sudo] apt install dkimpy-milter [Debian 10 or later]\n[sudo] apt install -t stretch-backports dkimpy-milter [Debian 9]\n\nWhen installing using the Debian package, all dependencies are automatically\ninstalled.\n\nThe preferred method of installation is from PyPi using pip (if distribution\npackages are not available):\n\n[sudo] pip install dkimpy_milter\n\nUsing pip will cause required packages to be installed via easy_install if they\nhave not been previously installed.  Because pymilter and PyNaCl are compiled\nPython extensions, the system will need appropriate development packages and\nan C compiler.  Alternately, install these dependencies from distribution/OS\npackages and then pip install dkimpy_milter.\n\nThe milter will work with either py3dns (DNS) or dnspython (dns), preferring\ndnspython if both are available.  The dkimpy DKIM module also works with\neither.\n\n## NON-STANDARD INSTALLATION PATHS\n\nThe package includes a custom setup command called expand.  It allows various\nfile locations in init scripts, man pages, and config files to be over-ridden\nat install time.\n\n\n    expand: Expand @@ variables in input files, simlar to make macros.\n    user_options:\n      --sysconfigdir=, e: Specify system configuration directory.\n      --sbindir=, s: Specify system binary directory [not used].\n      --bindir=, b: Specify binary directory.\n      --rundir=,r: Specify run state directory.\n\nAs an example, to change the run directory to /var/run, one would do:\n\n    python3 setup.py expand --rundir=/var/run\n    [sudo] python3 setup.py install --single-version-externally-managed \\\n                                --record=/dev/null\n\nor in a single step (the order matters):\n\n    [sudo] python3 setup.py expand --rundir=/var/run install \\\n                               --single-version-externally-managed \\\n                               --record=/dev/null\n\n# SETUP\n\n## SIGNING KEYS\n\nIn order to create DKIM signatures, a private key must be available.  Signing\nkeys should be protected (owned by root:root with permissions 600 in a\ndirectory that is not world readable).  Different keys are required for RSA\nand (if used) Ed25519.\n\n### RSA\n\nBoth public and private keys for RSA have standard formats and there are many\ntools available to create them.  Keys must (RFC 8302) have a minimum size of\n1024 bits and should have a size of at least 2048 bits.  The dknewkey script\nthat is provided with dkimpy is one such tool:\n\n    dknewkey exampleprivkey\n\nwill produce both the private key file (.key suffix) and a file with the DKIM\npublic key record to be published DNS (.dns suffix).  RSA is the default key\ntype.  2048 bits is the default key size.\n\n### ED25519\n\nThere is no standardized non-binary representation for Ed25519 private keys,\nso in order to generate Ed25519 keys for dkimpy-milter, dkimpy specific tools\nmust be used to be compatible.  The same dknewkey script support Ed25519:\n\n    dknewkey --ktype ed25519 anothernewkey\n\nwill provide both the private key file (.key suffix) and a file with the DKIM\npublic key record to be published DNS (.dns suffix).  Ed25519 keys do not have\nvariable bit lengths.\n\n### COMPLEX SIGNING CONFIGURATIONS\n\nThe KeyTable, KeyTableEd25519, and SigningTable are used to define signing\ninstructions to the filter where use of Domain, Selector and KeyFile together\nare insufficient.\n\nFirst, select the type of database you will use for each.  They need not\nbe the same.  The \"DATA SETS\" portion of the dkimpy-milter(8) man page\ndescribes the possibilities and how they are formatted.  Then, construct those\ndatabases.\n\nLet's suppose you want to sign for two domains, example.com and example.net.\nWithin example.com, you want to sign for user \"president\" differently than\neveryone else.  Let's say further that you want to use a flat text file.\n\nYou've generated private key files for each of these and stored them\nin the directory /usr/local/etc/dkim/keys as files \"president\", \"excom\" and\n\"exnet\", with the obvious intents.  You want to use selectors \"foo\", \"bar\"\nand \"baz\" for those, respectively.  The signing domains match the senders\n(i.e. the signatures for example.com's stuff will be held by example.com,\nand example.net likewise).\n\nFirst, write the KeyTable.  This is a list of the keys you intend to use,\nand you just assign arbitrary names to them.  So as a flat file, the KeyTable\nfor the above might look like this:\n\n\tpreskey\texample.com:foo:/usr/local/etc/dkim/keys/president\n\tcomkey\texample.com:bar:/usr/local/etc/dkim/keys/excom\n\tnetkey\texample.net:baz:/usr/local/etc/dkim/keys/exnet\n\nIf also signing with ed25519, specify a KeyTableEd25519, with the same\nnames, pointing to the keys needed for ed25519.  Both KeyTable and\nKeyTableEd25519 are evaluated if there is a SigningTable (see below).\n\nPer the documentation, multi-field data sets that are made of flat files have\nthe fields separated by colons, but the key and value(s) are separated by\nwhitespace.\n\nSo now we've named each key file, and specified with which selector and domain\neach will be used, and then given each of those groupings a name.  This\nis your KeyTable.  Let's say you put it in /usr/local/etc/dkim/keytable.\n\nNext, write the SigningTable.  This maps senders (by default, taken from the\nFrom: header field of a message passing through the filter) to which keys\nwill be used to sign their mail.  Wildcards are allowed.  So to do what was\ndescribed above, we write it as follows:\n\n\tpresident@example.com\tpreskey\n\t*@example.com\t\tcomkey\n\t*@example.net\t\tnetkey\n\nSince we want to use wildcards, we can't actually use a regular flat file.\nWildcards require a regular expression file, or \"refile\".  The above is\nvalid format for one of those.  Let's say you put this in\n/usr/local/etc/dkim/signingtable.\n\nFinally, tell the filter that it should use these files by adding this to\nyour configuration file:\n\n\tKeyTable\t/usr/local/etc/dkim/keytable\n\tSigningTable\trefile:/usr/local/etc/dkim/signingtable\n\nYou could put \"file:\" in front of the filename for the KeyTable just to be\nprecise, but \"file:\" is assumed if the value starts with a \"/\".\n\nNote: Unlike opendkim, dkimpy-milter will check for \"\\*\" in the signing table\nregardless of if refile is specified or not.  Use of refile is supported for\ncompatibility with configurations initially developed for use with opendkim.\n\n## MTA INTEGRATION\n\nBoth a systemd unit file and a sysv init file are provided.  Both make\nassumptions about defaults being used, e.g. if a non-standard pidfile name is\nused, they will need to be updated.  The sysv init file uses start-stop-deamon\nfrom Debian.  It is not portable to systems without that available.\n\nThe dkimpy-milter drops priviledges after setup to the user/group specified in\nUserID.  During initial setup, this system user needs to be manually created.\nAs an example, using the default dkimpy-user on Debian, the command would be:\n\n    [sudo] adduser --system --no-create-home --quiet --disabled-password \\\n               --disabled-login --shell /bin/false --group \\\n               --home /run/dkimpy-milter dkimpy-milter\n\nSince /var/run or /run is sometimes on a tempfs, if the PID file directory is\nmissing, the milter will create it on startup.\n\nTo start dkimpy-milter with systemd for the first time, you will need to take\nthe following steps:\n\n    [sudo] systemctl daemon-reload\n    [sudo] systemctl enable dkimpy-milter\n    [sudo] systemctl start dkimpy-milter\n    [sudo] systemctl status dkimpy-milter (to verify it started correctly)\n\nAs with all milters, dkimpy-milter needs to be integrated with your MTA of\nchoice (Sendmail or Postfix).  When integrating with your MTA, the risk of\nsignature invalidation due to content conversion of the message body needs to\nbe considered.  See RFC 6376, Section 5.3 for discussion of this issue.  As a\npractical matter, when signing, configure the milter to follow all others that\nmight modify the message body.  When verifying, configure the milter before\nother processes that might modify the message body.\n\n### SENDMAIL\n\nConfiguration is very similar to opendkim, but needs some adjustment for\ndkimpy-milter. Here's an example configuration line to include in your\nsendmail.mc:\n\n    INPUT_MAIL_FILTER(`dkimpy-milter', `S=local:/run/dkimpy-milter/dkimpy-milter.sock')dnl\n\nChanging the sendmail.mc file requires a Make (to compile it into sendmail.cf)\nand a restart of sendmail.  Note that S= needs to match the value of Socket in\nthe dkimpy-milter configuration file.\n\nMilter support should be present by default in most versions of sendmail\nthese days, but if not included in your Sendmail build, see:\nhttp://www.elandsys.com/resources/sendmail/milter.html\n\n#### ISSUES USING SENDMAIL TO SIGN AND VERIFY\n\nWhen using the sendmail MTA in both signing and verifying mode, there are\na few issues of which to be aware that might cause operational problems\nand deserve consideration.\n\n(a) When the MTA will be used for relaying emails, e.g. delivering to other\n    hosts using the aliases mechanism, it is important not to break\n    signatures inserted by the original sender.  This is particularly sensitive\n    particular when the sending domain has published a \"reject\" DMARC policy.\n\n    By default, sendmail quotes to address header fields when there are no\n    quotes and the display part of the address contains a period or an\n    apostrophe.  However, dkimpy-milter only sees the raw, unmodified form of\n    the header field, and so the content that gets verified and what gets\n    signed will not be the same, guaranteeing the attached signature is not\n    valid.\n\n    To direct sendmail not to modify the headers, add this to your sendmail.mc:\n\n    \tconf(`confMUST_QUOTE_CHARS', `')\n\n(b) As stated in sendmail's KNOWNBUGS file, sendmail truncates header field\n    values longer than 256 characters, which could mean truncating the domain\n    of a long From: header field value and invalidating the signature.\n    You may wish to consider increasing MAXNAME in sendmail/conf.h to mitigate\n    changing the messages and invalidating their signatures.  This change\n    requires recompiling sendmail.\n\n(c) Similar to (a) above, sendmail may wrap very long single-line recipient\n    fields for presentation purposes; for example:\n\n    To: very long name <a@example.org>,anotherloo...ong name b <b@example.org>\n\n    ...might be rewritten as:\n\n    To: very long name <a@example.org>,\n    \tanotherloo...ong name b <b@example.org>\n\n    This rewrite is also done after dkimpy-milter has seen the message,\n    meaning the signature dkimpy-milter attaches to the message does not match\n    the content it signed.  There is not a known configuration change to\n    mitigate this mutation.\n\n    The only known mechanism for dealing with this is to have distinct\n    instances of dkimpy-milter do the verifying (inbound) and signing\n    (outbound) so that the version that arrives at the signing instance is\n    already in the rewritten form, guaranteeing the input and output are the\n    same and thus the signature matches the payload.\n\n### POSTFIX\n\nIntegration of dkimpy-milter into Postfix is like any milter (See Postfix's\nREADME_FILES/MILTER_README).  Here's an example master.cf excerpt that talks\nto two dkimpy-milter instances, one configured for signing and one configured\nfor verification:\n\n    smtp       inet  n       -       -       -      -       smtpd\n        ...\n        -o smtpd_milters=inet:localhost:8892\n        ...\n\n    submission inet  n       -       -       -      -       smtpd\n        ...\n        -o smtpd_milters=inet:localhost:8891\n        ...\n\nThese need to match the Socket value for each dkimpy-milter instance.\n\nCare is required to segregate outbound mail to be signed and inbound mail to\nbe verified.  The above example uses two instances of dkimpy-milter to do\nthis.  There are many possible ways.  Here is another example using milter\nmacros to keep the mail streams segregated:\n\nPostfix master.cf:\n\n    smtp       inet  n       -       -       -       -       smtpd\n        ...\n        -o smtpd_milters=inet:localhost:8891\n        -o milter_macro_daemon_name=VERIFYING\n        ...\n\n    submission inet n       -       -       -       -       smtpd\n        -o syslog_name=postfix/submission\n        -o smtpd_tls_security_level=encrypt\n        -o smtpd_sasl_auth_enable=yes\n        ...\n        -o milter_macro_daemon_name=ORIGINATING\n        -o smtpd_milters=inet:localhost:8891\n        ...\n\nDkimpy-milter.conf:\n\n    ...\n    Mode\t\t\tsv\n    MacroList\t\tdameon_name|ORIGINATING\n    MacroListVerify\t\tdaemon_name|VERIFYING\n    ...\n\n\n# NOTES\n\nThe python DKIM library, dkimpy, requires the entire message being signed or\nverified to be in memory, so dkimpy-milter does not write messages out to a\ntemp file.  This may impact performance on low-memory systems.\n\nDKIM with Ed25519 signatures are described in RFC 8463.  Version 1.0.0 and\nlater support Ed25519 signing and verification.  RFC 8301 removed rsa-sha1\nfrom DKIM.  dkimpy-milter does not sign with rsa-sha1, but still considers\nrsa-sha1 signatures as valid for verification because they are still in\ncommon use and are not known to be cryptographically broken.",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": "https://pypi.python.org/pypi/dkimpy-milter",
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "home_page": "https://launchpad.net/dkimpy-milter",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "dkimpy-milter",
    "package_url": "https://pypi.org/project/dkimpy-milter/",
    "platform": "",
    "project_url": "https://pypi.org/project/dkimpy-milter/",
    "project_urls": {
      "Download": "https://pypi.python.org/pypi/dkimpy-milter",
      "Homepage": "https://launchpad.net/dkimpy-milter"
    },
    "release_url": "https://pypi.org/project/dkimpy-milter/1.2.2/",
    "requires_dist": null,
    "requires_python": "",
    "summary": "Domain Keys Identified Mail (DKIM) signing/verifying milter for Postfix/Sendmail.",
    "version": "1.2.2",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 17058130,
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "blake2b_256": "ba1e061a6bcd44000eb007f74b23bdb464b096a658cf261278c5fb43008cd743",
        "md5": "dc0f054bc7dc6178eb31f20d93b73cca",
        "sha256": "d7e0d4006cad1add90b5b71243e488680b63cf63c5350cef619c061e808f2c3b"
      },
      "downloads": -1,
      "filename": "dkimpy-milter-1.2.2.tar.gz",
      "has_sig": true,
      "md5_digest": "dc0f054bc7dc6178eb31f20d93b73cca",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": null,
      "size": 52654,
      "upload_time": "2020-08-09T18:25:30",
      "upload_time_iso_8601": "2020-08-09T18:25:30.680799Z",
      "url": "https://files.pythonhosted.org/packages/ba/1e/061a6bcd44000eb007f74b23bdb464b096a658cf261278c5fb43008cd743/dkimpy-milter-1.2.2.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}